#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция КатегорияПоИдентификатору(Идентификатор) Экспорт
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторКатегории = Формат(Идентификатор, "ЧГ=0");
	Для Каждого Значение Из Метаданные.Перечисления.ор_ПредопределенныеКатегорииРаботаСНоменклатурой.ЗначенияПеречисления Цикл
		Если Значение.Комментарий = ИдентификаторКатегории Тогда
			Возврат Перечисления.ор_ПредопределенныеКатегорииРаботаСНоменклатурой[Значение.Имя];
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли