
&Вместо("ТекстЗапросаИнициализироватьДанныеДокумента")
Функция эв_ТекстЗапросаИнициализироватьДанныеДокумента()
	
	ТекстЗапроса = ПродолжитьВызов();
	
	СтрокаЗамены =
	"
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы";
	СтрокаВставки =
	"
	|,
	|ЧекККМЗапасы.эв_ИБ КАК эв_ИБ,
	|ЧекККМЗапасы.эв_КБ КАК эв_КБ
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаЗамены, СтрокаВставки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&После("СформироватьТаблицаПродажи")
Процедура эв_СформироватьТаблицаПродажи(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Дата КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ТаблицаПродажи.СтруктурнаяЕдиница
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК Склад,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.НоменклатураНабора КАК НоменклатураНабора,
	|	ТаблицаПродажи.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ТаблицаПродажи.КассаККМ.Проект
	|		ИНАЧЕ ТаблицаПродажи.ЗаказПокупателя.Проект
	|	КОНЕЦ КАК Проект,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.Контрагент КАК Контрагент,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.Подразделение КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	ТаблицаПродажи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ИСТИНА ДвижениеЧекаВОткрытойСмене,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	0 КАК Себестоимость,
	|	СУММА(ТаблицаПродажи.Сумма + ТаблицаПродажи.СуммаСкидкиНаценки + ТаблицаПродажи.СуммаАвтоматическойСкидки +
	|		ТаблицаПродажи.СуммаСкидкиОплатыБонусом) КАК СуммаБезСкидки,
	|	СУММА(ТаблицаПродажи.эв_ИБ) КАК эв_ИБ,
	|	СУММА(ТаблицаПродажи.эв_КБ) КАК эв_КБ
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|ГДЕ
	|	&ЧекПробит
	|	И НЕ &Архивный
	|	И НЕ ТаблицаПродажи.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	И НЕ &ОперацияСДенежнымиСредствами
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Дата,
	|	ТаблицаПродажи.Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ТаблицаПродажи.СтруктурнаяЕдиница
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.НоменклатураНабора,
	|	ТаблицаПродажи.ХарактеристикаНабора,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ТаблицаПродажи.КассаККМ.Проект
	|		ИНАЧЕ ТаблицаПродажи.ЗаказПокупателя.Проект
	|	КОНЕЦ,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.Контрагент,
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.Подразделение,
	|	ТаблицаПродажи.Ответственный,
	|	ТаблицаПродажи.ХозяйственнаяОперация";
	
	Запрос.УстановитьПараметр("ЧекПробит", СтруктураДополнительныеСвойства.ДляПроведения.ЧекПробит);
	Запрос.УстановитьПараметр("Архивный", СтруктураДополнительныеСвойства.ДляПроведения.Архивный);
	Запрос.УстановитьПараметр("ОперацияСДенежнымиСредствами",
		СтруктураДополнительныеСвойства.ДляПроведения.ОперацияСДенежнымиСредствами);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&После("ИнициализироватьДанныеДокумента")
Процедура эв_ИнициализироватьДанныеДокумента(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства, Регистры = Неопределено)
	
	Если СтруктураДополнительныеСвойства.Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СтруктураДополнительныеСвойства.Свойство("УчетнаяПолитика") Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить(
			"Таблицаэв_КошелекПервостольника",
			Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	эв_СформироватьТаблицаКошелекПервостольника(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

Процедура эв_СформироватьТаблицаКошелекПервостольника(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Дата КАК Период,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаЗапасы.эв_ИБ) КАК эв_ИБ,
	|	СУММА(ТаблицаЗапасы.эв_КБ) КАК эв_КБ
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	&ЧекПробит
	|	И НЕ &Архивный
	|	И НЕ &ОперацияСДенежнымиСредствами
	|	И (ТаблицаЗапасы.эв_ИБ <> 0
	|		ИЛИ ТаблицаЗапасы.эв_КБ <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Дата,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ответственный";
	
	Запрос.УстановитьПараметр("ЧекПробит", СтруктураДополнительныеСвойства.ДляПроведения.ЧекПробит);
	Запрос.УстановитьПараметр("Архивный", СтруктураДополнительныеСвойства.ДляПроведения.Архивный);
	Запрос.УстановитьПараметр("ОперацияСДенежнымиСредствами",
		СтруктураДополнительныеСвойства.ДляПроведения.ОперацияСДенежнымиСредствами);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить(
		"Таблицаэв_КошелекПервостольника",
		Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
