
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Товары") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого ТекущиеДанные Из Параметры.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИзменения(Команда)
	
	УстановитьПризнакЖНВЛППоНакладной();
	Закрыть(НЕ ИзменитьПризнакЖНВЛПНоменклатуры());
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПризнакЖНВЛППоНакладной()
	
	ТаблицаТоваров = ВладелецФормы.Объект.Запасы;
	
	Отбор = Новый Структура;
	
	Для Каждого Товар Из Товары Цикл
		Если Товар.ор_ЖНВЛППоНакладной = Товар.ор_ЖНВЛПвОбъекте Тогда
			
			Отбор.Очистить();
			Отбор.Вставить("Номенклатура", Товар.Номенклатура);
			
			МассивСтрок = ТаблицаТоваров.НайтиСтроки(Отбор);
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				СтрокаМассива.ор_ЖНВЛППоНакладной = Товар.ор_ЖНВЛПвОбъекте;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет изменение признака ЖНВЛП в данных номенклатуры для каждой 
// позиции номенклатуры указанной в таблице 
//
&НаСервере
Функция ИзменитьПризнакЖНВЛПНоменклатуры()
	
	ЗакрыватьФорму = Истина;
	
	Для Каждого Товар Из Товары Цикл
		Если Товар.ор_ЖНВЛППоНакладной <> Товар.ор_ЖНВЛПвОбъекте Тогда
			
			ОбъектНоменклатура = Товар.Номенклатура.ПолучитьОбъект();
			
			Попытка
				ОбъектНоменклатура.Заблокировать();
				ОбъектНоменклатура.ор_ЖНВЛС = Товар.ор_ЖНВЛППоНакладной;
				ОбъектНоменклатура.Записать();
				ОбъектНоменклатура.Разблокировать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось изменить признак ЖНВЛП в позиции:%Товар%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%", Товар.Номенклатура);
				ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Попробуйте записать еще раз'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ЗакрыватьФорму = Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗакрыватьФорму;
	
КонецФункции

#КонецОбласти
