
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Склад = Параметры.СкладПродажиПоУмолчанию;
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
	НеобходимоВыбратьХарактеристику = Параметры.НеобходимоВыбратьХарактеристику;
	
	// Независимо от варианта добавляем строчку с номенклатурой.
	НоваяСтрока = ТаблицаСерий.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Характеристика = Характеристика;
	
	// Для характеристик необходимо отображать вариант с пустой характеристикой.
	Если ЗначениеЗаполнено(Характеристика) Тогда
		НоваяСтрока = ТаблицаСерий.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если НеобходимоВыбратьХарактеристику Тогда
		ЗаполнитьТаблицуСерийДаннымиПоНоменклатуре(Номенклатура, Склад);
	КонецЕсли;
	
	РасположениеНоменклатуры.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаСерийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСерий.ТекущиеДанные;
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		РасположениеНоменклатуры,
		"Номенклатура",
		ТекущиеДанные.Номенклатура,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		РасположениеНоменклатуры,
		"Характеристика",
		ТекущиеДанные.Характеристика,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВниз(Команда)
	
	ПередвинутьПозицию(1)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВверх(Команда)
	
	ПередвинутьПозицию(-1)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Передвинуть позицию в списке.
//
// Параметры:
// Движение = 1 (вниз) или -1 (вверх).
// 
&НаКлиенте
Процедура ПередвинутьПозицию(Движение)
	// Вставить содержимое обработчика.
	Если ТаблицаСерий.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТаблицаСерий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено  Тогда
		ИндексСтроки = 0;
	Иначе
		ИндексСтроки = ТаблицаСерий.Индекс(ТекущиеДанные);
	КонецЕсли;
	
	ИндексСтроки = ИндексСтроки + Движение;
	
	Если ИндексСтроки > (ТаблицаСерий.Количество() - 1) Тогда
		ИндексСтроки = 0;
	ИначеЕсли ИндексСтроки < 0 Тогда
		ИндексСтроки = ТаблицаСерий.Количество() - 1;
	КонецЕсли;
	
	ТекущиеДанные = ТаблицаСерий[ИндексСтроки];
	Элементы.ТаблицаСерий.ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСерийДаннымиПоНоменклатуре(Номенклатура, Склад)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Наименование КАК Наименование,
	|	&Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	НЕ ХарактеристикиНоменклатуры.Недействителен
	|	И ХарактеристикиНоменклатуры.Владелец = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Наименование КАК Наименование,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				СтруктурнаяЕдиница = &Склад
	|					И (Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВТ.Номенклатура,
	|							ВТ.Характеристика
	|						ИЗ
	|							ВТ КАК ВТ)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Характеристика КАК Характеристика,
	|	ИтоговаяТаблица.Номенклатура КАК Номенклатура
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ИтоговаяТаблица.Остаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИтоговаяТаблица.Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		// Добавим строчку с пустой характеристикой
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаСерий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

