
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресВоВременномХранилище) Тогда
		ТекстСообщения = НСтр("ru='Предусмотрено открытие формы только из документов.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	СуммаВключаетНДС = Параметры.СуммаВключаетНДС;
	ЭтоОрдер         = Параметры.ЭтоОрдер;
	
	АдресВоВременномХранилище = Параметры.АдресВоВременномХранилище;
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.МаркируемыйТовар = НоваяСтрока.Характеристика.ор_МаркируемыйТовар;
		НоваяСтрока.НомерСерии       = НоваяСтрока.Характеристика.ор_СерияПроизводителя;
	КонецЦикла;
	
	ЗаполнитьGTIN();
	
	Элементы.Состав.Заголовок = НСтр("ru='Состав транспортной упаковки: '") + """" + Параметры.НомерУпаковки + """";
	
	Элементы.ТоварыЦена.Видимость     = НЕ ЭтоОрдер;
	Элементы.ТоварыСумма.Видимость    = НЕ ЭтоОрдер;
	Элементы.ТоварыСуммаНДС.Видимость = НЕ ЭтоОрдер;
	Элементы.СоставЦена.Видимость     = НЕ ЭтоОрдер;
	Элементы.СоставСумма.Видимость    = НЕ ЭтоОрдер;
	Элементы.СоставСуммаНДС.Видимость = НЕ ЭтоОрдер;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Состав.НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Выбранная строка уже добавлена в состав.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Состав.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	НоваяСтрока.КоличествоВТоварах = ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоУпаковокПриИзменении(Элемент)
	
	Если НЕ ЭтоОрдер Тогда
		
		ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
		
		ПараметрыРасчета = Новый Структура();
		ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
		
		ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(ТекущаяСтрока, ПараметрыРасчета);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьВвод(Команда)
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	СохранитьВводСервер(ЕстьОшибки);
	Если Не Модифицированность И НЕ ЕстьОшибки Тогда
		
		ВладелецФормы.Модифицированность = МодифицированностьВладельца;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьВводСервер(ЕстьОшибки)
	
	Если Состав.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Состав не заполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из Состав Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = ЗаполнитьПризнакМаркируемгоТовара(СтрокаТовары.Характеристика);
		
		Если Результат Тогда
			СтрокаТовары.МаркируемыйТовар = Истина;
		Иначе
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Состав.Выгрузить(), АдресВоВременномХранилище);
	
	Если Модифицированность Тогда
		МодифицированностьВладельца = Истина;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПризнакМаркируемгоТовара(Характеристика)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектХарактеристики = Характеристика.ПолучитьОбъект();
	ОбъектХарактеристики.ор_МаркируемыйТовар = Истина;
	
	Попытка
		ОбъектХарактеристики.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить признак маркируемого товара в характеристике :'") + Строка(Характеристика);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьGTIN()
	
	Для Каждого СтрокаТовара Из Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовара.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПоиска = ор_ИнтеграцияМДЛП.НайтиGTINПоНоменклатре(СтрокаТовара.Номенклатура, СтрокаТовара.Характеристика);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			СтрокаТовара.GTIN = РезультатПоиска;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
