
#Область ПрограммныйИнтерфейс

// Процедура - Проверить токен
//
Процедура ПроверитьТокен() Экспорт
	
	// Проверка на заполненость токена.
	ТокенПользователя = Константы.ор_ТокенПользователяНСИ.Получить();
	
	Если Не ЗначениеЗаполнено(ТокенПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать токен пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = ПараметрыОтправкиЗапросаНСИ("port/rest/validate", "POST");
	
	ПараметрыОтправки.Json = "{
	|""userKey"": """ + СокрЛП(ТокенПользователя) + """,
	|""date"": """ + Формат(ТекущаяДатаСеанса(),"ДФ=""гггг-ММ-дд ЧЧ:мм:сс""") + """
	|}";
	
	Результат = ВыполнитьЗапросНСИ(ПараметрыОтправки);
	
	Если Результат.Код = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Токен верный.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка авторизации: Токен не верный.'"));
	КонецЕсли;
	
КонецПроцедуры

// Функция - Сформировать дерево ДВЛП
//
// Параметры:
//  ИсточникДанных	 - Строка - источник данных
//  ФайлСДанными	 - XMLСтрока - строка данных в XML
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево действующих веществ лекарственных препаратов
//
Функция СформироватьДеревоДВЛП(ИсточникДанных = "Классификаторы", ФайлСДанными = Неопределено) Экспорт
	
	Число10   = Новый ОписаниеТипов("Число",   Новый КвалификаторыЧисла(10));
	Строка150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	Строка400 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(400));
	Строка500 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(500));
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование"              , Строка150, НСтр("ru = 'Наименование'"));
	Дерево.Колонки.Добавить("КодРаздела"                , Строка400, НСтр("ru = 'Код'"));
	Дерево.Колонки.Добавить("НаименованиеПолное"        , Строка500, НСтр("ru = 'Наименование полное'"));
	Дерево.Колонки.Добавить("НаименованиеАнглийское"    , Строка500, НСтр("ru = 'Английское наименование'"));
	Дерево.Колонки.Добавить("НаименованиеЛатинское"     , Строка500, НСтр("ru = 'Латинское наименование'"));
	Дерево.Колонки.Добавить("ГруппаДействующегоВещества", Число10  , НСтр("ru = 'Группа действующего вещества'"));
	Дерево.Колонки.Добавить("АТХ"                       , Строка400, НСтр("ru = 'Код раздела (АТХ)'"));
	
	Если ИсточникДанных = "Файлы" И ЗначениеЗаполнено(ФайлСДанными) Тогда
		ЗаполнитьДанныеДВЛПИзФайла(Дерево, ФайлСДанными);
	ИначеЕсли ИсточникДанных = "API" Тогда
		ЗаполнитьДанныеДВЛПИзСервиса(Дерево);
	Иначе
		ЗаполнитьДанныеДВЛПИзФайла(Дерево);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

// Функция - Сформировать дерево классификаторов ATX
//
// Параметры:
//  ИсточникДанных	 - Строка - источник данных
//  ФайлСДанными	 - XMLСтрока - строка данных в XML
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево классификаторов ATX
//
Функция СформироватьДеревоКлассификаторовATX(ИсточникДанных = "Классификаторы", ФайлСДанными = Неопределено) Экспорт
	
	Число10   = Новый ОписаниеТипов("Число",   Новый КвалификаторыЧисла(10));
	Строка150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Идентификатор"       , Число10  , НСтр("ru = 'Идентификатор'"));
	Дерево.Колонки.Добавить("КодРаздела"          , Строка150, НСтр("ru = 'Код раздела'"));
	Дерево.Колонки.Добавить("Наименование"        , Строка150, НСтр("ru = 'Наименование'"));
	Дерево.Колонки.Добавить("НаименованиеПолное"  , Строка150, НСтр("ru = 'Полное наименование'"));
	Дерево.Колонки.Добавить("ИДРодительскойЗаписи", Число10  , НСтр("ru = 'Идентификатор родительской записи'"));
	
	Если ИсточникДанных = "Файлы" И ЗначениеЗаполнено(ФайлСДанными) Тогда
		ЗаполнитьДанныеКлассификатораATXИзФайла(Дерево, ФайлСДанными);
	ИначеЕсли ИсточникДанных = "API" Тогда
		ЗаполнитьДанныеКлассификатораATXИзСервиса(Дерево);
	Иначе
		ЗаполнитьДанныеКлассификатораATXИзФайла(Дерево);
	КонецЕсли;
	
	// Так как в дереве только ИД-строки и ИД-родителя установим реквизит "Родитель" к элементам дерева.
	
	// Копия дерева чтоб при изменени элементов цикл не сломался.
	ДеревоКопия = Дерево.Скопировать();
	
	// У данного дерева вложенности нет, поэтому рекурсии не будет.
	Для Каждого СтрокаДеревоКопия Из ДеревоКопия.Строки Цикл
		Если ЗначениеЗаполнено(СтрокаДеревоКопия.ИДРодительскойЗаписи) Тогда
			СтрокаРодительДерево = Дерево.Строки.Найти(СтрокаДеревоКопия.ИДРодительскойЗаписи, "Идентификатор", Истина);
			СтрокаДерево         = Дерево.Строки.Найти(СтрокаДеревоКопия.Идентификатор, "Идентификатор", Истина);
			Если ЗначениеЗаполнено(СтрокаРодительДерево) И ЗначениеЗаполнено(СтрокаДерево) Тогда
				СкопироватьУзелДерева(СтрокаРодительДерево.Строки, СтрокаДерево);
				Если ЗначениеЗаполнено(СтрокаДерево.Родитель) Тогда
					СтрокаДерево.Родитель.Строки.Удалить(СтрокаДерево);
				Иначе
					Дерево.Строки.Удалить(СтрокаДерево);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем ненужные колонки.
	Дерево.Колонки.Удалить(Дерево.Колонки.Найти("Идентификатор"));
	Дерево.Колонки.Удалить(Дерево.Колонки.Найти("ИДРодительскойЗаписи"));
	
	Возврат Дерево;
	
КонецФункции

// Функция - Сформировать дерево лекарственных форм
//
// Параметры:
//  ИсточникДанных		 - Строка - источник данных
//  ФайлСБазовымиЛФ		 - XMLСтрока - строка данных в XML
//  ФайлСПодчиненнымиЛФ	 - XMLСтрока - строка данных в XML
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево лекарственных форм
//
Функция СформироватьДеревоЛекарственныхФорм(ИсточникДанных = "Классификаторы", ФайлСБазовымиЛФ = Неопределено, ФайлСПодчиненнымиЛФ = Неопределено) Экспорт
	
	Строка100 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100));
	Строка150 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150));
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование"            , Строка100, НСтр("ru = 'Наименование'"));
	Дерево.Колонки.Добавить("НаименованиеЛатынь"      , Строка100, НСтр("ru = 'Наименование(Латынь)'"));
	Дерево.Колонки.Добавить("НаименованиеЛатыньПолное", Строка150, НСтр("ru = 'Полное наименование(Латынь)'"));
	Дерево.Колонки.Добавить("НаименованиеПолное"      , Строка150, НСтр("ru = 'Полное наименование'"));
	
	Если ИсточникДанных = "Файлы" Тогда
		ЗаполнитьДанныеЛекарственныхФормИзФайла(Дерево, ФайлСБазовымиЛФ, ФайлСПодчиненнымиЛФ);
	ИначеЕсли ИсточникДанных = "API" Тогда
		ЗаполнитьДанныеЛекарственныхФормИзСервиса(Дерево);
	Иначе
		ЗаполнитьДанныеЛекарственныхФормИзФайла(Дерево);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

// Функция - Сформировать дерево СМНН
//
// Параметры:
//  ИсточникДанных	 - Строка - источник данных
//  ФайлСДанными	 - XMLСтрока - строка данных в XML
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево международных непатентованных наименований
//
Функция СформироватьДеревоСМНН(ИсточникДанных = "Классификаторы", ФайлСДанными = Неопределено) Экспорт
	
	Строка150 = Новый ОписаниеТипов("Строка",,,,  Новый КвалификаторыСтроки(150));
	Булево    = Новый ОписаниеТипов("Булево");
	Дерево = Новый ДеревоЗначений; 
	Дерево.Колонки.Добавить("КодЕСКЛП"       , Строка150, НСтр("ru = 'Код узла СМНН'"));
	Дерево.Колонки.Добавить("КодКТРУ"        , Строка150, НСтр("ru = 'Код КТРУ'"));
	Дерево.Колонки.Добавить("КодОКЕИ"        , Строка150, НСтр("ru = 'Код ОКЕИ'"));
	Дерево.Колонки.Добавить("КодОКПД2"       , Строка150, НСтр("ru = 'Код ОКПД2'"));
	Дерево.Колонки.Добавить("ЖНВЛП"          , Булево   , НСтр("ru = 'ЖНВЛП'"));
	Дерево.Колонки.Добавить("КодАТХ"         , Строка150, НСтр("ru = 'Код АТХ'"));
	Дерево.Колонки.Добавить("НаименованиеАТХ", Строка150, НСтр("ru = 'Наименование АТХ'"));
	Дерево.Колонки.Добавить("НаименованиеФТГ", Строка150, НСтр("ru = 'Наименование ФТГ'"));
	Дерево.Колонки.Добавить(
		"СтандартизированноеМНН",
		Строка150,
		НСтр("ru = 'Стандартизированное МНН'"));
	Дерево.Колонки.Добавить(
		"СтандартизированнаяЛекарственнаяФорма",
		Строка150,
		НСтр("ru = 'Стандартизированная лекарственная форма'"));
	Дерево.Колонки.Добавить(
		"СтандартизированнаяЛекарственнаяДоза",
		Строка150,
		НСтр("ru = 'Стандартизированная лекарственная доза'"));
	Дерево.Колонки.Добавить(
		"НаименованиеПотребительскойЕдиницыИзмерения",
		Строка150,
		НСтр("ru = 'Наименование потребительской единицы измерения'"));
	Дерево.Колонки.Добавить(
		"НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров",
		Булево,
		НСтр("ru = 'Наличие в ЛП наркотических психотропных веществ и их прекурсоров'"));
	
	// Макета с классификатором СМНН нет.
	Если ИсточникДанных = "API" Тогда
		ЗаполнитьДанныеСМННИзСервиса(Дерево);
	Иначе
		ЗаполнитьДанныеСМННИзФайла(Дерево, ФайлСДанными);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

// Функция - Сформировать дерево ФТГ
//
// Параметры:
//  ИсточникДанных	 - Строка - источник данных
//  ФайлСДанными	 - XMLСтрока - строка данных в XML
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево фармако-терапевтической группы препарата
//
Функция СформироватьДеревоФТГ(ИсточникДанных = "Классификаторы", ФайлСДанными = Неопределено) Экспорт
	
	Строка400 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(500));
	Строка500 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(500));
	Дерево = Новый ДеревоЗначений; 
	Дерево.Колонки.Добавить("КодРаздела"            , Строка400, НСтр("ru = 'Код раздела'"));
	Дерево.Колонки.Добавить("НаименованиеПолное"    , Строка500, НСтр("ru = 'Наименование полное'"));
	Дерево.Колонки.Добавить("НаименованиеАнглийское", Строка500, НСтр("ru = 'Наименование английское'"));
	
	Если ИсточникДанных = "Файлы" Тогда
		ЗаполнитьДанныеФТГИзФайла(Дерево, ФайлСДанными);
	ИначеЕсли ИсточникДанных = "API" Тогда
		ЗаполнитьДанныеФТГИзСервиса(Дерево);
	Иначе
		ЗаполнитьДанныеФТГИзФайла(Дерево);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкопироватьУзелДерева(СтрокиПолучателя, УзелИсточник)
	НоваяСтрока = СтрокиПолучателя.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, УзелИсточник);
	Для Каждого Строка Из УзелИсточник.Строки Цикл
		СкопироватьУзелДерева(НоваяСтрока.Строки, Строка);
	КонецЦикла;
КонецПроцедуры

Функция ПараметрыОтправкиЗапросаНСИ(Знач ИмяКоманды = "port/rest/data", Метод = "GET")
	
	Параметры = ОтправкаЗапросов.НовыйПараметрыОтправки(Метод);
	
	ИмяКоманды = СокрЛП(ИмяКоманды);
	Если Не ПустаяСтрока(ИмяКоманды)
		И Не СтрНачинаетсяС(ИмяКоманды, "/") Тогда
		ИмяКоманды = "/" + ИмяКоманды;
	КонецЕсли;
	
	Параметры.URL = "https://nsi.rosminzdrav.ru" + ИмяКоманды;
	
	Параметры.Заголовки.Вставить("Content-Type", "application/json");
	
	Параметры.ИмяСобытияЖР = "Классификаторы.ЗагрузкаИзСервисаНСИ";
	
	Возврат Параметры;
	
КонецФункции

Функция ВыполнитьЗапросНСИ(ПараметрыОтправки)
	
	Если СтрНайти(ПараметрыОтправки.URL, "?") = 0 Тогда
		ДополнитьURLПараметрами(ПараметрыОтправки);
	КонецЕсли;
	
	РезультатЗапроса = ОтправкаЗапросов.ОтправитьЗапрос(ПараметрыОтправки, Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("Код", РезультатЗапроса.КодСостояния);
	Результат.Вставить("Описание", "");
	Результат.Вставить("Данные", РезультатЗапроса.ПараметрыТела);
	
	Если РезультатЗапроса.КодСостояния = 0 Или РезультатЗапроса.КодСостояния = 200 Тогда
		
		Данные = Новый Структура;
		
		Если РезультатЗапроса.ПараметрыТела.Свойство("total") Тогда
			Данные.Вставить("total", РезультатЗапроса.ПараметрыТела.total);
		КонецЕсли;
		
		Если РезультатЗапроса.ПараметрыТела.Свойство("list") Тогда
			Данные.Вставить("list", РезультатЗапроса.ПараметрыТела.list);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатЗапроса.ПараметрыТела.resultCode) Тогда
			РезультатКод = 40; // .Метод не выполнен по причине: %resultText%.
		Иначе
			РезультатКод = 0;
		КонецЕсли;
		
		Результат.Код = РезультатКод;
		Результат.Описание = РезультатЗапроса.ПараметрыТела.resultText;
		Результат.Данные = Данные;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьURLПараметрами(ПараметрыОтправки)
	
	Если ПараметрыОтправки.ПараметрыURL.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыURL = Новый Массив;
	Для Каждого КлючЗначение Из ПараметрыОтправки.ПараметрыURL Цикл
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			Для Каждого ТекущийЭлемент Из КлючЗначение.Значение Цикл
				ПараметрURL = КлючЗначение.Ключ + "=" + ОтправкаЗапросов.ЗначениеПараметраДляURL(ТекущийЭлемент);
				ПараметрыURL.Добавить(ПараметрURL);
			КонецЦикла;
		Иначе
			ПараметрURL = КлючЗначение.Ключ + "=" + ОтправкаЗапросов.ЗначениеПараметраДляURL(КлючЗначение.Значение);
			ПараметрыURL.Добавить(ПараметрURL);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтправки.URL = ОтправкаЗапросов.ДополнитьURLСтрокойПараметров(ПараметрыОтправки.URL, СтрСоединить(ПараметрыURL, "&"));
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДВЛПИзФайла(Дерево, ФайлСДанными = Неопределено)
	
	ЧтениеКлассификатор = Новый ЧтениеXML;
	Если ФайлСДанными = Неопределено Тогда
		МакетКлассификатор = Справочники.ор_ДВЛП.ПолучитьМакет("Классификатор");
		ЧтениеКлассификатор.УстановитьСтроку(МакетКлассификатор.ПолучитьТекст());
	Иначе
		ЧтениеКлассификатор.ОткрытьФайл(ФайлСДанными);
	КонецЕсли;
	
	ОбработкаРеквизитов = Ложь;
	Пока ЧтениеКлассификатор.Прочитать() Цикл
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			СтруктураСтроки = Новый Структура;
			ОбработкаРеквизитов = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбработкаРеквизитов Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "ID" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодРаздела", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "NAME_RUS" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("Наименование", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "NAME_LAT" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеЛатинское", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "NAME_ENG" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеАнглийское", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "GROUP" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("ГруппаДействующегоВещества", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "ATC" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("АТХ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.Наименование, "Наименование", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураСтроки);
				СтрокаДерева.НаименованиеПолное = СтруктураСтроки.Наименование;
			КонецЕсли;
			ОбработкаРеквизитов = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКлассификатораATXИзФайла(Дерево, ФайлСДанными = Неопределено)
	
	ЧтениеКлассификатор = Новый ЧтениеXML;
	Если ФайлСДанными = Неопределено Тогда
		МакетКлассификатор = Справочники.ор_КлассификаторАТХ.ПолучитьМакет("Классификатор");
		ЧтениеКлассификатор.УстановитьСтроку(МакетКлассификатор.ПолучитьТекст());
	Иначе
		ЧтениеКлассификатор.ОткрытьФайл(ФайлСДанными);
	КонецЕсли;
	
	ОбработкаРеквизитов = Ложь;
	Пока ЧтениеКлассификатор.Прочитать() Цикл
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			СтруктураСтроки = Новый Структура;
			ОбработкаРеквизитов = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбработкаРеквизитов Тогда
			Продолжить;
		КонецЕсли;
		
		// ИД нужен доля постройки дерева
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "RECID" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("Идентификатор", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "ATC_CODE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодРаздела", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "ATC_NAME" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("Наименование", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "HIGH" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("ИДРодительскойЗаписи", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			
			// Проверка на уникальность
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("КодРаздела",СтруктураСтроки.КодРаздела);
			ПараметрыПоиска.Вставить("Наименование",СтруктураСтроки.Наименование);
			НайденнаяСтрока = Дерево.Строки.НайтиСтроки(ПараметрыПоиска,Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураСтроки);
				СтрокаДерева.НаименованиеПолное = СтруктураСтроки.КодРаздела + " " + СтруктураСтроки.Наименование;
			КонецЕсли;
			ОбработкаРеквизитов = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеЛекарственныхФормИзФайла(Дерево, ФайлСБазовымиЛФ = Неопределено, ФайлСПодчиненнымиЛФ = Неопределено)
	
	// Записываем в дерево базовые ЛФ.
	ЧтениеКлассификаторБазовые = Новый ЧтениеXML;
	Если ФайлСБазовымиЛФ = Неопределено Тогда
		МакетКлассификатор = Справочники.ор_ЛекарственныеФормы.ПолучитьМакет("КлассификаторБазовые");
		ЧтениеКлассификаторБазовые.УстановитьСтроку(МакетКлассификатор.ПолучитьТекст());
	Иначе
		ЧтениеКлассификаторБазовые.ОткрытьФайл(ФайлСБазовымиЛФ);
	КонецЕсли;
	
	ОбработкаРеквизитов = Ложь;
	Пока ЧтениеКлассификаторБазовые.Прочитать() Цикл
		
		Если ЧтениеКлассификаторБазовые.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификаторБазовые.Имя = "entry" Тогда
			СтруктураСтроки = Новый Структура;
			ОбработкаРеквизитов = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбработкаРеквизитов Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеКлассификаторБазовые.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификаторБазовые.Имя = "BasicDoseForm" Тогда
			ЧтениеКлассификаторБазовые.Прочитать();
			СтруктураСтроки.Вставить("Наименование", ЧтениеКлассификаторБазовые.Значение);
			ЧтениеКлассификаторБазовые.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификаторБазовые.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификаторБазовые.Имя = "BasicDoseForm_LAT" Тогда
			ЧтениеКлассификаторБазовые.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеЛатынь", ЧтениеКлассификаторБазовые.Значение);
			ЧтениеКлассификаторБазовые.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификаторБазовые.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ЧтениеКлассификаторБазовые.Имя = "entry" Тогда
			СтрокаБазоваяЛФ = Дерево.Строки.Найти(СтруктураСтроки.Наименование, "Наименование", Истина);
			Если НЕ ЗначениеЗаполнено(СтрокаБазоваяЛФ) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураСтроки);
			КонецЕсли;
			ОбработкаРеквизитов = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Записываем в дерево подчиненные ЛФ.
	ЧтениеКлассификатор = Новый ЧтениеXML;
	Если ФайлСПодчиненнымиЛФ = Неопределено Тогда
		МакетКлассификатор = Справочники.ор_ЛекарственныеФормы.ПолучитьМакет("Классификатор");
		ЧтениеКлассификатор.УстановитьСтроку(МакетКлассификатор.ПолучитьТекст());
	Иначе
		ЧтениеКлассификатор.ОткрытьФайл(ФайлСПодчиненнымиЛФ);
	КонецЕсли;
	
	ОбработкаРеквизитов = Ложь;
	Пока ЧтениеКлассификатор.Прочитать() Цикл
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			СтруктураЭлемента = Новый Структура;
			ОбработкаРеквизитов = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбработкаРеквизитов Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "DosageFormFullName" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураЭлемента.Вставить("НаименованиеПолное", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "BasicDoseForm" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураЭлемента.Вставить("БазоваяЛФ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			Если СтруктураЭлемента.Свойство("БазоваяЛФ")
				И ЗначениеЗаполнено(СтруктураЭлемента.БазоваяЛФ) Тогда
				СтрокаБазоваяЛФ = Дерево.Строки.Найти(СтруктураЭлемента.БазоваяЛФ, "Наименование", Истина);
				СтрокаПодчиненнаяЛФ = Дерево.Строки.Найти(СтруктураЭлемента.НаименованиеПолное, "Наименование", Истина);
				Если ЗначениеЗаполнено(СтрокаБазоваяЛФ) И НЕ ЗначениеЗаполнено(СтрокаПодчиненнаяЛФ) Тогда
					НоваяСтрока = СтрокаБазоваяЛФ.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЭлемента);
					НоваяСтрока.Наименование = СтруктураЭлемента.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
			ОбработкаРеквизитов = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСМННИзФайла(Дерево, ФайлСДанными = Неопределено)
	
	Если ФайлСДанными = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеКлассификатор = Новый ЧтениеXML;
	ЧтениеКлассификатор.ОткрытьФайл(ФайлСДанными);
	
	ОбработкаРеквизитов = Ложь;
	Пока ЧтениеКлассификатор.Прочитать() Цикл
		
		ИмяЭлементаВРег = ВРег(ЧтениеКлассификатор.Имя);
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "ENTRY" Тогда
			СтруктураСтроки = Новый Структура;
			ОбработкаРеквизитов = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбработкаРеквизитов Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "SMNN_CODE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодЕСКЛП", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "STANDARD_INN" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("СтандартизированноеМНН", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "STANDARD_FORM" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("СтандартизированнаяЛекарственнаяФорма", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "STANDARD_DOZE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("СтандартизированнаяЛекарственнаяДоза", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "KTRU_CODE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодКТРУ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "NAME_UNIT" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеПотребительскойЕдиницыИзмерения", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "OKEI_CODE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодОКЕИ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "OKPD_2_CODE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодОКПД2", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "ESSENTIAL_MEDICINES" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("ЖНВЛП", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "NARCOTIC_PSYCHOTROPIC" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "CODE_ATC" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодАТХ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "NAME_ATC" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеАТХ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ИмяЭлементаВРег = "TN" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеФТГ", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ИмяЭлементаВРег = "ENTRY" Тогда
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.КодЕСКЛП, "КодЕСКЛП", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(
					СтрокаДерева,
					СтруктураСтроки,,
					"ЖНВЛП,НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров");
				СтрокаДерева.ЖНВЛП = ?(НРег(СтруктураСтроки.ЖНВЛП) = "да", Истина, Ложь);
				СтрокаДерева.НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров = ?(
					НРег(СтруктураСтроки.НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров) = "да",
					Истина,
					Ложь);
			КонецЕсли;
			ОбработкаРеквизитов = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеФТГИзФайла(Дерево, ФайлСДанными = Неопределено)
	
	ЧтениеКлассификатор = Новый ЧтениеXML;
	Если ФайлСДанными = Неопределено Тогда
		МакетКлассификатор = Справочники.ор_ФТГ.ПолучитьМакет("Классификатор");
		ЧтениеКлассификатор.УстановитьСтроку(МакетКлассификатор.ПолучитьТекст());
	Иначе
		ЧтениеКлассификатор.ОткрытьФайл(ФайлСДанными);
	КонецЕсли;
	
	ОбработкаРеквизитов = Ложь;
	Пока ЧтениеКлассификатор.Прочитать() Цикл
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			СтруктураСтроки = Новый Структура;
			ОбработкаРеквизитов = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбработкаРеквизитов Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "CS_ID" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("КодРаздела", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "NameR" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеПолное", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеКлассификатор.Имя = "NameE" Тогда
			ЧтениеКлассификатор.Прочитать();
			СтруктураСтроки.Вставить("НаименованиеАнглийское", ЧтениеКлассификатор.Значение);
			ЧтениеКлассификатор.Прочитать();
		КонецЕсли;
		
		
		Если ЧтениеКлассификатор.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ЧтениеКлассификатор.Имя = "entry" Тогда
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.НаименованиеПолное, "НаименованиеПолное", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураСтроки);
			КонецЕсли;
			ОбработкаРеквизитов = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДВЛПИзСервиса(Дерево)
	
	// Проверка на заполненость токена.
	ТокенПользователя = Константы.ор_ТокенПользователяНСИ.Получить();
	Если Не ЗначениеЗаполнено(ТокенПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для загрузки данных из НСИ необходимо указать токен пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = ПараметрыОтправкиЗапросаНСИ();
	
	ПараметрыОтправки.ПараметрыURL.Вставить("userKey", СокрЛП(ТокенПользователя));
	ПараметрыОтправки.ПараметрыURL.Вставить("identifier", "1.2.643.5.1.13.13.11.1367");
	
	// Фильтр по колонкам которые должны вернутся.
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("ID");
	МассивКолонок.Добавить("NAME_RUS");
	МассивКолонок.Добавить("NAME_LAT");
	МассивКолонок.Добавить("NAME_ENG");
	МассивКолонок.Добавить("GROUP");
	МассивКолонок.Добавить("ATC");
	ПараметрыОтправки.ПараметрыURL.Вставить("columns", МассивКолонок);
	
	ПараметрыОтправки.ПараметрыURL.Вставить("page", 1);
	
	// 10000 записей - максимум что может вернуть сайт в одном запросе.
	ПараметрыОтправки.ПараметрыURL.Вставить("size", 10000);
	
	НужнаИтерация = Истина;
	КоличествоПолучено = 0;
	
	Пока НужнаИтерация Цикл
		
		НужнаИтерация = Ложь;
		
		ДанныеСправочника = ВыполнитьЗапросНСИ(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтправки));
		
		Если ДанныеСправочника.Код <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеСправочника.Описание);
			Возврат;
		КонецЕсли;
		
		КоличествоПолучено = КоличествоПолучено + ДанныеСправочника.Данные.list.Количество(); 
		
		Для Каждого ЭлементСправочника Из ДанныеСправочника.Данные.list Цикл
			
			СтруктураСтроки = Новый Структура;
			
			Для Каждого Колонка Из ЭлементСправочника Цикл
				ИмяКолонки = ВРег(Колонка.column);
				Если ИмяКолонки ="ID" Тогда
					СтруктураСтроки.Вставить("КодРаздела", Колонка.value);
				ИначеЕсли ИмяКолонки = "NAME_RUS" Тогда
					СтруктураСтроки.Вставить("Наименование",Колонка.value);
				ИначеЕсли ИмяКолонки = "NAME_LAT" Тогда
					СтруктураСтроки.Вставить("НаименованиеЛатинское",Колонка.value);
				ИначеЕсли ИмяКолонки = "NAME_ENG" Тогда
					СтруктураСтроки.Вставить("НаименованиеАнглийское",Колонка.value);
				ИначеЕсли ИмяКолонки = "GROUP" Тогда
					СтруктураСтроки.Вставить("ГруппаДействующегоВещества",Колонка.value);
				ИначеЕсли ИмяКолонки = "ATC" Тогда
					СтруктураСтроки.Вставить("АТХ",Колонка.value);
				КонецЕсли;
			КонецЦикла;
			
			// Проверка на уникальность.
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.Наименование, "Наименование", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураСтроки);
				СтрокаДерева.НаименованиеПолное = СтруктураСтроки.Наименование;
			КонецЕсли;
			
		КонецЦикла;
		
		// Если получено не все, то инкрементируем номер страницы и получаем еще раз.
		Если КоличествоПолучено < ДанныеСправочника.Данные.total Тогда
			НужнаИтерация = Истина;
			ТекущаяСтраница = ПараметрыОтправки.ПараметрыURL.Получить("page");
			ПараметрыОтправки.ПараметрыURL.Вставить("page", ?(ТекущаяСтраница = Неопределено, 0, ТекущаяСтраница) + 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКлассификатораATXИзСервиса(Дерево)
	
	// Проверка на заполненость токена.
	ТокенПользователя = Константы.ор_ТокенПользователяНСИ.Получить();
	Если Не ЗначениеЗаполнено(ТокенПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для загрузки данных из НСИ необходимо указать токен пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = ПараметрыОтправкиЗапросаНСИ();
	
	ПараметрыОтправки.ПараметрыURL.Вставить("userKey", СокрЛП(ТокенПользователя));
	ПараметрыОтправки.ПараметрыURL.Вставить("identifier", "1.2.643.5.1.13.13.99.2.473");
	
	// Фильтр по колонкам которые должны вернутся.
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("RECID");
	МассивКолонок.Добавить("ATC_CODE");
	МассивКолонок.Добавить("ATC_NAME");
	МассивКолонок.Добавить("HIGH");
	ПараметрыОтправки.ПараметрыURL.Вставить("columns", МассивКолонок);
	
	ПараметрыОтправки.ПараметрыURL.Вставить("page", 1);
	
	// 10000 записей - максимум что может вернуть сайт в одном запросе.
	ПараметрыОтправки.ПараметрыURL.Вставить("size", 10000);
	
	НужнаИтерация = Истина;
	КоличествоПолучено = 0;
	
	Пока НужнаИтерация Цикл
		
		НужнаИтерация = Ложь;
		
		ДанныеСправочника = ВыполнитьЗапросНСИ(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтправки));
		
		Если ДанныеСправочника.Код <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеСправочника.Описание);
			Возврат;
		КонецЕсли;
		
		КоличествоПолучено = КоличествоПолучено + ДанныеСправочника.Данные.list.Количество(); 
		
		Для Каждого ЭлементСправочника Из ДанныеСправочника.Данные.list Цикл
			
			СтруктураСтроки = Новый Структура;
			
			Для Каждого Колонка Из ЭлементСправочника Цикл
				ИмяКолонки = ВРег(Колонка.column);
				Если ИмяКолонки = "RECID" Тогда
					СтруктураСтроки.Вставить("Идентификатор", Колонка.value);
				ИначеЕсли ИмяКолонки = "ATC_CODE" Тогда
					СтруктураСтроки.Вставить("КодРаздела", Колонка.value);
				ИначеЕсли ИмяКолонки = "ATC_NAME" Тогда
					СтруктураСтроки.Вставить("Наименование", Колонка.value);
				ИначеЕсли ИмяКолонки = "HIGH" Тогда
					СтруктураСтроки.Вставить("ИДРодительскойЗаписи", Колонка.value);
				КонецЕсли;
			КонецЦикла;
			
			// Проверка на уникальность
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("КодРаздела",СтруктураСтроки.КодРаздела);
			ПараметрыПоиска.Вставить("Наименование",СтруктураСтроки.Наименование);
			НайденнаяСтрока = Дерево.Строки.НайтиСтроки(ПараметрыПоиска,Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураСтроки);
				СтрокаДерева.НаименованиеПолное = СтруктураСтроки.КодРаздела + " " + СтруктураСтроки.Наименование;
			КонецЕсли;
			
		КонецЦикла;
		
		// Если получено не все, то инкрементируем номер страницы и получаем еще раз.
		Если КоличествоПолучено < ДанныеСправочника.Данные.total Тогда
			НужнаИтерация = Истина;
			ТекущаяСтраница = ПараметрыОтправки.ПараметрыURL.Получить("page");
			ПараметрыОтправки.ПараметрыURL.Вставить("page", ?(ТекущаяСтраница = Неопределено, 0, ТекущаяСтраница) + 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеЛекарственныхФормИзСервиса(Дерево)
	
	// Проверка на заполненость токена.
	ТокенПользователя = Константы.ор_ТокенПользователяНСИ.Получить();
	Если Не ЗначениеЗаполнено(ТокенПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для загрузки данных из НСИ необходимо указать токен пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = ПараметрыОтправкиЗапросаНСИ();
	
	ПараметрыОтправки.ПараметрыURL.Вставить("userKey", СокрЛП(ТокенПользователя));
	// Базовые лекарственные формы.
	ПараметрыОтправки.ПараметрыURL.Вставить("identifier", "1.2.643.5.1.13.13.11.1464");
	
	// Фильтр по колонкам которые должны вернутся.
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("BasicDoseForm");
	МассивКолонок.Добавить("BasicDoseForm_LAT");
	ПараметрыОтправки.ПараметрыURL.Вставить("columns", МассивКолонок);
	
	ПараметрыОтправки.ПараметрыURL.Вставить("page", 1);
	
	// 10000 записей - максимум что может вернуть сайт в одном запросе.
	ПараметрыОтправки.ПараметрыURL.Вставить("size", 10000);
	
	НужнаИтерация = Истина;
	КоличествоПолучено = 0;
	
	Пока НужнаИтерация Цикл
		
		НужнаИтерация = Ложь;
		
		ДанныеСправочника = ВыполнитьЗапросНСИ(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтправки));
		
		Если ДанныеСправочника.Код <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеСправочника.Описание);
			Возврат;
		КонецЕсли;
		
		КоличествоПолучено = КоличествоПолучено + ДанныеСправочника.Данные.list.Количество(); 
		
		Для Каждого ЭлементСправочника Из ДанныеСправочника.Данные.list Цикл
			
			СтруктураСтроки = Новый Структура;
			
			Для Каждого Колонка Из ЭлементСправочника Цикл
				ИмяКолонки = ВРег(Колонка.column);
				Если ИмяКолонки = ВРег("BasicDoseForm") Тогда
					СтруктураСтроки.Вставить("Наименование", Колонка.value);
				ИначеЕсли ИмяКолонки = ВРег("BasicDoseForm_LAT") Тогда
					СтруктураСтроки.Вставить("НаименованиеЛатынь", Колонка.value);
				КонецЕсли;
			КонецЦикла;
			
			// Проверка на уникальность.
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.Наименование, "Наименование", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
		// Если получено не все, то инкрементируем номер страницы и получаем еще раз.
		Если КоличествоПолучено < ДанныеСправочника.Данные.total Тогда
			НужнаИтерация = Истина;
			ТекущаяСтраница = ПараметрыОтправки.ПараметрыURL.Получить("page");
			ПараметрыОтправки.ПараметрыURL.Вставить("page", ?(ТекущаяСтраница = Неопределено, 0, ТекущаяСтраница) + 1);
		КонецЕсли;
	КонецЦикла;
	
	// Лекарственные формы.
	ПараметрыОтправки.ПараметрыURL.Вставить("identifier", "1.2.643.5.1.13.13.11.1466");
	ПараметрыОтправки.ПараметрыURL.Вставить("page", 1);
	// Фильтр по колонкам которые должны вернутся.
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("BasicDoseForm");
	МассивКолонок.Добавить("DosageFormFullName");
	ПараметрыОтправки.ПараметрыURL.Вставить("columns", МассивКолонок);
	
	НужнаИтерация = Истина;
	КоличествоПолучено = 0;
	
	Пока НужнаИтерация Цикл
		
		НужнаИтерация = Ложь;
		
		ДанныеСправочника = ВыполнитьЗапросНСИ(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтправки));
		
		Если ДанныеСправочника.Код <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеСправочника.Описание);
			Возврат;
		КонецЕсли;
		
		КоличествоПолучено = КоличествоПолучено + ДанныеСправочника.Данные.list.Количество(); 
		
		Для Каждого ЭлементСправочника Из ДанныеСправочника.Данные.list Цикл
			
			СтруктураСтроки = Новый Структура;
			
			Для Каждого Колонка Из ЭлементСправочника Цикл
				ИмяКолонки = ВРег(Колонка.column);
				Если ИмяКолонки = ВРег("DosageFormFullName") Тогда
					СтруктураСтроки.Вставить("НаименованиеПолное", Колонка.value);
				ИначеЕсли ИмяКолонки = ВРег("BasicDoseForm") Тогда
					СтруктураСтроки.Вставить("БазоваяЛФ", Колонка.value);
				КонецЕсли;
			КонецЦикла;
			
			// Проверка на уникальность.
			Если СтруктураСтроки.Свойство("БазоваяЛФ")
				И ЗначениеЗаполнено(СтруктураСтроки.БазоваяЛФ) Тогда
				СтрокаБазоваяЛФ = Дерево.Строки.Найти(СтруктураСтроки.БазоваяЛФ, "Наименование", Истина);
				СтрокаПодчиненнаяЛФ = Дерево.Строки.Найти(СтруктураСтроки.НаименованиеПолное, "Наименование", Истина);
				Если ЗначениеЗаполнено(СтрокаБазоваяЛФ) И НЕ ЗначениеЗаполнено(СтрокаПодчиненнаяЛФ) Тогда
					НоваяСтрока = СтрокаБазоваяЛФ.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
					НоваяСтрока.Наименование = СтруктураСтроки.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// Если получено не все, то инкрементируем номер страницы и получаем еще раз.
		Если КоличествоПолучено < ДанныеСправочника.Данные.total Тогда
			НужнаИтерация = Истина;
			ТекущаяСтраница = ПараметрыОтправки.ПараметрыURL.Получить("page");
			ПараметрыОтправки.ПараметрыURL.Вставить("page", ?(ТекущаяСтраница = Неопределено, 0, ТекущаяСтраница) + 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСМННИзСервиса(Дерево)
	
	// Проверка на заполненость токена.
	ТокенПользователя = Константы.ор_ТокенПользователяНСИ.Получить();
	Если Не ЗначениеЗаполнено(ТокенПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для загрузки данных из НСИ необходимо указать токен пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = ПараметрыОтправкиЗапросаНСИ();
	
	ПараметрыОтправки.ПараметрыURL.Вставить("userKey", СокрЛП(ТокенПользователя));
	ПараметрыОтправки.ПараметрыURL.Вставить("identifier", "1.2.643.5.1.13.13.99.2.611");
	
	ПараметрыОтправки.ПараметрыURL.Вставить("page", 1);
	
	// 10000 записей - максимум что может вернуть сайт в одном запросе.
	ПараметрыОтправки.ПараметрыURL.Вставить("size", 10000);
	
	НужнаИтерация = Истина;
	КоличествоПолучено = 0;
	
	Пока НужнаИтерация Цикл
		
		НужнаИтерация = Ложь;
		
		ДанныеСправочника = ВыполнитьЗапросНСИ(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтправки));
		
		Если ДанныеСправочника.Код <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеСправочника.Описание);
			Возврат;
		КонецЕсли;
		
		КоличествоПолучено = КоличествоПолучено + ДанныеСправочника.Данные.list.Количество(); 
		
		Для Каждого ЭлементСправочника Из ДанныеСправочника.Данные.list Цикл
			
			СтруктураСтроки = Новый Структура;
			
			Для Каждого Колонка Из ЭлементСправочника Цикл
				ИмяКолонки = ВРег(Колонка.column);
				Если ИмяКолонки ="SMNN_CODE" Тогда
					СтруктураСтроки.Вставить("КодЕСКЛП", Колонка.value);
				ИначеЕсли ИмяКолонки = "STANDARD_INN" Тогда
					СтруктураСтроки.Вставить("СтандартизированноеМНН", Колонка.value);
				ИначеЕсли ИмяКолонки = "STANDARD_FORM" Тогда
					СтруктураСтроки.Вставить("СтандартизированнаяЛекарственнаяФорма", Колонка.value);
				ИначеЕсли ИмяКолонки = "STANDARD_DOZE" Тогда
					СтруктураСтроки.Вставить("СтандартизированнаяЛекарственнаяДоза", Колонка.value);
				ИначеЕсли ИмяКолонки = "KTRU_CODE" Тогда
					СтруктураСтроки.Вставить("КодКТРУ", Колонка.value);
				ИначеЕсли ИмяКолонки = "NAME_UNIT" Тогда
					СтруктураСтроки.Вставить("НаименованиеПотребительскойЕдиницыИзмерения", Колонка.value);
				ИначеЕсли ИмяКолонки = "OKEI_CODE" Тогда
					СтруктураСтроки.Вставить("КодОКЕИ", Колонка.value);
				ИначеЕсли ИмяКолонки = "OKPD_2_CODE" Тогда
					СтруктураСтроки.Вставить("КодОКПД2", Колонка.value);
				ИначеЕсли ИмяКолонки = "ESSENTIAL_MEDICINES" Тогда
					СтруктураСтроки.Вставить("ЖНВЛП", Колонка.value);
				ИначеЕсли ИмяКолонки = "NARCOTIC_PSYCHOTROPIC" Тогда
					СтруктураСтроки.Вставить("НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров", Колонка.value);
				ИначеЕсли ИмяКолонки = "CODE_ATC" Тогда
					СтруктураСтроки.Вставить("КодАТХ", Колонка.value);
				ИначеЕсли ИмяКолонки = "NAME_ATC" Тогда
					СтруктураСтроки.Вставить("НаименованиеАТХ", Колонка.value);
				ИначеЕсли ИмяКолонки = "TN" Тогда
					СтруктураСтроки.Вставить("НаименованиеФТГ", Колонка.value);
				КонецЕсли;
			КонецЦикла;
			
			// Проверка на уникальность.
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.КодЕСКЛП, "КодЕСКЛП", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(
					СтрокаДерева,
					СтруктураСтроки,,
					"ЖНВЛП,НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров");
				СтрокаДерева.ЖНВЛП = ?(НРег(СтруктураСтроки.ЖНВЛП) = "да", Истина, Ложь);
				СтрокаДерева.НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров = ?(
					НРег(СтруктураСтроки.НаличиеВЛПНаркотическихПсихотропныхВеществИИхПрекурсоров) = "да",
					Истина,
					Ложь);
			КонецЕсли;
		КонецЦикла;
		
		// Если получено не все, то инкрементируем номер страницы и получаем еще раз.
		Если КоличествоПолучено < ДанныеСправочника.Данные.total Тогда
			НужнаИтерация = Истина;
			ТекущаяСтраница = ПараметрыОтправки.ПараметрыURL.Получить("page");
			ПараметрыОтправки.ПараметрыURL.Вставить("page", ?(ТекущаяСтраница = Неопределено, 0, ТекущаяСтраница) + 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеФТГИзСервиса(Дерево)
	
	// Проверка на заполненость токена.
	ТокенПользователя = Константы.ор_ТокенПользователяНСИ.Получить();
	Если Не ЗначениеЗаполнено(ТокенПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для загрузки данных из НСИ необходимо указать токен пользователя.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = ПараметрыОтправкиЗапросаНСИ();
	
	ПараметрыОтправки.ПараметрыURL.Вставить("userKey", СокрЛП(ТокенПользователя));
	ПараметрыОтправки.ПараметрыURL.Вставить("identifier", "1.2.643.5.1.13.13.99.2.930");
	
	ПараметрыОтправки.ПараметрыURL.Вставить("page", 1);
	
	// 10000 записей - максимум что может вернуть сайт в одном запросе.
	ПараметрыОтправки.ПараметрыURL.Вставить("size", 10000);
	
	НужнаИтерация = Истина;
	КоличествоПолучено = 0;
	
	Пока НужнаИтерация Цикл
		
		НужнаИтерация = Ложь;
		
		ДанныеСправочника = ВыполнитьЗапросНСИ(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтправки));
		
		Если ДанныеСправочника.Код <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеСправочника.Описание);
			Возврат;
		КонецЕсли;
		
		КоличествоПолучено = КоличествоПолучено + ДанныеСправочника.Данные.list.Количество();
		
		Для Каждого ЭлементСправочника Из ДанныеСправочника.Данные.list Цикл
			
			СтруктураСтроки = Новый Структура;
			
			Для Каждого Колонка Из ЭлементСправочника Цикл
				ИмяКолонки = ВРег(Колонка.column);
				Если ИмяКолонки ="CS_ID" Тогда
					СтруктураСтроки.Вставить("КодРаздела", Колонка.value);
				ИначеЕсли ИмяКолонки = ВРег("NameR") Тогда
					СтруктураСтроки.Вставить("НаименованиеПолное", Колонка.value);
				ИначеЕсли ИмяКолонки = ВРег("NameE") Тогда
					СтруктураСтроки.Вставить("НаименованиеАнглийское", Колонка.value);
				КонецЕсли;
			КонецЦикла;
			
			// Проверка на уникальность.
			НайденнаяСтрока = Дерево.Строки.Найти(СтруктураСтроки.НаименованиеПолное, "НаименованиеПолное", Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
		// Если получено не все, то инкрементируем номер страницы и получаем еще раз.
		Если КоличествоПолучено < ДанныеСправочника.Данные.total Тогда
			НужнаИтерация = Истина;
			ТекущаяСтраница = ПараметрыОтправки.ПараметрыURL.Получить("page");
			ПараметрыОтправки.ПараметрыURL.Вставить("page", ?(ТекущаяСтраница = Неопределено, 0, ТекущаяСтраница) + 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
