
&НаСервере
Процедура ОтправитьНаСервере(ТД)
	// Вставить содержимое обработчика. 
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИдентификаторЗаписи", ТД.ИдентификаторЗаписи);
	СтруктураЗаписи.Вставить("end_point",           ТД.end_point);
	СтруктураЗаписи.Вставить("service",             ТД.service);
	СтруктураЗаписи.Вставить("body",                ТД.body);
	СтруктураЗаписи.Вставить("http_status",         ТД.http_status);
	СтруктураЗаписи.Вставить("send_limit",          ТД.send_limit);
	СтруктураЗаписи.Вставить("Терминал",            ТД.Терминал);
	СтруктураЗаписи.Вставить("ТекстОшибки",         ТД.ТекстОшибки);
	СтруктураЗаписи.Вставить("metod",               ТД.metod);
	
	Ответ = эвСберСпасибоСервер.ОбработатьЭлементОчереди(СтруктураЗаписи);
	
	МЗ = РегистрыСведений.эвОчередьЗапросов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, СтруктураЗаписи);

	МЗ.http_status = Ответ.http_status;
	МЗ.ТекстОшибки = Ответ.ТекстОшибки;

	МЗ.ДатаЗапроса = ТекущаяДатаСеанса();
	МЗ.send_limit  = МЗ.send_limit + 1;
	МЗ.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ОтправитьНаСервере(ТД);
КонецПроцедуры
