
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Вызывается во всех созданных формах при вызове метода Оповестить.
//
// Параметры:
//  Форма - УправляемаяФорма - оповещаемая форма,
//  ИмяСобытия - Строка - имя события,
//  Параметр - Произвольный - параметр сообщения. Могут быть переданы любые необходимые данные,
//  Источник - Произвольный - источник события.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если Форма.ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ОприходованиеЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПриходныйОрдер.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходныйОрдер.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.СписаниеЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ор_ИзготовлениеЛекарственныхФорм.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ИнвентаризацияЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.КомплектацияЗапасов.Форма.ФормаДокумента" Тогда
		
		Если (ИмяСобытия = "Запись_УведомлениеОПриемкеМДЛП"
			ИЛИ ИмяСобытия = "Запись_УведомлениеОбОтгрузкеМДЛП"
			ИЛИ ИмяСобытия = "Запись_УведомлениеОПовторномВводеВОборотМДЛП"
			ИЛИ ИмяСобытия = "Запись_УведомлениеОПеремещенииМДЛП"
			ИЛИ ИмяСобытия = "Запись_УведомлениеОВыбытииМДЛП"
			ИЛИ ИмяСобытия = "Запись_УведомлениеОПередачиНаУничтожениеМДЛП"
			ИЛИ ИмяСобытия = "Запись_ИнвентаризацияПотребительскихУпаковокМДЛП"
			ИЛИ ИмяСобытия = "Запись_УведомлениеОРозничнойПродажеМДЛП") Тогда
			
			Форма.СформироватьТекстУведомлениеМДЛПСервер();
			
		КонецЕсли;
		
		Если ИмяСобытия = "ИзменениеСостоянияМДЛП" Тогда
			Форма.СформироватьТекстУведомлениеМДЛПСервер();
		КонецЕсли;
		
		Если ИмяСобытия = "ВыполненОбменМДЛП" Тогда
			Форма.СформироватьТекстУведомлениеМДЛПСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Открывает форму создания нового документа поступления товаров на основании уведомления о приемке.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой вызывается команда создания документа. Для автоматической подстановки
//         создаваемого документа в поле "Основание", форма должна быть передана в качестве владельца открываемой формы;
//  Ссылка - ДокументСсылка.Уведомление - ссылка на уведомление о поступлении.
//
Процедура ОткрытьФормуСозданияДокументаВыбытияТоваровНаОсновании(Форма, Ссылка) Экспорт
	
	Если Форма.ИмяФормы = "Документ.УведомлениеОВыбытииМДЛП.Форма.ФормаДокумента" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Ссылка);
		Форма.ОжидаетсяЗаписьДокументаОсновния = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОформлениеДокументаОснованияЗавершение", Форма);
		ОткрытьФорму("Документ.СписаниеЗапасов.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		
	ИначеЕсли Форма.ИмяФормы = "Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.Форма.ФормаДокумента" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Ссылка);
		Форма.ОжидаетсяЗаписьДокументаОсновния = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОформлениеДокументаОснованияЗавершение", Форма);
		ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоДанныеМаркировкиМДЛП(ДанныеСоСканера) Экспорт
	
	Если Не ДанныеСоСканера.Свойство("Штрихкод") Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураМаркировки = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(ДанныеСоСканера.Штрихкод, Ложь);
	Если СтруктураМаркировки.Свойство("ГрупповаяУпаковка") Тогда
		Возврат Истина;
	ИначеЕсли СтруктураМаркировки.Свойство("МаркированныйТовар") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
