

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура эв_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
		ТекстОшибки = НСтр("ru = 'Не допускается коррекция датой, отличной от текущей'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Дата",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ)  Тогда
		
		СтруктураСостояниеКассовойСмены = РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);
		
		ОтчетОРозничныхПродажах = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
		
		Если НЕ ЗначениеЗаполнено(ОтчетОРозничныхПродажах) ИЛИ НЕ РозничныеПродажиСервер.СменаОткрыта(ОтчетОРозничныхПродажах, Дата, ТекстОшибки) Тогда
			ТекстОшибки = НСтр("ru = 'Кассовая смена не открыта'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "КассаККМ",, Отказ);
		КонецЕсли;
		
		#Удаление
		ТипОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПодключаемоеОборудование.ТипОборудования");
		Если ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
		#КонецУдаления
		#Вставка
		РеквизитыКассы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			КассаККМ, "ПодключаемоеОборудование.ТипОборудования, ИспользоватьБезПодключенияОборудования");
		Если РеквизитыКассы.ПодключаемоеОборудованиеТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ККТ
			И РеквизитыКассы.ИспользоватьБезПодключенияОборудования <> Истина Тогда
		#КонецВставки
			ТекстОшибки = НСтр("ru = 'Коррекция допускается только при использовании ККТ'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "КассаККМ",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Оплата.Итог("Сумма") <> ПозицииЧека.Итог("СуммаСоСкидками") Тогда
		ТекстОшибки = НСтр("ru = 'Сумма оплат не совпадает с итоговой суммой по позициям чека'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Оплата",, Отказ);
	КонецЕсли;
	
	Если РасчетВИнтернете Тогда
		
		ОтборНаличные = Новый Структура("ТипОплаты", Перечисления.ТипыОплатыККТ.Наличные);
		Если Оплата.НайтиСтроки(ОтборНаличные).Количество() > 0 Тогда
			ТекстОшибки = НСтр("ru = 'При расчете в интернете недопустимо указание наличных видов оплат'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Оплата",, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПокупательEmail) И Не ЗначениеЗаполнено(ПокупательНомер) Тогда
			ТекстОшибки = НСтр("ru = 'При расчете в интернете необходимо указание телефона или адреса электронной почты покупателя.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ПокупательEmail",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
