
#Область СлужебныеПроцедурыИФункции

// Обработчик вызывается перед началом всех остальных действий в систме.
//
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	Если СтрНайти(ПараметрЗапуска, "СформироватьИдентификаторКонфигурации") > 0 Тогда
		
		ЗавершитьРаботу = СтрНайти(ПараметрЗапуска, "СформироватьИдентификаторКонфигурацииИЗакрыть") > 0;
		СохранитьИдентификаторКонфигурацииВКаталогБазы(ЗавершитьРаботу);
		
	КонецЕсли;
	
КонецПроцедуры

// Клиентская точка входа в алгоритм сохранения идентификатора конфигурации.
//
// Параметры:
//  ЗавершитьРаботу	 - Булево - Признак необходимости завершения работы приложения.
//
Процедура СохранитьИдентификаторКонфигурацииВКаталогБазы(ЗавершитьРаботу)
	
	ЭтоФайловаяБаза = СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=") = 1;
	Если Не ЭтоФайловаяБаза Тогда
		Возврат;
	КонецЕсли;
	
	КаталогРасположенияИБ = Сред(
		СтрокаСоединенияИнформационнойБазы(),
		7,
		СтрДлина(СтрокаСоединенияИнформационнойБазы()) - 8);
	
	ор_ПакетныйРежимЗапускаВызовСервера.СохранитьИдентификаторКонфигурацииВКаталогБазы(ЗавершитьРаботу, КаталогРасположенияИБ);
	
	Если ЗавершитьРаботу Тогда
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 