
#Область ПрограммныйИнтерфейс

#Область CDNПлощадки

// Переопределяет запуск обновления CDN-площадок на форме документов библиотеки МДЛП или документов имеющих структуру подобную документам библиотеки МДЛП.
// (см. процедуру СобытияФормРазрешительныйРежимМДЛПКлиент.ОбновитьСписокCDNПлощадокНаФорме).
//
Процедура ОбновитьСписокCDNПлощадокНаФорме(Форма, ОповещениеОЗавершении, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти // CDNПлощадки

#Область ПроверкаКодаМаркировки

// Переопределяет запуск выполнения проверки КМ на форме документов библиотеки МДЛП или документов имеющих структуру подобную документам библиотеки МДЛП.
// (см. процедуру СобытияФормРазрешительныйРежимМДЛПКлиент.НачатьПроверкуКМНаФорме).
// Для выполнения проверки КМ на форме объектов не имеющих структуру подобную документам библиотеки МДЛП необходимо использовать процедуру
// РазрешительныйРежимМДЛПКлиент.НачатьПроверкуКМ
//
Процедура НачатьПроверкуКМНаФорме(Форма, ДанныеШтрихкодовПоТипам, ОповещениеОЗавершении, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти // ПроверкаКодаМаркировки

#КонецОбласти
