
#Область СлужебныеПроцедурыИФункции

// см. ОбновлениеИнформационнойБазыРТ.ПриДобавленииПодсистемы
// 
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "РозницаАптека";
	Описание.ИдентификаторИнтернетПоддержки = "RetPharm";
	Описание.Вставить("ИдентификаторПродукта", "37d998bbf03b417d83035b9b0dbaa435");
	
КонецПроцедуры

// см. ОбновлениеИнформационнойБазыРТ.ПриДобавленииОбработчиковОбновления
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.4.106";
	Обработчик.Процедура = "ор_ОбновлениеИнформационнойБазы.ОбновитьПараметрыОтправкиСтатистики";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.1.255";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЗаполнитьПредопределенные";
	
	// +ор интеграция МДЛП
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.0";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ор_ИнтеграцияМДЛП.ЗаполнитьКонтрольСтатусовКИЗПриПробитииЧерезРМК";
	// +ор интеграция МДЛП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.132";
	Обработчик.Процедура = "ор_ОбновлениеИнформационнойБазы.УдалитьКомандуАкционныеПредложенияВГорячихКлавишах";
	
	// +ор интеграция МДЛП
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.161";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ор_ИнтеграцияМДЛП.ЗаполнитьДатуНачалаРазрешительногоРежима";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.170";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ор_ИнтеграцияМДЛП.РазрешительныйРежимМиграцияНастроекМДЛП";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.115";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ор_ИнтеграцияМДЛП.ЗаполнитьДатуНачалаЛокальногоРазрешительногоРежима";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.115";
	Обработчик.Процедура = "ор_ИнтеграцияМДЛП.КопированиеНастроекЛокальныхМодулейИзПодсистемыИСМП";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.13.239";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ор_ИнтеграцияМДЛП.ЗаполнитьДатуНачалаДействияТСПИоТ";
	// +ор интеграция МДЛП
	
КонецПроцедуры

// Процедура - Обновить параметры отправки статистики
//
Процедура ОбновитьПараметрыОтправкиСтатистики() Экспорт
	
	// 1. Получение текущих настроек.
	ПараметрыЦентраМониторинга = ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторинга();
	
	// 2. Определение необходимости обновления.
	Если Не (ПараметрыЦентраМониторинга.ВключитьЦентрМониторинга = Истина
			И ПараметрыЦентраМониторинга.ЦентрОбработкиИнформацииОПрограмме = Ложь
			И ПараметрыЦентраМониторинга.Сервер <> "stat.rarus.ru") Тогда 
		// Либо режим не отправка вендору, либо адрес сервера уже обновлен.
		Возврат;
	КонецЕсли;
	
	// 3. Очищаем содержимое регистра "ПакетыДляОтправки" т.к. отправка будет осуществляться на другой сервер.
	РегистрыСведений.ПакетыДляОтправки.Очистить();
	
	// 4. При необходимости (определяется разработчиком) можно очистить остальные регистры подсистемы.
	
	// 5. Установка новых параметров подсистемы.
	ТекДата = ТекущаяУниверсальнаяДата();
	
	ПараметрыЦентраМониторинга = ЦентрМониторингаСлужебный.ПолучитьПараметрыПоУмолчаниюВнешнийВызов(); // Уже содержит новый адрес сервера.
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ПараметрыЦентраМониторинга.БизнесСтатистикаПериодФормирования = 3600;
	КонецЕсли;
	
	ПараметрыЦентраМониторинга.РегистрацияДамповСледующееФормирование = ТекДата + ПараметрыЦентраМониторинга.РегистрацияДамповПериодФормирования;
	ПараметрыЦентраМониторинга.БизнесСтатистикаСледующееФормирование = ТекДата + ПараметрыЦентраМониторинга.БизнесСтатистикаПериодФормирования;
	ПараметрыЦентраМониторинга.СтатистикаКонфигурацииСледующееФормирование = ТекДата + ПараметрыЦентраМониторинга.СтатистикаКонфигурацииПериодФормирования;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	ДельтаОтправки = ГСЧ.СлучайноеЧисло(0, 86400);
	ПараметрыЦентраМониторинга.ОтправкаДанныхСледующееФормирование = ТекДата + ДельтаОтправки;
	
	ПараметрыЦентраМониторинга.ПериодАгрегацииМалый = 600;
	ПараметрыЦентраМониторинга.ПериодАгрегации = 3600;
	ПараметрыЦентраМониторинга.ПериодУдаления = 86400;
	
	ПараметрыЦентраМониторинга.ВключитьЦентрМониторинга = Истина;
	
	ЦентрМониторингаСлужебный.УстановитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
	
	// 6. Регистрация ИБ на новом сервере.
	// Только для БСП 3.*, т.к. в более ранних отсутствует метод "ОтправитьТестовыйПакет".
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	ПараметрыПроцедуры = Новый Структура("Итератор, ОтправкаТестовогоПакета, ПолучениеИдентификатора", 0, Ложь, Истина);
	ЦентрМониторингаСлужебный.ОтправитьТестовыйПакет(ПараметрыПроцедуры, АдресРезультата);
	
	// 7. Создание и настрока регламентного задания, отвечающего за сбор и отправку статистики.
	СтароеРегЗадание = ЦентрМониторингаСлужебный.ПолучитьРегламентноеЗаданиеВнешнийВызов("СборИОтправкаСтатистики", Ложь);
	Если СтароеРегЗадание = Неопределено Тогда 
		// Регл. задание еще не создавалось. Создаем новое.
		РегЗадание = ЦентрМониторингаСлужебный.ПолучитьРегламентноеЗаданиеВнешнийВызов("СборИОтправкаСтатистики", Истина);
		ЦентрМониторингаСлужебный.УстановитьРасписаниеПоУмолчаниюВнешнийВызов(РегЗадание);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьКомандуАкционныеПредложенияВГорячихКлавишах() Экспорт
	
	ИмяКнопки = "КомандаАкционныеПредложенияАкселераторы";
	
	ЗапросНастроекРМК = Новый Запрос;
	ЗапросНастроекРМК.Текст = 
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ГорячиеКлавиши КАК НастройкиРабочегоМестаКассираГорячиеКлавиши
	|ГДЕ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.ИмяКнопки = &ИмяКнопки";
	ЗапросНастроекРМК.УстановитьПараметр("ИмяКнопки", ИмяКнопки);
	
	ВыборкаНастроекРМК = ЗапросНастроекРМК.Выполнить().Выбрать();
	Пока ВыборкаНастроекРМК.Следующий() Цикл
		НастройкаРМКОбъект = ВыборкаНастроекРМК.НастройкаРМК.ПолучитьОбъект();
		СтрокаСтаройКнопки = НастройкаРМКОбъект.ГорячиеКлавиши.Найти(ИмяКнопки, "ИмяКнопки");
		НастройкаРМКОбъект.ГорячиеКлавиши.Удалить(СтрокаСтаройКнопки);
		НастройкаРМКОбъект.ОбменДанными.Загрузка = Истина;
		НастройкаРМКОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти