#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает адрес технической поддержки для отправки сообщения
//
// Возвращаемое значение:
//   Структура
//
Функция АдресТехподдержки() Экспорт
	
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("Адрес", "retail@rarus.ru");
	СтруктураАдреса.Вставить("Представление", СтрШаблон(НСтр("ru='Служба поддержки %1'"), Метаданные.КраткаяИнформация));
	Кому = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураАдреса);
	Возврат Кому;
	
КонецФункции

#КонецОбласти

#КонецЕсли