#Область СлужебныеПроцедурыИФункции

// Сохраняет идентификатор базы в файл cid в каталоге информационной базы.
//  Работает только в файловом режиме.
//
// Параметры:
//  ЗавершитьРаботу	 - Булево	 - Признак необходимости закрытия программы после,
//  	возврата управления на клиент
//  Каталог			 - Строка	 - Каталог, в который будет выполнено сохраниение.
//
Процедура СохранитьИдентификаторКонфигурацииВКаталогБазы(ЗавершитьРаботу, Каталог) Экспорт

	Файл = Каталог + ПолучитьРазделительПути() + "cid";
	ДвоичныеДанные = 
		ПолучитьДвоичныеДанныеИзСтроки(
			ПолучитьИдентификаторКонфигурации());
			
	ДвоичныеДанные.Записать(Файл);
	
КонецПроцедуры

#КонецОбласти