
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерУпаковки") <> НомерУпаковки Тогда
		КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НомерУпаковки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомерУпаковки = "";
	КлючУпаковки = "";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(КлючУпаковки) Тогда
		ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru='Ключ упаковки не заполнен.'"),
					ЭтотОбъект,
					"КлючУпаковки",
					"Объект",
					Отказ);
		Возврат;
	КонецЕсли;
	
	вКлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НомерУпаковки);
	Если КлючУпаковки <> вКлючУпаковки Тогда
		ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru='Ключ упаковки некорректный.'"),
					ЭтотОбъект,
					"КлючУпаковки",
					"Объект",
					Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ор_МДЛПУпаковкиМаркируемыхТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК ор_МДЛПУпаковкиМаркируемыхТоваров
	|ГДЕ
	|	ор_МДЛПУпаковкиМаркируемыхТоваров.НомерУпаковки = &НомерУпаковки
	|	И ор_МДЛПУпаковкиМаркируемыхТоваров.КлючУпаковки = &КлючУпаковки
	|	И ор_МДЛПУпаковкиМаркируемыхТоваров.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("НомерУпаковки", НомерУпаковки);
	Запрос.УстановитьПараметр("КлючУпаковки", КлючУпаковки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru='Упаковка маркируемого товара с таким номером упаковки уже существует.'"),
					ЭтотОбъект,
					"НомерУпаковки",
					"Объект",
					Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли