
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ИмяСправочника   = Параметры.ИмяСправочника;
	Заголовок        = Метаданные.Справочники[ИмяСправочника].Синоним;
	ПолеУникальности = "Наименование";
	
	Если Параметры.Свойство("Дерево") Тогда
		
		Дерево = ОбщегоНазначения.ЗначениеИзСтрокиXML(Параметры.Дерево);
		ФормаНезависима = Истина;
		
	// Данные были получены с сайта в виде таблицы, ее нужно переформировать в дерево.
	ИначеЕсли Параметры.Свойство("Адрес") Тогда 
		
		ТаблицаСправочник = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		Дерево = Новый ДеревоЗначений;
		ТипСтрока =  Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150));
		Для Каждого Колонка Из ТаблицаСправочник.Колонки Цикл
			Дерево.Колонки.Добавить(Колонка.Имя,ТипСтрока,Колонка.Заголовок,Колонка.Ширина);
		КонецЦикла;
		ЗаполнитьДеревоРекурсия(Дерево,ТаблицаСправочник);
		Дерево.Колонки.Удалить(Дерево.Колонки.Найти("ИдентификаторРодителя"));
		Дерево.Колонки.Удалить(Дерево.Колонки.Найти("ИдентификаторЭлемента"));
		
	ИначеЕсли ИмяСправочника = "ор_ЛекарственныеФормы" И Параметры.Свойство("Файлы") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоЛекарственныхФорм(
			"Файлы",
			Параметры.Файлы.ФайлДанныхБазовые,
			Параметры.Файлы.ФайлДанных);
	ИначеЕсли ИмяСправочника = "ор_ЛекарственныеФормы" И Параметры.Свойство("API") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоЛекарственныхФорм("API");
		
	ИначеЕсли ИмяСправочника = "ор_КлассификаторАТХ" И Параметры.Свойство("Файлы") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоКлассификаторовATX(
			"Файлы",
			Параметры.Файлы.ФайлДанных);
	ИначеЕсли ИмяСправочника = "ор_КлассификаторАТХ" И Параметры.Свойство("API") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоКлассификаторовATX("API");
		
	ИначеЕсли ИмяСправочника = "ор_ДВЛП" И Параметры.Свойство("Файлы") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоДВЛП(
			"Файлы",
			Параметры.Файлы.ФайлДанных);
	ИначеЕсли ИмяСправочника = "ор_ДВЛП" И Параметры.Свойство("API") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоДВЛП("API");
		
	ИначеЕсли ИмяСправочника = "ор_СМНН" И Параметры.Свойство("Файлы") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоСМНН(
			"Файлы",
			Параметры.Файлы.ФайлДанных);
	ИначеЕсли ИмяСправочника = "ор_СМНН" И Параметры.Свойство("API") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоСМНН("API");
		
	ИначеЕсли ИмяСправочника = "ор_ФТГ" И Параметры.Свойство("Файлы") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоФТГ(
			"Файлы",
			Параметры.Файлы.ФайлДанных);
	ИначеЕсли ИмяСправочника = "ор_ФТГ" И Параметры.Свойство("API") Тогда
		Дерево = ор_РаботаСКлассификаторами.СформироватьДеревоФТГ("API");
	Иначе
		ДеревоКлассификатора = ор_РаботаСКлассификаторамиПовтИсп.ПолучитьДанныеКлассификатора(ИмяСправочника);
		ФормаНезависима = Ложь;
		Дерево = ДеревоКлассификатора.Скопировать();
	КонецЕсли;
	
	Если Дерево = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Дерево.Колонки.Добавить("Выбран"    , Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(1,0)));
	Дерево.Колонки.Добавить("Существует", Новый ОписаниеТипов("Булево"));
	
	Если Дерево.Колонки.Найти("Страна") <> Неопределено Тогда 
		Дерево.Колонки.Удалить(Дерево.Колонки.Найти("Страна")); 
	КонецЕсли;
	
	КлассификаторЭлементФормы = "ДанныеКлассификатора";
	МассивДобавляемыхРеквизитов = Новый Массив;
	Для Каждого Колонка Из Дерево.Колонки Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(
			Колонка.Имя,
			Колонка.ТипЗначения,
			КлассификаторЭлементФормы,
			Колонка.Заголовок));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	МассивДобавляемыхРеквизитов.Удалить(МассивДобавляемыхРеквизитов.ВГраница());
	
	ГруппаПолей = Элементы.Добавить(КлассификаторЭлементФормы + "Группа", Тип("ГруппаФормы"), Элементы[КлассификаторЭлементФормы]);
	ГруппаПолей.Группировка = ГруппировкаКолонок.ВЯчейке;
	
	ИмяРеквизитаГруппыПолей = ?(Метаданные.Справочники[ИмяСправочника].ДлинаКода > 0, "Код", "Наименование");
	Для Каждого РеквизитКлассификатора Из МассивДобавляемыхРеквизитов Цикл
		Если РеквизитКлассификатора.Имя = ИмяРеквизитаГруппыПолей ИЛИ РеквизитКлассификатора.Имя = "Выбран" Тогда
			НовыйЭлемент = Элементы.Добавить(РеквизитКлассификатора.Имя, Тип("ПолеФормы"), ГруппаПолей);
		Иначе
			НовыйЭлемент = Элементы.Добавить(РеквизитКлассификатора.Имя, Тип("ПолеФормы"), Элементы[КлассификаторЭлементФормы]);
		КонецЕсли;
		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = КлассификаторЭлементФормы + "." + РеквизитКлассификатора.Имя;
	КонецЦикла;
	
	ЭлементыФормыФлажокВыбран = Элементы.Найти("Выбран");
	ЭлементыФормыФлажокВыбран.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементыФормыФлажокВыбран.ТриСостояния = Истина;
	ЭлементыФормыФлажокВыбран.УстановитьДействие("ПриИзменении", "Подключаемый_ДанныеКлассификатораВыбранПриИзменении");
	
	СоответствиеПолеУникальности = Новый Соответствие;
	
	Если ИмяСправочника = "ор_КлассификаторАТХ" Тогда
		ПолеУникальности = "КодРаздела";
	ИначеЕсли ИмяСправочника = "ор_СМНН" Тогда
		ПолеУникальности = "КодЕСКЛП";
	ИначеЕсли ИмяСправочника = "ор_ФТГ" Тогда
		ПолеУникальности = "НаименованиеПолное";
	Иначе
		ПолеУникальности = "Наименование";
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ Классификатор." + ПолеУникальности + ", Классификатор.Ссылка ИЗ Справочник.%1 КАК Классификатор";
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ИмяСправочника);
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СоответствиеПолеУникальности.Вставить(ТРег(СокрЛП(Выборка[ПолеУникальности])), Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	СоответствиеПоПолюУникальности = Новый ФиксированноеСоответствие(СоответствиеПолеУникальности);
	
	ОбработатьДеревоСервер(Дерево.Строки, ПолеУникальности);
	
	ЗначениеВРеквизитФормы(Дерево, КлассификаторЭлементФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ДанныеКлассификатораВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКлассификатора.ТекущиеДанные;
	
	Если ТекущиеДанные.Выбран = 2 Тогда
		ТекущиеДанные.Выбран = 0;
	КонецЕсли;
	
	ОбходДереваВверх(ТекущиеДанные);
	ОбходДереваВниз(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОбработкаПодбораВыполнена = Истина;
	РезультатПодбора = ОбработатьРезультатыПодбораНаСервере(ОбработкаПодбораВыполнена);
	
	Если ОбработкаПодбораВыполнена И ФормаНезависима Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Добавлено: (%1) Обновлено: (%2)'"),
			РезультатПодбора.КоличествоНовыхЭлементов,
			РезультатПодбора.КоличествоОбновленныхЭлементов);
		
		ТекстЗаголовка = НСтр("ru='Изменения:'");
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
		Оповестить("Запись_КлассификаторОбновлен");
		Закрыть();
	ИначеЕсли ОбработкаПодбораВыполнена Тогда
		Закрыть(РезультатПодбора);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьВсемЗначениеФлага(1);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	УстановитьВсемЗначениеФлага(0);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьДеревоСервер(Строки,ПолеУникальности)
	
	Для Каждого Строка Из Строки Цикл
		
		Если СоответствиеПоПолюУникальности.Получить(ТРег(СокрЛП(Строка[ПолеУникальности]))) <> Неопределено Тогда
			Строка.Существует = Истина;
			Строка.Выбран = 1;
		КонецЕсли;
		
		Если Строка.Строки.Количество() <> 0 Тогда
			ОбработатьДеревоСервер(Строка.Строки,ПолеУникальности);
		КонецЕсли;
		
		Если Строка.Родитель <> Неопределено Тогда
			Если Строка.Родитель.Выбран = 1 Тогда
				Если Строка.Родитель.Строки.НайтиСтроки(Новый Структура("Выбран", 1)).Количество() <> Строка.Родитель.Строки.Количество() Тогда
					Строка.Родитель.Выбран = 2;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Строка.Выбран = 1 Тогда
			Если Строка.Строки.НайтиСтроки(Новый Структура("Выбран", 1)).Количество() <> Строка.Строки.Количество() Тогда
				Строка.Родитель.Выбран = 2;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДеревоРекурсия(Уровень,Таблица)
	Родитель = ?(ТипЗнч(Уровень) = Тип("ДеревоЗначений"), "", Уровень.ИдентификаторЭлемента);
	СтрокиРодителя = Таблица.НайтиСтроки(Новый Структура("ИдентификаторРодителя", Родитель));
	Если СтрокиРодителя.Количество() Тогда
		Для Каждого Строка Из СтрокиРодителя Цикл
			ВложенныйУровень = Уровень.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ВложенныйУровень, Строка);
			ЗаполнитьДеревоРекурсия(ВложенныйУровень, Таблица);
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		НовоеУсловноеОформление.Отбор,
		"ДанныеКлассификатора.Существует",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.ДанныеКлассификатора.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление,
		"ЦветТекста",
		ЦветаСтиля.НедоступныеДанныеЦвет);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ГруппаИ");
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		ГруппаОтбора,
		"ДанныеКлассификатора.Выбран",
		1,
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		ГруппаОтбора,
		"ДанныеКлассификатора.Существует",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.ДанныеКлассификатора.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "ГруппаИ");
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		ГруппаОтбора,
		"ДанныеКлассификатора.Выбран",
		0,
		ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
		ГруппаОтбора,
		"ДанныеКлассификатора.Существует",
		Истина,
		ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, Элементы.ДанныеКлассификатора.Имя);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление,
		"ЦветТекста",
		ЦветаСтиля.ЦветФонаВыделенияПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбходДереваВверх(ТекущиеДанные)
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель <> Неопределено Тогда
		
		ДочерниеСтроки = Родитель.ПолучитьЭлементы();
		КоличествоВыбранных = 0;
		ОбщееКоличество = 0;
		Для Каждого Элемент Из ДочерниеСтроки Цикл
			Если Элемент.Выбран = 2 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 0.5;
			ИначеЕсли Элемент.Выбран = 1 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 1;
			КонецЕсли;
			ОбщееКоличество = ОбщееКоличество + 1;
		КонецЦикла;
		
		Если ОбщееКоличество = КоличествоВыбранных Тогда
			Родитель.Выбран = 1;
		ИначеЕсли КоличествоВыбранных = 0 Тогда
			Родитель.Выбран = 0;
		Иначе
			Родитель.Выбран = 2;
		КонецЕсли;
		
		ОбходДереваВверх(Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбходДереваВниз(ТекущиеДанные)
	
	ДочерниеСтроки = ТекущиеДанные.ПолучитьЭлементы();
	Для Каждого Элемент Из ДочерниеСтроки Цикл
		Элемент.Выбран = ТекущиеДанные.Выбран;
		ОбходДереваВниз(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьРезультатыПодбораНаСервере(ОбработкаПодбораВыполнена)
	
	Дерево = РеквизитФормыВЗначение("ДанныеКлассификатора");
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	Для Каждого ТекущаяКолонка Из Дерево.Колонки Цикл
		Если ТекущаяКолонка.Имя = "Выбран" Или ТекущаяКолонка.Имя = "Существует" Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаЗначений.Колонки.Добавить(ТекущаяКолонка.Имя, ТекущаяКолонка.ТипЗначения);
	КонецЦикла;
	
	МассивВыбранныхСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("Выбран", 2), Истина);
	Для Каждого ВыбраннаяСтрока Из МассивВыбранныхСтрок Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), ВыбраннаяСтрока);
	КонецЦикла;
	
	МассивВыбранныхСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("Выбран", 1), Истина);
	Для Каждого ВыбраннаяСтрока Из МассивВыбранныхСтрок Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), ВыбраннаяСтрока);
	КонецЦикла;
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ТаблицаЗначений"      , ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ОбновлятьСуществующие", ОбновлятьСуществующие);
	ПараметрыПолучения.Вставить("Дерево"               , Дерево);
	
	Результат = Справочники[ИмяСправочника].СоздатьЭлементКлассификатора(ПараметрыПолучения);
	
	РезультатПодбора = Новый Структура;
	РезультатПодбора.Вставить("КоличествоНовыхЭлементов"      , Результат.КоличествоНовыхЭлементов);
	РезультатПодбора.Вставить("КоличествоОбновленныхЭлементов", Результат.КоличествоОбновленныхЭлементов);
	РезультатПодбора.Вставить("НовыеЭлементы"                 , Результат.МассивНовыхЭлементов);
	
	Возврат РезультатПодбора;
	
КонецФункции

&НаСервере
Процедура УстановитьВсемЗначениеФлага(ЗначениеФлага)
	ЗначениеДанныеКлассификатора = РеквизитФормыВЗначение("ДанныеКлассификатора");
	УстановитьФлагВсем(ЗначениеДанныеКлассификатора.Строки, ЗначениеФлага);
	ЗначениеВРеквизитФормы(ЗначениеДанныеКлассификатора, "ДанныеКлассификатора");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьФлагВсем(Строки, ЗначениеФлага)
	Для Каждого Строка Из Строки Цикл
		Если Не Строка.Существует Тогда
			Строка.Выбран = ЗначениеФлага;
		КонецЕсли;
		УстановитьФлагВсем(Строка.Строки, ЗначениеФлага);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти




