
#Область Переменные

&НаКлиенте
Перем ЭтоСопоставлениеПослеЗагрузки;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью(Истина,Ложь);
	ИнициализироватьТаблицуЗагрузки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Подготовим диалог к открытию
	Фильтр 											= "Номенклатура в сегменте(*.csv)|*.csv";
	ДиалогВыбораФайла 								= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок 					= "Выберите файл";
	ДиалогВыбораФайла.Фильтр = Фильтр;
	ДиалогВыбораФайла.МножественныйВыбор 			= Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла 	= Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДанных;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ЗавершениеПомещениеФайла", ЭтотОбъект, Новый Структура("ЧитатьФайл",Ложь));
	НачатьПомещениеФайлов(ОповещениеЗавершения,,ДиалогВыбораФайла,Истина,Этаформа.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	Если РежимРаботы = 0 Тогда
		Элементы.ФайлДанных.Видимость = Истина;
	Иначе
		Элементы.ФайлДанных.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМагазиновПриИзменении(Элемент)
	
	МассивЗначений = СвернутьСписокЗначений(СписокМагазинов);
	СписокМагазинов.ЗагрузитьЗначения(МассивЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаСопоставления.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Получим параметры текущей номенклатуры.
	СтруктураПараметров              = ОбработатьИзмененияНоменклатурыТаблицыСопоставления(ТекСтрока.Номенклатура);
	ТекСтрока.КодРосздравнадзора     = СтруктураПараметров.КодРосздравнадзора;
	ТекСтрока.ЕдиницаИзмерения       = СтруктураПараметров.ЕдиницаИзмерения;
	ТекСтрока.Производитель          = СтруктураПараметров.Производитель;
	ТекСтрока.Пометка                = Истина;
	ТекСтрока.ПодсветитьНеУникальные = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыгрузкиНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	// Проверим на соответствие характеристики владельцу
	Если Не ТекСтрока.Характеристика.Пустая() Тогда   
		ВладелецХарактеристики = ПолучитьВладельцаХарактеристики(ТекСтрока.Характеристика);
		Если (ВладелецХарактеристики <> ТекСтрока.Номенклатура)
			И (ВладелецХарактеристики <> ПолучитьКатегориюНоменклатуры(ТекСтрока.Номенклатура)) Тогда
			ТекСтрока.Характеристика = ПолучитьПустуюХарактеристику();
		КонецЕсли;
	КонецЕсли; 
	
	// Очистим, если это услуга.
	Если НоменклатураЯвляетсяУслугой(ТекСтрока.Номенклатура) Тогда
		СтрокаСообщения = НСтр("ru = 'Нельзя выбирать номенклатуру с видом ""Услуга""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);

		ТекСтрока.Номенклатура = ПолучитьПустуюНоменклатуру();
	КонецЕсли;
	
	// Очистим цены, если номенклатура не заполнена
	Если ТекСтрока.Номенклатура = ПолучитьПустуюНоменклатуру() Тогда
		ТекСтрока.ЦенаПроизводителя = 0;
		ТекСтрока.ЦенаЗакупочная 	= 0;
		ТекСтрока.ЦенаРозничная 	= 0;
	Иначе
		// Спросим о пересчете цен
		ПодготовитьДанныеДляПересчета(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыгрузкиХарактеристикаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Спросим о пересчете цен
	ПодготовитьДанныеДляПересчета(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыгрузкиДокументПоступленияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДокументПоступления) Тогда
		ТекСтрока.Поставщик = ПолучитьКонтрагентаНаСервере(ТекСтрока.ДокументПоступления);
	КонецЕсли;
	
	// Спросим о пересчете цен
	ПодготовитьДанныеДляПересчета(ТекСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ОчиститьСообщения();
	
	// Проверим корректность заполнения реквизитов
	Если НЕ ПроверитьКорректностьЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	// начало работы
	Если Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.Начало Тогда
		
		Если РежимРаботы = 0 Тогда
			
			Если ПустаяСтрока(ФайлДанных) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан файл для загрузки!'"));
				Возврат;
			КонецЕсли;
			
			Рез = ЗагрузитьДанныеИзФайла(ФайлДанных);
			Если Не Рез Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		УправлениеВидимостью(Ложь, Ложь);
		Если РежимРаботы = 1 Тогда
			ОтработатьОчисткуСопоставления();
		КонецЕсли;
		
	// Загрузка данных.
	ИначеЕсли Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.ЗагрузкаДанных Тогда
		
		Переключиться = ОбработатьЗагрузку();
		Если Переключиться Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузкаДанныхЗавершение", ЭтотОбъект),
				НСтр("ru = 'Данные успешно загружены. Перейти к сопоставлению загруженных данных?'"),
				РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;
		
	// Сопоставление данных.
	ИначеЕсли Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.СопоставлениеДанных Тогда
		
		ОбработатьСопоставление();
		
	// Выгрузка данных.
	ИначеЕсли Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.ВыгрузкаДанных Тогда
		
		Если Не ПроверитьКоличествоВТаблицеВыгрузки() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет данных для выгрузки.'"));
			Возврат;
		КонецЕсли;
		
		Если СписокМагазинов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Не выбрано ни одной структурной единицы!'") ,, 
				"СписокМагазинов");
			Возврат;
		КонецЕсли;
		
		Если Не ПроверитьОстаткиЖНВЛП() Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыгрузкаОстатковВопросЗавершение", ЭтотОбъект),
				НСтр("ru = 'На остатках найдены ЖНВЛП товары не учавствующие в выгрузке. Продолжить выгрузку?'"),
				РежимДиалогаВопрос.ДаНет,,
				КодВозвратаДиалога.Нет);
			Возврат;
		КонецЕсли;
		
		ВыполнитьВыборФайлаДляВыгрузки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.Начало Тогда
		Возврат;
	Иначе 
		УправлениеВидимостью(Истина, Ложь);
    КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	// Подготовим диалог к открытию
	Фильтр 											= "Номенклатура в сегменте(*.csv)|*.csv";
	ДиалогВыбораФайла 								= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок 					= "Выберите файл";
	ДиалогВыбораФайла.Фильтр = Фильтр;
	ДиалогВыбораФайла.МножественныйВыбор 			= Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла 	= Ложь;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ЗавершениеПомещениеФайла", ЭтотОбъект, Новый Структура("ЧитатьФайл", Истина));
	НачатьПомещениеФайлов(ОповещениеЗавершения,,ДиалогВыбораФайла,Истина,Этаформа.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиЗагрузки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗагрузки Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиЗагрузки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗагрузки Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСопоставления Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСопоставления Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСопоставления(Команда)
	
	ПустаяТаблица = ТаблицаСопоставленияПустая();
	Если Не ПустаяТаблица Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуСопоставленияЗавершение", ЭтотОбъект),
			НСтр("ru = 'При выполнении операции все внесенные вручную изменения будут утеряны. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ЗаполнитьТаблицуСопоставленияНаФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьАвтоматически(Команда)
	
	НадоСпросить = Не ТаблицаСопоставленияПустая(Истина);
	Если НадоСпросить Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СопоставитьАвтоматическиЗавершение", ЭтотОбъект),
			НСтр("ru = 'Для отмеченных строк все существующие сопоставления будут очищены. Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		СопоставитьАвтоматическиПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьАвтоматическиПродолжение()
	
	НайденыНеУникальные = Ложь;
	МассивИндексов = Новый Массив;
	
	// Запустим автоматическое сопоставление
	СопоставитьАвтоматическиНаСервере(НайденыНеУникальные, МассивИндексов);
	
	Если НайденыНеУникальные Тогда
		ОчиститьСообщения();
		
		ТекстСообщения = НСтр("ru='При автоматическом сопоставлении данных найдены неуникальные товары.
							|Цветом выделены строки, требующие дополнительного переназначения данных!'");
		ПоказатьПредупреждение(,ТекстСообщения);
		
		СообщитьДублиНоменклатуры(МассивИндексов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	
	ОчиститьСообщения();
	
	Если СписокМагазинов.Количество() = 0 Тогда
		Текст = НСтр("ru = 'Не выбрано ни одной структурной единицы!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,, "СписокМагазинов");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузкаОстатковВопросЗавершение", ЭтотОбъект),
			НСтр("ru = 'Очистить текущую таблицу выгрузки?'"),
			РежимДиалогаВопрос.ДаНетОтмена,,
			КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткамиНаДату();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СопоставитьАвтоматическиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СопоставитьАвтоматическиПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСопоставленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуСопоставленияНаФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РежимРаботы = 1;
		УправлениеВидимостью(Ложь, Истина);
		ЗаполнитьТаблицуСопоставленияНаФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция получения цены закупки для выгрузки
//
Функция ПересчитатьЦенуЗакупки(Номенклатура, Характеристика, ДокументПоступления)
	
	ЦенаЗакупочная = 0;
	
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Номенклатура",   Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", Характеристика);
		
		МассивНайденныхСтрокДокумента = ДокументПоступления.Запасы.НайтиСтроки(СтруктураОтбора);
		Если МассивНайденныхСтрокДокумента.Количество() <> 0 Тогда
			ЦенаЗакупочная = МассивНайденныхСтрокДокумента[0].Цена;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЦенаЗакупочная;
	
КонецФункции

&НаСервере
// Функция получения цены производителя для выгрузки
//
Функция ПересчитатьЦенуПроизводителя(Номенклатура, Характеристика, ДокументПоступления)
	
	ЦенаПроизводителя = 0;
	
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Номенклатура",   Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", Характеристика);
		
		МассивНайденныхСтрокДокумента = ДокументПоступления.Запасы.НайтиСтроки(СтруктураОтбора);
		Если МассивНайденныхСтрокДокумента.Количество() <> 0 Тогда
			ЦенаПроизводителя = МассивНайденныхСтрокДокумента[0].ор_ЦенаПроизводителя;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЦенаПроизводителя;
	
КонецФункции

// Возвращает основную цену продажи для указанной номенклатуры и характеристики.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура по которой необходимо вычислить цену (обязательна к заполнению);
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - 
//                   характеристика, для которой необходимо вычислить цену (обязательна к заполнению);
// Возвращаемое значение:
// 	Произвольный, Число - Описание
//
&НаСервере
Функция ПересчитатьЦенуРозничную(Номенклатура, Характеристика, СтруктурнаяЕдиница)
	
	ВидЦен = СтруктурнаяЕдиница.РозничныйВидЦен;
	Если ВидЦен = Справочники.ВидыЦен.ПустаяСсылка() Тогда
		ВидЦен = Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК ОсновнаяЦенаПродажи
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			ВидЦен = &ВидЦен
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Актуальность) КАК ЦеныНоменклатурыСрезПоследних");
	
	Запрос.УстановитьПараметр("ВидЦен",         ВидЦен);
	Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Дата",           ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.ОсновнаяЦенаПродажи, 0);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы  = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
		ФайлДанных = ВыбранныйФайл;
	КонецЦикла;
	
	МассивДляВыгрузки = ОбработатьВыгрузку();
	
	Если МассивДляВыгрузки.Количество() <> 0 Тогда
		
		// Произведем запись в файл.
		Попытка
			ФайлВыгрузки = Новый ЗаписьТекста(ФайлДанных, "Windows-1251");
		Исключение
			ТекстСообщения = НСтр("ru = 'При открытии файла для записи данных произошла ошибка! Возможно файл уже открыт.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
		Для Каждого СтрокаДанных Из МассивДляВыгрузки Цикл
			ФайлВыгрузки.ЗаписатьСтроку(СтрокаДанных);
		КонецЦикла;
		
		ФайлВыгрузки.Закрыть();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данные записаны в файл.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаОстатковВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТаблицаВыгрузки.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткамиНаДату();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатковВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ВыполнитьВыборФайлаДляВыгрузки();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетЦенВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ТекСтрока = ДополнительныеПараметры.ТекСтрока;
		ТекСтрока.ЦенаЗакупочная 	= ПересчитатьЦенуЗакупки(ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.ДокументПоступления);
		ТекСтрока.ЦенаПроизводителя = ПересчитатьЦенуПроизводителя(ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.ДокументПоступления);
		
		Если СписокМагазинов.Количество() = 1 Тогда
			ТекСтрока.ЦенаРозничная = ПересчитатьЦенуРозничную(ТекСтрока.Номенклатура, ТекСтрока.Характеристика, СписокМагазинов[0].Значение);
		ИначеЕсли СписокМагазинов.Количество() > 1 Тогда
			ДополнительныеПараметры = Новый Структура("ТекСтрока", ТекСтрока);
			ОповещениеВыбораМагазина = Новый ОписаниеОповещения("ОповещениеВыбораМагазина", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("Обработка.ор_МониторингЦенРосздравнадзора.Форма.ФормаВыбораМагазина",
				Новый Структура("СтруктурныеЕдиницы", СписокМагазинов),
				ЭтотОбъект,,,,
				ОповещениеВыбораМагазина,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыбораМагазина(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекСтрока = ДополнительныеПараметры.ТекСтрока;
		ТекСтрока.ЦенаРозничная = ПересчитатьЦенуРозничную(ТекСтрока.Номенклатура, ТекСтрока.Характеристика, Результат)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПомещениеФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы  = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
		ФайлДанных = ПереданныйФайл.Имя;
		АдресХранилищаФайла = ПереданныйФайл.Хранение;
	КонецЦикла;
	
	Если ДополнительныеПараметры.ЧитатьФайл Тогда
		Рез = ЗагрузитьДанныеИзФайла(ФайлДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура управления видимостью элементов формы
//
Процедура УправлениеВидимостью(ЭтоНачалоРаботы = Истина, СопоставлениеПослеЗагрузки = Ложь)
	
	Элементы.Панель.ПодчиненныеЭлементы.Начало.Видимость 				= ЭтоНачалоРаботы;
	Элементы.Панель.ПодчиненныеЭлементы.ЗагрузкаДанных.Видимость 		= Не ЭтоНачалоРаботы И РежимРаботы = 0;
	Элементы.Панель.ПодчиненныеЭлементы.ВыгрузкаДанных.Видимость 		= Не ЭтоНачалоРаботы И РежимРаботы = 2;
	Элементы.Панель.ПодчиненныеЭлементы.СопоставлениеДанных.Видимость 	= Не ЭтоНачалоРаботы И РежимРаботы = 1;
	
	Если ЭтоНачалоРаботы Тогда
		Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.Начало;
	ИначеЕсли РежимРаботы = 0 Тогда
		Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.ЗагрузкаДанных;
	ИначеЕсли РежимРаботы = 1 Тогда
		Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.СопоставлениеДанных;
	Иначе 
		Элементы.Панель.ТекущаяСтраница = Элементы.Панель.ПодчиненныеЭлементы.ВыгрузкаДанных;
	КонецЕсли;
	
	Элементы.Назад.Видимость = Не ЭтоНачалоРаботы И Не СопоставлениеПослеЗагрузки;
	Элементы.Далее.Заголовок = ?(ЭтоНачалоРаботы, "Далее", "Выполнить");
	
	ТекстОсновногоЗаголовка = ?(ЭтоНачалоРаботы, "Первоначальные настройки", ?(РежимРаботы = 0, "Загрузка", ?(РежимРаботы = 1, "Сопоставление", "Выгрузка")) + " данных");
	Элементы.ДекорацияЗаголовок.Заголовок = ТекстОсновногоЗаголовка;

	Элементы.ДекорацияЗаголовокНиз.Видимость = Не ЭтоНачалоРаботы;
	Элементы.ДекорацияЗаголовокНиз.Заголовок = ?(ЭтоНачалоРаботы, "", "Прайс-лист """ + Объект.ПрайсЛист + """ контрагента """ + Объект.Контрагент+"""");

КонецПроцедуры

&НаСервере
// Процедура проверки корректности заполнения реквизитов мониторинга
//
Функция ПроверитьКорректностьЗаполнения()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПроверитьКорректностьЗаполнения();
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьВыборФайлаДляВыгрузки()
	
	ИмяСохраняемогоФайла = "";
	// Подготовим диалог к открытию.
	Фильтр = "Номенклатура в сегменте(*.csv)|*.csv";
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Заголовок = "Выберите файл";
	ДиалогВыбораФайла.Фильтр = Фильтр;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	// Осуществим выбор файла для сохранения.
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ЗавершениеВыбораФайла", ЭтотОбъект));

КонецПроцедуры

&НаСервере
// Процедура получения пустой таблицы загрузки
//
Процедура ИнициализироватьТаблицуЗагрузки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ТаблицаЗагрузкиОбъект = ОбработкаОбъект.ПолучитьПустуюТаблицуЗагрузки();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	Элемент = УсловноеОформление.Элементы.Добавить();
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСопоставления.ПодсветитьНеУникальные");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Новое = Элемент.Поля.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ТаблицаСопоставления");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветИнформацияОшибочна);
	
КонецПроцедуры

&НаСервере
// Процедуры загрузки данных из файла в таблицу на форме
//
Функция ЗагрузитьДанныеИзФайла(ИмяФайлаДляЗагрузки)
	
	ТекущаяТаблицаДанныхЗагрузки 	= РеквизитФормыВЗначение("ТаблицаЗагрузки");
	ОбработкаОбъект 				= РеквизитФормыВЗначение("Объект");
	ТаблицаЗагрузкиСФормы  			= РеквизитФормыВЗначение("ТаблицаЗагрузки");
	
	// Выполним чтение файла
	Рез = ОбработкаОбъект.ЗагрузитьДанныеМониторингаЦенВТаблицу(ИмяФайлаДляЗагрузки, ТаблицаЗагрузкиСФормы, АдресХранилищаФайла);
	
	// Если файл не прочитали успешно - надо вернуть на форму старую таблицу
	Если Не Рез Тогда
		ТаблицаЗагрузкиСФормы = ТекущаяТаблицаДанныхЗагрузки.Скопировать();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, 		"Объект");
	ЗначениеВРеквизитФормы(ТаблицаЗагрузкиСФормы, 	"ТаблицаЗагрузки");
	
	Возврат Рез;
	
КонецФункции

&НаСервере
// Серверная процедура обработки загрузки из таблицы в регистр сведений
//
Функция ОбработатьЗагрузку()
	
	ТаблицаЗагрузкиДанные 	= РеквизитФормыВЗначение("ТаблицаЗагрузки");
	ОбработкаОбъект 		= РеквизитФормыВЗначение("Объект");

	// Если таблица пустая, то грузить нечего
	Если ТаблицаЗагрузкиДанные.Количество() = 0 Или ТаблицаЗагрузкиДанные.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		ОбработкаОбъект.мСообщитьОбОшибке(НСтр("ru = 'Нет данных для загрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Непосредственно загрузка данных
	РезультатЗагрузки = ОбработкаОбъект.ЗагрузитьДанные(ТаблицаЗагрузкиДанные, ЗагружатьНоменклатуруСНулевойЦеной);
	Если Не РезультатЗагрузки Тогда
		ОтменитьТранзакцию();
		Возврат Истина;
	Иначе
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Проверка на заполненность таблицы сопоставления
//
Функция ТаблицаСопоставленияПустая(ПроверитьГалки = Ложь)
	
	Если Не ПроверитьГалки Тогда
		Возврат ТаблицаСопоставления.Количество() = 0;
	Иначе
		Возврат ТаблицаСопоставления.Количество() = 0 ИЛИ ТаблицаСопоставления.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура заполнения таблицы сопоставления по данным прайс-листа
//
Процедура ЗаполнитьТаблицуСопоставленияНаФорме()
	
	// Проверим заполнение контрагента и прайс-листа
	Если Не ПроверитьКорректностьЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	// Перезаполним таблицу
	ОбработкаОбъект 			= РеквизитФормыВЗначение("Объект");
	ТаблицаСопоставленияФормы 	= ОбработкаОбъект.ЗаполнитьТаблицуСопоставления().Скопировать();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, 			"Объект");
	ЗначениеВРеквизитФормы(ТаблицаСопоставленияФормы, 	"ТаблицаСопоставления");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Обработка изменения номенклатуры в таблице сопоставления
//
Функция ОбработатьИзмененияНоменклатурыТаблицыСопоставления(Номенклатура)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КодРосздравнадзора",	Номенклатура.ор_КодРосздравнадзора);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения",	Номенклатура.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("Производитель",		Номенклатура.ор_Производитель);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
// Процедура запуска автоматического сопоставления данных таблицы сопоставления
//
Процедура СопоставитьАвтоматическиНаСервере(НайденыНеУникальные,МассивИндексов)
	
	ТаблицаСопоставленияДанные 	= РеквизитФормыВЗначение("ТаблицаСопоставления");
	ОбработкаОбъект 			= РеквизитФормыВЗначение("Объект");
	
	// Проверим, отметили мы хоть что-то или нет.
	ЕстьДанныеДляСопоставления 	= ТаблицаСопоставленияДанные.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество()<>0;
	
	// Ничего не отметили, ничего запускать не надо.
	Если Не ЕстьДанныеДляСопоставления Тогда
		Возврат;
	КонецЕсли;
	
	// Выполним сопоставление в модуле обработки на сервере
	ОбработкаОбъект.ВыполнитьСопоставлениеДанных(ТаблицаСопоставленияДанные, НайденыНеУникальные, МассивИндексов);
	
	ЗначениеВРеквизитФормы(ТаблицаСопоставленияДанные, 	"ТаблицаСопоставления");
	ЗначениеВРеквизитФормы(ОбработкаОбъект, 			"Объект");
	
КонецПроцедуры

&НаКлиенте
// Процедура записи сопоставлений в регистр прайс-листов
//
Процедура ОбработатьСопоставление()
	
	ИндексыДублей = Новый Массив();
	ОбработатьСопоставлениеНаСервере(ИндексыДублей);
	
	Если ИндексыДублей.Количество() > 0 Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru='Операция отменена! При выполнении были найдены не уникальные товары с учётом записанных в базе. 
							|Цветом выделены строки, требующие дополнительного переназначения данных!'");
		ПоказатьПредупреждение(,ТекстСообщения);
		
		СообщитьДублиНоменклатуры(ИндексыДублей);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура записи сопоставлений в регистр прайс-листов
//
Процедура ОбработатьСопоставлениеНаСервере(ИндексыДублей)
	
	ТаблицаСопоставленияДанные 	= РеквизитФормыВЗначение("ТаблицаСопоставления");
	ОбработкаОбъект 			= РеквизитФормыВЗначение("Объект");

	// Проверим, есть ли что вносить в регистр.
	Если ТаблицаСопоставленияДанные.Количество() = 0 Или ТаблицаСопоставленияДанные.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		
		ОбработкаОбъект.мСообщитьОбОшибке("Нет данных для сопоставления.");
		Возврат;
		
	КонецЕсли;
	
	// Проверим, что сопоставления указаны для того прайс-листа, в который будем осуществлять запись.
	Если ТаблицаСопоставленияДанные[0].ПрайсЛист <> ОбработкаОбъект.ПрайсЛист Тогда
		
		ОбработкаОбъект.мСообщитьОбОшибке("Текущая таблица сопоставленных данных заполнена для прайс-листа """+ТаблицаСопоставленияДанные[0].ПрайсЛист+""" контрагента """+ТаблицаСопоставленияДанные[0].ПрайсЛист.Владелец+""". В текущий прайс лист """+ОбработкаОбъект.ПрайсЛист+""" внести данные нельзя!");
		Возврат;
		
	КонецЕсли;

	// Выполним запись сопоставлений в модуле обработки на сервере.
	Результат = ОбработкаОбъект.ЗаписатьСопоставления(ТаблицаСопоставленияДанные, ИндексыДублей);
	Если Результат Тогда
	 	ЗначениеВРеквизитФормы(ОбработкаОбъект, 			"Объект");
		ЗначениеВРеквизитФормы(ТаблицаСопоставленияДанные, 	"ТаблицаСопоставления");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтработатьОчисткуСопоставления()
	
	ТаблицаСопоставленияДанные = РеквизитФормыВЗначение("ТаблицаСопоставления");
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Проверим, есть ли что вносить в регистр
	Если ТаблицаСопоставленияДанные.Количество() = 0 Или ТаблицаСопоставленияДанные.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		ТаблицаСопоставленияДанные 	= ОбработкаОбъект.ЗаполнитьТаблицуСопоставления().Скопировать();
	
		ЗначениеВРеквизитФормы(ОбработкаОбъект, 			"Объект");
		ЗначениеВРеквизитФормы(ТаблицаСопоставленияДанные, 	"ТаблицаСопоставления");
		Возврат;
		
	КонецЕсли;
	
	// Проверим, что сопоставления указаны для того прайс-листа, в который будем осуществлять запись
	Если ТаблицаСопоставленияДанные[0].ПрайсЛист <> ОбработкаОбъект.ПрайсЛист Тогда
		
		ТаблицаСопоставленияДанные.Очистить();
		ТаблицаСопоставленияДанные 	= ОбработкаОбъект.ЗаполнитьТаблицуСопоставления().Скопировать();
	
		ЗначениеВРеквизитФормы(ОбработкаОбъект, 			"Объект");
		ЗначениеВРеквизитФормы(ТаблицаСопоставленияДанные, 	"ТаблицаСопоставления");
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура заполнения таблицы выгрузки закупками за период
//
Процедура ЗаполнитьОстаткамиНаДату()
	
	ТаблицаВыгрузкиДанные 	= РеквизитФормыВЗначение("ТаблицаВыгрузки");
	ОбработкаОбъект 		= РеквизитФормыВЗначение("Объект");
	
	// Произведем заполнение в модуле обработки на сервере
	ОбработкаОбъект.ЗаполнитьТаблицуВыгрузкиПоОстаткам(ТаблицаВыгрузкиДанные, Дата, СписокМагазинов);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, 		"Объект");
	ЗначениеВРеквизитФормы(ТаблицаВыгрузкиДанные, 	"ТаблицаВыгрузки");
	
КонецПроцедуры

&НаСервере
// Проверка возможности выгрузки данных
//
Функция ПроверитьКоличествоВТаблицеВыгрузки()
	
	ТаблицаВыгрузкиДанные = РеквизитФормыВЗначение("ТаблицаВыгрузки");
	Возврат ТаблицаВыгрузкиДанные.Количество() <> 0;
	
КонецФункции

&НаСервере
// Процедура выгрузки данных в файл
//
Функция ОбработатьВыгрузку()
	
	ТаблицаВыгрузкиДанные 	= РеквизитФормыВЗначение("ТаблицаВыгрузки");
	ОбработкаОбъект 		= РеквизитФормыВЗначение("Объект");
	
	// Выполним выгрузку на сервере
	МассивДляВыгрузки = ОбработкаОбъект.ВыгрузитьДанные(ТаблицаВыгрузкиДанные, Дата);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Возврат МассивДляВыгрузки;
	
КонецФункции

&НаСервереБезКонтекста
// Функция получения пустой характеристики номенклатуры
//
Функция ПолучитьПустуюХарактеристику()
	
	Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
КонецФункции

&НаСервереБезКонтекста
// Функция получения пустой номенклатуры
//
Функция ПолучитьПустуюНоменклатуру()
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

&НаСервереБезКонтекста
// Функция проверки того, что номенклатура является услугой
//
Функция НоменклатураЯвляетсяУслугой(Номенклатура)
	
	Возврат Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
	
КонецФункции

&НаСервереБезКонтекста
// Функция получения владельца характеристики
//
Функция ПолучитьВладельцаХарактеристики(Характеристика)
	
	Возврат Характеристика.Владелец;
	
КонецФункции

&НаСервереБезКонтекста
// Функция получения вида номенклатуры
//
Функция ПолучитьКатегориюНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.КатегорияНоменклатуры;
	
КонецФункции

&НаСервере
Функция ПроверитьОстаткиЖНВЛП()
	
	Если СписокМагазинов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Установим дату, если она не заполнена в шапке.
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТаблицаВыгрузкиДанные = РеквизитФормыВЗначение("ТаблицаВыгрузки");
	Если ТаблицаВыгрузкиДанные.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СписокСтруктурныхЕдиниц.Значение КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ втСтруктурныеЕдиницы
	|ИЗ
	|	&СписокСтруктурныхЕдиниц КАК СписокСтруктурныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.Ссылка В
	|			(ВЫБРАТЬ
	|				ТорговыеОбъекты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|			ИЗ
	|				втСтруктурныеЕдиницы КАК ТорговыеОбъекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТоварыИзТаблицы
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ТоварыНаСкладахОстатки.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	ТоварыНаСкладахОстатки.СтруктурнаяЕдиница.Представление КАК СкладПредставление,
	|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияПредставление
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&Дата,
	|			Номенклатура.ор_ЖНВЛС
	|				И СтруктурнаяЕдиница В
	|					(ВЫБРАТЬ
	|						ТаблицаСклады.Склад КАК СтруктурнаяЕдиница
	|					ИЗ
	|						ТаблицаСклады КАК ТаблицаСклады)) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзТаблицы КАК ТоварыИзТаблицы
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыИзТаблицы.Номенклатура
	|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыИзТаблицы.Характеристика
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|	И ТоварыИзТаблицы.Номенклатура ЕСТЬ NULL";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СписокСтруктурныхЕдиниц", СписокМагазинов);
	Запрос.УстановитьПараметр("Дата",                    Дата);
	Запрос.УстановитьПараметр("Таблица",                 ТаблицаВыгрузкиДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПредставлениеХарактеристики = ?(ЗначениеЗаполнено(Выборка.ХарактеристикаПредставление),"("+ Строка(Выборка.ХарактеристикаПредставление) +")", ""); 
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Товар %1%2 присутствует на складе %3 в количестве %4 %5'"),
										Выборка.НоменклатураПредставление,
										ПредставлениеХарактеристики,
										Выборка.СкладПредставление,
										Выборка.КоличествоОстаток,
										Выборка.ЕдиницаИзмеренияПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПодготовитьДанныеДляПересчета(ТекСтрока)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекСтрока", ТекСтрока);
	
	ОповещениеПересчетаЦен  = Новый ОписаниеОповещения("ПересчетЦенВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОповещениеПересчетаЦен,"Выполнить пересчет цен?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентаНаСервере(ДокументПоступления)
	 Возврат ДокументПоступления.Контрагент;
КонецФункции

&НаСервере
Функция СвернутьСписокЗначений(СписокМагазинов)
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	
	Для каждого ЭлементСписка ИЗ СписокМагазинов Цикл
		Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			НоваяСтрока = ТаблицаЗначений.Добавить();
			НоваяСтрока.СтруктурнаяЕдиница = ЭлементСписка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗначений.Свернуть("СтруктурнаяЕдиница");
	
	Возврат ТаблицаЗначений.ВыгрузитьКолонку("СтруктурнаяЕдиница");

КонецФункции

&НаКлиенте
Процедура СообщитьДублиНоменклатуры(ИндексыДублей)
	
	Для Каждого ДанныеДублей Из ИндексыДублей Цикл
		
		нТекстСообщения = СтрШаблон(НСтр("ru='Номенклатура %1 сопоставлена для нескольких товаров поставщика:'"), ДанныеДублей.Номенклатура); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(нТекстСообщения);
		
		Для Счетчик = 0 По ДанныеДублей.Индексы.ВГраница() Цикл
			Индекс = ДанныеДублей.Индексы[Счетчик];
			СтрокаТаблицы = ТаблицаСопоставления[Индекс];
			
			ТекстСообщения = СтрШаблон(НСтр("ru=' %1. Номенклатура %2;'"), Счетчик + 1, СтрокаТаблицы.НоменклатураПоставщика); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаСопоставления", Индекс + 1, "Номенклатура"));
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
