
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресВоВременномХранилище) Тогда
		ТекстСообщения = НСтр("ru='Предусмотрено открытие формы только из документов.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ИспользоватьТранспортныеУпаковки = Параметры.ИспользоватьТранспортныеУпаковки;
	АдресВоВременномХранилище = Параметры.АдресВоВременномХранилище;
	
	СтруктураВходныхпараметров = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	НомераУпаковок.Загрузить(СтруктураВходныхпараметров.ТаблицаНомеров);
	Если ИспользоватьТранспортныеУпаковки Тогда
		ТранспортныеУпаковки.Загрузить(СтруктураВходныхпараметров.ТаблицаТУ);
		СоставТранспортныхУпаковок.Загрузить(СтруктураВходныхпараметров.ТаблицаСоставТУ);
	КонецЕсли;
	
	Для Каждого Строка Из СтруктураВходныхпараметров.ТаблицаТоваров Цикл
		
		Если НЕ Строка.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Характеристика) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КоличествоИзДокумента = НоваяСтрока.Количество;
		НоваяСтрока.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		НоваяСтрока.МаркируемыйТовар = НоваяСтрока.Характеристика.ор_МаркируемыйТовар;
		
	КонецЦикла;
	
	Для Каждого Строка Из Товары Цикл
		ОбновитьДанныВСтрокеСервер(Строка);
	КонецЦикла;
	
	ЗаполнитьСписокТоваровСРазнымиХарактеристиками();
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок", "СоставТранспортныхУпаковок");
	
	МассивКомандПО = Новый Массив;
	МассивКомандПО.Добавить("ЗагрузитьДанныеИзТСД");
	
	ИнтеграцияМДЛППереопределяемый.НастроитьПодключаемоеОборудование(ЭтотОбъект, МассивКомандПО);
	ПараметрыСобытийПО = Новый Структура;
	
	ПоказыватьДетальноеКоличество = Ложь;
	Элементы.ТоварыКоличествоКИЗ.Видимость = ПоказыватьДетальноеКоличество;
	Элементы.ТоварыКоличествоПоТУ.Видимость = ПоказыватьДетальноеКоличество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанныеПодвала();
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьОповещение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	УказатьНомераУпаковок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНадписьФильтрацияНажатие(Элемент)
	
	ИспользоватьФильтрацию = Не ИспользоватьФильтрацию;
	УстановитьОтборТоваровЕстьРасхождениеКоличества(ИспользоватьФильтрацию);
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДетальноеКоличествоПриИзменении(Элемент)
	
	Элементы.ТоварыКоличествоКИЗ.Видимость = ПоказыватьДетальноеКоличество;
	Элементы.ТоварыКоличествоПоТУ.Видимость = ПоказыватьДетальноеКоличество;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьВвод(Команда)
	
	ОчиститьСообщения();
	
	Если ЕстьСтрокиСНеокрректнымКоличеством() Тогда
		ТекстСообщения = НСтр("ru = 'Есть строки у которых количество введенных номеров упаковок больше количества. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаКоличестваЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗавершитьВводПродолжить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	
	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ПолучитьДанныеИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаКоличестваЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗавершитьВводПродолжить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьОповещение(Результат, Контекст) Экспорт
	
	ЗавершитьВвод(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТоваровЕстьРасхождениеКоличества(вИспользоватьФильтрацию)
	
	Если вИспользоватьФильтрацию <> ИспользоватьФильтрацию Тогда
		ИспользоватьФильтрацию = вИспользоватьФильтрацию;
	КонецЕсли;
	
	Если ИспользоватьФильтрацию Тогда
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.Товары.ОтборСтрок,
			Новый Структура("ЕстьРасхождениеКоличества", Истина));
	Иначе
		ИнтеграцияМДЛПКлиент.СнятьОтборСтрок(Элементы.Товары.ОтборСтрок, "ЕстьРасхождениеКоличества");
	КонецЕсли;
	
	ОбновитьДекорацияНадписьФильтрация();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТоваровПоНоменклатуре(вНоменклатура)
	
	ИспользоватьФильтрацию = Истина;
	
	ИнтеграцияМДЛПКлиент.СнятьОтборСтрок(Элементы.Товары.ОтборСтрок, "ЕстьРасхождениеКоличества");
	
	ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.Товары.ОтборСтрок,
			Новый Структура("Номенклатура", вНоменклатура));
	
	ОбновитьДекорацияНадписьФильтрация();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДекорацияНадписьФильтрация()
	
	Если ИспользоватьФильтрацию Тогда
		Элементы.ДекорацияНадписьФильтрация.Заголовок = "Показать все строки";
	Иначе
		Элементы.ДекорацияНадписьФильтрация.Заголовок = "Показать строки с рахождением в количестве";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводПродолжить()
	
	ЕстьОшибки = Ложь;
	
	СохранитьВводСервер(ЕстьОшибки);
	Если Не Модифицированность И НЕ ЕстьОшибки Тогда
		
		ВладелецФормы.Модифицированность = МодифицированностьВладельца;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВводСервер(ЕстьОшибки)
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ор_ИдентификаторСтроки);
		СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиНомеров.Количество() > 0 Тогда
			
			Результат = ЗаполнитьПризнакМаркируемгоТовара(СтрокаТовары.Характеристика);
			
			Если Результат Тогда
				СтрокаТовары.МаркируемыйТовар = Истина;
			Иначе
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Структурапараметров = Новый Структура;
	Структурапараметров.Вставить("ТаблицаТоваров", Товары.Выгрузить());
	Структурапараметров.Вставить("ТаблицаНомеров", НомераУпаковок.Выгрузить());
	Структурапараметров.Вставить("ТаблицаТУ", ТранспортныеУпаковки.Выгрузить());
	Структурапараметров.Вставить("ТаблицаСоставТУ", СоставТранспортныхУпаковок.Выгрузить());
	
	ПоместитьВоВременноеХранилище(Структурапараметров, АдресВоВременномХранилище);
	
	Если Модифицированность Тогда
		МодифицированностьВладельца = Истина;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПризнакМаркируемгоТовара(Характеристика)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектХарактеристики = Характеристика.ПолучитьОбъект();
	ОбъектХарактеристики.ор_МаркируемыйТовар = Истина;
	
	Попытка
		ОбъектХарактеристики.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить признак маркируемого товара в характеристике :'") + Строка(Характеристика);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныВСтроке(ТекущиеДанные)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки);
	СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
	
	КоличествоНомеровТУ = 0;
	Если ИспользоватьТранспортныеУпаковки Тогда
		СтруктураПоискаСостава = Новый Структура("ИдентификаторСтрокиТовара", ТекущиеДанные.ор_ИдентификаторСтроки);
		НайденныеСтрокиСостава = СоставТранспортныхУпаковок.НайтиСтроки(СтруктураПоискаСостава);
		Для Каждого СтрокаСостава Из НайденныеСтрокиСостава Цикл
			СтруктураПоискаТУ = Новый Структура("ИдентификаторСтроки", СтрокаСостава.ИдентификаторСтроки);
			НайденныеСтрокиТУ = ТранспортныеУпаковки.НайтиСтроки(СтруктураПоискаТУ);
			Если НайденныеСтрокиТУ.Количество() > 0 Тогда
				КоличествоНомеровТУ = КоличествоНомеровТУ + СтрокаСостава.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущиеДанные.КоличествоНомеровУпаковок = СтрокиНомеров.Количество() + КоличествоНомеровТУ;
	ТекущиеДанные.КоличествоКИЗ = СтрокиНомеров.Количество();
	ТекущиеДанные.КоличествоПоТУ = КоличествоНомеровТУ;
	ТекущиеДанные.ЕстьРасхождениеКоличества = ТекущиеДанные.Количество <> ТекущиеДанные.КоличествоНомеровУпаковок;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныВСтрокеСервер(ТекущиеДанные)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки);
	СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
	
	КоличествоНомеровТУ = 0;
	Если ИспользоватьТранспортныеУпаковки Тогда
		СтруктураПоискаСостава = Новый Структура("ИдентификаторСтрокиТовара", ТекущиеДанные.ор_ИдентификаторСтроки);
		НайденныеСтрокиСостава = СоставТранспортныхУпаковок.НайтиСтроки(СтруктураПоискаСостава);
		Для Каждого СтрокаСостава Из НайденныеСтрокиСостава Цикл
			СтруктураПоискаТУ = Новый Структура("ИдентификаторСтроки", СтрокаСостава.ИдентификаторСтроки);
			НайденныеСтрокиТУ = ТранспортныеУпаковки.НайтиСтроки(СтруктураПоискаТУ);
			Если НайденныеСтрокиТУ.Количество() > 0 Тогда
				КоличествоНомеровТУ = КоличествоНомеровТУ + СтрокаСостава.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущиеДанные.КоличествоНомеровУпаковок = СтрокиНомеров.Количество() + КоличествоНомеровТУ;
	ТекущиеДанные.КоличествоКИЗ = СтрокиНомеров.Количество();
	ТекущиеДанные.КоличествоПоТУ = КоличествоНомеровТУ;
	ТекущиеДанные.ЕстьРасхождениеКоличества = ТекущиеДанные.Количество <> ТекущиеДанные.КоличествоНомеровУпаковок;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьНомераУпаковок()
	
	ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыФормыУказания = ПараметрыФормыНомеровУпаковок(ТекущиеДанныеИдентификатор);
	
	ОбработчикУказанияСерий = Новый ОписаниеОповещения("ОбработатьУказаниеНомеровУпаковок", ЭтотОбъект, ПараметрыФормыУказания);
	РежимБлокировки = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму(ПараметрыФормыУказания.ИмяФормы, ПараметрыФормыУказания, ЭтаФорма,,,, ОбработчикУказанияСерий, РежимБлокировки);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыНомеровУпаковок(ТекущиеДанныеИдентификатор)
	
	ПараметрыФормыУказанияМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
	ПараметрыФормыУказанияМДЛП.ТекущиеДанныеИдентификатор = ТекущиеДанныеИдентификатор;
	ПараметрыФормыУказанияМДЛП.ИмяТЧТовары = "Товары";
	ПараметрыФормыУказанияМДЛП.ИмяТЧСерии = "НомераУпаковок";
	ПараметрыФормыУказанияМДЛП.ИмяТЧТУ = "ТранспортныеУпаковки";
	ПараметрыФормыУказанияМДЛП.ИмяТЧСоставТУ = "СоставТранспортныхУпаковок";
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПараметрыФормыВводаНомеровУпаковок(ЭтотОбъект, ЭтаФорма, ПараметрыФормыУказанияМДЛП, ИспользоватьТранспортныеУпаковки);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьУказаниеНомеровУпаковок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("Результат", Результат);
		ОбработатьУказаниеНомеровУпаковоСервер(ДополнительныеПараметры);
	КонецЕсли;
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок", "СоставТранспортныхУпаковок");
	
	Для Каждого Строка Из Товары Цикл
		ОбновитьДанныВСтроке(Строка);
	КонецЦикла;
	
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУказаниеНомеровУпаковоСервер(ДополнительныеПараметры)
	
	ТекущиеДанныеИдентификатор = ДополнительныеПараметры.ТекущиеДанныеИдентификатор;
	ИмяТЧТовары                = ДополнительныеПараметры.ИмяТЧТовары;
	
	ТекущаяСтрока = ЭтотОбъект[ИмяТЧТовары].НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	
	Если НЕ ТекущаяСтрока.ИспользоватьНомераУпаковок Тогда
		ТекущаяСтрока.ИспользоватьНомераУпаковок = Истина;
	КонецЕсли;
	
	ор_ИнтеграцияМДЛП.ЗаполнитьНомераУпаковок(ЭтотОбъект, ДополнительныеПараметры, ЭтотОбъект);
	
КонецПроцедуры

#Область ПодключаемоеОборудование

// Обработка результата загрузки данных из ТСД.
//
// Параметры:
//  СтруктураРезультат - Структура - структура результата выполнения операции.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ПолучитьДанныеИзТСДЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ПолученыШтрихкоды(РезультатВыполнения.ТаблицаТоваров);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьДанныеПоШтрихкодам(СтруктураДанные)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
	КонецЦикла;
	
	// + ор
	ПараметрыСобытийПО = Новый Структура;
	ПараметрыСобытийПО.Вставить("ЗапретПоискаХарактеристикПоШКПроизводителя");
	// + ор
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодамВМассиве(СтруктураДанные.МассивШтрихкодов,,, ПараметрыСобытийПО);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		МассивДанныхШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если МассивДанныхШтрихкода <> Неопределено
			И МассивДанныхШтрихкода.Количество() <> 0 Тогда
			
			Для Каждого ДанныеШтрихкода Из МассивДанныхШтрихкода Цикл
				
				ДанныеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
				Если ТекШтрихкод.Свойство("ДанныеМаркировкиМДЛП") Тогда
					ДанныеШтрихкода.Вставить("ДанныеМаркировкиМДЛП", ТекШтрихкод.ДанныеМаркировкиМДЛП);
				КонецЕсли;
				
				СтруктураДанныеНоменклатуры = Новый Структура();
				СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
				СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
				СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
				ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры));
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов)
	
	Результат = Новый Структура;
	Результат.Вставить("НеизвестныеШтрихкоды", Новый Массив);
	Результат.Вставить("ШтрихкодыНекорректногоТипа", Новый Массив);
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	КоличествоШК = МассивШтрихкодов.Количество();
	
	ор_ИнтеграцияМДЛПКлиент.ОбработатьМассивШтрихкодовМДЛП(ЭтотОбъект, МассивШтрихкодов,, Истина);
	
	Контекст = Новый Структура();
	Контекст.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	Контекст.Вставить("КоличествоШК", КоличествоШК);
	
	ДополнитьДанныеПоШтрихкодам(Контекст);
	
	Для каждого ТекШтрихкод Из Контекст.МассивШтрихкодов Цикл
		ДанныеШтрихкода = Контекст.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода.Количество() > 1 Тогда
			
			ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод, КоличествоШК", ДанныеШтрихкода, ТекШтрихкод, КоличествоШК);
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение"
			, ЭтотОбъект, Новый Структура("Контекст", Контекст));
			
			ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.ДублиНоменклатурыПоШтрихКодам", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Продолжить;
		КонецЕсли;
		
		Если ДанныеШтрихкода <> Неопределено И ДанныеШтрихкода.Количество() = 0 Тогда
			Результат.НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас") 
			ИЛИ ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
			Результат.ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры,ЭтоНабор"
			, ТекШтрихкод.Штрихкод, ДанныеШтрихкода[0].Номенклатура, ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры, ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор));
		ИначеЕсли Не ЗначениеЗаполнено(ДанныеШтрихкода[0].Характеристика) Тогда
			
			ОбработатьСтрокуШКСПУстойХарактеристикой(ДанныеШтрихкода[0], КоличествоШК);
			
		Иначе
			
			ОбработатьСтрокуШКСЗаполненнойХарактеристикой(ДанныеШтрихкода[0]);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт
	
	Если СтруктураНоменклатуры = Неопределено Тогда Возврат КонецЕсли;
	
	ДанныеШтрихкода = СтруктураНоменклатуры.МассивНоменклатуры[0];
	ТекШтрихкод = СтруктураНоменклатуры.ТекШтрихкод;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	КоличествоШК = Параметры.Контекст.КоличествоШК;
	
	// Подставляем данные, т.к. форма выбора дублей не возвращает часть даных.
	ДанныеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
	ДанныеШтрихкода.Вставить("ТипНоменклатуры", ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры);
	ДанныеШтрихкода.Вставить("ДанныеМаркировкиМДЛП", ТекШтрихкод.ДанныеМаркировкиМДЛП);
	
	Если ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас")
		ИЛИ ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
		ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры,ЭтоНабор", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор));
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеШтрихкода.Характеристика) Тогда
		
		ОбработатьСтрокуШКСПУстойХарактеристикой(ДанныеШтрихкода, КоличествоШК);
		
	Иначе
		
		ОбработатьСтрокуШКСЗаполненнойХарактеристикой(ДанныеШтрихкода);
		
	КонецЕсли;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуШКСПУстойХарактеристикой(ДанныеШтрихкода, КоличествоШК)
	
	Если ТоварыСРазнымиХарактеристиками.НайтиПоЗначению(ДанныеШтрихкода.Номенклатура) = Неопределено Тогда
		
		СтруктураПоиска = Новый Структура("Номенклатура", ДанныеШтрихкода.Номенклатура);
		НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаСообщения = НСтр("ru = 'Найденного по коду %1% товара %2% нет в таблице товаров.'");
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ДанныеШтрихкода.Штрихкод);
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ДанныеШтрихкода.Номенклатура);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокаДобавлена = Ложь;
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			Если ТекущаяСтрока.Количество <= ТекущаяСтрока.КоличествоНомеровУпаковок Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьСтрокуНомераУпаковки(ТекущаяСтрока, ДанныеШтрихкода);
			СтрокаДобавлена = Истина;
			Прервать;
		КонецЦикла;
		
		Если СтрокаДобавлена Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			ДобавитьСтрокуНомераУпаковки(ТекущаяСтрока, ДанныеШтрихкода);
			СтрокаДобавлена = Истина;
			Прервать;
		КонецЦикла;
		
	Иначе
		СписокНоменклатурСРазнымиХараткеристиками.Добавить(ДанныеШтрихкода.Номенклатура);
		
		Если КоличествоШК = 1 Тогда
			УстановитьОтборТоваровПоНоменклатуре(ДанныеШтрихкода.Номенклатура);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуШКСЗаполненнойХарактеристикой(ДанныеШтрихкода)
	
	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,ЕдиницаИзмерения", ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.Характеристика, ДанныеШтрихкода.ЕдиницаИзмерения);
	НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаСообщения = НСтр("ru = 'Найденного по коду %1% товара %2% нет в таблице товаров.'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ДанныеШтрихкода.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ПредставлениеНоменклатуры(ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.Характеристика));
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		Возврат;
	КонецЕсли;
	
	СтрокаДобавлена = Ложь;
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		Если ТекущаяСтрока.Количество <= ТекущаяСтрока.КоличествоНомеровУпаковок Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьСтрокуНомераУпаковки(ТекущаяСтрока, ДанныеШтрихкода);
		СтрокаДобавлена = Истина;
		Прервать;
	КонецЦикла;
	
	Если СтрокаДобавлена Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ДобавитьСтрокуНомераУпаковки(ТекущаяСтрока, ДанныеШтрихкода);
		СтрокаДобавлена = Истина;
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	Модифицированность = Истина;
	
	СписокНоменклатурСРазнымиХараткеристиками.Очистить();
	
	НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтаФорма, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтаФорма,,,,Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
	Если СписокНоменклатурСРазнымиХараткеристиками.Количество() > 0 Тогда
		
		СтрокаСообщения = НСтр("ru = 'В таблице товаров есть строки с одинаковой номенклатурой и разными характеристиками. Вводить номера упаковок нужно для каждой характеристики отдельно через форму ввода номеров.'");
		Для Каждого СтрокаСписка Из СписокНоменклатурСРазнымиХараткеристиками Цикл
			СтрокаСообщенияДетальная = НСтр("ru = ' - %1%'");
			СтрокаСообщенияДетальная = СтрЗаменить(СтрокаСообщенияДетальная, "%1%", СтрокаСписка.Значение);
			СтрокаСообщения = СтрокаСообщения + Символы.ПС + СтрокаСообщенияДетальная
		КонецЦикла;
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЕсли;
	
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		Если ТекНекорректныйШтрихкод.Свойство("ЭтоНабор") И ТекНекорректныйШтрихкод.ЭтоНабор Тогда
			// Наборы
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", НСтр("ru = 'Набор'"));
		Иначе
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		КонецЕсли; 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ТипНоменклатуры", СтруктураДанные.Номенклатура.ТипНоменклатуры);
	СтруктураДанные.Вставить("ЭтоНабор", СтруктураДанные.Номенклатура.ЭтоНабор);
	
	// Характеристики
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьХарактеристики Тогда
		
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика), СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;
	// Конец Характеристики
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаКлиенте
Процедура ДобавитьСтрокуНомераУпаковки(ТекущаяСтрока, Строка)
	
	Если НЕ ТекущаяСтрока.ИспользоватьНомераУпаковок Тогда
		ТекущаяСтрока.ИспользоватьНомераУпаковок = Истина;
	КонецЕсли;
	
	СтруктураПараметровКлиента = Новый Структура;
	ДанныеМаркировкиМДЛП = Неопределено;
	
	Если Строка.Свойство("ДанныеМаркировкиМДЛП") Тогда
		ДанныеМаркировкиМДЛП = Строка.ДанныеМаркировкиМДЛП;
	ИначеЕсли ЗначениеЗаполнено(Строка.Штрихкод) Тогда
		СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(Строка.Штрихкод, Ложь);
		ДанныеМаркировкиМДЛП = СтруктураМаркировкиМДЛП.Данные;
	КонецЕсли;
	
	СтруктураПараметровКлиента.Вставить("ДанныеМаркировкиМДЛП", ДанныеМаркировкиМДЛП);
	
	ПараметрыФормыУказания = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
	ПараметрыФормыУказания.ИмяТЧТовары = "Товары";
	ПараметрыФормыУказания.ИмяТЧСерии = "НомераУпаковок";
	ПараметрыФормыУказания.ИмяТЧТУ = "ТранспортныеУпаковки";
	ПараметрыФормыУказания.ИмяТЧСоставТУ = "СоставТранспортныхУпаковок";
	
	ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьСтрокуНомераУпаковки(ЭтотОбъект, ТекущаяСтрока, ПараметрыФормыУказания, СтруктураПараметровКлиента);
	
	Если СтруктураПараметровКлиента.Свойство("ТекстПредупреждения") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураПараметровКлиента.ТекстПредупреждения);
	КонецЕсли;
	
	ОбновитьДанныВСтроке(ТекущаяСтрока);
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(ЭтотОбъект, ТекущаяСтрока, "НомераУпаковок", "СоставТранспортныхУпаковок");
	
	Модифицированность = Истина;
	
	ТекущийЭлемент = Элементы.Товары;
	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
	ЭлементУпаковок = Элементы.Найти("ТоварыКоличествоУпаковок");
	Если ЭлементУпаковок <> Неопределено Тогда
		Элементы.Товары.ТекущийЭлемент = ЭлементУпаковок;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТоваровСРазнымиХарактеристиками();
	
	ТоварыСРазнымиХарактеристиками.Очистить();
	
	ТаблицаТоваров = Товары.Выгрузить(,"Номенклатура,Характеристика");
	ТаблицаТоваров.Свернуть("Номенклатура,Характеристика");
	
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.ЗаполнитьЗначения(1, "Количество");
	
	ТаблицаТоваров.Свернуть("Номенклатура", "Количество");
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		Если Строка.Количество > 1 Тогда
			ТоварыСРазнымиХарактеристиками.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеНоменклатуры(НоменклатураПредставление, ХарактеристикаПредставление)
	
	Возврат ор_ИнтеграцияМДЛП.ПредставлениеНоменклатуры(НоменклатураПредставление, ХарактеристикаПредставление);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоличествоПоНомерам(Команда)
	
	Для Каждого Строка Из Товары Цикл
		Если Строка.Количество < Строка.КоличествоНомеровУпаковок Тогда
			Строка.Количество = Строка.КоличествоНомеровУпаковок;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок", "СоставТранспортныхУпаковок");
	
	ОбновитьДанныеПодвала();
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьСтрокиСНеокрректнымКоличеством()
	
	Для Каждого Строка Из Товары Цикл
		Если Строка.Количество < Строка.КоличествоНомеровУпаковок Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеПодвала()
	
	Если ИспользоватьФильтрацию Тогда
		
		ОбщееКоличество = 0;
		ОбщееКоличествоНомеровУпаковок = 0;
		ОбщееКоличествоКИЗ = 0;
		ОбщееКоличествоПоТУ = 0;
		
		СтруктураПоиска = Новый Структура("ЕстьРасхождениеКоличества", Истина);
		НайденныйСтроки = Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныйСтроки.Количество() > 0 Тогда
			Для Каждого Строка Из НайденныйСтроки Цикл
				ОбщееКоличество = ОбщееКоличество + Строка.Количество;
				ОбщееКоличествоНомеровУпаковок = ОбщееКоличествоНомеровУпаковок + Строка.КоличествоНомеровУпаковок;
				ОбщееКоличествоКИЗ = ОбщееКоличествоКИЗ + Строка.КоличествоКИЗ;
				ОбщееКоличествоПоТУ = ОбщееКоличествоПоТУ + Строка.КоличествоПоТУ;
			КонецЦикла;
		КонецЕсли;
		
		Элементы.ТоварыКоличество.ТекстПодвала = ОбщееКоличество;
		Элементы.ТоварыКоличествоНомеровУпаковок.ТекстПодвала = ОбщееКоличествоНомеровУпаковок;
		Элементы.ТоварыКоличествоКИЗ.ТекстПодвала = ОбщееКоличествоКИЗ;
		Элементы.ТоварыКоличествоПоТУ.ТекстПодвала = ОбщееКоличествоПоТУ;
		
	Иначе
		Элементы.ТоварыКоличество.ТекстПодвала = Товары.Итог("Количество");
		Элементы.ТоварыКоличествоНомеровУпаковок.ТекстПодвала = Товары.Итог("КоличествоНомеровУпаковок");
		Элементы.ТоварыКоличествоКИЗ.ТекстПодвала = Товары.Итог("КоличествоКИЗ");
		Элементы.ТоварыКоличествоПоТУ.ТекстПодвала = Товары.Итог("КоличествоПоТУ");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
