
#Область ПрограммныйИнтерфейс

Функция ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ИмяОбработчика",                        Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ВызовПослеАвторизации",                 Ложь);
	ВозвращаемоеЗначение.Вставить("Результат",                             Неопределено);
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           Неопределено);
	ВозвращаемоеЗначение.Вставить("Параметры",                             ПараметрыЗапроса.Параметры);
	ВозвращаемоеЗначение.Вставить("Организация",                           ПараметрыЗапроса.Организация);
	ВозвращаемоеЗначение.Вставить("ОрганизацияПоСертификатам",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ПроверкаПоТокенуРозничнойПродажи",      Ложь);
	ВозвращаемоеЗначение.Вставить("НеТребуетсяАвторизацияПоКлючуСессии",   Ложь);
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор",               Неопределено);
	ВозвращаемоеЗначение.Вставить("ВыполнениеВФоне",                       Ложь);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",                    Неопределено);
	ВозвращаемоеЗначение.Вставить("ВыполнениеНаКлиенте",                   Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ВыполнениеНаКлиенте = ПараметрыЗапроса.ВыполнениеНаКлиенте;
	ДоступныеМетодыИнтерфейса              = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	
	АсинхронныйЗапуск = Ложь;
	#Если ВебКлиент Тогда
		АсинхронныйЗапуск = ПараметрыОбработки.ВыполнениеНаКлиенте;
	#КонецЕсли
	
	Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеРозничногоТокена Тогда
		Если Не ПараметрыОбработки.ВызовПослеАвторизации Тогда
			ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
		КонецЕсли;
	ИначеЕсли Не ПараметрыЗапроса.ВыполнениеНаКлиенте Тогда
		РазрешительныйРежимМаршрутизаторМДЛПСлужебныйВызовСервера.ЗапросМетодаИнтерфейсаСОбработкой(ПараметрыОбработки);
	Иначе
		ЗапросМетодаИнтерфейсаСОбработкой(ПараметрыОбработки, ПараметрыЗапроса, АсинхронныйЗапуск);
	КонецЕсли;
	
	Если Не АсинхронныйЗапуск Тогда
		Если ПараметрыОбработки.ВыполнениеВФоне И Не ПараметрыЗапроса.ВыполнениеНаКлиенте Тогда
			ОжидатьВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
		Иначе
			ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Асинх Процедура ЗапросМетодаИнтерфейсаСОбработкой(ПараметрыОбработки, ПараметрыЗапроса, АсинхронныйЗапуск)
	
	Если Не ЗначениеЗаполнено(ПараметрыОбработки.Организация)
		И ПараметрыОбработки.ОрганизацияПоСертификатам = Неопределено
		И Не ПараметрыОбработки.НеТребуетсяАвторизацияПоКлючуСессии Тогда
		ПараметрыОбработки.ОрганизацияПоСертификатам = Истина;
		Возврат;
	КонецЕсли;
	
	ТребуетсяОбновлениеКлючаСессииРозница = Ложь;
	ТекстОшибки                           = Неопределено;
	
	ДоступныеМетодыИнтерфейса = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	
	Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок Тогда
		
		Если ПараметрыОбработки.ВыполнениеНаКлиенте Тогда
			
			ПараметрыОбработки.ЕстьОшибки  = Истина;
			ПараметрыОбработки.ТекстОшибки = НСтр("ru = 'Данный метод недоступен на клиенте.'");
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ Тогда
		
		#Если ВебКлиент Тогда
		
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
				ТекстОшибки = НСтр("ru = 'Обмен с Локальным модулем ""Честный знак"" из веб-клиента недоступен для текущей версии платформы.
					|Используйте тонкий клиент.'");
				Возврат;
			КонецЕсли;
			
			РезультатНастройкиЛМЧЗ = Ждать ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗНаВебКлиенте(
				ПараметрыОбработки.Параметры.Организация,
				ПараметрыОбработки.Параметры.ПараметрыУстановки,
				ПараметрыОбработки.УникальныйИдентификатор);
			
			
		#Иначе
			
			РезультатНастройкиЛМЧЗ = ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗНаКлиенте(
				ПараметрыОбработки.Параметры.Организация,
				ПараметрыОбработки.Параметры.ПараметрыУстановки,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#КонецЕсли
		
		ТребуетсяОбновлениеКлючаСессииРозница = РезультатНастройкиЛМЧЗ.ТребуетсяОбновлениеКлючаСессииРозница;
		ТекстОшибки                           = РезультатНастройкиЛМЧЗ.ТекстОшибки;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ Тогда
		
		#Если ВебКлиент Тогда
		
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
				ТекстОшибки = НСтр("ru = 'Обмен с Локальным модулем ""Честный знак"" из веб-клиента недоступен для текущей версии платформы.
					|Используйте тонкий клиент.'");
				Возврат;
			КонецЕсли;
			
			РезультатНастройкиЛМЧЗ = Ждать ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗНаВебКлиенте(
				ПараметрыОбработки.Параметры.Организация,
				ПараметрыОбработки.Параметры.ПараметрыУстановки,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#Иначе
			
			РезультатНастройкиЛМЧЗ = ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗНаКлиенте(
				ПараметрыОбработки.Параметры.Организация,
				ПараметрыОбработки.Параметры.ПараметрыУстановки,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#КонецЕсли
		
		ТекстОшибки = РезультатНастройкиЛМЧЗ.ТекстОшибки;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ Тогда
		
		#Если ВебКлиент Тогда
		
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
				ТекстОшибки = НСтр("ru = 'Обмен с Локальным модулем ""Честный знак"" из веб-клиента недоступен для текущей версии платформы.
					|Используйте тонкий клиент.'");
				Возврат;
			КонецЕсли;
			
			РезультатНастройкиЛМЧЗ = Ждать ВыполнитьИзменениеПароляАдминистратораЛокальногоМодуляЧЗНаВебКлиенте(
				ПараметрыОбработки.Параметры.Организация,
				ПараметрыОбработки.Параметры.ПараметрыУстановки,
				ПараметрыОбработки.Параметры.НовыйПароль,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#Иначе
			
			РезультатНастройкиЛМЧЗ = ВыполнитьИзменениеПароляАдминистратораЛокальногоМодуляЧЗНаКлиенте(
				ПараметрыОбработки.Параметры.Организация,
				ПараметрыОбработки.Параметры.ПараметрыУстановки,
				ПараметрыОбработки.Параметры.НовыйПароль,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#КонецЕсли
		
		ТекстОшибки = РезультатНастройкиЛМЧЗ.ТекстОшибки;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
		
		#Если ВебКлиент Тогда
		
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
				ТекстОшибки = НСтр("ru = 'Обмен с ТС ПИоТ из веб-клиента недоступен для текущей версии платформы.
					|Используйте тонкий клиент.'");
				Возврат;
			КонецЕсли;
			
			РезультатНастройкиТСПИоТ = Ждать ВыполнитьПолучениеДанныхНастроекТСПИоТНаВебКлиенте(
				ПараметрыОбработки.Параметры.ПараметрыПодключения,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#Иначе
			
			РезультатНастройкиТСПИоТ = ВыполнитьПолучениеДанныхНастроекТСПИоТ(
				ПараметрыОбработки.Параметры.ПараметрыПодключения,
				ПараметрыОбработки.УникальныйИдентификатор);
			
		#КонецЕсли
		
		ТекстОшибки = РезультатНастройкиТСПИоТ.ТекстОшибки;
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Внутренняя ошибка. Не описан метод интерфейса с запросом ключа авторизации %1'"),
			ПараметрыОбработки.ИмяОбработчика);
	КонецЕсли;
	
	Если ТребуетсяОбновлениеКлючаСессииРозница Тогда
		
		ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПараметрыОбработки.ЕстьОшибки  = Истина;
		ПараметрыОбработки.ТекстОшибки = ТекстОшибки;
		
	Иначе
		
		Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ
			Тогда
			ПараметрыОбработки.Результат = РезультатНастройкиЛМЧЗ;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
			ПараметрыОбработки.Результат = РезультатНастройкиТСПИоТ;
		Иначе
			ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Не описан метод интерфейса с запросом ключа авторизации (после авторизации).'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если АсинхронныйЗапуск Тогда
		
		Если ПараметрыОбработки.ВыполнениеВФоне И Не ПараметрыЗапроса.ВыполнениеНаКлиенте Тогда
			ОжидатьВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
		Иначе
			ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОжидатьВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки)
	
	Если ПараметрыОбработки.ДлительнаяОперация <> Неопределено Тогда
		
		ВыводитьОкноОжидания = Истина;
		Если ТипЗнч(ПараметрыЗапроса.Параметры) = Тип("Структура") И ПараметрыЗапроса.Параметры.Свойство("НеВыводитьОкноОжидания") Тогда
			ВыводитьОкноОжидания = Не ПараметрыЗапроса.Параметры.НеВыводитьОкноОжидания;
		КонецЕсли;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		
		ДоступныеМетодыИнтерфейса              = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
		Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ Тогда
			ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Инициализация конфигурации Локального модуля ""Честный Знак""'");
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ Тогда
			ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Получение статуса системы Локальный модуль ""Честный Знак""'");
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ Тогда
			ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Смена пароля администратора системы Локальный модуль ""Честный Знак""'");
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок Тогда
			ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Выполняется обновление CDN-площадок'");
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
			ПараметрыОжидания.ТекстСообщения             = НСтр("ru = 'Получение данных настройки ТС ПИоТ'");
		КонецЕсли;
		
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания       = ВыводитьОкноОжидания;
		ПараметрыОжидания.ВыводитьСообщения          = Истина;
		
		ПараметрыЗавершенияДлительнойОперации = Новый Структура;
		ПараметрыЗавершенияДлительнойОперации.Вставить("ПараметрыОбработки"     , ПараметрыОбработки);
		ПараметрыЗавершенияДлительнойОперации.Вставить("ПараметрыЗапроса"       , ПараметрыЗапроса);
		ПараметрыЗавершенияДлительнойОперации.Вставить("ОповещениеПриЗавершении", ПараметрыЗапроса.ОповещениеОЗавершении);
		ПараметрыЗавершенияДлительнойОперации.Вставить("Организация"            , ПараметрыЗапроса.Организация);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ПараметрыОбработки.ДлительнаяОперация,
			Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ЭтотОбъект, ПараметрыЗавершенияДлительнойОперации),
			ПараметрыОжидания);
		
	Иначе
		
		Если ПараметрыОбработки.ОрганизацияПоСертификатам <> Неопределено
			И ПараметрыОбработки.ОрганизацияПоСертификатам Тогда
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ПараметрыЗапроса",   ПараметрыЗапроса);
			ДополнительныеПараметры.Вставить("ПараметрыОбработки", ПараметрыОбработки);
			
			ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
				"ПоискОрганизацияПоСертификатамЗавершение",
				ЭтотОбъект,
				ДополнительныеПараметры);
			ЭлектроннаяПодписьКлиент.НайтиДействительныеЛичныеСертификаты(ОповещениеПриЗапросеКлючаСессии);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки"        , Ложь);
	Результат.Вставить("ТекстОшибки"       , Неопределено);
	Результат.Вставить("Результат"         , Неопределено);
	Результат.Вставить("ОтказОтАвторизации", Ложь);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",   ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("ПараметрыОбработки", ПараметрыОбработки);
	
	Если ПараметрыОбработки.ОрганизацияПоСертификатам <> Неопределено
		И ПараметрыОбработки.ОрганизацияПоСертификатам Тогда
		
		ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
			"ПоискОрганизацияПоСертификатамЗавершение",
			ЭтотОбъект,
			ДополнительныеПараметры);
		ЭлектроннаяПодписьКлиент.НайтиДействительныеЛичныеСертификаты(ОповещениеПриЗапросеКлючаСессии);
		Возврат;
		
	ИначеЕсли ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		
		Если ПараметрыОбработки.ВызовПослеАвторизации Тогда
			Результат.ЕстьОшибки  = Истина;
			Результат.ТекстОшибки = НСтр("ru = 'Не удалось выполнить авторизацию ГИС МТ по причине: %1'");
			Если ЗначениеЗаполнено(ПараметрыОбработки.ТекстОшибки) Тогда
				Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат.ТекстОшибки, ПараметрыОбработки.ТекстОшибки);
			Иначе
				Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат.ТекстОшибки, НСтр("ru = 'Неизвестная ошибка.'"));
			КонецЕсли;
		Иначе
			
			ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
				"ЗапроситьРозничныйКлючСессииЗавершение",
				ЭтотОбъект,
				ДополнительныеПараметры);
			
			ПараметрыЗапросаКлючаСессии = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница(ПараметрыОбработки.Организация);
			
			РазрешительныйРежимМДЛПКлиент.ЗапроситьКлючСессии(ПараметрыЗапросаКлючаСессии, ОповещениеПриЗапросеКлючаСессии);
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОбработки.ЕстьОшибки Тогда
		Результат.ЕстьОшибки  = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Не удалось запросить данные ГИС МТ по причине: %1'");
		Если ЗначениеЗаполнено(ПараметрыОбработки.ТекстОшибки) Тогда
			Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат.ТекстОшибки, ПараметрыОбработки.ТекстОшибки);
		Иначе
			Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат.ТекстОшибки, НСтр("ru = 'Неизвестная ошибка.'"));
		КонецЕсли;
	Иначе
		Результат.Результат = ПараметрыОбработки.Результат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыЗапроса.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры


Процедура ПослеЗавершенияДлительнойОперации(Результат, ДополнительныеПараметрыДлительнойОперации) Экспорт
	
	Если Результат = Неопределено Тогда // отменено пользователем
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОбмена = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		ОбработатьРезультатОбменаСлужебный(РезультатОбмена, ДополнительныеПараметрыДлительнойОперации);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении, Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискОрганизацияПоСертификатамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.ПараметрыОбработки.ОрганизацияПоСертификатам = Ложь;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ДополнительныеПараметры.ПараметрыОбработки.ЕстьОшибки  = Истина;
		ДополнительныеПараметры.ПараметрыОбработки.ТекстОшибки = НСтр("ru = 'Не найдено доступных сертификатов для подписи.'");
	Иначе
		ДополнительныеПараметры.ПараметрыОбработки.Организация = ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(Результат[0].Организация);
	КонецЕсли;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ДополнительныеПараметры.ПараметрыЗапроса, ДополнительныеПараметры.ПараметрыОбработки);
	
КонецПроцедуры

Процедура ЗапроситьРозничныйКлючСессииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОтказОтАвторизации = Ложь;
	ОшибкаАвторизации  = Ложь;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие")
		Или (ДополнительныеПараметры.ПараметрыОбработки.Организация <> Неопределено
		И Результат[ДополнительныеПараметры.ПараметрыОбработки.Организация] = Неопределено) Тогда
		ОтказОтАвторизации = Истина;
	Иначе
		
		Если ДополнительныеПараметры.ПараметрыОбработки.Организация = Неопределено Тогда
			Для Каждого КлючИЗначение Из Результат Цикл
				РезультатАвторизации = КлючИЗначение.Значение;
			КонецЦикла;
		Иначе
			РезультатАвторизации = Результат[ДополнительныеПараметры.ПараметрыОбработки.Организация];
		КонецЕсли;
		
		Если РезультатАвторизации = Неопределено Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = НСтр("ru = 'Произошла ошибка при авторизации.'");
		ИначеЕсли РезультатАвторизации <> Истина Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = РезультатАвторизации;
		Иначе
			ДополнительныеПараметры.ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтказОтАвторизации Тогда
		
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("ЕстьОшибки"        , Истина);
		РезультатВыполнения.Вставить("ТекстОшибки"       , ДополнительныеПараметры.ПараметрыОбработки.ТекстОшибки);
		РезультатВыполнения.Вставить("Результат"         , Новый Структура("ОтказОтАвторизации", Истина));
		РезультатВыполнения.Вставить("ОтказОтАвторизации", ОтказОтАвторизации);
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПараметрыЗапроса.ОповещениеОЗавершении, РезультатВыполнения);
		Возврат;
		
	ИначеЕсли ОшибкаАвторизации Тогда
		ДополнительныеПараметры.ПараметрыОбработки.ЕстьОшибки  = Истина;
	КонецЕсли;
	
	ДополнительныеПараметры.ПараметрыОбработки.ВызовПослеАвторизации = Истина;
	ОбработкаМетодаИнтерфейсаСАвторизацией(ДополнительныеПараметры.ПараметрыЗапроса, ДополнительныеПараметры.ПараметрыОбработки);
	
КонецПроцедуры

Процедура ОбработатьРезультатОбменаСлужебный(РезультатОбмена, ДополнительныеПараметрыДлительнойОперации)
	
	СписокПолейЗаполнения = Новый Массив;
	СписокПолейЗаполнения.Добавить("ЕстьОшибки");
	СписокПолейЗаполнения.Добавить("ТребуетсяОбновлениеКлючаСессииРозница");
	СписокПолейЗаполнения.Добавить("ТекстОшибки");
	
	ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки.Результат = РезультатОбмена;
	
	Для Каждого ПолеЗаполнения Из СписокПолейЗаполнения Цикл
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки, ПолеЗаполнения)
			Или Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РезультатОбмена, ПолеЗаполнения) Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки[ПолеЗаполнения] = РезультатОбмена[ПолеЗаполнения];
		
	КонецЦикла;
	
	ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(
		ДополнительныеПараметрыДлительнойОперации.ПараметрыЗапроса,
		ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки);
	
КонецПроцедуры

#Если ВебКлиент Тогда

#Область ТСПИоТ

Асинх Функция ВыполнитьПолучениеДанныхНастроекТСПИоТНаВебКлиенте(ПараметрыНастройки, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",               "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ());
	
	РезультатОбновления = Ждать ИнтеграцияТСПИоТМДЛПВебКлиент.ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыНастройки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ  = РезультатОбновления.НастройкиЭкземпляраТСПИоТ;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ТСПИоТ

#Область ЛокальныйМодульЧЗ

Асинх Функция ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗНаВебКлиенте(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",                      Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	РезультатОбновления = Ждать РазрешительныйРежимМДЛПВебКлиент.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                            = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
	ВозвращаемоеЗначение.ТекстОшибки                           = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации                      = РезультатОбновления.ОтказАвторизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Асинх Функция ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗНаВебКлиенте(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                 Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ВерсияСборки",               "");
	ВозвращаемоеЗначение.Вставить("Статус",                     "");
	ВозвращаемоеЗначение.Вставить("ДатаПоследнейСинхронизации", Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("ТребуетсяЗагрузка",          Ложь);
	
	РезультатОбновления = Ждать РазрешительныйРежимМДЛПВебКлиент.ЗапроситьСтатусЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации           = РезультатОбновления.ОтказАвторизации;
	ВозвращаемоеЗначение.ВерсияСборки               = РезультатОбновления.ВерсияСборки;
	ВозвращаемоеЗначение.Статус                     = РезультатОбновления.Статус;
	ВозвращаемоеЗначение.ТребуетсяЗагрузка          = РезультатОбновления.ТребуетсяЗагрузка;
	ВозвращаемоеЗначение.ДатаПоследнейСинхронизации = РезультатОбновления.ДатаПоследнейСинхронизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Асинх Функция ВыполнитьИзменениеПароляАдминистратораЛокальногоМодуляЧЗНаВебКлиенте(Организация, ПараметрыУстановки, НовыйПароль, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",       Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",      "");
	
	РезультатОбновления = Ждать РазрешительныйРежимМДЛПВебКлиент.ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, НовыйПароль);
	
	ВозвращаемоеЗначение.ЕстьОшибки       = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки      = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации = РезультатОбновления.ОтказАвторизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ЛокальныйМодульЧЗ

#Иначе

#Область ТСПИоТ

Функция ВыполнитьПолучениеДанныхНастроекТСПИоТ(ПараметрыНастройки, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",               "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ());
	
	РезультатОбновления = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыНастройки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ  = РезультатОбновления.НастройкиЭкземпляраТСПИоТ;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ТСПИоТ

#Область ЛокальныйМодульЧЗ

Функция ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗНаКлиенте(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",                      Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	РезультатОбновления = РазрешительныйРежимМДЛПКлиентСервер.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                            = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
	ВозвращаемоеЗначение.ТекстОшибки                           = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации                      = РезультатОбновления.ОтказАвторизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗНаКлиенте(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                 Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ВерсияСборки",               "");
	ВозвращаемоеЗначение.Вставить("Статус",                     "");
	ВозвращаемоеЗначение.Вставить("ДатаПоследнейСинхронизации", Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("ТребуетсяЗагрузка",          Ложь);
	
	РезультатОбновления = РазрешительныйРежимМДЛПКлиентСервер.ЗапроситьСтатусЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации           = РезультатОбновления.ОтказАвторизации;
	ВозвращаемоеЗначение.ВерсияСборки               = РезультатОбновления.ВерсияСборки;
	ВозвращаемоеЗначение.Статус                     = РезультатОбновления.Статус;
	ВозвращаемоеЗначение.ТребуетсяЗагрузка          = РезультатОбновления.ТребуетсяЗагрузка;
	ВозвращаемоеЗначение.ДатаПоследнейСинхронизации = РезультатОбновления.ДатаПоследнейСинхронизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьИзменениеПароляАдминистратораЛокальногоМодуляЧЗНаКлиенте(Организация, ПараметрыУстановки, НовыйПароль, УникальныйИдентификатор = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",       Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",      "");
	
	РезультатОбновления = РазрешительныйРежимМДЛПКлиентСервер.ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, НовыйПароль);
	
	ВозвращаемоеЗначение.ЕстьОшибки       = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки      = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации = РезультатОбновления.ОтказАвторизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ЛокальныйМодульЧЗ

#КонецЕсли

#КонецОбласти // СлужебныеПроцедурыИФункции
