
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);

	МассивНоменклатуры = Параметры.МассивНоменклатуры;
	ТекШтрихкод = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ТекШтрихкод);
	
	Для Каждого ЭлементМассива Из МассивНоменклатуры Цикл
		
		НоваяСтрока = ШтрихкодыНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		
		// Аптека ++
		Если ЭлементМассива.Характеристика <> Неопределено Тогда
			НоваяСтрока.ор_СрокГодности = ЭлементМассива.Характеристика.ор_СрокГодности;
		КонецЕсли;
		// Аптека --
		
		Если  НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда 
			ВариантКартинки = 0;
		ИначеЕсли НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
			ВариантКартинки = 4
			Иначе
			ВариантКартинки = 2
		КонецЕсли;
		
		Если НоваяСтрока.Номенклатура.ИспользоватьХарактеристики Тогда 
			ВариантКартинки = ВариантКартинки + 1;
		КонецЕсли;
		
		Если НоваяСтрока.Номенклатура.ПометкаУдаления Тогда 
			ВариантКартинки = ВариантКартинки + 6;
			НоваяСтрока.ПометкаУдаления = Истина;
		КонецЕсли;
		
		Если НоваяСтрока.Номенклатура.ЭтоНабор Тогда 
			ВариантКартинки = ВариантКартинки + 12;
		КонецЕсли;
		
		НоваяСтрока.ВариантКартинки = ВариантКартинки;
		
	КонецЦикла;
	
	// Аптека ++
	ор_ОбщегоНазначенияСервер.ЗаполнитьТаблицуИндикацииСерийПоСрокамГодности(ЭтотОбъект.ТаблицаИндикацииСерий);
	ЗаполнитьУсловноеОформлениеФормыИндикацииСерийПоСрокамГодности();
	// Аптека --
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПеренестиДанныеВДокумент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиДанныеВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПеренестиДанныеВДокумент()
	
	ТекущиеДанные = Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Если ТекущиеДанные.ПометкаУдаления Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Номенклатура помечена на удаление. Продолжить?'"), Режим, 0);
	Иначе
		ПеренестиДанныеВДокументЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДанныеВДокументЗавершение()
	
	ТекущиеДанные = Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	МассивСтрок = Новый Массив;
	СтруктураШК = Новый Структура;
	
	СтруктураШК.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	СтруктураШК.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	СтруктураШК.Вставить("Партия", ТекущиеДанные.Партия);
	СтруктураШК.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ЕдиницаИзмерения);
	СтруктураШК.Вставить("Серия", ТекущиеДанные.Серия);
	СтруктураШК.Вставить("СтруктураДанныеНоменклатуры", ТекущиеДанные.СтруктураДанныеНоменклатуры);
	СтруктураШК.Вставить("ДанныеНоменклатуры", ТекущиеДанные.ДанныеНоменклатуры);
	
	МассивСтрок.Добавить(СтруктураШК);
	
	СтруктураЗакрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивСтрок , ТекШтрихкод);
	
	ЭтаФорма.Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиДанныеВДокументЗавершение();

КонецПроцедуры

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

#Область ИндикацияСерийПоСрокуГодности

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеФормыИндикацииСерийПоСрокамГодности()

	ИскомоеПоле1 = Новый ПолеКомпоновкиДанных("ШтрихкодыНоменклатуры");
	
	// Установим новое оформление
	Для Каждого СтрокаТаблицыОформления Из ЭтотОбъект.ТаблицаИндикацииСерий Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		Отбор = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных("ШтрихкодыНоменклатуры.ор_СрокГодности");
		Отбор.ВидСравнения    = ВидСравненияКомпоновкиДанных.Больше;
		Отбор.ПравоеЗначение  = СтрокаТаблицыОформления.ДатаС;
		
		Отбор = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ШтрихкодыНоменклатуры.ор_СрокГодности");
		Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		Отбор.ПравоеЗначение   = СтрокаТаблицыОформления.Дата;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", СтрокаТаблицыОформления.Цвет);
		
		НовоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле          = ИскомоеПоле1;
		
		//НовоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Использование = Истина;
		//НовоеПоле.Поле          = ИскомоеПоле2;
		
		ЭлементУО.Представление = СтрШаблон(НСтр("ru = 'Значение срока годности между %1 и %2'"), СтрокаТаблицыОформления.ДатаС, СтрокаТаблицыОформления.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти