///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоПожелание = (ЭтотОбъект[0].ВидОбращения = 0);
	ЭтоОшибка    = (ЭтотОбъект[0].ВидОбращения = 1);
	ЭтоВопрос    = (ЭтотОбъект[0].ВидОбращения = 2);
	ЭтоЗаявка    = (ЭтотОбъект[0].ВидОбращения = 3);
	
	НепроверяемыеРеквизиты = Новый Массив;
	Если ЭтоПожелание ИЛИ ЭтоВопрос Тогда
		НепроверяемыеРеквизиты.Добавить("ФактическоеПоведение");
	КонецЕсли;
	Если ЭтоЗаявка Тогда
		НепроверяемыеРеквизиты.Добавить("ОписаниеДействия");
		НепроверяемыеРеквизиты.Добавить("ОжидаемаяЦель");
		НепроверяемыеРеквизиты.Добавить("ФактическоеПоведение");
	Иначе
		НепроверяемыеРеквизиты.Добавить("ИдентификаторСервиса");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли