
#Область ПрограммныйИнтерфейс

#Область НастройкиПрофилейДоступа

// Дополняет профиль ролями МДЛП для выполнения базовых функций работы с РТ
//
// Параметры:
//  ОписаниеПрофиля - Структура - описание поставляемого профиля 
//                    (см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа)
//
Процедура ДополнитьПрофильОбязательнымиРолямиМДЛП(ОписаниеПрофиля)Экспорт
	
	ОписаниеПрофиля.Роли.Добавить("ор_БазовыеПраваМДЛП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваМДЛП");
	ОписаниеПрофиля.Роли.Добавить("НастройкаНСИМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеУпаковокМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОтчетаПротоколОбменаМДЛП");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбАгрегированииИТрансформацииУпаковокМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОВыбытииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПередачеНаУничтожениеМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПеремещенииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПриемкеМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОРозничныхПродажахМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОФактеУничтоженияМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПовторномВводеВОборотМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОприходованииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийВладельцаОбОприходованииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОВыдачеВОтделенияМДЛП");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОбАгрегированииИТрансформацииУпаковокМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОбОтгрузкеМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОВыбытииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПередачеНаУничтожениеМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПеремещенииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПриемкеМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОРозничныхПродажахМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОФактеУничтоженияМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПовторномВводеВОборотМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОбОприходованииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийВладельцаОбОприходованииМДЛП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОВыдачеВОтделенияМДЛП");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДокументов

// Вызывается при вводе документа на основании, при выполнении метода Заполнить или при интерактивном вводе нового.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - заполняемый документ,
//  ДанныеЗаполнения - Произвольный - значение, которое используется как основание для заполнения,
//  ТекстЗаполнения - Строка, Неопределено - текст, используемый для заполнения документа,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОприходованииМДЛП") Тогда
			ЗаполнитьУведомлениеОбОприходованииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		Иначе
			ЗаполнитьУведомлениеОПриемеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОприходованииМДЛП") Тогда
			ЗаполнитьУведомлениеОбОприходованииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП") Тогда
			ЗаполнитьУведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛППоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		Иначе
			ЗаполнитьУведомлениеОбОтгрузкеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеЗапасов")
		И  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОВыбытииМДЛП") Тогда
		ЗаполнитьУведомлениеОВыбытииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ор_ИзготовлениеЛекарственныхФорм")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОВыбытииМДЛП") Тогда
		ЗаполнитьУведомлениеОВыбытииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КомплектацияЗапасов")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОВыбытииМДЛП") Тогда
		ЗаполнитьУведомлениеОВыбытииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеЗапасов")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОПередачеНаУничтожениеМДЛП") Тогда
		ЗаполнитьУведомлениеПередачеНаУничтожениеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ЗаполнитьУведомлениеОПеремещенииПоОснованию(ДокументОбъект, ДанныеЗаполнения, Неопределено, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			ЗаполнитьУведомлениеОПеремещенииПоОснованию(ДокументОбъект, ДанныеЗаполнения.ДокументОснование, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОприходованииМДЛП") Тогда
			ЗаполнитьУведомлениеОбОприходованииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		Иначе
			ЗаполнитьУведомлениеОПриемеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			ЗаполнитьУведомлениеОПеремещенииПоОснованию(ДокументОбъект, ДанныеЗаполнения.ДокументОснование, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОприходованииМДЛП") Тогда
			ЗаполнитьУведомлениеОбОприходованииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП") Тогда
			ЗаполнитьУведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛППоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		Иначе
			ЗаполнитьУведомлениеОбОтгрузкеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОПередачеНаУничтожениеМДЛП") Тогда
		ЗаполнитьУведомлениеОФактеУничтоженияПоПередачеНаУничтожение(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеЗапасов")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОПовторномВводеВОборотМДЛП") Тогда
		ЗаполнитьУведомлениеОПовторномВводеВОборотПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеЗапасов")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОприходованииМДЛП") Тогда
		ЗаполнитьУведомлениеОбОприходованииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ЗаполнитьУведомлениеОРозничнойПродажеПоЧекуККМ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		ЗаполнитьПриходнаяНакладнаяПоУведомлениюОПриеме(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОВыбытииМДЛП")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеЗапасов") Тогда
		ЗаполнитьСписаниеТоваровПоУведомлениюОВыбытии(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОбОприходованииМДЛП")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОприходованиеЗапасов") Тогда
		ЗаполнитьОприходованиеЗапасовПоУведомлениеОбОприходованииМДЛП(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияПотребительскихУпаковокМДЛП")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ИнвентаризацияЗапасов") Тогда
		ЗаполнитьИнвентаризацияЗапасовПоИнвентаризацияПотребительскихУпаковокМДЛП(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП")
		И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
		ЗаполнитьРасходнаяНакладнаяПоУведомлениюОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается расширением формы при необходимости проверки заполнения реквизитов
// при записи или при проведении документа в форме,
// а также при выполнении метода ПроверитьЗаполнение.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проверяемый документ,
//  Отказ - Булево - признак отказа от проведения документа,
//  ПроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых будет выполнена проверка заполнения,
//  НепроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых не будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты = Неопределено) Экспорт
	
	Если НепроверяемыеРеквизиты = Неопределено Тогда
		НепроверяемыеРеквизиты = Новый Массив;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОприходованиеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КомплектацияЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ") Тогда
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОприходованиеЗапасов")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйОрдер")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходнаяНакладная")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйОрдер")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КомплектацияЗапасов")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм")
			ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеЗапасов") Тогда
			ПроверитьЗаполнениеНомеровУпаковок(ДокументОбъект, Отказ);
			ПроверитьДублиНомеровУпаковок(ДокументОбъект, Отказ);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
			ПроверитьЗаполнениеGTIN(ДокументОбъект, Отказ);
			ПроверитьЗаполнениеТранспортныхУпаковок(ДокументОбъект, Отказ);
			//ПроверитьКомиссионныеТовары(ДокументОбъект, Отказ);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйОрдер") Тогда
			Если ТипЗнч(ДокументОбъект.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
				ПроверитьЗаполнениеGTIN(ДокументОбъект, Отказ);
			КонецЕсли;
			ПроверитьЗаполнениеТранспортныхУпаковок(ДокументОбъект, Отказ,,,,, Ложь);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
			ПроверитьЗаполнениеТранспортныхУпаковок(ДокументОбъект, Отказ);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйОрдер") Тогда
			ПроверитьЗаполнениеТранспортныхУпаковок(ДокументОбъект, Отказ,,,,, Ложь);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеЗапасов") Тогда
			ПроверитьУпаковкиНоменклатуры(ДокументОбъект, Отказ,,,, Истина);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм") Тогда
			ПроверитьУпаковкиНоменклатуры(ДокументОбъект, Отказ,,,, Истина);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ") Тогда
			ПроверитьЗаполнениеНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ);
			ПроверитьЗаполнениеНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ, "Подарки", "ор_НомераУпаковокПодарков",,, Истина);
			
			ПроверитьОстатокНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ);
			ПроверитьОстатокНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ, "Подарки", "ор_НомераУпаковокПодарков",,, Истина);
			
			ПроверитьДублиНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ);
			ПроверитьДублиНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ, "Подарки", "ор_НомераУпаковокПодарков");
			
			ПроверитьСтатусыНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ);
			ПроверитьСтатусыНомеровУпаковокПриРозничнойПродаже(ДокументОбъект, Отказ, "Подарки", "ор_НомераУпаковокПодарков");
			
			ПроверитьСкладыВРозничнойПродаже(ДокументОбъект, Отказ);
			ПроверитьУпаковкиНоменклатуры(ДокументОбъект, Отказ);
			
			ПроверитьДанныеРецептовПриРозничнойПродаже(ДокументОбъект, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает перед выполнением записи документа. Вызывается после начала транзакции записи, но до начала записи документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ,
//  Отказ - Булево - признак отказа от записи,
//  РежимЗаписи - РежимЗаписиДокумента - текущий режим записи документа,
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения документа.
//
Процедура ПередЗаписью(ДокументОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОприходованиеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КомплектацияЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеЗапасов") Тогда
		УдалитьНеиспользуемыеНомераУпаковок(ДокументОбъект);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗаполнитьПризнакиЕстьМаркируемаяПродукция(ДокументОбъект));
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ") Тогда
		УдалитьНеиспользуемыеНомераУпаковок(ДокументОбъект);
		УдалитьНеиспользуемыеНомераУпаковок(ДокументОбъект, "Подарки", "ор_НомераУпаковокПодарков");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗаполнитьПризнакиЕстьМаркируемаяПродукция(ДокументОбъект,,, ДокументОбъект.ОперацияСДенежнымиСредствами));
		ЗаполнитьДанныеРецептаДляККТ105(ДокументОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Возникает перед выполнением копирования документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ,
//  ОбъектКопирования -  ДокументСсылка - копируемый документ.
//
Процедура ПриКопировании(ДокументОбъект, ОбъектКопирования) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОприходованиеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйОрдер")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КомплектацияЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеЗапасов")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ") Тогда
		
		ДокументОбъект.ор_НомераУпаковок.Очистить();
		ДокументОбъект.ор_ЕстьМаркируемаяПродукция = Ложь;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ор_НомераУпаковокПодарков") Тогда
			ДокументОбъект.ор_НомераУпаковокПодарков.Очистить();
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ор_ТранспортныеУпаковки") Тогда
			ДокументОбъект.ор_ТранспортныеУпаковки.Очистить();
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ор_СоставТранспортныхУпаковок") Тогда
			ДокументОбъект.ор_СоставТранспортныхУпаковок.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеКомандыРегистрацииGTIN

// Процедура - Создать команду регистрации GTINНа форме
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма клиентского приложения
//
Процедура СоздатьКомандуРегистрацииGTINНаФорме(Форма) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	МассивКоманд = ПолучитьКомандыРегистрацииGTIN();
	
	Для Каждого Команда Из МассивКоманд Цикл
		Если Форма.ИмяФормы <> Команда.ИмяФормы Тогда
			Продолжить;
		КонецЕсли;
		СоздатьКомандуРегистрацииGTIN(Форма, Команда);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СозданиеКомандыРегистрацииGTIN

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров.
Процедура ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Штрихкоды.НомерУпаковки,
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика,
	|	Значение(Справочник.ЕдиницыИзмерения.ПустаяСсылка),
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	Значение(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|	1,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК Штрихкоды";
	
	Если СУсловиемПоиска Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ Штрихкоды.НомерУпаковки = &НомерУпаковкиSGTIN И Штрихкоды.КлючУпаковки = &КлючУпаковкиSGTIN";
	КонецЕсли;
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияПоШтриходамМДЛП(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	ДанныеКодовМаркировки = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
	Если ДанныеКодовМаркировки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДляУточнения = Новый ТаблицаЗначений;
	СтрокиДляУточнения.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	СтрокиДляУточнения.Колонки.Добавить("НомерУпаковки", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(27)));
	СтрокиДляУточнения.Колонки.Добавить("КлючУпаковки", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	
	Для Каждого СтрокаДанных Из ДанныеКодовМаркировки Цикл
		СтрокаДанных.ЭтоПродукцияМДЛП = Ложь;
		Если ЗначениеЗаполнено(СтрокаДанных.Номенклатура)
			И ПроверитьНоменклатуруМаркировки(СтрокаДанных.Номенклатура) Тогда
			
			Если ЗначениеЗаполнено(СтрокаДанных.Характеристика)
				И ПроверитьХарактеристикуМаркировки(СтрокаДанных.Характеристика) Тогда
				СтрокаДанных.ЭтоПродукцияМДЛП = Истина;
			Иначе
				
				НоваяСтрока = СтрокиДляУточнения.Добавить();
				НоваяСтрока.НомерУпаковки = СтрокаДанных.SGTIN;
				НоваяСтрока.КлючУпаковки  = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(СтрокаДанных.SGTIN);
				НоваяСтрока.Штрихкод      = СтрокаДанных.ШтрихкодBase64;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиДляУточнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТЗSGTIN.НомерУпаковки КАК НомерУпаковки,
	|	ТЗSGTIN.КлючУпаковки КАК КлючУпаковки,
	|	ТЗSGTIN.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаSGTIN
	|ИЗ
	|	&ТЗSGTIN КАК ТЗSGTIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаSGTIN.ШтрихКод КАК Штрихкод,
	|	УпаковкиМаркируемыхТоваров.Номенклатура КАК Номенклатура,
	|	УпаковкиМаркируемыхТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаSGTIN КАК ВременнаяТаблицаSGTIN
	|		ПО УпаковкиМаркируемыхТоваров.НомерУпаковки = ВременнаяТаблицаSGTIN.НомерУпаковки
	|			И УпаковкиМаркируемыхТоваров.КлючУпаковки = ВременнаяТаблицаSGTIN.КлючУпаковки
	|			И (НЕ УпаковкиМаркируемыхТоваров.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО УпаковкиМаркируемыхТоваров.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО УпаковкиМаркируемыхТоваров.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	СпрНоменклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров
	|	И ЕСТЬNULL(СпрХарактеристикиНоменклатуры.ор_МаркируемыйТовар, ЛОЖЬ)");
	Запрос.УстановитьПараметр("ТЗSGTIN", СтрокиДляУточнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = ДанныеКодовМаркировки.НайтиСтроки(Новый Структура("ШтрихкодBase64", Выборка.Штрихкод));
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
			СтрокаДанных.ЭтоПродукцияМДЛП = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает данные настроек Локального модуля Честный знак по подключаемому оборудованию
//
// Параметры:
//  МассивПодключаемогоОборудования - СправочникСсылка.ПодключаемоеОборудование
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
//   АдресЛокальногоМодуля    - Строка
//   Настроено                - Булево
//
Функция НастройкиЛокальногоМодуляЧестныйЗнакПоФискальнымУстройствам(МассивПодключаемогоОборудования) Экспорт
	
	РезультатНастройкиЛМЧЗ = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодключаемоеОборудование.Ссылка КАК ПодключаемоеОборудование,
		|	ПодключаемоеОборудование.Организация КАК Организация,
		|	СубъектыОбращенияМДЛП.Организация КАК ОрганизацияМДЛП,
		|	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТ_СписокПодключаемогоОборудования
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
		|		ПО ПодключаемоеОборудование.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
		|ГДЕ
		|	ПодключаемоеОборудование.Ссылка В(&МассивСсылок)
		|	И ЕСТЬNULL(СубъектыОбращенияМДЛП.СобственнаяОрганизация, ЛОЖЬ) = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокПодключаемогоОборудования.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
		|	НастройкиПодключенияЛокальныхМодулейИСМП.АдресПодключенияЛМ КАК АдресЛокальногоМодуля,
		|	НЕ НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет ЕСТЬ NULL КАК Настроено
		|ИЗ
		|	ВТ_СписокПодключаемогоОборудования КАК ВТ_СписокПодключаемогоОборудования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП КАК НастройкиПодключенияЛокальныхМодулейИСМП
		|		ПО ВТ_СписокПодключаемогоОборудования.ОрганизацияМДЛП = НастройкиПодключенияЛокальныхМодулейИСМП.Организация
		|			И (ВТ_СписокПодключаемогоОборудования.РабочееМесто = НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто
		|				ИЛИ НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто = &ПустоеЗначениеРабочееМесто)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивПодключаемогоОборудования);
	Запрос.УстановитьПараметр("ПустоеЗначениеРабочееМесто", Справочники.РабочиеМеста.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Подключение = Новый Структура("Настроено, АдресЛокальногоМодуля",
			ВыборкаДетальныеЗаписи.Настроено, ВыборкаДетальныеЗаписи.АдресЛокальногоМодуля);
			
		РезультатНастройкиЛМЧЗ.Вставить(ВыборкаДетальныеЗаписи.ПодключаемоеОборудование, Подключение);
		
	КонецЦикла;
	
	Возврат РезультатНастройкиЛМЧЗ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииПолученияСписковВозможныхДокументовСопоставления

Функция ПолучитьСписокВыбораУведомленний(Ссылка, СтруктурнаяЕдиницаПоУмолчанию = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Организация        = Неопределено;
	Контрагент         = Неопределено;
	НомерДокумента     = Неопределено;
	ДатаДокумента      = Неопределено;
	ОснованиеСсылка    = Неопределено;
	СтруктурнаяЕдиница = Неопределено;
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиницаПоУмолчанию) Тогда
		СтруктурнаяЕдиница = СтруктурнаяЕдиницаПоУмолчанию;
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		СтруктураРеквизитов = Новый Структура();
		СтруктураРеквизитов.Вставить("ДокументОснование");
		СтруктураРеквизитов.Вставить("СтруктурнаяЕдиница");
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтруктураРеквизитов);
		
		Если ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ОснованиеСсылка = Реквизиты.ДокументОснование;
		СтруктурнаяЕдиница           = Реквизиты.СтруктурнаяЕдиница;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		
		СтруктураРеквизитов = Новый Структура();
		СтруктураРеквизитов.Вставить("ДокументОснование");
		СтруктураРеквизитов.Вставить("СтруктурнаяЕдиница");
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтруктураРеквизитов);
		
		СтруктурнаяЕдиница = Реквизиты.СтруктурнаяЕдиница;
		
		Если ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Возврат Неопределено;
			
		ИначеЕсли ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			Поступление = ПолучитьПоступлениеТоваровПоЗаказуПоставщику(Реквизиты.ДокументОснование);
			
			Если Поступление = Неопределено Тогда
				Возврат Неопределено;
			Иначе
				ОснованиеСсылка = Поступление;
			КонецЕсли;
			
		Иначе
			ОснованиеСсылка = Реквизиты.ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Поступление = ПолучитьПоступлениеТоваровПоЗаказуПоставщику(Ссылка);
		
		Если Поступление = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			ОснованиеСсылка = Поступление;
		КонецЕсли;
		
	Иначе
		ОснованиеСсылка = Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОснованиеСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.РасходнаяНакладная")Тогда
		ЭтоОтгрузка = Истина;
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ЭтоОтгрузка = Ложь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("СтруктурнаяЕдиница");
	СтруктураРеквизитов.Вставить("Контрагент");
	Если ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		СтруктураРеквизитов.Вставить("НомерВходящегоДокумента");
		СтруктураРеквизитов.Вставить("ДатаВходящегоДокумента");
	Иначе
		СтруктураРеквизитов.Вставить("Номер");
		СтруктураРеквизитов.Вставить("Дата");
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеСсылка, СтруктураРеквизитов);
	
	Организация = Реквизиты.Организация;
	Контрагент  = Реквизиты.Контрагент;
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = Реквизиты.СтруктурнаяЕдиница;
	КонецЕсли;
	
	Если ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		НомерДокумента = Реквизиты.НомерВходящегоДокумента;
		ДатаДокумента  = Реквизиты.ДатаВходящегоДокумента;
	Иначе
		НомерДокумента = Реквизиты.Номер;
		ДатаДокумента  = Реквизиты.Дата;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Ссылка"        ,     ОснованиеСсылка);
	СтруктураПараметров.Вставить("Организация"   ,     Организация);
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	СтруктураПараметров.Вставить("Контрагент"    ,     Контрагент);
	СтруктураПараметров.Вставить("НомерДокумента",     НомерДокумента);
	СтруктураПараметров.Вставить("ДатаДокумента" ,     ДатаДокумента);
	
	Если ЭтоОтгрузка Тогда
		ТаблицаУведомлений = ор_ИнтеграцияМДЛП.ПолучитьТаблицуВыбораУведомленийОтгрузки(СтруктураПараметров);
	Иначе
		ТаблицаУведомлений = ор_ИнтеграцияМДЛП.ПолучитьТаблицуВыбораУведомленийПриемки(СтруктураПараметров);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ОснованиеСсылка"   , ОснованиеСсылка);
	СтруктураВозврата.Вставить("ТаблицаУведомлений", ТаблицаУведомлений);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСписокВыбораОснований(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
		
		СтруктураРеквизитов = Новый Структура();
		СтруктураРеквизитов.Вставить("НомерДокумента");
		СтруктураРеквизитов.Вставить("ДатаДокумента");
		СтруктураРеквизитов.Вставить("Операция");
		СтруктураРеквизитов.Вставить("Организация");
		СтруктураРеквизитов.Вставить("МестоДеятельности");
		СтруктураРеквизитов.Вставить("Грузоотправитель");
		СтруктураРеквизитов.Вставить("МестоДеятельностиГрузоотправителя");
		СтруктураРеквизитов.Вставить("ТипДоговора");
		СтруктураРеквизитов.Вставить("ТипОперации");
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтруктураРеквизитов);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерДокумента"                  , Реквизиты.НомерДокумента);
		СтруктураПараметров.Вставить("ДатаДокумента"                   , Реквизиты.ДатаДокумента);
		СтруктураПараметров.Вставить("Операция"                        , Реквизиты.Операция);
		СтруктураПараметров.Вставить("ОрганизацияМДЛП"                 , Реквизиты.Организация);
		СтруктураПараметров.Вставить("МестоДеятельностиОрганизацииМДЛП", Реквизиты.МестоДеятельности);
		СтруктураПараметров.Вставить("КонтрагентМДЛП"                  , Реквизиты.Грузоотправитель);
		СтруктураПараметров.Вставить("МестоДеятельностиКонтрагентаМДЛП", Реквизиты.МестоДеятельностиГрузоотправителя);
		СтруктураПараметров.Вставить("ТипДоговора"                     , Реквизиты.ТипДоговора);
		СтруктураПараметров.Вставить("ТипОперации"                     , Реквизиты.ТипОперации);
		
	Иначе
		
		СтруктураРеквизитов = Новый Структура();
		СтруктураРеквизитов.Вставить("НомерДокумента");
		СтруктураРеквизитов.Вставить("ДатаДокумента");
		СтруктураРеквизитов.Вставить("Операция");
		СтруктураРеквизитов.Вставить("Организация");
		СтруктураРеквизитов.Вставить("МестоДеятельности");
		СтруктураРеквизитов.Вставить("Грузополучатель");
		СтруктураРеквизитов.Вставить("МестоДеятельностиГрузополучателя");
		СтруктураРеквизитов.Вставить("ТипДоговора");
		СтруктураРеквизитов.Вставить("ТипОперации");
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтруктураРеквизитов);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерДокумента"                  , Реквизиты.НомерДокумента);
		СтруктураПараметров.Вставить("ДатаДокумента"                   , Реквизиты.ДатаДокумента);
		СтруктураПараметров.Вставить("Операция"                        , Реквизиты.Операция);
		СтруктураПараметров.Вставить("ОрганизацияМДЛП"                 , Реквизиты.Организация);
		СтруктураПараметров.Вставить("МестоДеятельностиОрганизацииМДЛП", Реквизиты.МестоДеятельности);
		СтруктураПараметров.Вставить("КонтрагентМДЛП"                  , Реквизиты.Грузополучатель);
		СтруктураПараметров.Вставить("МестоДеятельностиКонтрагентаМДЛП", Реквизиты.МестоДеятельностиГрузополучателя);
		СтруктураПараметров.Вставить("ТипДоговора"                     , Реквизиты.ТипДоговора);
		СтруктураПараметров.Вставить("ТипОперации"                     , Реквизиты.ТипОперации);
		
	КонецЕсли;
	
	Возврат ПолучитьТаблицуВыбораОснований(СтруктураПараметров);
	
КонецФункции

Функция ПолучитьТаблицуВыбораУведомленийПриемки(СтруктураПараметров) Экспорт
	
	Организация        = СтруктураПараметров.Организация;
	СтруктурнаяЕдиница = СтруктураПараметров.СтруктурнаяЕдиница;
	Контрагент         = СтруктураПараметров.Контрагент;
	НомерДокумента     = СтруктураПараметров.НомерДокумента;
	ДатаДокумента      = СтруктураПараметров.ДатаДокумента;
	Ссылка             = СтруктураПараметров.Ссылка;
	
	СтруктураОрганизацииМДЛП = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Организация, СтруктурнаяЕдиница, Истина);
	ОрганизацияМДЛП                  = СтруктураОрганизацииМДЛП.Организация;
	МестоДеятельностиОрганизацииМДЛП = СтруктураОрганизацииМДЛП.МестоДеятельности;
	
	СтруктураКонтрагентаМДЛП = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Контрагент, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь);
	КонтрагентМДЛП                   = СтруктураКонтрагентаМДЛП.Организация;
	МестоДеятельностиКонтрагентаМДЛП = СтруктураКонтрагентаМДЛП.МестоДеятельности;
	
	ЭтоКомиссионноеПоступление = Ложь;
	
	Операция = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора);
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.Поступление);
		ЭтоКомиссионноеПоступление = Истина;
	ИначеЕсли ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.Поступление);
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ПоступлениеНаРанееНеЗарегистрированноеМестоДеятельности);
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ВозвратОтПокупателя);
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ВозвратПриостановленныхЛП);
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.Поступление);
		Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ПоступлениеНаРанееНеЗарегистрированноеМестоДеятельности);
		
	ИначеЕсли СтруктураПараметров.Свойство("ЭтоВозврат") И ТипЗнч(СтруктураПараметров.ЭтоВозврат) = Тип("Булево") Тогда
		
		Если СтруктураПараметров.ЭтоВозврат Тогда
			Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ВозвратОтПокупателя);
			Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ВозвратПриостановленныхЛП);
		Иначе
			Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.Поступление);
			Операция.Добавить(Перечисления.ОперацииПриемкиМДЛП.ПоступлениеНаРанееНеЗарегистрированноеМестоДеятельности);
		КонецЕсли;
		
	КонецЕсли;
	
	СписокОснований = Новый СписокЗначений;
	СписокОснований.Добавить(Ссылка);
	СписокОснований.Добавить(Неопределено);
	СписокОснований.Добавить(Документы.ПриходнаяНакладная.ПустаяСсылка());
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ОснованиеСсылка"                 , Ссылка);
	Запрос.УстановитьПараметр("СписокОснований"                 , СписокОснований);
	Запрос.УстановитьПараметр("НомерДокумента"                  , НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента"                   , НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("Операция"                        , Операция);
	Запрос.УстановитьПараметр("ОрганизацияМДЛП"                 , ОрганизацияМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельностиОрганизацииМДЛП", МестоДеятельностиОрганизацииМДЛП);
	Запрос.УстановитьПараметр("КонтрагентМДЛП"                  , КонтрагентМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельностиКонтрагентаМДЛП", МестоДеятельностиКонтрагентаМДЛП);
	Запрос.УстановитьПараметр("ЭтоКомиссионноеПоступление"      , ЭтоКомиссионноеПоступление);
	
	МестоДеятельностиКонтрагентаМДЛППустое = НЕ ЗначениеЗаполнено(МестоДеятельностиКонтрагентаМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельностиКонтрагентаМДЛППустое", МестоДеятельностиКонтрагентаМДЛППустое);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеОПриемкеМДЛП.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА УведомлениеОПриемкеМДЛП.Основание = &ОснованиеСсылка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УжеСопоставлен,
	|	ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.пустаяСсылка)) КАК Статус,
	|	УведомлениеОПриемкеМДЛП.НомерДокумента КАК НомерДокумента,
	|	УведомлениеОПриемкеМДЛП.ДатаДокумента КАК ДатаДокумента,
	|	УведомлениеОПриемкеМДЛП.Номер КАК Номер,
	|	УведомлениеОПриемкеМДЛП.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА УведомлениеОПриемкеМДЛП.НомерДокумента = &НомерДокумента
	|				И УведомлениеОПриемкеМДЛП.ДатаДокумента = &ДатаДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НомерИДатаСоответствует,
	|	УведомлениеОПриемкеМДЛП.СхемаАкцептования КАК СхемаАкцептования
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП КАК УведомлениеОПриемкеМДЛП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО УведомлениеОПриемкеМДЛП.Ссылка = Статусы.Документ
	|ГДЕ
	|	НЕ УведомлениеОПриемкеМДЛП.ПометкаУдаления
	|	И УведомлениеОПриемкеМДЛП.Основание В(&СписокОснований)
	|	И УведомлениеОПриемкеМДЛП.Организация = &ОрганизацияМДЛП
	|	И УведомлениеОПриемкеМДЛП.МестоДеятельности = &МестоДеятельностиОрганизацииМДЛП
	|	И УведомлениеОПриемкеМДЛП.Грузоотправитель = &КонтрагентМДЛП
	|	И ВЫБОР
	|			КОГДА &МестоДеятельностиКонтрагентаМДЛППустое
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УведомлениеОПриемкеМДЛП.МестоДеятельностиГрузоотправителя = &МестоДеятельностиКонтрагентаМДЛП
	|		КОНЕЦ
	|	И УведомлениеОПриемкеМДЛП.Операция В(&Операция)
	|	И ВЫБОР
	|			КОГДА &ЭтоКомиссионноеПоступление
	|				ТОГДА УведомлениеОПриемкеМДЛП.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора)
	|						ИЛИ УведомлениеОПриемкеМДЛП.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПриемкиМДЛП.Поступление)
	|							И УведомлениеОПриемкеМДЛП.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровМДЛП.Комиссия)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуВыбораУведомленийОтгрузки(СтруктураПараметров) Экспорт
	
	Организация        = СтруктураПараметров.Организация;
	СтруктурнаяЕдиница = СтруктураПараметров.СтруктурнаяЕдиница;
	Контрагент         = СтруктураПараметров.Контрагент;
	НомерДокумента     = СтруктураПараметров.НомерДокумента;
	ДатаДокумента      = СтруктураПараметров.ДатаДокумента;
	Ссылка             = СтруктураПараметров.Ссылка;
	
	СтруктураОрганизацииМДЛП = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Организация, СтруктурнаяЕдиница, Истина);
	ОрганизацияМДЛП                  = СтруктураОрганизацииМДЛП.Организация;
	МестоДеятельностиОрганизацииМДЛП = СтруктураОрганизацииМДЛП.МестоДеятельности;
	
	СтруктураКонтрагентаМДЛП = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Контрагент, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь);
	КонтрагентМДЛП                   = СтруктураКонтрагентаМДЛП.Организация;
	МестоДеятельностиКонтрагентаМДЛП = СтруктураКонтрагентаМДЛП.МестоДеятельности;
	
	ЭтоКомиссионныйВозврат = Ложь;
	
	Операция = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.Продажа);
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту Тогда
		Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.ОтгрузкаВРамкахАгентскогоДоговора);
		ЭтоКомиссионныйВозврат = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная")
		И Ссылка.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
		Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.Возврат);
		Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.ВозвратПриостановленныхЛП);
		
	ИначеЕсли СтруктураПараметров.Свойство("ЭтоВозврат") И ТипЗнч(СтруктураПараметров.ЭтоВозврат) = Тип("Булево") Тогда
		
		Если СтруктураПараметров.ЭтоВозврат Тогда
			Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.Возврат);
			Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.ВозвратПриостановленныхЛП);
		Иначе
			Операция.Добавить(Перечисления.ОперацииОтгрузкиМДЛП.Продажа);
		КонецЕсли;
		
	КонецЕсли;
	
	СписокОснований = Новый СписокЗначений;
	СписокОснований.Добавить(Ссылка);
	СписокОснований.Добавить(Неопределено);
	СписокОснований.Добавить(Документы.РасходнаяНакладная.ПустаяСсылка());
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ОснованиеСсылка"                 , Ссылка);
	Запрос.УстановитьПараметр("СписокОснований"                 , СписокОснований);
	Запрос.УстановитьПараметр("НомерДокумента"                  , НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента"                   , НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("Операция"                        , Операция);
	Запрос.УстановитьПараметр("ОрганизацияМДЛП"                 , ОрганизацияМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельностиОрганизацииМДЛП", МестоДеятельностиОрганизацииМДЛП);
	Запрос.УстановитьПараметр("КонтрагентМДЛП"                  , КонтрагентМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельностиКонтрагентаМДЛП", МестоДеятельностиКонтрагентаМДЛП);
	Запрос.УстановитьПараметр("ЭтоКомиссионныйВозврат"          , ЭтоКомиссионныйВозврат);
	
	МестоДеятельностиКонтрагентаМДЛППустое = НЕ ЗначениеЗаполнено(МестоДеятельностиКонтрагентаМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельностиКонтрагентаМДЛППустое", МестоДеятельностиКонтрагентаМДЛППустое);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеОбОтгрузкеМДЛП.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА УведомлениеОбОтгрузкеМДЛП.Основание = &ОснованиеСсылка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УжеСопоставлен,
	|	ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.пустаяСсылка)) КАК Статус,
	|	УведомлениеОбОтгрузкеМДЛП.НомерДокумента КАК НомерДокумента,
	|	УведомлениеОбОтгрузкеМДЛП.ДатаДокумента КАК ДатаДокумента,
	|	УведомлениеОбОтгрузкеМДЛП.Номер КАК Номер,
	|	УведомлениеОбОтгрузкеМДЛП.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА УведомлениеОбОтгрузкеМДЛП.НомерДокумента = &НомерДокумента
	|				И УведомлениеОбОтгрузкеМДЛП.ДатаДокумента = &ДатаДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НомерИДатаСоответствует,
	|	УведомлениеОбОтгрузкеМДЛП.СхемаАкцептования КАК СхемаАкцептования
	|ИЗ
	|	Документ.УведомлениеОбОтгрузкеМДЛП КАК УведомлениеОбОтгрузкеМДЛП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО УведомлениеОбОтгрузкеМДЛП.Ссылка = Статусы.Документ
	|ГДЕ
	|	НЕ УведомлениеОбОтгрузкеМДЛП.ПометкаУдаления
	|	И УведомлениеОбОтгрузкеМДЛП.Основание В(&СписокОснований)
	|	И УведомлениеОбОтгрузкеМДЛП.Организация = &ОрганизацияМДЛП
	|	И УведомлениеОбОтгрузкеМДЛП.МестоДеятельности = &МестоДеятельностиОрганизацииМДЛП
	|	И УведомлениеОбОтгрузкеМДЛП.Грузополучатель = &КонтрагентМДЛП
	|	И ВЫБОР
	|			КОГДА &МестоДеятельностиКонтрагентаМДЛППустое
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УведомлениеОбОтгрузкеМДЛП.МестоДеятельностиГрузополучателя = &МестоДеятельностиКонтрагентаМДЛП
	|		КОНЕЦ
	|	И УведомлениеОбОтгрузкеМДЛП.Операция В(&Операция)
	|	И ВЫБОР
	|			КОГДА &ЭтоКомиссионныйВозврат
	|				ТОГДА УведомлениеОбОтгрузкеМДЛП.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийОтгрузкиМДЛП.Возврат)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуВыбораОснований(СтруктураПараметров) Экспорт
	
	НомерДокумента                   = СтруктураПараметров.НомерДокумента;
	ДатаДокумента                    = СтруктураПараметров.ДатаДокумента;
	Операция                         = СтруктураПараметров.Операция;
	ОрганизацияМДЛП                  = СтруктураПараметров.ОрганизацияМДЛП;
	МестоДеятельностиОрганизацииМДЛП = СтруктураПараметров.МестоДеятельностиОрганизацииМДЛП;
	КонтрагентМДЛП                   = СтруктураПараметров.КонтрагентМДЛП;
	МестоДеятельностиКонтрагентаМДЛП = СтруктураПараметров.МестоДеятельностиКонтрагентаМДЛП;
	ТипДоговора                      = СтруктураПараметров.ТипДоговора;
	ТипОперации                      = СтруктураПараметров.ТипОперации;
	
	СтруктураОрганизации = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиОрганизацииМДЛП, Истина);
	СтруктураКонтрагента = ПолучитьОрганизациюИМестоДеятельности(КонтрагентМДЛП, МестоДеятельностиКонтрагентаМДЛП, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                  , СтруктураОрганизации.Организация);
	Запрос.УстановитьПараметр("МестоДеятельности"            , СтруктураОрганизации.МестоДеятельности);
	Запрос.УстановитьПараметр("Контрагент"                   , СтруктураКонтрагента.Организация);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("НомерДокумента"               , НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента"                , ДатаДокумента);
	
	ЭтоРасход = Ложь;
	ЭтоПриход = Ложь;
	ОперацияЗапасов = Новый СписокЗначений;
	
	Если Операция =  Перечисления.ОперацииПриемкиМДЛП.ВозвратОтПокупателя
		ИЛИ Операция =  Перечисления.ОперацииПриемкиМДЛП.ВозвратПриостановленныхЛП Тогда
		
		ОперацияЗапасов.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя);
		ЭтоПриход = Истина;
		
	ИначеЕсли Операция = Перечисления.ОперацииПриемкиМДЛП.Поступление
		И ТипДоговора <> Перечисления.ТипыДоговоровМДЛП.Комиссия
		ИЛИ Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеНаРанееНеЗарегистрированноеМестоДеятельности Тогда
		
		ОперацияЗапасов.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика);
		ЭтоПриход = Истина;
		
	ИначеЕсли Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора
		ИЛИ Операция = Перечисления.ОперацииПриемкиМДЛП.Поступление
		И ТипДоговора = Перечисления.ТипыДоговоровМДЛП.Комиссия Тогда
		
		ОперацияЗапасов.Добавить(Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию);
		ЭтоПриход = Истина;
		
	ИначеЕсли Операция = Перечисления.ОперацииОтгрузкиМДЛП.Продажа Тогда
		
		ОперацияЗапасов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю);
		ЭтоРасход = Истина;
		
	ИначеЕсли Операция = Перечисления.ОперацииОтгрузкиМДЛП.Возврат
		ИЛИ Операция = Перечисления.ОперацииОтгрузкиМДЛП.ВозвратПриостановленныхЛП Тогда
		
		ОперацияЗапасов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику);
		ЭтоРасход = Истина;
		
	ИначеЕсли Операция = Перечисления.ОперацииОтгрузкиМДЛП.ОтгрузкаВРамкахАгентскогоДоговора
		И ТипОперации = Перечисления.ТипыОперацийОтгрузкиМДЛП.Возврат Тогда
		
		ОперацияЗапасов.Добавить(Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту);
		ЭтоРасход = Истина;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОперацияЗапасов", ОперацияЗапасов);
	
	Если ЭтоПриход Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП КАК УведомлениеОПриемкеМДЛП
		|		ПО ПриходнаяНакладная.Ссылка = УведомлениеОПриемкеМДЛП.Основание
		|ГДЕ
		|	УведомлениеОПриемкеМДЛП.Ссылка ЕСТЬ NULL
		|	И НЕ ПриходнаяНакладная.ПометкаУдаления
		|	И ПриходнаяНакладная.ВидОперации В(&ОперацияЗапасов)
		|	И ПриходнаяНакладная.Номер = &НомерДокумента
		|	И НАЧАЛОПЕРИОДА(ПриходнаяНакладная.Дата, ДЕНЬ) = &ДатаДокумента
		|	И ПриходнаяНакладная.Организация = &Организация
		|	И ПриходнаяНакладная.Контрагент = &Контрагент
		|	И ВЫБОР
		|			КОГДА &ИспользоватьМестаДеятельности
		|				ТОГДА ПриходнаяНакладная.СтруктурнаяЕдиница = &МестоДеятельности
		|						ИЛИ &МестоДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ ПриходнаяНакладная.СтруктурнаяЕдиница.ОрдерныйСклад
		|";
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриходнаяНакладная.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП КАК УведомлениеОПриемкеМДЛП
			|		ПО ПриходнаяНакладная.Ссылка = УведомлениеОПриемкеМДЛП.Основание
			|ГДЕ
			|	УведомлениеОПриемкеМДЛП.Ссылка ЕСТЬ NULL
			|	И НЕ ПриходнаяНакладная.ПометкаУдаления
			|	И ПриходнаяНакладная.ВидОперации В(&ОперацияЗапасов)
			|	И ПриходнаяНакладная.Организация = &Организация
			|	И ПриходнаяНакладная.Контрагент = &Контрагент
			|	И ВЫБОР
			|			КОГДА &ИспользоватьМестаДеятельности
			|				ТОГДА ПриходнаяНакладная.СтруктурнаяЕдиница = &МестоДеятельности
			|						ИЛИ &МестоДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И НЕ ПриходнаяНакладная.СтруктурнаяЕдиница.ОрдерныйСклад
			|";
			Результат = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	ИначеЕсли ЭтоРасход Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтгрузкеМДЛП КАК УведомлениеОбОтгрузкеМДЛП
		|		ПО РасходнаяНакладная.Ссылка = УведомлениеОбОтгрузкеМДЛП.Основание
		|ГДЕ
		|	УведомлениеОбОтгрузкеМДЛП.Ссылка ЕСТЬ NULL
		|	И НЕ РасходнаяНакладная.ПометкаУдаления
		|	И РасходнаяНакладная.ВидОперации В(&ОперацияЗапасов)
		|	И РасходнаяНакладная.Номер = &НомерДокумента
		|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ) = &ДатаДокумента
		|	И РасходнаяНакладная.Организация = &Организация
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И ВЫБОР
		|			КОГДА &ИспользоватьМестаДеятельности
		|				ТОГДА РасходнаяНакладная.СтруктурнаяЕдиница = &МестоДеятельности
		|						ИЛИ &МестоДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ РасходнаяНакладная.СтруктурнаяЕдиница.ОрдерныйСклад
		|";
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходнаяНакладная.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтгрузкеМДЛП КАК УведомлениеОбОтгрузкеМДЛП
			|		ПО РасходнаяНакладная.Ссылка = УведомлениеОбОтгрузкеМДЛП.Основание
			|ГДЕ
			|	УведомлениеОбОтгрузкеМДЛП.Ссылка ЕСТЬ NULL
			|	И НЕ РасходнаяНакладная.ПометкаУдаления
			|	И РасходнаяНакладная.ВидОперации В(&ОперацияЗапасов)
			|	И РасходнаяНакладная.Организация = &Организация
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И ВЫБОР
			|			КОГДА &ИспользоватьМестаДеятельности
			|				ТОГДА РасходнаяНакладная.СтруктурнаяЕдиница = &МестоДеятельности
			|						ИЛИ &МестоДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И НЕ РасходнаяНакладная.СтруктурнаяЕдиница.ОрдерныйСклад
			|";
			Результат = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокВыбораДляСвязыванияПеремещенияТоваров(Ссылка) Экспорт
	
	СписокДокументов = Новый СписокЗначений;
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("СтруктурнаяЕдиница");
	СтруктураРеквизитов.Вставить("СтруктурнаяЕдиницаПолучатель");
	СтруктураРеквизитов.Вставить("Номер");
	СтруктураРеквизитов.Вставить("Дата");
	
	СтруктураПараметров = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтруктураРеквизитов);
	
	Организация                   = СтруктураПараметров.Организация;
	СтруктурнаяЕдиницаОтправитель = СтруктураПараметров.СтруктурнаяЕдиница;
	СтруктурнаяЕдиницаПолучатель  = СтруктураПараметров.СтруктурнаяЕдиницаПолучатель;
	НомерДокумента                = СтруктураПараметров.Номер;
	ДатаДокумента                 = СтруктураПараметров.Дата;
	
	СтруктураОрганизацииМДЛП = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Организация, СтруктурнаяЕдиницаОтправитель, Истина);
	ОрганизацияМДЛП                  = СтруктураОрганизацииМДЛП.Организация;
	МестоДеятельностиОрганизацииМДЛП = СтруктураОрганизацииМДЛП.МестоДеятельности;
	
	СтруктураОрганизацииПолучателяМДЛП = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Организация, СтруктурнаяЕдиницаПолучатель, Истина);
	ОрганизацияПолучательМДЛП                  = СтруктураОрганизацииПолучателяМДЛП.Организация;
	МестоДеятельностиОрганизацииПолучателяМДЛП = СтруктураОрганизацииПолучателяМДЛП.МестоДеятельности;
	
	Если ЗначениеЗаполнено(СтруктураОрганизацииМДЛП.Организация) И ЗначениеЗаполнено(СтруктураОрганизацииПолучателяМДЛП.Организация)
		И НЕ СтруктураОрганизацииМДЛП.ВестиУчетВЭтойИБ И СтруктураОрганизацииПолучателяМДЛП.ВестиУчетВЭтойИБ Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("НомерДокумента"                            , НомерДокумента);
		Запрос.УстановитьПараметр("ДатаДокумента"                             , НачалоДня(ДатаДокумента));
		Запрос.УстановитьПараметр("Операция"                                  , Перечисления.ОперацииПеремещенияМДЛП.ПриходныйОрдер);
		Запрос.УстановитьПараметр("ОрганизацияМДЛП"                           , ОрганизацияМДЛП);
		Запрос.УстановитьПараметр("МестоДеятельностиОрганизацииМДЛП"          , МестоДеятельностиОрганизацииМДЛП);
		Запрос.УстановитьПараметр("МестоДеятельностиОрганизацииПолучателяМДЛП", МестоДеятельностиОрганизацииПолучателяМДЛП);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УведомлениеОПеремещенииМДЛП.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УведомлениеОПеремещенииМДЛП КАК УведомлениеОПеремещенииМДЛП
		|ГДЕ
		|	НЕ УведомлениеОПеремещенииМДЛП.ПометкаУдаления
		|	И УведомлениеОПеремещенииМДЛП.НомерДокумента = &НомерДокумента
		|	И УведомлениеОПеремещенииМДЛП.ДатаДокумента = &ДатаДокумента
		|	И УведомлениеОПеремещенииМДЛП.Организация = &ОрганизацияМДЛП
		|	И УведомлениеОПеремещенииМДЛП.МестоДеятельности = &МестоДеятельностиОрганизацииМДЛП
		|	И УведомлениеОПеремещенииМДЛП.МестоДеятельностиПолучатель = &МестоДеятельностиОрганизацииПолучателяМДЛП
		|	И УведомлениеОПеремещенииМДЛП.Операция = &Операция";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокДокументов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции

Функция СвязатьПеремещениеСУведомлением(ПеремещениеСсылка, УведомлениеСсылка, ТекстСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УведомлениеОбъект = УведомлениеСсылка.ПолучитьОбъект();
	УведомлениеОбъект.Основание             = ПеремещениеСсылка;
	
	Попытка
		УведомлениеОбъект.Записать();
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Не удалось перезаписать уведомление МДЛП:'") + Строка(УведомлениеСсылка);
		ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОшибки;
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСписокВыбораДляСвязыванияУведомленияОПеремещенииТоваров(СтруктураПараметров) Экспорт
	
	НомерДокумента                  = СтруктураПараметров.НомерДокумента;
	ДатаДокумента                   = СтруктураПараметров.ДатаДокумента;
	ОрганизацияМДЛП                 = СтруктураПараметров.ОрганизацияМДЛП;
	МестоДеятельностиМДЛП           = СтруктураПараметров.МестоДеятельностиМДЛП;
	МестоДеятельностиПолучательМДЛП = СтруктураПараметров.МестоДеятельностиПолучательМДЛП;
	ЭтоОрдер                        = СтруктураПараметров.ЭтоОрдер;
	
	СтруктураОрганизации           = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиМДЛП, Истина);
	СтруктураОрганизацииПолучателя = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиПолучательМДЛП, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                  , СтруктураОрганизации.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , СтруктураОрганизации.МестоДеятельности);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиницаПолучатель" , СтруктураОрганизацииПолучателя.МестоДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("НомерДокумента"               , НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента"                , ДатаДокумента);
	Запрос.УстановитьПараметр("ЭтоОрдер"                     , ЭтоОрдер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеЗапасов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПеремещенииМДЛП КАК УведомлениеОПеремещенииМДЛП
	|		ПО ПеремещениеЗапасов.Ссылка = УведомлениеОПеремещенииМДЛП.Основание
	|ГДЕ
	|	НЕ &ЭтоОрдер
	|	И УведомлениеОПеремещенииМДЛП.Ссылка ЕСТЬ NULL
	|	И НЕ ПеремещениеЗапасов.ПометкаУдаления
	|	И ПеремещениеЗапасов.Номер = &НомерДокумента
	|	И НАЧАЛОПЕРИОДА(ПеремещениеЗапасов.Дата, ДЕНЬ) = &ДатаДокумента
	|	И ПеремещениеЗапасов.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА ПеремещениеЗапасов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель = &СтруктурнаяЕдиницаПолучатель
	|						ИЛИ &СтруктурнаяЕдиницаПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивДокументов.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция ПолучитьСписокВыбораДляСвязыванияУведомленияОВыбытииТоваров(СтруктураПараметров) Экспорт
	
	ОрганизацияМДЛП       = СтруктураПараметров.ОрганизацияМДЛП;
	МестоДеятельностиМДЛП = СтруктураПараметров.МестоДеятельностиМДЛП;
	Операция              = СтруктураПараметров.Операция;
	ТипВыводаИзОборота    = СтруктураПараметров.ТипВыводаИзОборота;
	
	СтруктураОрганизации  = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиМДЛП, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                  , СтруктураОрганизации.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , СтруктураОрганизации.МестоДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеЗапасов КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОВыбытииМДЛП КАК Уведомление
	|		ПО Документ.Ссылка = Уведомление.Основание
	|ГДЕ
	|	Уведомление.Ссылка ЕСТЬ NULL
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.Проведен
	|	И Документ.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА Документ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивДокументов.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция ПолучитьСписокВыбораДляСвязыванияУведомленияОбОприходованииМДЛП(СтруктураПараметров) Экспорт
	
	ОрганизацияМДЛП       = СтруктураПараметров.ОрганизацияМДЛП;
	МестоДеятельностиМДЛП = СтруктураПараметров.МестоДеятельностиМДЛП;
	
	СтруктураОрганизации  = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиМДЛП, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                  , СтруктураОрганизации.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , СтруктураОрганизации.МестоДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОприходованиеЗапасов КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП КАК Уведомление
	|		ПО Документ.Ссылка = Уведомление.Основание
	|ГДЕ
	|	Уведомление.Ссылка ЕСТЬ NULL
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.Проведен
	|	И Документ.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА Документ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивДокументов.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция ПолучитьСписокВыбораДляСвязыванияИнвентаризацияПотребительскихУпаковокМДЛП(СтруктураПараметров) Экспорт
	
	ОрганизацияМДЛП       = СтруктураПараметров.ОрганизацияМДЛП;
	МестоДеятельностиМДЛП = СтруктураПараметров.МестоДеятельностиМДЛП;
	
	СтруктураОрганизации  = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиМДЛП, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                  , СтруктураОрганизации.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , СтруктураОрганизации.МестоДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияЗапасов КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияПотребительскихУпаковокМДЛП КАК Уведомление
	|		ПО Документ.Ссылка = Уведомление.Основание
	|ГДЕ
	|	Уведомление.Ссылка ЕСТЬ NULL
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА Документ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивДокументов.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция ПолучитьСписокВыбораДляСвязыванияУведомленияОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП(СтруктураПараметров) Экспорт
	
	ОрганизацияМДЛП       = СтруктураПараметров.ОрганизацияМДЛП;
	МестоДеятельностиМДЛП = СтруктураПараметров.МестоДеятельностиМДЛП;
	
	СтруктураОрганизации  = ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиМДЛП, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                  , СтруктураОрганизации.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"           , СтруктураОрганизации.МестоДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОВыбытииМДЛП КАК Уведомление
	|		ПО Документ.Ссылка = Уведомление.Основание
	|ГДЕ
	|	Уведомление.Ссылка ЕСТЬ NULL
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.Проведен
	|	И Документ.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА Документ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивДокументов.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииФормированияИОтправкиУведомленияОРозничнойПродажеПередПробитиемЧека

Процедура ИзменитьСтатусыУпаковокУведомленияККМОффлайн(ТаблицаКизов, ООРПСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекВерсияСхемы = ИнтеграцияМДЛП.ИспользуемаяВерсияСхемОбмена();
	
	Если НЕ (ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекВерсияСхемы + ".0", "1.29.0") > 0) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаКизов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	вЗапрос = Новый Запрос;
	вЗапрос.УстановитьПараметр("ТаблицаКизов", ТаблицаКизов);
	вЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	вЗапрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКизов.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаКизов.ДоляУпаковки КАК ДоляУпаковки
	|ПОМЕСТИТЬ втНомераУпаковок
	|ИЗ
	|	&ТаблицаКизов КАК ТаблицаКизов";
	
	вЗапрос.Выполнить();
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(вЗапрос.МенеджерВременныхТаблиц, "втНомераУпаковок");
	
	вЗапрос.Текст =
	"ВЫБРАТЬ
	|	втНомераУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(втНомераУпаковок.ДоляУпаковки) КАК ДоляУпаковки,
	|	УпаковкиМДЛП.МестоДеятельности КАК МестоДеятельности
	|ИЗ
	|	втНомераУпаковок КАК втНомераУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
	|		ПО втНомераУпаковок.НомерУпаковки = УпаковкиМДЛП.НомерУпаковки
	|		И втНомераУпаковок.КлючУпаковки = УпаковкиМДЛП.КлючУпаковки
	|ГДЕ
	|	НЕ УпаковкиМДЛП.МестоДеятельности ЕСТЬ NULL
	|	И УпаковкиМДЛП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|
	|СГРУППИРОВАТЬ ПО
	|	УпаковкиМДЛП.МестоДеятельности,
	|	втНомераУпаковок.НомерУпаковки
	|ИТОГИ ПО
	|	МестоДеятельности";
	
	РезультатЗапроса = вЗапрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// +ор интеграция МДЛП
	вТаблицаКизов = Новый ТаблицаЗначений;
	вТаблицаКизов.Колонки.Добавить("НомерУпаковки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(27)));
	вТаблицаКизов.Колонки.Добавить("ДоляУпаковки",  Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(6,5)));
	// -ор интеграция МДЛП
	
	ВыборкаПоместам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоместам.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоместам.МестоДеятельности) Тогда
			Продолжить;
		КонецЕсли;
		
		вТаблицаКизов.Очистить();
		ВыборкаДетальная = ВыборкаПоместам.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			НовыйКиз = вТаблицаКизов.Добавить();
			НовыйКиз.НомерУпаковки = ВыборкаДетальная.НомерУпаковки;
			Если ВыборкаДетальная.ДоляУпаковки > 1 Тогда
				НовыйКиз.ДоляУпаковки = 1;
			Иначе
				НовыйКиз.ДоляУпаковки  = ВыборкаДетальная.ДоляУпаковки;
			КонецЕсли;
		КонецЦикла;
		
		Если вТаблицаКизов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НомераУпаковок.НомерУпаковки КАК НомерУпаковки,
		|	НомераУпаковок.ДоляУпаковки КАК ДоляУпаковки,
		|	ЛОЖЬ КАК ГрупповаяУпаковка,
		|	""НомераУпаковок"" КАК ИмяТабличнойЧасти,
		|	""НомерКиЗ"" КАК ИмяПоля
		|ПОМЕСТИТЬ НомераУпаковок
		|ИЗ
		|	&НомераУпаковок КАК НомераУпаковок";
		
		Запрос.УстановитьПараметр("НомераУпаковок", вТаблицаКизов);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Выполнить();
		
		ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц);
		
		ПараметрыОперации = ИнтеграцияМДЛП.ПараметрыОперацииИзмененияСтатусаУпаковок();
		ПараметрыОперации.ИсходныйСтатус = Перечисления.СтатусыУпаковокМДЛП.ВОбороте;
		ПараметрыОперации.НовыйСтатус    = Перечисления.СтатусыУпаковокМДЛП.ВыбылаИзОборота;
		ПараметрыОперации.Владелец       = Справочники.ОрганизацииМДЛП.ПустаяСсылка();
		
		ПараметрыОперации.ДатаОперации      = ООРПСсылка.Дата;
		ПараметрыОперации.ДокументРезерва   = ООРПСсылка;
		ПараметрыОперации.МестоДеятельности = ВыборкаПоместам.МестоДеятельности;
		
		ИнтеграцияМДЛП.ЗарезервироватьУпаковки(Запрос.МенеджерВременныхТаблиц, ПараметрыОперации);
		ИнтеграцияМДЛП.УстановитьНовыйСтатус(Запрос.МенеджерВременныхТаблиц, ПараметрыОперации);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьСтатусыУпаковокУведомления(ЧекККМСсылка, ТекстСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекВерсияСхемы = ИнтеграцияМДЛП.ИспользуемаяВерсияСхемОбмена();
	
	Если НЕ (ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекВерсияСхемы + ".0", "1.29.0") > 0) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЧекККМСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка.Дата КАК Дата,
	|	Товары.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА Товары.СтруктурнаяЕдиница
	|		ИНАЧЕ Товары.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Дата,
	|	Товары.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА Товары.СтруктурнаяЕдиница
	|		ИНАЧЕ Товары.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Дата КАК Дата,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ИЗ
	|	втТаблица КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО Товары.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (СубъектыОбращенияМДЛП.СобственнаяОрганизация)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА Товары.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			КОНЕЦ)";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("Ссылка", ЧекККМСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Нет данных для изменения статуса'");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Некорректные данные для изменения статуса'");
		Возврат;
	КонецЕсли;
	
	Выборка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЧекККМСсылка);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ПолучитьПризнакКонтролироватьСтатусыКИЗ() Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НомераУпаковок.НомерСтроки КАК НомерСтроки,
		|	НомераУпаковок.НомерКИЗ КАК НомерУпаковки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
		|			ТОГДА ВЫРАЗИТЬ(Товары.Количество / Товары.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК ЧИСЛО(10, 5))
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДоляУпаковки,
		|	ЛОЖЬ КАК ГрупповаяУпаковка,
		|	""НомераУпаковок"" КАК ИмяТабличнойЧасти,
		|	""НомерКиЗ"" КАК ИмяПоля
		|ПОМЕСТИТЬ НомераУпаковок
		|ИЗ
		|	Документ.ЧекККМ.ор_НомераУпаковок КАК НомераУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Запасы КАК Товары
		|		ПО НомераУпаковок.Ссылка = Товары.Ссылка
		|			И НомераУпаковок.ИдентификаторСтроки = Товары.ор_ИдентификаторСтроки
		|ГДЕ
		|	НомераУпаковок.Ссылка = &Ссылка
		|	И НЕ Товары.ор_ИдентификаторСтроки ЕСТЬ NULL
		|	И Товары.ор_СтатусЗаполненияУпаковок <> 0";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НомераУпаковок.НомерСтроки КАК НомерСтроки,
		|	НомераУпаковок.НомерКИЗ КАК НомерУпаковки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
		|			ТОГДА ВЫРАЗИТЬ(Товары.Количество / Товары.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК ЧИСЛО(10, 5))
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДоляУпаковки
		|ПОМЕСТИТЬ втНомераУпаковок
		|ИЗ
		|	Документ.ЧекККМ.ор_НомераУпаковок КАК НомераУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Запасы КАК Товары
		|		ПО НомераУпаковок.Ссылка = Товары.Ссылка
		|			И НомераУпаковок.ИдентификаторСтроки = Товары.ор_ИдентификаторСтроки
		|ГДЕ
		|	НомераУпаковок.Ссылка = &Ссылка
		|	И НЕ Товары.ор_ИдентификаторСтроки ЕСТЬ NULL
		|	И Товары.ор_СтатусЗаполненияУпаковок <> 0";
		
		Запрос.Выполнить();
		ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "втНомераУпаковок");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	втНомераУпаковок.НомерСтроки КАК НомерСтроки,
		|	втНомераУпаковок.НомерУпаковки КАК НомерУпаковки,
		|	втНомераУпаковок.ДоляУпаковки КАК ДоляУпаковки,
		|	ЛОЖЬ КАК ГрупповаяУпаковка,
		|	""НомераУпаковок"" КАК ИмяТабличнойЧасти,
		|	""НомерКиЗ"" КАК ИмяПоля
		|ПОМЕСТИТЬ НомераУпаковок
		|ИЗ
		|	втНомераУпаковок КАК втНомераУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
		|		ПО втНомераУпаковок.НомерУпаковки = УпаковкиМДЛП.НомерУпаковки
		|			И втНомераУпаковок.КлючУпаковки = УпаковкиМДЛП.КлючУпаковки
		|			И УпаковкиМДЛП.МестоДеятельности = &МестоДеятельностиКонтроль
		|ГДЕ
		|	ЕстьNULL(УпаковкиМДЛП.Статус,ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)";
		
		Запрос.УстановитьПараметр("МестоДеятельностиКонтроль", Выборка.МестоДеятельности);
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц);
	
	ПараметрыОперации = ИнтеграцияМДЛП.ПараметрыОперацииИзмененияСтатусаУпаковок();
	ПараметрыОперации.ИсходныйСтатус = Перечисления.СтатусыУпаковокМДЛП.ВОбороте;
	ПараметрыОперации.НовыйСтатус    = Перечисления.СтатусыУпаковокМДЛП.ВыбылаИзОборота;
	ПараметрыОперации.Владелец       = Справочники.ОрганизацииМДЛП.ПустаяСсылка();
	
	ПараметрыОперации.ДатаОперации      = Выборка.Дата;
	ПараметрыОперации.ДокументРезерва   = ЧекККМСсылка;
	ПараметрыОперации.МестоДеятельности = Выборка.МестоДеятельности;
	
	ИнтеграцияМДЛП.ЗарезервироватьУпаковки(Запрос.МенеджерВременныхТаблиц, ПараметрыОперации);
	ИнтеграцияМДЛП.УстановитьНовыйСтатус(Запрос.МенеджерВременныхТаблиц, ПараметрыОперации);
	
КонецПроцедуры

Процедура СоздатьИОтправитьУведомлениеОРозничнойПродаже(ЧекККМСсылка, ТекстСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокУведомлений = СоздатьУведомленияОРозничнойПродажеМДЛП(ЧекККМСсылка, ТекстСообщения, Истина);
	Если СписокУведомлений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Уведомление Из СписокУведомлений Цикл
		
		РезультатОперации = ИнтеграцияМДЛПВызовСервера.ПодготовитьСообщенияКПередаче(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Уведомление.Значение),
				ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюМДЛП.ПередайтеДанные"),,Истина);
				
		Для Каждого СтрокаРезультата Из РезультатОперации.Изменения Цикл
			Если ЗначениеЗаполнено(СтрокаРезультата.ТекстОшибки) Тогда
				ТекстСообщения = ?(ТекстСообщения = "", "", Символы.ПС) + СтрокаРезультата.ТекстОшибки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьУведомленияОРозничнойПродажеМДЛП(ЧекККМСсылка, ТекстСообщения = "", ТолькоПроведенные = Ложь)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокУведомлений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА Товары.СтруктурнаяЕдиница
	|		ИНАЧЕ Товары.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ КАК Склад
	|ПОМЕСТИТЬ втОрганизации
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|		И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА Товары.СтруктурнаяЕдиница
	|		ИНАЧЕ Товары.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.Организация, ЗНАЧЕНИЕ(Справочник.ОрганизацииМДЛП.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ИЗ
	|	втОрганизации КАК втОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО втОрганизации.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА втОрганизации.Склад = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.Организация, ЗНАЧЕНИЕ(Справочник.ОрганизацииМДЛП.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности,
	|	втОрганизации.Склад КАК Склад
	|ИЗ
	|	втОрганизации КАК втОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО втОрганизации.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА втОрганизации.Склад = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			КОНЕЦ)";
	Запрос.УстановитьПараметр("Ссылка", ЧекККМСсылка);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	Результ         = РезультатПакет[1].Выгрузить();
	РезультатСклады = РезультатПакет[2].Выгрузить();
	
	Для Каждого СтрокаИдентификатор Из Результ Цикл
		
		СписокСкладов = Новый СписокЗначений;
		Для Каждого СтрокаСклады Из РезультатСклады Цикл
			Если СтрокаИдентификатор.МестоДеятельности = СтрокаСклады.МестоДеятельности Тогда
				СписокСкладов.Добавить(СтрокаСклады.Склад);
			КонецЕсли;
		КонецЦикла;
		
		УведомлениеОбъект = Документы.УведомлениеОРозничнойПродажеМДЛП.СоздатьДокумент();
		ЗаполнитьУведомлениеОРозничнойПродаже(УведомлениеОбъект, ЧекККМСсылка, СписокСкладов, СтрокаИдентификатор.Организация, СтрокаИдентификатор.МестоДеятельности);
		УведомлениеОбъект.Дата = ТекущаяДата();
		УведомлениеОбъект.УстановитьНовыйНомер();
		
		Попытка
			УведомлениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ ТолькоПроведенные Тогда
			СписокУведомлений.Добавить(УведомлениеОбъект.Ссылка);
		КонецЕсли;
		
		Попытка
			УведомлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ТолькоПроведенные Тогда
				СписокУведомлений.Добавить(УведомлениеОбъект.Ссылка);
			КонецЕсли;
		Исключение
			ТекстСообщения = ?(ТекстСообщения = "", "", Символы.ПС) + НСтр("ru = 'Не удалось провести уведомление ""'") + Строка(УведомлениеОбъект.Ссылка) + """";
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат СписокУведомлений;
	
КонецФункции

Процедура ЗаполнитьУведомлениеОРозничнойПродаже(ДокументОбъект, ДанныеЗаполнения, СписокСкладов, ОрганизацияМДЛП, МестоДеятельностиМДЛП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Ссылка КАК Основание,
	|	ЧекККМ.Номер КАК НомерДокумента,
	|	ЧекККМ.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.Сумма КАК Цена,
	|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	Товары.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	Товары.СуммаСкидкиНаценки КАК СуммаРучнойСкидки,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервичныхУпаковокВоВторичной
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
	|		ПО Товары.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ВЫБОР
	|			КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА Товары.СтруктурнаяЕдиница В (&СписокСкладов)
	|			ИНАЧЕ ЧекККМ.СтруктурнаяЕдиница В (&СписокСкладов)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМор_НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	ЧекККМор_НомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ втНомера
	|ИЗ
	|	Документ.ЧекККМ.ор_НомераУпаковок КАК ЧекККМор_НомераУпаковок
	|ГДЕ
	|	ЧекККМор_НомераУпаковок.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.КоличествоПервичныхУпаковокВоВторичной КАК КоличествоПервичныхУпаковокВоВторичной
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНомера.НомерКИЗ КАК НомерКИЗ,
	|	втНомера.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.Цена КАК Цена,
	|	втТовары.Количество КАК Количество,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	втТовары.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	втТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(втТовары.Упаковка) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА втТовары.КоличествоУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервичныхУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомера КАК втНомера
	|		ПО втТовары.ИдентификаторСтроки = втНомера.ИдентификаторСтроки";
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("СписокСкладов", СписокСкладов);
	
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатШапка  = Результат[0].Выгрузить();
	РезультатТовары = Результат[3].Выгрузить();
	РезультатНомера = Результат[4].Выгрузить();
	РезультатНомераСвернутая = Результат[4].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	ДокументОбъект.Основание         = Шапка.Основание;
	ДокументОбъект.Организация       = ОрганизацияМДЛП;
	ДокументОбъект.МестоДеятельности = МестоДеятельностиМДЛП;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	ИдентификаторДокумента = Новый УникальныйИдентификатор;
	
	НоваяСтрокаДокументапродажи = ДокументОбъект.ДокументыПродажи.Добавить();
	НоваяСтрокаДокументапродажи.ВидДокумента           = Перечисления.ВидыДокументовПродажиМДЛП.Чек;
	НоваяСтрокаДокументапродажи.НомерДокумента         = Шапка.НомерДокумента;
	НоваяСтрокаДокументапродажи.ДатаДокумента          = Шапка.ДатаДокумента;
	НоваяСтрокаДокументапродажи.ИдентификаторДокумента = ИдентификаторДокумента;
	
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ИдентификаторДокумента = ИдентификаторДокумента;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	РезультатНомераСвернутая.Свернуть("ИдентификаторСтроки,СуммаНДС");
	
	Для Каждого СтрокаСвернутая Из РезультатНомераСвернутая Цикл
		
		СуммаНДСОбщая = СтрокаСвернутая.СуммаНДС;
		СуммаНДСРасчетная = 0;
		
		НайденныеСтроки = ДокументОбъект.НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаСвернутая.ИдентификаторСтроки));
		
		КоличествоСтрок      = НайденныеСтроки.Количество();
		КоличествоОбработано = 0;
		
		Если КоличествоСтрок = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			КоличествоОбработано = КоличествоОбработано + 1;
			
			Если КоличествоОбработано = КоличествоСтрок Тогда
				Строка.СуммаНДС = СуммаНДСОбщая - СуммаНДСРасчетная;
			Иначе
				Строка.СуммаНДС = Формат(СуммаНДСОбщая/КоличествоСтрок, "ЧЦ=15; ЧДЦ=2");
				СуммаНДСРасчетная = СуммаНДСРасчетная + Строка.СуммаНДС;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеСтатусУведомления(УведомлениеСсылка) Экспорт
	
	Возврат ИнтеграцияМДЛП.ТекущийСтатусУведомления(УведомлениеСсылка);
	
КонецФункции

Функция ПолучитьРеквизитЕстьМаркируемаяПродукция(ЧекККМСсылка) Экспорт
	
	Возврат ЧекККМСсылка.ор_ЕстьМаркируемаяПродукция;
	
КонецФункции

Процедура ЗаполнитьДанныеШапкиПередПробитиемЧека(ОбщиеПараметры, РеквизитыДокумента, РеквизитыКассыККМ) Экспорт
	
	ДокументСМДЛП = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыДокумента, "ор_ЕстьМаркируемаяПродукция");
	
	Если НЕ ДокументСМДЛП Тогда
		Возврат
	КонецЕсли;
	
	// тег 1084
	ПередаватьДанныеМаркировкиЧерезОФД = ор_ИнтеграцияМДЛП.ПолучитьПризнакПередачиДанныхМаркировкиЧерезОФД()
										И РеквизитыКассыККМ.ор_МДЛПОтправлятьДанныеМаркируемыхТоваровЧерезОФД
										И НЕ РеквизитыДокумента.ОперацияСДенежнымиСредствами
										//И НЕ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат
										И РеквизитыДокумента.ор_ЕстьМаркируемаяПродукция;
	Если ПередаватьДанныеМаркировкиЧерезОФД Тогда
		
		Если ЗначениеЗаполнено(ОбщиеПараметры.Организация) Тогда
			вОрганизация = ОбщиеПараметры.Организация;
		Иначе
			вОрганизация = РеквизитыДокумента.Организация;
		КонецЕсли;
		
		ИдМестаДеятельностиМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(вОрганизация, РеквизитыКассыККМ.СтруктурнаяЕдиница, Истина).Идентификатор;
		
		СтруктураПользователяМДЛП = ИнтеграцияМДЛПКлиентСервер.ОписаниеДанныхПараметраДополнительныйРеквизитПользователяМДЛП();
		СтруктураПользователяМДЛП.ИдентификаторМестаДеятельностиМДЛП = ИдМестаДеятельностиМДЛП;
		
		СтруктураПользователяМДЛП.НомерСерииРецепта = РеквизитыДокумента.ор_НомерСерииРецепта;
		СтруктураПользователяМДЛП.НомерРецепта = РеквизитыДокумента.ор_НомерРецепта;
		СтруктураПользователяМДЛП.ДатаРегистрацииРецепта = РеквизитыДокумента.ор_ДатаРегистрацииРецепта;
		
		СтруктураДополнительныйРеквизитПользователя = ИнтеграцияМДЛПКлиентСервер.СформироватьПараметрДополнительныйРеквизитПользователяМДЛП(СтруктураПользователяМДЛП);
		
		ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование = СтруктураДополнительныйРеквизитПользователя.Наименование;
		ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение     = СтруктураДополнительныйРеквизитПользователя.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСтрокиПередПробитиемЧека(СтрокаПозицииЧека, СтрокаТЧ, ОбщиеПараметры) Экспорт
	
	ЕстьНомерКИЗ = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "НомерКИЗ");
	
	Если ЕстьНомерКИЗ И ЗначениеЗаполнено(СтрокаТЧ.НомерКИЗ) Тогда
		
		ЭтоДробнаяПродажа = Ложь;
		Если ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) И ТипЗнч(СтрокаТЧ.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			ЭтоДробнаяПродажа = Истина;
		КонецЕсли;
		
		ГлобальныйИдентификаторТорговойЕдиницы = Лев(СтрокаТЧ.НомерКИЗ, 14);
		СерийныйНомер                          = Сред(СтрокаТЧ.НомерКИЗ, 15);
		
		СтрокаПозицииЧека.Штрихкод = "(01)" + ГлобальныйИдентификаторТорговойЕдиницы + "(21)" + СерийныйНомер;
		
		// тег 1162
		СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.ТипМаркировки                          = Перечисления.ТипыМаркировкиККТ.ЛекарственныеПрепараты;
		СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы = ГлобальныйИдентификаторТорговойЕдиницы;
		СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.СерийныйНомер                          = СерийныйНомер;
		КодТовара = МенеджерОборудованияМаркировкаКлиентСервер.СформироватьКодТовараДляDataMatrixGS1(ГлобальныйИдентификаторТорговойЕдиницы, СерийныйНомер);
		СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара = КодТовара.РеквизитКодаТовара;
		
		// тег 1191
		СтруктураПредметаРасчетаМДЛП = ИнтеграцияМДЛПКлиентСервер.ОписаниеДанныхПараметраДополнительныйРеквизитПредметаРасчетаМДЛП();
		Если ЭтоДробнаяПродажа Тогда
			СтруктураПредметаРасчетаМДЛП.КоличествоОтпущенныхПервичныхУпаковок           = СтрокаТЧ.Количество;
			СтруктураПредметаРасчетаМДЛП.КоличествоПервичныхУпаковокВМаркируемойУпаковке = СтрокаТЧ.ор_КоличествоПервичныхУпаковок;
		КонецЕсли;
		СтрокаПозицииЧека.ДополнительныйРеквизит = ИнтеграцияМДЛПКлиентСервер.СформироватьПараметрДополнительныйРеквизитПредметаРасчетаМДЛП(СтруктураПредметаРасчетаМДЛП);
		
		// ффд 1.2
		// тег 1260
		
		ИдМестаДеятельностиМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(ОбщиеПараметры.Организация, СтрокаТЧ.СтруктурнаяЕдиница, Истина).Идентификатор;
		
		СтруктураТега1265МДЛП = ИнтеграцияМДЛПКлиентСервер.ОписаниеДанныхПараметраЗначениеОтраслевогоРеквизитаМДЛП();
		СтруктураТега1265МДЛП.ИдентификаторМестаДеятельностиМДЛП = ИдМестаДеятельностиМДЛП;
		
		СтруктураТега1265МДЛП.НомерСерииРецепта = СтрокаТЧ.ор_НомерСерииРецепта;
		СтруктураТега1265МДЛП.НомерРецепта = СтрокаТЧ.ор_НомерРецепта;
		СтруктураТега1265МДЛП.ДатаРегистрацииРецепта = СтрокаТЧ.ор_ДатаРегистрацииРецепта;
		
		СтруктураТега1265МДЛП.ИдентификаторЗапроса      = СтрокаТЧ.РазрешительныйРежимИдентификаторЗапросаГИСМТ;
		СтруктураТега1265МДЛП.ВременнаяМетка            = СтрокаТЧ.РазрешительныйРежимДатаЗапросаГИСМТ;
		СтруктураТега1265МДЛП.ИдентификаторЭкземпляраПО = СтрокаТЧ.РазрешительныйРежимИдентификаторЭкземпляраПО;
		СтруктураТега1265МДЛП.ВерсияБазыЧерногоСписка   = СтрокаТЧ.РазрешительныйРежимВерсияБазы;
		
		ЗначениеТега1265МДЛП = ИнтеграцияМДЛПКлиентСервер.СформироватьПараметрЗначениеОтраслевогоРеквизитаМДЛП(СтруктураТега1265МДЛП);
		СтрокаПозицииЧека.ОтраслевойРеквизит = ИнтеграцияМДЛПКлиентСервер.СформироватьПараметрОтраслевойРеквизитМДЛП(ЗначениеТега1265МДЛП);
		
		// тег 1291
		Если ЭтоДробнаяПродажа Тогда
			СтруктураТега1291МДЛП = ИнтеграцияМДЛПКлиентСервер.ОписаниеДанныхПараметраДробноеКоличествоТовараМДЛП();
			СтруктураТега1291МДЛП.КоличествоОтпущенныхПервичныхУпаковок = СтрокаТЧ.Количество;
			СтруктураТега1291МДЛП.КоличествоПервичныхУпаковокВМаркируемойУпаковке = СтрокаТЧ.ор_КоличествоПервичныхУпаковок;
			СтрокаПозицииЧека.ДробноеКоличество = ИнтеграцияМДЛПКлиентСервер.СформироватьПараметрыДробногоКоличестваТовараМДЛП(СтруктураТега1291МДЛП);
		КонецЕсли;
		
		Если ор_ИнтеграцияМДЛП.ПолучитьПризнакКонтролироватьКодыМаркировкиСредствамиККТ() Тогда
			
			Количество = СтрокаТЧ.Количество * ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТЧ.ЕдиницаИзмерения);
			
			РезультатРаспределенияШтрихкодов = НовыйРезультатРаспределенияШтрихкодовПоТоварам();
			РезультатРаспределенияШтрихкодов.Вставить("Количество",           Количество);
			РезультатРаспределенияШтрихкодов.Вставить("КоличествоУпаковок",   СтрокаТЧ.Количество);
			РезультатРаспределенияШтрихкодов.Вставить("Штрихкод",             СтрокаПозицииЧека.Штрихкод);
			РезультатРаспределенияШтрихкодов.Вставить("ВидПродукции",         Перечисления.ВидыПродукцииИС.ПустаяСсылка());
			РезультатРаспределенияШтрихкодов.Вставить("ВидУпаковки",          Перечисления.ВидыУпаковокИС.Потребительская);
			РезультатРаспределенияШтрихкодов.Вставить("КодМаркировки",        СтрокаПозицииЧека.Штрихкод);
			РезультатРаспределенияШтрихкодов.Вставить("ПолныйКодМаркировки",  СтрокаТЧ.ПолныйКодМаркировки);
			РезультатРаспределенияШтрихкодов.Вставить("СоставКодаМаркировки", Неопределено);
			РезультатРаспределенияШтрихкодов.Вставить("ШтрихкодУпаковки",     Неопределено);
			РезультатРаспределенияШтрихкодов.Вставить("ТипШтрихкода",         Перечисления.ТипыШтрихкодов.GS1_DataMatrix);
			// КодЕдиницыИзмерения не нужно заполнять. Возникает ошибка программирования реквизита 2108.
			РезультатРаспределенияШтрихкодов.Вставить("КодЕдиницыИзмерения",  Неопределено);
			
			РезультатРаспределенияШтрихкодов.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", СтрокаТЧ.РазрешительныйРежимИдентификаторЗапросаГИСМТ);
			РезультатРаспределенияШтрихкодов.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ",          СтрокаТЧ.РазрешительныйРежимДатаЗапросаГИСМТ);
			РезультатРаспределенияШтрихкодов.Вставить("РазрешительныйРежимИдентификаторЭкземпляраПО", СтрокаТЧ.РазрешительныйРежимИдентификаторЭкземпляраПО);
			РезультатРаспределенияШтрихкодов.Вставить("РазрешительныйРежимВерсияБазы",                СтрокаТЧ.РазрешительныйРежимВерсияБазы);
			
			Если ЭтоДробнаяПродажа Тогда
				
				ДробноеКоличествоМДЛП = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДробноеКоличество();
				ДробноеКоличествоМДЛП.Числитель = СтрокаТЧ.Количество;
				ДробноеКоличествоМДЛП.Знаменатель = СтрокаТЧ.ор_КоличествоПервичныхУпаковок;
				
				МераКоличестваМДЛП = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(СтрокаПозицииЧека.КодЕдиницыИзмерения);
				
				ДробнаяПродажаМДЛП = Новый Структура;
				ДробнаяПродажаМДЛП.Вставить("ДробноеКоличествоМДЛП", ДробноеКоличествоМДЛП);
				ДробнаяПродажаМДЛП.Вставить("МераКоличестваМДЛП"   , МераКоличестваМДЛП);
				
				РезультатРаспределенияШтрихкодов.Вставить("ДробнаяПродажаМДЛП", ДробнаяПродажаМДЛП);
				
			КонецЕсли;
			
			СтрокаПозицииЧека.РезультатРаспределенияШтрихкодовМДЛП = РезультатРаспределенияШтрихкодов;
			ПолныйКодМаркировки = СтрокаТЧ.ПолныйКодМаркировки;
			Если ЗначениеЗаполнено(ПолныйКодМаркировки) Тогда
				СтрокаПозицииЧека.ШтрихкодBase64 = ПолныйКодМаркировки;
				СтрокаПозицииЧека.КонтрольнаяМарка = ПолныйКодМаркировки;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ор_ИнтеграцияМДЛП.ПолучитьФлагМаркируемогоТовара(СтрокаТЧ.Номенклатура) Тогда
		
		Если ЗначениеЗаполнено(СтрокаПозицииЧека.Штрихкод) Тогда
			СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(СтрокаПозицииЧека.Штрихкод, Ложь);
			Если СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар") Тогда
				СтрокаПозицииЧека.Штрихкод = Сред(СтруктураМаркировкиМДЛП.Данные.GTIN, 2);
			КонецЕсли;
		КонецЕсли;
		
		// Если товар маркируемый, но в характеристике не стоит признак маркировки 
		// и у товара признак предмета расчета макируемый, то ставим признак предмета расчета обычного товара
		Если СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ Тогда
			СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Новый результат распределения штрихкодов по товарам.
// 
// Возвращаемое значение:
//  Структура - Данные о коде маркировки:
// * Количество                     - Число  - Количество базовых единиц.
// * КоличествоУпаковок             - Число  - Устарел. Количество упаковок.
// * Штрихкод                       - Строка - Строковое представление кода маркиаровки.
// * ВидПродукции                   - ПеречислениеСсылка.ВидыПродукцииИС         - Вид продукции.
// * ВидУпаковки                    - ПеречислениеСсылка.ВидыУпаковокИС          - Вид упаковки.
// * ШтрихкодУпаковки               - СправочникСсылка.ШтрихкодыУпаковокТоваров  - Штрихкод упаковки.
// * КодМаркировки                  - Строка               - Нормализованный код маркировки.
// * ПолныйКодМаркировки            - Строка, Неопределено - Полный код маркировки (base64).
// * СоставКодаМаркировки           - Структура            - Состав кода маркировки.
// * ЧастичноеВыбытие               - Булево               - Признак частичного выбытия части упаковки.
// * ЕмкостьПотребительскойУпаковки - Число                - Знаменатель значения частичного выбытия.
// * ТекстОшибки                    - Строка, Неопределено - Текст ошибки распределения.
// * КодЕдиницыИзмерения            - Строка, Неопределено - Код единицы измерения частично выбытия.
// * ЧастичноеВыбытиеКоличество     - Число, Неопределено  - Числитель частичного выбытия.
// * РазрешительныйРежимИдентификаторЗапросаГИСМТ - ОпределяемыйТип.УникальныйИдентификаторИС - Идентификатор запроса ГИС МТ
// * РазрешительныйРежимДатаЗапросаГИСМТ - Строка - Дата получения идентификатора ГИС МТ в формате timestamp
// * РазрешительныйРежимИдентификаторЭкземпляраПО - ОпределяемыйТип.УникальныйИдентификаторИС - Идентификатор локального модуля ГИС МТ
// * РазрешительныйРежимВерсияБазы - ОпределяемыйТип.УникальныйИдентификаторИС - Идентификатор базы данных локального модуля ГИС МТ.
//
Функция НовыйРезультатРаспределенияШтрихкодовПоТоварам()
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Количество",                                   0);
	ВозвращаемоеЗначение.Вставить("КоличествоПотребительскихУпаковок",            0);
	ВозвращаемоеЗначение.Вставить("КоличествоУпаковок",                           0);
	ВозвращаемоеЗначение.Вставить("Штрихкод",                                     "");
	ВозвращаемоеЗначение.Вставить("ВидПродукции",                                 Неопределено);
	ВозвращаемоеЗначение.Вставить("ВидУпаковки",                                  Неопределено);
	ВозвращаемоеЗначение.Вставить("КодМаркировки",                                Неопределено);
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки",                          Неопределено);
	ВозвращаемоеЗначение.Вставить("СоставКодаМаркировки",                         Неопределено);
	ВозвращаемоеЗначение.Вставить("ШтрихкодУпаковки",                             Неопределено);
	ВозвращаемоеЗначение.Вставить("ТипШтрихкода",                                 Неопределено);
	ВозвращаемоеЗначение.Вставить("ЕмкостьПотребительскойУпаковки",               0);
	ВозвращаемоеЗначение.Вставить("ЧастичноеВыбытие",                             Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                                  Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗапрещеноИгнорироватьОшибку",                  Неопределено);
	ВозвращаемоеЗначение.Вставить("КодЕдиницыИзмерения",                          Неопределено);
	ВозвращаемоеЗначение.Вставить("ЧастичноеВыбытиеКоличество",                   0);
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ",          "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимИдентификаторЭкземпляраПО", "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимВерсияБазы",                "");
	ВозвращаемоеЗначение.Вставить("ЧастичноеВыбытиеОстаток",                      Неопределено);
	ВозвращаемоеЗначение.Вставить("ЧастичноеВыбытиеКомментарий",                  Неопределено);
	ВозвращаемоеЗначение.Вставить("МинимальнаяРозничнаяЦена",                     0);
	ВозвращаемоеЗначение.Вставить("Сумма",                                        0);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЭтоКассаСФФД12(КассаККМ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПодключаемоеОборудование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПодключаемоеОборудование");
	
	Возврат ОборудованиеЧекопечатающиеУстройстваВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ПодключаемоеОборудование);
	
КонецФункции

Процедура ЗаполнитьДанныеРецептаДляККТ105(Объект, ИмяТЧТовары = "Запасы") Экспорт
	
	// Для ккт < 1.2 заполняем данные по рецепту в шапку.
	
	Если ЭтоКассаСФФД12(Объект.КассаККМ) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект[ИмяТЧТовары] Цикл
		Если ЗначениеЗаполнено(Строка.ор_ДатаРегистрацииРецепта) Тогда
			Объект.ор_НомерСерииРецепта      = Строка.ор_НомерСерииРецепта;
			Объект.ор_НомерРецепта           = Строка.ор_НомерРецепта;
			Объект.ор_ДатаРегистрацииРецепта = Строка.ор_ДатаРегистрацииРецепта;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииНовогоРМК

// Заполняет таблицу данными о переданных товарах.
// Таблица должна содержать данные для заполнения табличной части "Товары" обработки "РабочееМестоКассира".
//
// Параметры:
//  МассивТоваров - Массив - массив, в котором содержится список товаров.
//  ТаблицаТовары - ТаблицаЗначений - таблица, в которую необходимо поместить информацию по товарам.
//
Процедура ЗаполнитьТаблицуТовары(ТаблицаТовары, ТекущийВыбор, ЗапретитьВводНомеров = Ложь) Экспорт
	
	Если ЗапретитьВводНомеров Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов") Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ТекущийВыбор.Номенклатура;
	Если ТекущийВыбор.Свойство("Характеристика") Тогда
		Характеристика = ТекущийВыбор.Характеристика;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура)
		И ЗначениеЗаполнено(Характеристика)
		и ПроверитьНоменклатуруМаркировки(Номенклатура)
		и ПроверитьХарактеристикуМаркировки(Характеристика) Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаТовары Цикл
			СтрокаТаблицы.Маркируемый = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбновления

Процедура ЗаполнитьКонтрольСтатусовКИЗПриПробитииЧерезРМК() Экспорт
	
	ТекКонтрольСтатусов = Константы.ор_МДЛПКонтрольСтатусовКИЗПриПробитииЧерезРМК.Получить();
	
	Если НЕ ЗначениеЗаполнено(ТекКонтрольСтатусов) Тогда
		НовыйКонтрольСтатусов = Перечисления.ор_МДЛПВидКонтроляСтатусовКИЗПриПробитииЧерезРМК.Предупреждать;
		Константы.ор_МДЛПКонтрольСтатусовКИЗПриПробитииЧерезРМК.Установить(НовыйКонтрольСтатусов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуНачалаРазрешительногоРежима() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Константы.ор_МДЛПДатаНачалаРазрешительногоРежима.Получить()) Тогда
		Константы.ор_МДЛПДатаНачалаРазрешительногоРежима.Установить(Дата("20250601000000"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьДатуНачалаЛокальногоРазрешительногоРежима() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Константы.ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежима.Получить()) Тогда
		Константы.ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежима.Установить(Дата("20250901000000"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьДатуНачалаДействияТСПИоТ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Константы.ор_МДЛПДатаНачалаДействияТСПИоТ.Получить()) Тогда
		Константы.ор_МДЛПДатаНачалаДействияТСПИоТ.Установить(Дата("20260301000000"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура РазрешительныйРежимМиграцияНастроекМДЛП() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Переносим данные по токена разрешительного режима.
	ПараметрыЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница();
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеКлючаСессии.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.ДанныеКлючаСессииИСМП КАК ДанныеКлючаСессии
	|ГДЕ
	|	ДанныеКлючаСессии.ИмяПараметраСеанса = &ИмяПараметраСеанса
	|");
	
	Запрос.УстановитьПараметр("ИмяПараметраСеанса", ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизации.ИСМПРозница));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		НаборЗаписей = РегистрыСведений.ДанныеКлючаСессииМДЛП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяПараметраКлючаСессии.Установить(ПараметрыЗапроса.ИмяПараметраКлючаСессии, Истина);
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ИмяПараметраКлючаСессии = ПараметрыЗапроса.ИмяПараметраКлючаСессии;
		
		ДанныеКлючаСессии = Новый Соответствие;
		ДанныеИСМП = Выборка.Данные.Получить();
		Если ДанныеИСМП <> Неопределено Тогда
			Для Каждого КлючИЗначение Из ДанныеИСМП Цикл
				ОрганизацияМДЛП = ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(КлючИЗначение.Ключ);
				Если ЗначениеЗаполнено(ОрганизацияМДЛП) Тогда
					ДанныеКлючаСессии.Вставить(ОрганизацияМДЛП, КлючИЗначение.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ЗаписьНабора.Данные = Новый ХранилищеЗначения(ДанныеКлючаСессии);
		
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	// Переносим данные по CDN-площадкам.
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СостоянияCDNПлощадокИСМП.АдресПлощадки КАК АдресПлощадки,
	|	СостоянияCDNПлощадокИСМП.СреднееВремяПроверкиКМ КАК СреднееВремяПроверкиКМ,
	|	СостоянияCDNПлощадокИСМП.СреднееВремяОтвета КАК СреднееВремяОтвета,
	|	СостоянияCDNПлощадокИСМП.ДатаНедоступнаДоУниверсальная КАК ДатаНедоступнаДоУниверсальная,
	|	СостоянияCDNПлощадокИСМП.ДатаОбновленияУниверсальная КАК ДатаОбновленияУниверсальная,
	|	СостоянияCDNПлощадокИСМП.Сервер КАК Сервер,
	|	СостоянияCDNПлощадокИСМП.Порт КАК Порт,
	|	СостоянияCDNПлощадокИСМП.ЗащищенноеСоединение КАК ЗащищенноеСоединение
	|ИЗ
	|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК СостоянияCDNПлощадокИСМП");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.СостоянияCDNПлощадокМДЛП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Записать(Истина);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура КопированиеНастроекЛокальныхМодулейИзПодсистемыИСМП() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Переносим данные по токена разрешительного режима.
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СубъектыОбращенияМДЛП.Организация КАК Организация,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто КАК РабочееМесто,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет КАК Приоритет,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.АдресПодключенияЛМ КАК АдресПодключенияЛМ,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.Логин КАК Логин,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.ОбменНаСервере КАК ОбменНаСервере,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.Таймаут КАК Таймаут,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.СерверПодключенияЛМ КАК СерверПодключенияЛМ,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.ПортПодключенияЛМ КАК ПортПодключенияЛМ,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.ХешСумма КАК ХешСумма
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП КАК НастройкиПодключенияЛокальныхМодулейИСМП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО НастройкиПодключенияЛокальныхМодулейИСМП.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|ГДЕ
	|	СубъектыОбращенияМДЛП.СобственнаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	РабочееМесто,
	|	Приоритет
	|ИТОГИ ПО
	|	Организация,
	                      |	РабочееМесто");
	
	ВыборкаПоОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоОрганизации.Следующий() Цикл
		
		ВыборкаПоРабочемуМесту = ВыборкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоРабочемуМесту.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.СоздатьНаборЗаписей();
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			
			НаборЗаписей.Отбор.Организация.Установить(ВыборкаПоОрганизации.Организация, Истина);
			НаборЗаписей.Отбор.РабочееМесто.Установить(ВыборкаПоРабочемуМесту.РабочееМесто, Истина);
			
			Приоритет = 0;
			СписокАдресов = Новый Массив;
			Выборка = ВыборкаПоРабочемуМесту.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если СписокАдресов.Найти(Выборка.АдресПодключенияЛМ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаписьНабора = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
				ЗаписьНабора.Приоритет = Приоритет;
				Приоритет = Приоритет + 1;
				
				СписокАдресов.Добавить(Выборка.АдресПодключенияЛМ);
				
			КонецЦикла;
			
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				ТекстСообщения = НСтр("ru= 'Не удалось перенести настройки подключения к локальным модулям из подсистемы ИСМП в подсистему МДЛП по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
			КонецПопытки;
			
		КонецЦикла;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПолученияКонстант

Функция ПолучитьПризнакПередачиДанныхМаркировкиЧерезОФД(ЧекККМСсылка = Неопределено) Экспорт
	
	// передача через ОФД отключена
	//Возврат Ложь;
	
	Если ЧекККМСсылка = Неопределено Тогда
		Возврат ПолучитьПризнакВеденияУчетаМаркировки() И Константы.ор_МДЛПОтправлятьДанныеМаркировкиЧерезОФД.Получить();
	Иначе
		Возврат ПолучитьПризнакВеденияУчетаМаркировки() И Константы.ор_МДЛПОтправлятьДанныеМаркировкиЧерезОФД.Получить() И ЧекККМСсылка.КассаККМ.ор_МДЛПОтправлятьДанныеМаркируемыхТоваровЧерезОФД;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПризнакВеденияУчетаМаркировки() Экспорт
	
	Возврат Константы.ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов.Получить();
	
КонецФункции

Функция ПолучитьДатуНачалаМаркировкиТоваров() Экспорт
	
	Возврат Константы.ор_МДЛПДатаНачалаМаркировкиТоваров.Получить();
	
КонецФункции

// Получить дату начала разрешительного режима МДЛП.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаРазрешительногоРежима() Экспорт
	
	Возврат Константы.ор_МДЛПДатаНачалаРазрешительногоРежима.Получить();
	
КонецФункции

// Получить дату начала работы с локальным модулем разрешительного режима МДЛП.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаОфлайнРазрешительногоРежима() Экспорт
	
	Возврат Константы.ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежима.Получить();
	
КонецФункции

// Получить дату начала работы разрешительного режима МДЛП с помощью ТС ПИоТ.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаДействияТСПИоТ() Экспорт
	
	Возврат Константы.ор_МДЛПДатаНачалаДействияТСПИоТ.Получить();
	
КонецФункции

Функция ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций() Экспорт
	
	Возврат Константы.ор_МДЛПИспользоватьМестаДеятельностиОрганизаций.Получить();
	
КонецФункции

Функция ПолучитьПризнакКонтролироватьЗаполнениеТоваровВУведомлениях() Экспорт
	
	Возврат Константы.ор_МДЛПКонтролироватьЗаполнениеТоваровВУведомлениях.Получить();
	
КонецФункции

Функция ПолучитьПризнакКонтролироватьСтатусыКИЗ() Экспорт
	
	КонтрольСтатусовКиз = Константы.ор_МДЛПКонтрольСтатусовКИЗПриПробитииЧерезРМК.Получить();
	
	Возврат КонтрольСтатусовКиз = Перечисления.ор_МДЛПВидКонтроляСтатусовКИЗПриПробитииЧерезРМК.Контролировать;
	
КонецФункции

Функция ПолучитьПризнакПредупреждатьСтатусыКИЗ() Экспорт
	
	КонтрольСтатусовКиз = Константы.ор_МДЛПКонтрольСтатусовКИЗПриПробитииЧерезРМК.Получить();
	
	Возврат КонтрольСтатусовКиз = Перечисления.ор_МДЛПВидКонтроляСтатусовКИЗПриПробитииЧерезРМК.Предупреждать;
	
КонецФункции

Функция ПолучитьПризнакНЕКонтролироватьСтатусыКИЗ() Экспорт
	
	КонтрольСтатусовКиз = Константы.ор_МДЛПКонтрольСтатусовКИЗПриПробитииЧерезРМК.Получить();
	
	Возврат КонтрольСтатусовКиз = Перечисления.ор_МДЛПВидКонтроляСтатусовКИЗПриПробитииЧерезРМК.НеКонтролировать;
	
КонецФункции

Функция ПолучитьПризнакРегистрироватьGTINПриПодбореНомеровУпаковок() Экспорт
	
	Возврат Константы.ор_МДЛПРегистрироватьGTINПриПодбореНомеровУпаковок.Получить();
	
КонецФункции

Функция ПолучитьПризнакКонтролироватьКодыМаркировкиСредствамиККТ() Экспорт
	
	Возврат Константы.ор_МДЛПКонтролироватьКодыМаркировкиСредствамиККТ.Получить();
	
КонецФункции

Функция ПолучитьРежимКонтроляКМНаККТ() Экспорт
	
	Возврат Константы.ор_МДЛПРежимКонтроляКМСредствамиККТ.Получить();
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииСозданияУпаковокМаркируемыхТоваров

Процедура ор_ЗаписатьУпаковкиМаркируемыхТоваровОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.ПриходнаяНакладная")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ОприходованиеЗапасов") Тогда
		ЗаписатьУпаковкиМаркируемыхТоваровПоступление(Источник.Ссылка);
	Иначе
		ЗаписатьУпаковкиМаркируемыхТоваровУведомление(Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьУпаковкиМаркируемыхТоваровПоступление(Поступление)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	НомераУпаковок.НомерКИЗ КАК НомерУпаковки
	|ПОМЕСТИТЬ УпаковкиУведомления
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Поступление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.ОприходованиеЗапасов.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОприходованиеЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Поступление";
	
	Запрос.УстановитьПараметр("Поступление", Поступление);
	
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "УпаковкиУведомления");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиУведомления.Номенклатура КАК Номенклатура,
	|	УпаковкиУведомления.Характеристика КАК Характеристика,
	|	УпаковкиУведомления.НомерУпаковки КАК НомерУпаковки,
	|	УпаковкиМаркируемыхТоваров.Ссылка КАК Упаковка
	|ИЗ
	|	УпаковкиУведомления КАК УпаковкиУведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
	|		ПО (УпаковкиМаркируемыхТоваров.НомерУпаковки = УпаковкиУведомления.НомерУпаковки)
	|			И (УпаковкиМаркируемыхТоваров.КлючУпаковки = УпаковкиУведомления.КлючУпаковки)
	|ГДЕ
	|	(УпаковкиМаркируемыхТоваров.Ссылка ЕСТЬ NULL
	|			ИЛИ УпаковкиМаркируемыхТоваров.Номенклатура <> УпаковкиУведомления.Номенклатура
	|			ИЛИ УпаковкиМаркируемыхТоваров.Характеристика <> УпаковкиУведомления.Характеристика)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ (ЗначениеЗаполнено(Выборка.Номенклатура) И ЗначениеЗаполнено(Выборка.Характеристика)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
			УпаковкаМаркируемогоТоваров = Выборка.Упаковка.ПолучитьОбъект();
		Иначе
			УпаковкаМаркируемогоТоваров = Справочники.ор_МДЛПУпаковкиМаркируемыхТоваров.СоздатьЭлемент();
			УпаковкаМаркируемогоТоваров.НомерУпаковки = Выборка.НомерУпаковки;
		КонецЕсли;
		
		УпаковкаМаркируемогоТоваров.Номенклатура   = Выборка.Номенклатура;
		УпаковкаМаркируемогоТоваров.Характеристика = Выборка.Характеристика;
		
		УпаковкаМаркируемогоТоваров.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьУпаковкиМаркируемыхТоваровУведомление(Уведомление)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	НомераУпаковок.НомерКИЗ КАК НомерУпаковки
	|ПОМЕСТИТЬ УпаковкиУведомления
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (НомераУпаковок.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтверждено))
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтрокиУпаковки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ПО (ТранспортныеУпаковки.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТранспортныеУпаковки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (ТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтверждено))
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.УведомлениеОПеремещенииМДЛП.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПеремещенииМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (НомераУпаковок.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ))
	|			И (НЕ НомераУпаковок.Отклонено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление
	|	И ТаблицаТовары.Ссылка.Операция = &Операция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.УведомлениеОПеремещенииМДЛП.СоставТранспортныхУпаковок КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПеремещенииМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтрокиУпаковки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПеремещенииМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ПО (ТранспортныеУпаковки.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТранспортныеУпаковки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (ТранспортныеУпаковки.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ))
	|			И (НЕ ТранспортныеУпаковки.Отклонено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление
	|	И ТаблицаТовары.Ссылка.Операция = &Операция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (НомераУпаковок.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ))
	|			И (НЕ НомераУпаковок.Отклонено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП.СоставТранспортныхУпаковок КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтрокиУпаковки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ПО (ТранспортныеУпаковки.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТранспортныеУпаковки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (ТранспортныеУпаковки.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ))
	|			И (НЕ ТранспортныеУпаковки.Отклонено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	НомераУпаковок.НомерКИЗ
	|ИЗ
	|	Документ.УведомлениеОПовторномВводеВОборотМДЛП.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПовторномВводеВОборотМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО (НомераУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (НомераУпаковок.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки)
	|			И (НомераУпаковок.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ))
	|			И (НЕ НомераУпаковок.Отклонено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Уведомление";
	
	Запрос.УстановитьПараметр("Уведомление", Уведомление);
	Запрос.УстановитьПараметр("Операция"   , Перечисления.ОперацииПеремещенияМДЛП.ПриходныйОрдер);
	
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "УпаковкиУведомления");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиУведомления.Номенклатура КАК Номенклатура,
	|	УпаковкиУведомления.Характеристика КАК Характеристика,
	|	УпаковкиУведомления.НомерУпаковки КАК НомерУпаковки,
	|	УпаковкиМаркируемыхТоваров.Ссылка КАК Упаковка
	|ИЗ
	|	УпаковкиУведомления КАК УпаковкиУведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
	|		ПО (УпаковкиМаркируемыхТоваров.НомерУпаковки = УпаковкиУведомления.НомерУпаковки)
	|			И (УпаковкиМаркируемыхТоваров.КлючУпаковки = УпаковкиУведомления.КлючУпаковки)
	|ГДЕ
	|	(УпаковкиМаркируемыхТоваров.Ссылка ЕСТЬ NULL
	|			ИЛИ УпаковкиМаркируемыхТоваров.Номенклатура <> УпаковкиУведомления.Номенклатура
	|			ИЛИ УпаковкиМаркируемыхТоваров.Характеристика <> УпаковкиУведомления.Характеристика)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ (ЗначениеЗаполнено(Выборка.Номенклатура) И ЗначениеЗаполнено(Выборка.Характеристика)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
			УпаковкаМаркируемогоТоваров = Выборка.Упаковка.ПолучитьОбъект();
		Иначе
			УпаковкаМаркируемогоТоваров = Справочники.ор_МДЛПУпаковкиМаркируемыхТоваров.СоздатьЭлемент();
			УпаковкаМаркируемогоТоваров.НомерУпаковки = Выборка.НомерУпаковки;
		КонецЕсли;
		
		УпаковкаМаркируемогоТоваров.Номенклатура   = Выборка.Номенклатура;
		УпаковкаМаркируемогоТоваров.Характеристика = Выборка.Характеристика;
		
		УпаковкаМаркируемогоТоваров.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьУпаковкиМаркируемогоТовара(ДанныеУпаковок) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеУпаковок.Номенклатура КАК Номенклатура,
	|	ДанныеУпаковок.Характеристика КАК Характеристика,
	|	ДанныеУпаковок.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ ДанныеУпаковок
	|ИЗ
	|	&ДанныеУпаковок КАК ДанныеУпаковок
	|ГДЕ
	|	НЕ ДанныеУпаковок.ГрупповаяУпаковка";
	
	Запрос.УстановитьПараметр("ДанныеУпаковок", ДанныеУпаковок);
	
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "ДанныеУпаковок");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеУпаковок.Номенклатура КАК Номенклатура,
	|	ДанныеУпаковок.Характеристика КАК Характеристика,
	|	ДанныеУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	УпаковкиМаркируемыхТоваров.Ссылка КАК Упаковка
	|ИЗ
	|	ДанныеУпаковок КАК ДанныеУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
	|		ПО (УпаковкиМаркируемыхТоваров.НомерУпаковки = ДанныеУпаковок.НомерУпаковки)
	|			И (УпаковкиМаркируемыхТоваров.КлючУпаковки = ДанныеУпаковок.КлючУпаковки)
	|ГДЕ
	|	(УпаковкиМаркируемыхТоваров.Ссылка ЕСТЬ NULL
	|			ИЛИ УпаковкиМаркируемыхТоваров.Номенклатура <> ДанныеУпаковок.Номенклатура
	|			ИЛИ УпаковкиМаркируемыхТоваров.Характеристика <> ДанныеУпаковок.Характеристика)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ (ЗначениеЗаполнено(Выборка.Номенклатура) И ЗначениеЗаполнено(Выборка.Характеристика)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
			УпаковкаМаркируемогоТоваров = Выборка.Упаковка.ПолучитьОбъект();
		Иначе
			УпаковкаМаркируемогоТоваров = Справочники.ор_МДЛПУпаковкиМаркируемыхТоваров.СоздатьЭлемент();
			УпаковкаМаркируемогоТоваров.НомерУпаковки = Выборка.НомерУпаковки;
		КонецЕсли;
		
		УпаковкаМаркируемогоТоваров.Номенклатура   = Выборка.Номенклатура;
		УпаковкаМаркируемогоТоваров.Характеристика = Выборка.Характеристика;
		
		УпаковкаМаркируемогоТоваров.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполненияПоОснованию

Функция ТекстЗапросаРасходПриходТовара()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|			ТОГДА Шапка.Номер
	|		ИНАЧЕ Шапка.НомерВходящегоДокумента
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &ОснованиеСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.Организация,
	|	Шапка.Контрагент,
	|	Шапка.СтруктурнаяЕдиница,
	|	Шапка.СуммаВключаетНДС,
	|	Шапка.Дата,
	|	Шапка.ВидОперации
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &ОснованиеСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.Организация,
	|	Значение(Справочник.Контрагенты.ПустаяСсылка),
	|	Шапка.СтруктурнаяЕдиница,
	|	Истина,
	|	Шапка.Дата,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ОприходованиеЗапасов КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &ОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Характеристика.ор_СерияПроизводителя КАК НомерСерии,
	|	Товары.Характеристика.ор_СрокГодности КАК ГоденДо,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Характеристика.ор_СерияПроизводителя,
	|	Товары.Характеристика.ор_СрокГодности,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1
	|ИЗ
	|	Документ.ПриходныйОрдер.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдер.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Характеристика.ор_СерияПроизводителя,
	|	Товары.Характеристика.ор_СрокГодности,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)),
	|	Товары.Сумма,
	|	Товары.СуммаНДС,
	|	Товары.СтавкаНДС,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Характеристика.ор_СерияПроизводителя,
	|	Товары.Характеристика.ор_СрокГодности,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Характеристика.ор_СерияПроизводителя,
	|	Товары.Характеристика.ор_СрокГодности,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)),
	|	Товары.Сумма,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1
	|ИЗ
	|	Документ.ОприходованиеЗапасов.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Цена КАК ЦенаУпаковки,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДСУпаковки,
	|	СоставТранспортныхУпаковок.Номенклатура КАК Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика КАК Характеристика,
	|	СоставТранспортныхУпаковок.Характеристика.ор_СрокГодности КАК ГоденДо,
	|	СоставТранспортныхУпаковок.GTIN КАК GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии КАК НомерСерии,
	|	СоставТранспортныхУпаковок.Количество КАК Количество,
	|	СоставТранспортныхУпаковок.Цена КАК Цена,
	|	СоставТранспортныхУпаковок.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.ПриходнаяНакладная.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.ор_СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|		ПО ТранспортныеУпаковки.Ссылка = СоставТранспортныхУпаковок.Ссылка
	|			И ТранспортныеУпаковки.ИдентификаторСтроки = СоставТранспортныхУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки,
	|	0,
	|	0,
	|	СоставТранспортныхУпаковок.Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика,
	|	СоставТранспортныхУпаковок.Характеристика.ор_СрокГодности,
	|	СоставТранспортныхУпаковок.GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии,
	|	СоставТранспортныхУпаковок.Количество,
	|	0,
	|	0
	|ИЗ
	|	Документ.ПриходныйОрдер.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдер.ор_СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|		ПО ТранспортныеУпаковки.Ссылка = СоставТранспортныхУпаковок.Ссылка
	|			И ТранспортныеУпаковки.ИдентификаторСтроки = СоставТранспортныхУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Цена,
	|	ТранспортныеУпаковки.СуммаНДС,
	|	СоставТранспортныхУпаковок.Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика,
	|	СоставТранспортныхУпаковок.Характеристика.ор_СрокГодности,
	|	СоставТранспортныхУпаковок.GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии,
	|	СоставТранспортныхУпаковок.Количество,
	|	СоставТранспортныхУпаковок.Цена,
	|	СоставТранспортныхУпаковок.СуммаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.ор_СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|		ПО ТранспортныеУпаковки.Ссылка = СоставТранспортныхУпаковок.Ссылка
	|			И ТранспортныеУпаковки.ИдентификаторСтроки = СоставТранспортныхУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки,
	|	0,
	|	0,
	|	СоставТранспортныхУпаковок.Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика,
	|	СоставТранспортныхУпаковок.Характеристика.ор_СрокГодности,
	|	СоставТранспортныхУпаковок.GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии,
	|	СоставТранспортныхУпаковок.Количество,
	|	0,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|		ПО ТранспортныеУпаковки.Ссылка = СоставТранспортныхУпаковок.Ссылка
	|			И ТранспортныеУпаковки.ИдентификаторСтроки = СоставТранспортныхУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.НомерСерии КАК НомерСерии,
	|	втТовары.ГоденДо КАК ГоденДо,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.СтавкаНДС КАК СтавкаНДС,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.НомерСерии,
	|	втТовары.ГоденДо,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.Цена,
	|	втТовары.СуммаНДС,
	|	втТовары.СтавкаНДС,
	|	втТовары.Сумма,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.ЦенаУпаковки КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДСУпаковки КАК СуммаНДС
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортныеУпаковки.НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки,
	|	ТранспортныеУпаковки.ЦенаУпаковки,
	|	ТранспортныеУпаковки.СуммаНДСУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.Номенклатура КАК Номенклатура,
	|	ТранспортныеУпаковки.Характеристика КАК Характеристика,
	|	ТранспортныеУпаковки.ГоденДо КАК ГоденДо,
	|	ТранспортныеУпаковки.GTIN КАК GTIN,
	|	ТранспортныеУпаковки.НомерСерии КАК НомерСерии,
	|	ТранспортныеУпаковки.Количество КАК Количество,
	|	ТранспортныеУпаковки.Цена КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДС,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	НЕ ТранспортныеУпаковки.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ОснованиеСсылка
	|	И &ЭтоОрдер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)),
	|	Товары.Сумма,
	|	Товары.СуммаНДС,
	|	Товары.СтавкаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ОснованиеСсылка
	|	И &ЭтоОрдер";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаполнитьУведомлениеОбОприходованииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Поступление = ПолучитьПоступлениеТоваровПоЗаказуПоставщику(ДанныеЗаполнения.ДокументОснование);
			Если Поступление = Неопределено Тогда
				Возврат;
			Иначе
				ОснованиеСсылка = Поступление;
			КонецЕсли;
		Иначе
			ОснованиеСсылка = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
		ЭтоОрдер = Истина;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		ОснованиеСсылка = ДанныеЗаполнения.ДокументОснование;
		ЭтоОрдер = Истина;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеЗапасов") Тогда
		ОснованиеСсылка = ДанныеЗаполнения;
		// для расчета сумм НДС, т.к. в оприходовании их нет
		ЭтоОрдер = Истина;
	Иначе
		ОснованиеСсылка = ДанныеЗаполнения;
		ЭтоОрдер = Ложь;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ОснованиеСсылка, Метаданные.Документы.УведомлениеОбОприходованииМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРасходПриходТовара();
	Запрос.УстановитьПараметр("СписокНомеровУпаковок" , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ОснованиеСсылка"       , ОснованиеСсылка);
	Запрос.УстановитьПараметр("ЭтоОрдер"              , ЭтоОрдер);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	РезультатСоставТранспортныхУпаковок = Результат[6].Выгрузить();
	РезультатТоварыДляОрдера            = Результат[7].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Основание = ОснованиеСсылка;
	
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
		ДокументОбъект.Операция = Перечисления.ОперацииОприходованияМДЛП.ВозвратОтПокупателя;
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ОприходованиеЗапасов") Тогда
		ДокументОбъект.Операция = Перечисления.ОперацииОприходованияМДЛП.Пересорт;
	Иначе
		ДокументОбъект.Операция = Перечисления.ОперацииОприходованияМДЛП.Поступление;
	КонецЕсли;
	
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
		ДокументОбъект.ТипДоговора = Перечисления.ТипыДоговоровМДЛП.Комиссия;
	Иначе
		ДокументОбъект.ТипДоговора = Перечисления.ТипыДоговоровМДЛП.КупляПродажа;
	КонецЕсли;
	
	ДокументОбъект.ИсточникФинансирования = Перечисления.ИсточникиФинансированияМДЛП.СобственныеСредства;
	
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	СтруктураКонтрагентаМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Контрагент, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь);
	
	ДокументОбъект.Организация                        = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности                  = СтруктураОрганизацииМДЛП.МестоДеятельности;
	ДокументОбъект.Грузоотправитель                   = СтруктураКонтрагентаМДЛП.Организация;
	ДокументОбъект.МестоДеятельностиГрузоотправителя  = СтруктураКонтрагентаМДЛП.МестоДеятельности;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество
			ИЛИ ЭтоОрдер Тогда
			
			Если ЭтоОрдер Тогда
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
				СтруктураПоиска.Вставить("Упаковка", Строка.Упаковка);
				
				НайденныеСтроки = РезультатТоварыДляОрдера.НайтиСтроки(СтруктураПоиска);
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					НоваяСтрока.Цена = НайденнаяСтрока.Цена;
					Строка.СтавкаНДС = НайденнаяСтрока.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
			
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Строка.СтавкаНДС);
			
			НоваяСтрока.СуммаНДС = ?(Шапка.СуммаВключаетНДС, 
									  НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
									  НоваяСтрока.Сумма * СтавкаНДС / 100);
			
		КонецЕсли;
		
		Если НЕ Шапка.СуммаВключаетНДС И НоваяСтрока.СуммаНДС <> 0 Тогда
			
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			НоваяСтрока.Цена  = Окр(НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатСоставТранспортныхУпаковок Цикл
		НоваяСтрока = ДокументОбъект.СоставТранспортныхУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		
		Если НЕ Шапка.СуммаВключаетНДС И НоваяСтрока.СуммаНДС <> 0 Тогда
			
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			НоваяСтрока.Цена  = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество, 2);
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОПриемеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Поступление = ПолучитьПоступлениеТоваровПоЗаказуПоставщику(ДанныеЗаполнения.ДокументОснование);
			Если Поступление = Неопределено Тогда
				Возврат;
			Иначе
				ОснованиеСсылка = Поступление;
			КонецЕсли;
		Иначе
			ОснованиеСсылка = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
		ЭтоОрдер = Истина;
	Иначе
		ОснованиеСсылка = ДанныеЗаполнения;
		ЭтоОрдер = Ложь;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ОснованиеСсылка, Метаданные.Документы.УведомлениеОПриемкеМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРасходПриходТовара();
	Запрос.УстановитьПараметр("СписокНомеровУпаковок" , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ОснованиеСсылка"       , ОснованиеСсылка);
	Запрос.УстановитьПараметр("ЭтоОрдер"              , ЭтоОрдер);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	РезультатСоставТранспортныхУпаковок = Результат[6].Выгрузить();
	РезультатТоварыДляОрдера            = Результат[7].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Основание = ОснованиеСсылка;
	
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
		ДокументОбъект.Операция = Перечисления.ОперацииПриемкиМДЛП.ВозвратОтПокупателя;
	Иначе
		ДокументОбъект.Операция = Перечисления.ОперацииПриемкиМДЛП.Поступление;
	КонецЕсли;
	
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
		ДокументОбъект.Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора;
		ДокументОбъект.ТипОперации = Перечисления.ТипыОперацийОтгрузкиМДЛП.Продажа;
	Иначе
		ДокументОбъект.ТипДоговора = Перечисления.ТипыДоговоровМДЛП.КупляПродажа;
	КонецЕсли;
	
	ДокументОбъект.ИсточникФинансирования = Перечисления.ИсточникиФинансированияМДЛП.СобственныеСредства;
	ДокументОбъект.СхемаАкцептования      = Перечисления.СхемыАкцептованияМДЛП.ОбратныйПорядок;
	
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	СтруктураКонтрагентаМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Контрагент, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь);
	
	ДокументОбъект.Организация                        = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности                  = СтруктураОрганизацииМДЛП.МестоДеятельности;
	ДокументОбъект.Грузоотправитель                   = СтруктураКонтрагентаМДЛП.Организация;
	ДокументОбъект.МестоДеятельностиГрузоотправителя  = СтруктураКонтрагентаМДЛП.МестоДеятельности;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество
			ИЛИ ЭтоОрдер Тогда
			
			Если ЭтоОрдер Тогда
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
				СтруктураПоиска.Вставить("Упаковка", Строка.Упаковка);
				
				НайденныеСтроки = РезультатТоварыДляОрдера.НайтиСтроки(СтруктураПоиска);
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					НоваяСтрока.Цена = НайденнаяСтрока.Цена;
					Строка.СтавкаНДС = НайденнаяСтрока.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
			
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Строка.СтавкаНДС);
			
			НоваяСтрока.СуммаНДС = ?(Шапка.СуммаВключаетНДС, 
									  НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
									  НоваяСтрока.Сумма * СтавкаНДС / 100);
			
		КонецЕсли;
		
		Если НЕ Шапка.СуммаВключаетНДС И НоваяСтрока.СуммаНДС <> 0 Тогда
			
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			НоваяСтрока.Цена  = Окр(НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатСоставТранспортныхУпаковок Цикл
		НоваяСтрока = ДокументОбъект.СоставТранспортныхУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		
		Если НЕ Шапка.СуммаВключаетНДС И НоваяСтрока.СуммаНДС <> 0 Тогда
			
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			НоваяСтрока.Цена  = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораМДЛП.НеВыполнялось;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОбОтгрузкеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		ОснованиеСсылка = ДанныеЗаполнения.ДокументОснование;
		ЭтоОрдер = Истина;
	Иначе
		ОснованиеСсылка = ДанныеЗаполнения;
		ЭтоОрдер = Ложь;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ОснованиеСсылка, Метаданные.Документы.УведомлениеОбОтгрузкеМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРасходПриходТовара();
	Запрос.УстановитьПараметр("СписокНомеровУпаковок" , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ОснованиеСсылка"       , ОснованиеСсылка);
	Запрос.УстановитьПараметр("ЭтоОрдер"              , ЭтоОрдер);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	РезультатСоставТранспортныхУпаковок = Результат[6].Выгрузить();
	РезультатТоварыДляОрдера            = Результат[7].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Основание = ОснованиеСсылка;
	
	Если Шапка.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту Тогда
		ДокументОбъект.Операция = Перечисления.ОперацииОтгрузкиМДЛП.ОтгрузкаВРамкахАгентскогоДоговора;
		ДокументОбъект.ТипОперации = Перечисления.ТипыОперацийОтгрузкиМДЛП.Возврат;
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
		ДокументОбъект.Операция = Перечисления.ОперацииОтгрузкиМДЛП.Возврат;
		ДокументОбъект.ТипОперации = Перечисления.ТипыОперацийОтгрузкиМДЛП.Возврат;
	Иначе
		ДокументОбъект.Операция = Перечисления.ОперацииОтгрузкиМДЛП.Продажа;
		ДокументОбъект.ТипОперации = Перечисления.ТипыОперацийОтгрузкиМДЛП.Продажа;
	КонецЕсли;
	
	ДокументОбъект.ТипДоговора            = Перечисления.ТипыДоговоровМДЛП.КупляПродажа;
	ДокументОбъект.ИсточникФинансирования = Перечисления.ИсточникиФинансированияМДЛП.СобственныеСредства;
	ДокументОбъект.СхемаАкцептования      = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок;
	
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	СтруктураКонтрагентаМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Контрагент, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь);
	
	ДокументОбъект.Организация                      = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности                = СтруктураОрганизацииМДЛП.МестоДеятельности;
	ДокументОбъект.Грузополучатель                  = СтруктураКонтрагентаМДЛП.Организация;
	ДокументОбъект.МестоДеятельностиГрузополучателя = СтруктураКонтрагентаМДЛП.МестоДеятельности;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество
			ИЛИ ЭтоОрдер Тогда
			
			Если ЭтоОрдер Тогда
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
				СтруктураПоиска.Вставить("Упаковка", Строка.Упаковка);
				
				НайденныеСтроки = РезультатТоварыДляОрдера.НайтиСтроки(СтруктураПоиска);
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					НоваяСтрока.Цена = НайденнаяСтрока.Цена;
					Строка.СтавкаНДС = НайденнаяСтрока.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
			
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Строка.СтавкаНДС);
			
			НоваяСтрока.СуммаНДС = ?(Шапка.СуммаВключаетНДС, 
									  НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
									  НоваяСтрока.Сумма * СтавкаНДС / 100);
			
		КонецЕсли;
		
		Если НЕ Шапка.СуммаВключаетНДС И НоваяСтрока.СуммаНДС <> 0 Тогда
			
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			НоваяСтрока.Цена  = Окр(НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатСоставТранспортныхУпаковок Цикл
		НоваяСтрока = ДокументОбъект.СоставТранспортныхУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если НЕ Шапка.СуммаВключаетНДС И НоваяСтрока.СуммаНДС <> 0 Тогда
			
			Сумма = Строка.Сумма + Строка.СуммаНДС;
			НоваяСтрока.Цена  = Окр(Сумма / Строка.Количество, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛППоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		ОснованиеСсылка = ДанныеЗаполнения.ДокументОснование;
		ЭтоОрдер = Истина;
	Иначе
		ОснованиеСсылка = ДанныеЗаполнения;
		ЭтоОрдер = Ложь;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ОснованиеСсылка, Метаданные.Документы.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Номер КАК НомерДокумента,
	|	Шапка.Дата КАК ДатаДокумента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &ОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервичныхУпаковокВоВторичной,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервичныхУпаковок,
	|	1 КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	Товары.ор_ИдентификаторСтроки,
	|	НомераУпаковок.НомерКИЗ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	1
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.СтавкаНДС КАК СтавкаНДС,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.КоличествоПервичныхУпаковокВоВторичной КАК КоличествоПервичныхУпаковокВоВторичной,
	|	СУММА(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.Цена,
	|	втТовары.СуммаНДС,
	|	втТовары.СтавкаНДС,
	|	втТовары.Сумма,
	|	втТовары.КоличествоПервичныхУпаковокВоВторичной,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ОснованиеСсылка
	|	И &ЭтоОрдер";
	Запрос.УстановитьПараметр("СписокНомеровУпаковок" , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ОснованиеСсылка"       , ОснованиеСсылка);
	Запрос.УстановитьПараметр("ЭтоОрдер"              , ЭтоОрдер);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка           = Результат[0].Выгрузить();
	РезультатТовары          = Результат[2].Выгрузить();
	РезультатНомера          = Результат[3].Выгрузить();
	РезультатТоварыДляОрдера = Результат[4].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	ДокументОбъект.Основание = ОснованиеСсылка;
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	СтруктураКонтрагентаМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Контрагент, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь);
	
	ДокументОбъект.Организация            = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности      = СтруктураОрганизацииМДЛП.МестоДеятельности;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	ИдентификаторДокумента = Новый УникальныйИдентификатор;
	
	НоваяСтрокаДокументапродажи = ДокументОбъект.ДокументыПродажи.Добавить();
	НоваяСтрокаДокументапродажи.НомерДокумента         = Шапка.НомерДокумента;
	НоваяСтрокаДокументапродажи.ДатаДокумента          = Шапка.ДатаДокумента;
	НоваяСтрокаДокументапродажи.ИдентификаторДокумента = ИдентификаторДокумента;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		Если Строка.КоличествоНомеровУпаковок <> Строка.Количество
			ИЛИ ЭтоОрдер Тогда
			
			Если ЭтоОрдер Тогда
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
				СтруктураПоиска.Вставить("Упаковка", Строка.Упаковка);
				
				НайденныеСтроки = РезультатТоварыДляОрдера.НайтиСтроки(СтруктураПоиска);
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					Строка.Цена = НайденнаяСтрока.Цена;
					Строка.СтавкаНДС = НайденнаяСтрока.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
			Строка.Количество = Строка.КоличествоНомеровУпаковок;
			Строка.КоличествоУпаковок = Строка.Количество/ПолучитьКоэффициентЕдиницыИзмерения(Строка.Упаковка);
			
			Строка.Сумма = Строка.Цена * Строка.КоличествоУпаковок;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Строка.СтавкаНДС);
			
			Строка.СуммаНДС = ?(Шапка.СуммаВключаетНДС, 
				Строка.Сумма - (Строка.Сумма) / ((СтавкаНДС + 100) / 100),
				Строка.Сумма * СтавкаНДС / 100);
			
		КонецЕсли;
		
		Если НЕ Шапка.СуммаВключаетНДС И Строка.СуммаНДС <> 0 Тогда
			
			Строка.Сумма = Строка.Сумма + Строка.СуммаНДС;
			Строка.Цена  = Окр(Строка.Сумма / Строка.КоличествоУпаковок, 2);
			
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.ИдентификаторДокумента = ИдентификаторДокумента;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		
		НайденныеСтроки = РезультатТовары.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Цена = НайденнаяСтрока.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	ИменаКолонок = "ИдентификаторСтроки,СуммаНДС";
	РезультатНомераСвернутая = РезультатТовары.Скопировать(,ИменаКолонок);
	РезультатНомераСвернутая.Свернуть(ИменаКолонок);
	Для Каждого СтрокаСвернутая Из РезультатНомераСвернутая Цикл
		
		СуммаНДСОбщая = СтрокаСвернутая.СуммаНДС;
		СуммаНДСРасчетная = 0;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИдентификаторСтроки", СтрокаСвернутая.ИдентификаторСтроки);
		НайденныеСтроки = ДокументОбъект.НомераУпаковок.НайтиСтроки(СтруктураПоиска);
		
		КоличествоСтрок      = НайденныеСтроки.Количество();
		КоличествоОбработано = 0;
		
		Если КоличествоСтрок = 1 Тогда
			НайденныеСтроки[0].СуммаНДС = СуммаНДСОбщая;
			Продолжить;
		КонецЕсли;
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			КоличествоОбработано = КоличествоОбработано + 1;
			
			Если КоличествоОбработано = КоличествоСтрок Тогда
				Строка.СуммаНДС = СуммаНДСОбщая - СуммаНДСРасчетная;
			Иначе
				Строка.СуммаНДС = Формат(СуммаНДСОбщая/КоличествоСтрок, "ЧЦ=15; ЧДЦ=2");
				СуммаНДСРасчетная = СуммаНДСРасчетная + Строка.СуммаНДС;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОВыбытииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ДанныеЗаполнения, Метаданные.Документы.УведомлениеОВыбытииМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Номер КАК НомерДокумента,
	|	Шапка.Дата КАК ДатаДокумента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.СписаниеЗапасов КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.Организация,
	|	Шапка.СтруктурнаяЕдиница
	|ИЗ
	|	Документ.ор_ИзготовлениеЛекарственныхФорм КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.Организация,
	|	Шапка.СтруктурнаяЕдиница
	|ИЗ
	|	Документ.КомплектацияЗапасов КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеровУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ор_КоличествоПервичныхУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.СписаниеЗапасов.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	Документ.ор_ИзготовлениеЛекарственныхФорм.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ор_ИзготовлениеЛекарственныхФорм.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	Документ.КомплектацияЗапасов.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровУпаковок)
	|;
	|
	// 2
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.СписаниеЗапасов.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В(&СписокНомеровУпаковок)
	|;
	|
	// 3 товары
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Сумма(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок,
	|	втТовары.ор_КоличествоПервичныхУпаковок КАК ор_КоличествоПервичныхУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.ИдентификаторСтроки,
	|	втТовары.ор_КоличествоПервичныхУпаковок
	|;
	|
	// 4 номера упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	// 5 танспортные упаковки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки
	|";
	
	Запрос.УстановитьПараметр("СписокНомеровУпаковок"        , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                       , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Операция = Перечисления.ОперацииВыбытияМДЛП.ВыводПоРазличнымПричинам;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КомплектацияЗапасов") Тогда
		ДокументОбъект.ТипВыводаИзОборота = Перечисления.ВидыВыводаИзОборотаМДЛП.ПроизводствоМедицинскихИзделий;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ор_ИзготовлениеЛекарственныхФорм") Тогда
		ДокументОбъект.ТипВыводаИзОборота = Перечисления.ВидыВыводаИзОборотаМДЛП.ПроизводствоМедицинскихПрепаратов;
	КонецЕсли;
	
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	ДокументОбъект.Организация       = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности = СтруктураОрганизацииМДЛП.МестоДеятельности;
	
	ДокументОбъект.Основание = ДанныеЗаполнения;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		СписаниеБлистера = ЗначениеЗаполнено(Строка.Упаковка) И Строка.Количество < Строка.КоличествоУпаковок;
		
		Если НЕ СписаниеБлистера И Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
		КонецЕсли;
		
		Если СписаниеБлистера Тогда
			НоваяСтрока.КоличествоПервичныхУпаковокВоВторичной = Строка.ор_КоличествоПервичныхУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Если ЗначениеЗаполнено(Строка.Упаковка) И Строка.Количество < Строка.КоличествоУпаковок Тогда
			НоваяСтрока.КоличествоПервичныхУпаковок = Строка.КоличествоУпаковок;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеПередачеНаУничтожениеПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ДанныеЗаполнения, Метаданные.Документы.УведомлениеОПередачеНаУничтожениеМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Номер КАК НомерДокумента,
	|	Шапка.Дата КАК ДатаДокумента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.СписаниеЗапасов КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.СписаниеЗапасов.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровУпаковок)
	|;
	|
	// 2
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.СписаниеЗапасов.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В(&СписокНомеровУпаковок)
	|;
	|
	// 3 товары
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Сумма(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	// 4 номера упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	// 5 танспортные упаковки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки
	|";
	
	Запрос.УстановитьПараметр("СписокНомеровУпаковок"        , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                       , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	ДокументОбъект.Организация       = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности = СтруктураОрганизацииМДЛП.МестоДеятельности;
	
	ДокументОбъект.Основание = ДанныеЗаполнения;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОПовторномВводеВОборотПоОснованию(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ДанныеЗаполнения, Метаданные.Документы.УведомлениеОПовторномВводеВОборотМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Номер КАК НомерДокумента,
	|	Шапка.Дата КАК ДатаДокумента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.ОприходованиеЗапасов КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ОприходованиеЗапасов.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровУпаковок)
	|;
	|
	// 2 товары
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Сумма(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	// 3 номера упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|";
	
	Запрос.УстановитьПараметр("СписокНомеровУпаковок"        , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"                       , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[2].Выгрузить();
	РезультатНомера                     = Результат[3].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	СтруктураОрганизацииМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	ДокументОбъект.Организация       = СтруктураОрганизацииМДЛП.Организация;
	ДокументОбъект.МестоДеятельности = СтруктураОрганизацииМДЛП.МестоДеятельности;
	
	ДокументОбъект.Основание = ДанныеЗаполнения;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОПеремещенииПоОснованию(ДокументОбъект, ДанныеЗаполнения, ДокументОрдера, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ДанныеЗаполнения, Метаданные.Документы.УведомлениеОПеремещенииМДЛП);
	
	СписокОрдеров = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ДокументОрдера) Тогда
		СписокОрдеров.Добавить(ДокументОрдера);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("ОрдерныйСклад", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, ЗапрашиваемыеРеквизиты);
		
		Если ЗначенияРеквизитов.ОрдерныйСклад Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходныйОрдер.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РасходныйОрдер КАК РасходныйОрдер
			|ГДЕ
			|	РасходныйОрдер.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
			
			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					СписокОрдеров.Добавить(Выборка.Ссылка);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Номер КАК НомерДокумента,
	|	Шапка.Дата КАК ДатаДокумента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Шапка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ор_ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок,
	|	НомераУпаковок.НомерКИЗ,
	|	1
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка В (&СписокОрдеров)
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.ПеремещениеЗапасов.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокНомеровУпаковок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки
	|ИЗ
	|	Документ.РасходныйОрдер.ор_ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка В (&СписокОрдеров)
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки";
	
	Запрос.УстановитьПараметр("СписокНомеровУпаковок", СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка"               , ДанныеЗаполнения);
	Запрос.УстановитьПараметр("СписокОрдеров"        , СписокОрдеров);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	
	Шапка = РезультатШапка[0];
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	СтруктураОрганизацииОтправителяМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиница, Истина);
	ДокументОбъект.Организация       = СтруктураОрганизацииОтправителяМДЛП.Организация;
	ДокументОбъект.МестоДеятельности = СтруктураОрганизацииОтправителяМДЛП.МестоДеятельности;
	
	СтруктураОрганизацииПолучателяМДЛП = ПолучитьОрганизациюИМестоДеятельностиМДЛП(Шапка.Организация, Шапка.СтруктурнаяЕдиницаПолучатель, Истина);
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
		ДокументОбъект.Организация = СтруктураОрганизацииПолучателяМДЛП.Организация;
	КонецЕсли;
	ДокументОбъект.МестоДеятельностиПолучатель = СтруктураОрганизацииПолучателяМДЛП.МестоДеятельности;
	
	ДокументОбъект.Основание = ДанныеЗаполнения;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	Если ЗначениеЗаполнено(ДокументОбъект.МестоДеятельностиПолучатель) Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.МестоДеятельностиПолучатель, "ВестиУчетВЭтойИБ") Тогда
			ДокументОбъект.Операция = Перечисления.ОперацииПеремещенияМДЛП.Перемещение;
		Иначе
			ДокументОбъект.Операция = Перечисления.ОперацииПеремещенияМДЛП.РасходныйОрдер;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОФактеУничтоженияПоПередачеНаУничтожение(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ОбщегоНазначенияРТ.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения);
	
	СписокНомеровУпаковок = ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ДанныеЗаполнения, Метаданные.Документы.УведомлениеОФактеУничтоженияМДЛП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОФактеУничтоженияМДЛП.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УведомлениеОФактеУничтоженияМДЛП КАК УведомлениеОФактеУничтоженияМДЛП
	|ГДЕ
	|	УведомлениеОФактеУничтоженияМДЛП.Основание = &Основание";
	Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ТекстОшибки = НСтр("ru='По документу %1 уже существуют документы о факте уничтожения. Ввод на основании документа невозможен'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеЗаполнения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ДокументОбъект.Основание = ДанныеЗаполнения;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект,ДанныеЗаполнения,"Организация, МестоДеятельности,Контрагент,КонтрагентИНН,КонтрагентКПП,КонтрагентФизическоеЛицо");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.GTIN КАК GTIN,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.УведомлениеОПередачеНаУничтожениеМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПередачеНаУничтожениеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И Товары.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ)
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.УведомлениеОПередачеНаУничтожениеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И ТранспортныеУпаковки.Ссылка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ПринятоГИСМ)
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В(&СписокНомеровУпаковок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.GTIN КАК GTIN,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Сумма(втТовары.КоличествоНомеровУпаковок) КАК КоличествоНомеровУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.Упаковка,
	|	втТовары.GTIN,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТранспортныеУпаковки КАК втТранспортныеУпаковки";
	
	Запрос.УстановитьПараметр("СписокНомеровУпаковок"        , СписокНомеровУпаковок);
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатТовары               = Результат[2].Выгрузить();
	РезультатНомера               = Результат[3].Выгрузить();
	РезультатТранспортныеУпаковки = Результат[4].Выгрузить();
	
	Для Каждого Строка Из РезультатТовары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.КоличествоНомеровУпаковок <> НоваяСтрока.Количество Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеровУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.Упаковка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУведомлениеОРозничнойПродажеПоЧекуККМ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА Товары.СтруктурнаяЕдиница
	|		ИНАЧЕ Товары.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ КАК Склад
	|ПОМЕСТИТЬ втОрганизации
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.ор_НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ор_ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА Товары.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА Товары.СтруктурнаяЕдиница
	|		ИНАЧЕ Товары.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.Организация, ЗНАЧЕНИЕ(Справочник.ОрганизацииМДЛП.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ИЗ
	|	втОрганизации КАК втОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО втОрганизации.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА втОрганизации.Склад = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			КОНЕЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	
	ВыборкаМесто = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаМесто.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаМесто.Следующий();
	ОрганизацияМДЛП = ВыборкаМесто.Организация;
	МестоДеятельностиМДЛП = ВыборкаМесто.МестоДеятельности;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Ссылка КАК Основание,
	|	ЧекККМ.Номер КАК НомерДокумента,
	|	ЧекККМ.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.Сумма КАК Цена,
	|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	Товары.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	Товары.СуммаСкидкиНаценки КАК СуммаРучнойСкидки,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).ор_КоличествоПервичныхУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервичныхУпаковокВоВторичной
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ор_СтатусЗаполненияУпаковок <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМор_НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	ЧекККМор_НомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ втНомера
	|ИЗ
	|	Документ.ЧекККМ.ор_НомераУпаковок КАК ЧекККМор_НомераУпаковок
	|ГДЕ
	|	ЧекККМор_НомераУпаковок.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.КоличествоПервичныхУпаковокВоВторичной КАК КоличествоПервичныхУпаковокВоВторичной
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНомера.НомерКИЗ КАК НомерКИЗ,
	|	втНомера.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТовары.Цена КАК Цена,
	|	втТовары.Количество КАК Количество,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	втТовары.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	втТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(втТовары.Упаковка) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА втТовары.КоличествоУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервичныхУпаковок
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомера КАК втНомера
	|		ПО втТовары.ИдентификаторСтроки = втНомера.ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатШапка  = Результат[0].Выгрузить();
	РезультатТовары = Результат[3].Выгрузить();
	РезультатНомера = Результат[4].Выгрузить();
	РезультатНомераСвернутая = Результат[4].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	ДокументОбъект.Основание         = Шапка.Основание;
	ДокументОбъект.Организация       = ОрганизацияМДЛП;
	ДокументОбъект.МестоДеятельности = МестоДеятельностиМДЛП;
	ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	
	ИдентификаторДокумента = Новый УникальныйИдентификатор;
	
	НоваяСтрокаДокументапродажи = ДокументОбъект.ДокументыПродажи.Добавить();
	НоваяСтрокаДокументапродажи.ВидДокумента           = Перечисления.ВидыДокументовПродажиМДЛП.Чек;
	НоваяСтрокаДокументапродажи.НомерДокумента         = Шапка.НомерДокумента;
	НоваяСтрокаДокументапродажи.ДатаДокумента          = Шапка.ДатаДокумента;
	НоваяСтрокаДокументапродажи.ИдентификаторДокумента = ИдентификаторДокумента;
	
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ИдентификаторДокумента = ИдентификаторДокумента;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	РезультатНомераСвернутая.Свернуть("ИдентификаторСтроки,СуммаНДС");
	
	Для Каждого СтрокаСвернутая Из РезультатНомераСвернутая Цикл
		
		СуммаНДСОбщая = СтрокаСвернутая.СуммаНДС;
		СуммаНДСРасчетная = 0;
		
		НайденныеСтроки = ДокументОбъект.НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаСвернутая.ИдентификаторСтроки));
		
		КоличествоСтрок      = НайденныеСтроки.Количество();
		КоличествоОбработано = 0;
		
		Если КоличествоСтрок = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			КоличествоОбработано = КоличествоОбработано + 1;
			
			Если КоличествоОбработано = КоличествоСтрок Тогда
				Строка.СуммаНДС = СуммаНДСОбщая - СуммаНДСРасчетная;
			Иначе
				Строка.СуммаНДС = Формат(СуммаНДСОбщая/КоличествоСтрок, "ЧЦ=15; ЧДЦ=2");
				СуммаНДСРасчетная = СуммаНДСРасчетная + Строка.СуммаНДС;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
		НайденныеНомераУпаковок = ДокументОбъект.НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеНомераУпаковок.Количество() > 0 Тогда
			Строка.GTIN = Лев(НайденныеНомераУпаковок[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПриходнаяНакладнаяПоУведомлениюОПриеме(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОПриемкеМДЛП.НомерДокумента КАК НомерВходящегоДокумента,
	|	УведомлениеОПриемкеМДЛП.ДатаДокумента КАК ДатаВходящегоДокумента,
	|	УведомлениеОПриемкеМДЛП.Организация КАК ОрганизацияМДЛП,
	|	УведомлениеОПриемкеМДЛП.МестоДеятельности КАК МестоДеятельностиМДЛП,
	|	УведомлениеОПриемкеМДЛП.Грузоотправитель КАК ГрузоотправительМДЛП,
	|	УведомлениеОПриемкеМДЛП.МестоДеятельностиГрузоотправителя КАК МестоДеятельностиГрузоотправителяМДЛП
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП КАК УведомлениеОПриемкеМДЛП
	|ГДЕ
	|	УведомлениеОПриемкеМДЛП.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.GTIN КАК GTIN,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеров
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И (НомераУпаковок.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтвердить)
	|	ИЛИ НомераУпаковок.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтверждено))
	|;
	|
	// 2
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Цена КАК ЦенаУпаковки,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДСУпаковки,
	|	СоставТранспортныхУпаковок.Номенклатура КАК Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика КАК Характеристика,
	|	СоставТранспортныхУпаковок.GTIN КАК GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии КАК НомерСерии,
	|	СоставТранспортныхУпаковок.Количество КАК Количество,
	|	СоставТранспортныхУпаковок.Цена КАК Цена,
	|	СоставТранспортныхУпаковок.СуммаНДС КАК СуммаНДС,
	|	СоставТранспортныхУпаковок.Сумма КАК Сумма
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|		ПО ТранспортныеУпаковки.Ссылка = СоставТранспортныхУпаковок.Ссылка
	|			И ТранспортныеУпаковки.ИдентификаторСтроки = СоставТранспортныхУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И (ТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтвердить)
	|	ИЛИ ТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтверждено))
	|;
	|
	// 3 товары
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	Сумма(КоличествоНомеров) КАК КоличествоНомеров
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения,
	|	втТовары.Цена,
	|	втТовары.СуммаНДС,
	|	втТовары.Сумма,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	// 4 номера упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	// 5 танспортные упаковки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.ЦенаУпаковки КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДСУпаковки КАК СуммаНДС
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортныеУпаковки.НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки,
	|	ТранспортныеУпаковки.ЦенаУпаковки,
	|	ТранспортныеУпаковки.СуммаНДСУпаковки
	|;
	|
	// 6 состав транспортных упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.Номенклатура КАК Номенклатура,
	|	ТранспортныеУпаковки.Характеристика КАК Характеристика,
	|	ТранспортныеУпаковки.GTIN КАК GTIN,
	|	ТранспортныеУпаковки.НомерСерии КАК НомерСерии,
	|	ТранспортныеУпаковки.Количество КАК Количество,
	|	ТранспортныеУпаковки.Цена КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДС,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Сумма КАК Сумма
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	НЕ ТранспортныеУпаковки.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	РезультатСоставТранспортныхУпаковок = Результат[6].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	ДокументОбъект.НомерВходящегоДокумента = Шапка.НомерВходящегоДокумента;
	ДокументОбъект.ДатаВходящегоДокумента  = Шапка.ДатаВходящегоДокумента;
	
	СтруктураОрганизации = ПолучитьОрганизациюИМестоДеятельности(Шапка.ОрганизацияМДЛП, Шапка.МестоДеятельностиМДЛП, Истина);
	СтруктураКонтрагента = ПолучитьОрганизациюИМестоДеятельности(Шапка.ГрузоотправительМДЛП, Шапка.МестоДеятельностиГрузоотправителяМДЛП, Ложь);
	
	ДокументОбъект.Организация        = СтруктураОрганизации.Организация;
	ДокументОбъект.СтруктурнаяЕдиница = СтруктураОрганизации.МестоДеятельности;
	ДокументОбъект.Контрагент         = СтруктураКонтрагента.Организация;
	ДокументОбъект.СуммаВключаетНДС = Истина;
	
	Если ДанныеЗаполнения.Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора
		ИЛИ ДанныеЗаполнения.Операция = Перечисления.ОперацииПриемкиМДЛП.Поступление
		И ДанныеЗаполнения.ТипДоговора = Перечисления.ТипыДоговоровМДЛП.Комиссия Тогда
		
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию;
		
		ЗапросДоговор = Новый Запрос;
		ЗапросДоговор.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ПризнакАгента = &ПризнакАгента
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент";
		ЗапросДоговор.УстановитьПараметр("Организация"  , ДокументОбъект.Организация);
		ЗапросДоговор.УстановитьПараметр("ПризнакАгента", Перечисления.ПризнакиАгента.Комиссионер);
		ЗапросДоговор.УстановитьПараметр("Контрагент"   , ДокументОбъект.Контрагент);
		
		ВыборкаДоговор = ЗапросДоговор.Выполнить().Выбрать();
		
		Если ВыборкаДоговор.Количество() = 1 Тогда
			ВыборкаДоговор.Следующий();
			ДокументОбъект.Договор = ВыборкаДоговор.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ДанныеЗаполнения.Операция = Перечисления.ОперацииПриемкиМДЛП.Поступление
		ИЛИ ДанныеЗаполнения.Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеНаРанееНеЗарегистрированноеМестоДеятельности Тогда
		
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
		
	ИначеЕсли ДанныеЗаполнения.Операция = Перечисления.ОперацииПриемкиМДЛП.ВозвратОтПокупателя
		ИЛИ ДанныеЗаполнения.Операция = Перечисления.ОперацииПриемкиМДЛП.ВозвратПриостановленныхЛП Тогда
		
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		
	КонецЕсли;
	
	НуженПересчетКоличества = Ложь;
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = Строка.КоличествоУпаковок;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура.ВидСтавкиНДС) Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(НоваяСтрока.Номенклатура.ВидСтавкиНДС, ТекущаяДатаСеанса());
		Иначе
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ДокументОбъект.Организация.ВидСтавкиНДСПоУмолчанию, ТекущаяДатаСеанса());
			КонецЕсли;
		КонецЕсли;
		
		Если Строка.Количество <> Строка.КоличествоНомеров Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеров/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			
			НоваяСтрока.СуммаНДС = ?(ДокументОбъект.СуммаВключаетНДС, 
									  НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
									  НоваяСтрока.Сумма * СтавкаНДС / 100);
		КонецЕсли;
		НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(ДокументОбъект.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.ор_НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ор_ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатСоставТранспортныхУпаковок Цикл
		НоваяСтрока = ДокументОбъект.ор_СоставТранспортныхУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатСоставТранспортныхУпаковок Цикл
		
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ор_ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура.ВидСтавкиНДС) Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(НоваяСтрока.Номенклатура.ВидСтавкиНДС, ТекущаяДатаСеанса());
		Иначе
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ДокументОбъект.Организация.ВидСтавкиНДСПоУмолчанию, ТекущаяДатаСеанса());
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
		Если НЕ (ЗначениеЗаполнено(НоваяСтрока.Цена) И ЗначениеЗаполнено(НоваяСтрока.Количество)) Тогда
			НоваяСтрока.Сумма = 0;
			НоваяСтрока.СуммаНДС = 0;
			НоваяСтрока.Всего = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРасходнаяНакладнаяПоУведомлениюОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабДокументыПродажи.НомерДокумента КАК НомерВходящегоДокумента,
	|	ТабДокументыПродажи.ДатаДокумента КАК ДатаВходящегоДокумента,
	|	УведомлениеОПриемкеМДЛП.Организация КАК ОрганизацияМДЛП,
	|	УведомлениеОПриемкеМДЛП.МестоДеятельности КАК МестоДеятельностиМДЛП
	|ИЗ
	|	Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП КАК УведомлениеОПриемкеМДЛП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.ДокументыПродажи КАК ТабДокументыПродажи
	|		ПО УведомлениеОПриемкеМДЛП.Ссылка = ТабДокументыПродажи.Ссылка
	|ГДЕ
	|	УведомлениеОПриемкеМДЛП.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	НомераУпаковок.Цена КАК Цена,
	|	НомераУпаковок.СуммаНДС КАК СуммаНДС,
	|	Товары.GTIN КАК GTIN,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераУпаковок.НомерКиЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеров
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаНДС КАК СуммаНДС,
	|	втТовары.ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	СУММА(втТовары.КоличествоНомеров) КАК КоличествоНомеров
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения,
	|	втТовары.Цена,
	|	втТовары.СуммаНДС,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[2].Выгрузить();
	РезультатНомера                     = Результат[3].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	ДокументОбъект.НомерВходящегоДокумента = Шапка.НомерВходящегоДокумента;
	ДокументОбъект.ДатаВходящегоДокумента  = Шапка.ДатаВходящегоДокумента;
	
	СтруктураОрганизации = ПолучитьОрганизациюИМестоДеятельности(Шапка.ОрганизацияМДЛП, Шапка.МестоДеятельностиМДЛП, Истина);
	
	ДокументОбъект.Организация        = СтруктураОрганизации.Организация;
	ДокументОбъект.СтруктурнаяЕдиница = СтруктураОрганизации.МестоДеятельности;
	ДокументОбъект.СуммаВключаетНДС   = Истина;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
	
	НуженПересчетКоличества = Ложь;
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = Строка.КоличествоУпаковок;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура.ВидСтавкиНДС) Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(НоваяСтрока.Номенклатура.ВидСтавкиНДС, ТекущаяДатаСеанса());
		Иначе
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ДокументОбъект.Организация.ВидСтавкиНДСПоУмолчанию, ТекущаяДатаСеанса());
			КонецЕсли;
		КонецЕсли;
		
		Если Строка.Количество <> Строка.КоличествоНомеров Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеров/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			
			НоваяСтрока.СуммаНДС = ?(ДокументОбъект.СуммаВключаетНДС, 
				НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
				НоваяСтрока.Сумма * СтавкаНДС / 100);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.ор_НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписаниеТоваровПоУведомлениюОВыбытии(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОВыбытииМДЛП.Организация КАК ОрганизацияМДЛП,
	|	УведомлениеОВыбытииМДЛП.МестоДеятельности КАК МестоДеятельностиМДЛП
	|ИЗ
	|	Документ.УведомлениеОВыбытииМДЛП КАК УведомлениеОВыбытииМДЛП
	|ГДЕ
	|	УведомлениеОВыбытииМДЛП.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеров
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.УведомлениеОВыбытииМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОВыбытииМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.Отклонено
	|;
	|
	// 2
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	Документ.УведомлениеОВыбытииМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Ссылка
	|	И НЕ ТранспортныеУпаковки.Отклонено
	|;
	|
	// 3 товары
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТовары.ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	Сумма(КоличествоНомеров) КАК КоличествоНомеров
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	// 4 номера упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	// 5 танспортные упаковки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТранспортныеУпаковки КАК ТранспортныеУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[3].Выгрузить();
	РезультатНомера                     = Результат[4].Выгрузить();
	РезультатТранспортныеУпаковки       = Результат[5].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	СтруктураОрганизации = ПолучитьОрганизациюИМестоДеятельности(Шапка.ОрганизацияМДЛП, Шапка.МестоДеятельностиМДЛП, Истина);
	
	ДокументОбъект.Организация        = СтруктураОрганизации.Организация;
	ДокументОбъект.СтруктурнаяЕдиница = СтруктураОрганизации.МестоДеятельности;
	
	НуженПересчетКоличества = Ложь;
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = Строка.КоличествоУпаковок;
		Если Строка.Количество <> Строка.КоличествоНомеров Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеров/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.ор_НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из РезультатТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ор_ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнвентаризацияЗапасовПоИнвентаризацияПотребительскихУпаковокМДЛП(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Уведомление.Организация КАК ОрганизацияМДЛП,
	|	Уведомление.МестоДеятельности КАК МестоДеятельностиМДЛП
	|ИЗ
	|	Документ.ИнвентаризацияПотребительскихУпаковокМДЛП КАК Уведомление
	|ГДЕ
	|	Уведомление.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НомераУпаковок.ФактическоеНаличие
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНомеров
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ИнвентаризацияПотребительскихУпаковокМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияПотребительскихУпаковокМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(втТовары.КоличествоНомеров) КАК КоличествоНомеров
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[2].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	СтруктураОрганизации = ПолучитьОрганизациюИМестоДеятельности(Шапка.ОрганизацияМДЛП, Шапка.МестоДеятельностиМДЛП, Истина);
	
	ДокументОбъект.Организация        = СтруктураОрганизации.Организация;
	ДокументОбъект.СтруктурнаяЕдиница = СтруктураОрганизации.МестоДеятельности;
	
	НуженПересчетКоличества = Ложь;
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = Строка.КоличествоУпаковок;
		Если Строка.Количество <> Строка.КоличествоНомеров Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеров/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОприходованиеЗапасовПоУведомлениеОбОприходованииМДЛП(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОбОприходованииМДЛП.Организация КАК ОрганизацияМДЛП,
	|	УведомлениеОбОприходованииМДЛП.МестоДеятельности КАК МестоДеятельностиМДЛП
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП КАК УведомлениеОбОприходованииМДЛП
	|ГДЕ
	|	УведомлениеОбОприходованииМДЛП.Ссылка = &Ссылка
	|;
	|
	// 1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК КоличествоНомеров
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И НЕ НомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.Отклонено
	|;
	|
	// 2 товары
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Количество КАК Количество,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТовары.ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	Сумма(КоличествоНомеров) КАК КоличествоНомеров
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.КоличествоУпаковок,
	|	втТовары.ЕдиницаИзмерения,
	|	втТовары.ИдентификаторСтроки
	|;
	|
	// 3 номера упаковок
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результат = Запрос.ВыполнитьПакет();
	РезультатШапка                      = Результат[0].Выгрузить();
	РезультатТовары                     = Результат[2].Выгрузить();
	РезультатНомера                     = Результат[3].Выгрузить();
	
	Шапка = РезультатШапка[0];
	
	СтруктураОрганизации = ПолучитьОрганизациюИМестоДеятельности(Шапка.ОрганизацияМДЛП, Шапка.МестоДеятельностиМДЛП, Истина);
	
	ДокументОбъект.Организация        = СтруктураОрганизации.Организация;
	ДокументОбъект.СтруктурнаяЕдиница = СтруктураОрганизации.МестоДеятельности;
	
	НуженПересчетКоличества = Ложь;
	Для Каждого Строка Из РезультатТовары Цикл
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = Строка.КоличествоУпаковок;
		Если Строка.Количество <> Строка.КоличествоНомеров Тогда
			НоваяСтрока.Количество = Строка.КоличествоНомеров/ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из РезультатНомера Цикл
		НоваяСтрока = ДокументОбъект.ор_НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокНомеровУпаковкоУведомленийПоОснованию(ДокументОснование, МетаданныеУведомления) Экспорт
	
	СписокНомеровУпаковок = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Если МетаданныеУведомления = Метаданные.Документы.УведомлениеОПриемкеМДЛП
		ИЛИ МетаданныеУведомления = Метаданные.Документы.УведомлениеОбОтгрузкеМДЛП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументы.Ссылка КАК Ссылка,
		|	Статусы.Статус КАК Статус
		|ПОМЕСТИТЬ ОформленныеДокументы
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП КАК ТаблицаДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
		|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
		|ГДЕ
		|	ТаблицаДокументы.Основание = &ДокументОснование
		|	И НЕ ТаблицаДокументы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОформленныеУпаковки.НомерКИЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК ОформленныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.Товары КАК ОформленныеТовары
		|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
		|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|				ТОГДА ВЫБОР
		|						КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
		|							ТОГДА ЛОЖЬ
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОформленныеТранспортныеУпаковки.НомерУпаковки
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы)
		|				ТОГДА ЛОЖЬ
		|			КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|				ТОГДА ВЫБОР
		|						КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
		|							ТОГДА ЛОЖЬ
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.НомерУпаковки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.УведомлениеОПриемкеМДЛП", МетаданныеУведомления.ПолноеИмя());
		
	ИначеЕсли МетаданныеУведомления = Метаданные.Документы.УведомлениеОбОприходованииМДЛП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ОформленныеДокументы
		|ИЗ
		|	Документ.УведомлениеОбОприходованииМДЛП КАК ТаблицаДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
		|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
		|ГДЕ
		|	ТаблицаДокументы.Основание = &ДокументОснование
		|	И НЕ ТаблицаДокументы.ПометкаУдаления
		|	И НЕ(ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|				И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОформленныеУпаковки.НомерКИЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	Документ.УведомлениеОбОприходованииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.Товары КАК ОформленныеТовары
		|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
		|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеУпаковки.Отклонено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОформленныеТранспортныеУпаковки.НомерУпаковки
		|ИЗ
		|	Документ.УведомлениеОбОприходованииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.НомерУпаковки";
		
	ИначеЕсли МетаданныеУведомления = Метаданные.Документы.УведомлениеОВыбытииМДЛП
		ИЛИ МетаданныеУведомления = Метаданные.Документы.УведомлениеОПередачеНаУничтожениеМДЛП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ОформленныеДокументы
		|ИЗ
		|	Документ.УведомлениеОВыбытииМДЛП КАК ТаблицаДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
		|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
		|ГДЕ
		|	ТаблицаДокументы.Основание = &ДокументОснование
		|	И НЕ ТаблицаДокументы.ПометкаУдаления
		|	И НЕ(ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|				И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОформленныеУпаковки.НомерКИЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	Документ.УведомлениеОВыбытииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОВыбытииМДЛП.Товары КАК ОформленныеТовары
		|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
		|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеУпаковки.Отклонено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОформленныеТранспортныеУпаковки.НомерУпаковки
		|ИЗ
		|	Документ.УведомлениеОВыбытииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.НомерУпаковки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.УведомлениеОВыбытииМДЛП", МетаданныеУведомления.ПолноеИмя());
		
	ИначеЕсли МетаданныеУведомления = Метаданные.Документы.УведомлениеОПеремещенииМДЛП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ОформленныеДокументы
		|ИЗ
		|	Документ.УведомлениеОПеремещенииМДЛП КАК ТаблицаДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
		|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
		|ГДЕ
		|	ТаблицаДокументы.Основание = &ДокументОснование
		|	И НЕ ТаблицаДокументы.ПометкаУдаления
		|	И НЕ(ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|				И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОформленныеУпаковки.НомерКИЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	Документ.УведомлениеОПеремещенииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПеремещенииМДЛП.Товары КАК ОформленныеТовары
		|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
		|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеУпаковки.Отклонено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОформленныеТранспортныеУпаковки.НомерУпаковки
		|ИЗ
		|	Документ.УведомлениеОПеремещенииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.НомерУпаковки";
		
	ИначеЕсли МетаданныеУведомления = Метаданные.Документы.УведомлениеОПовторномВводеВОборотМДЛП
		ИЛИ МетаданныеУведомления = Метаданные.Документы.УведомлениеОРозничнойПродажеМДЛП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ОформленныеДокументы
		|ИЗ
		|	Документ.УведомлениеОПовторномВводеВОборотМДЛП КАК ТаблицаДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
		|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
		|ГДЕ
		|	ТаблицаДокументы.Основание = &ДокументОснование
		|	И НЕ ТаблицаДокументы.ПометкаУдаления
		|	И НЕ(ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|				И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОформленныеУпаковки.НомерКиЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	Документ.УведомлениеОПовторномВводеВОборотМДЛП.НомераУпаковок КАК ОформленныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПовторномВводеВОборотМДЛП.Товары КАК ОформленныеТовары
		|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
		|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТовары.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеУпаковки.Отклонено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.НомерУпаковки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.УведомлениеОПовторномВводеВОборотМДЛП", МетаданныеУведомления.ПолноеИмя());
		
	ИначеЕсли МетаданныеУведомления = Метаданные.Документы.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ОформленныеДокументы
		|ИЗ
		|	Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП КАК ТаблицаДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
		|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
		|ГДЕ
		|	ТаблицаДокументы.Основание = &ДокументОснование
		|	И НЕ ТаблицаДокументы.ПометкаУдаления
		|	И НЕ ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОформленныеУпаковки.НомерКиЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.НомераУпаковок КАК ОформленныеУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.Товары КАК ОформленныеТовары
		|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
		|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
		|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТовары.Ссылка)
		|ГДЕ
		|	НЕ ОформленныеУпаковки.Отклонено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.НомерУпаковки";
		
	Иначе
		Возврат СписокНомеровУпаковок;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СписокНомеровУпаковок;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокНомеровУпаковок.Добавить(Выборка.НомерУпаковки);
	КонецЦикла;
	
	Возврат СписокНомеровУпаковок;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиПроверкиИЗаполнения

Процедура ЗаполнитьПустойИднтификаторСтроки(Объект, ИмяТЧТовары = "Запасы", ИмяРеквизитаИдентификатор = "ор_ИдентификаторСтроки") Экспорт
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧТовары] Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквизитаИдентификатор]) Тогда
			СтрокаТЧ[ИмяРеквизитаИдентификатор] = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНеиспользуемыеНомераУпаковок(Объект, ИмяТЧТовары = "Запасы", ИмяТЧСерии = "ор_НомераУпаковок") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчНомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК тчТовары
	|			ПО тчНомераУпаковок.ИдентификаторСтроки = тчТовары.ор_ИдентификаторСтроки
	|ГДЕ
	|	тчТовары.ор_ИдентификаторСтроки ЕСТЬ NULL
	|	ИЛИ тчТовары.ор_СтатусЗаполненияУпаковок = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	тчНомераУпаковок.ИдентификаторСтроки";
	Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"ор_ИдентификаторСтроки, ор_СтатусЗаполненияУпаковок"));
	Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"ИдентификаторСтроки"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("ИдентификаторСтроки", Выборка.ИдентификаторСтроки));
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			Объект[ИмяТЧСерии].Удалить(Строка);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьПризнакиЕстьМаркируемаяПродукция(Объект, ИмяТЧТовары = "Запасы", ИмяТЧСерии = "ор_НомераУпаковок", ЗапретитьВводНомеров = Ложь) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ор_ЕстьМаркируемаяПродукция", Ложь);
	
	Если НЕ ЗапретитьВводНомеров Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
		|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерКИЗ
		|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
		|ИЗ
		|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тчТовары.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки
		|ИЗ
		|	ТаблицаТоваров КАК тчТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
		|		ПО тчТовары.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
		|ГДЕ
		|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
		|	И НЕ тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки"));
		
		СтруктураВозврата.ор_ЕстьМаркируемаяПродукция = НЕ Запрос.Выполнить().Пустой();
		
		ЕстьТранспортныеУпаковки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ор_ТранспортныеУпаковки");
		
		Если ЕстьТранспортныеУпаковки Тогда
			Если Объект.ор_ТранспортныеУпаковки.Количество() > 0 И НЕ СтруктураВозврата.ор_ЕстьМаркируемаяПродукция Тогда
				СтруктураВозврата.ор_ЕстьМаркируемаяПродукция = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ПроверитьЗаполнениеНомеровУпаковок(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "") Экспорт
	
	КонтролироватьКоличествоНомеровУпаковок = Истина;
	
	ДатаОбъекта = Неопределено;
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходнаяНакладная")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РасходнаяНакладная")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.СписаниеЗапасов")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПеремещениеЗапасов")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходныйОрдер")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РасходныйОрдер")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ОприходованиеЗапасов")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.КомплектацияЗапасов") Тогда
		Если Объект.Ссылка.Пустая() Тогда
			ДатаОбъекта = ТекущаяДата();
		Иначе
			ДатаОбъекта = Объект.Дата;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбработкаОбъект.РабочееМестоКассира") Тогда
		ДатаОбъекта = Объект.Дата;
	Иначе
		ДатаОбъекта = ТекущаяДата();
	КонецЕсли;
	
	Если ДатаОбъекта < ПолучитьДатуНачалаМаркировкиТоваров() Тогда
		КонтролироватьКоличествоНомеровУпаковок = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходнаяНакладная")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
		КонтролироватьКоличествоНомеровУпаковок = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходныйОрдер")
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		КонтролироватьКоличествоНомеровУпаковок = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.РасходныйОрдер")
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		КонтролироватьКоличествоНомеровУпаковок = Ложь;
	КонецЕсли;
	
	ЕстьПолеТранспортныеУпаковки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ор_ТранспортныеУпаковки");
	
	ЕстьТранспортныеУпаковки = Ложь;
	Если ЕстьПолеТранспортныеУпаковки Тогда
		Если Объект.ор_ТранспортныеУпаковки.Количество() > 0 Тогда
			ЕстьТранспортныеУпаковки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров1
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Количество * ТаблицаТоваров.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ТаблицаТоваров.Количество КАК КоличествоУпаковок,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров1 КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерКИЗ
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Характеристика КАК Характеристика,
	|	тчТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	тчТовары.Количество КАК Количество,
	|	тчТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	СУММА(ВЫБОР
	|			КОГДА тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ПО тчТовары.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	тчТовары.НомерСтроки,
	|	тчТовары.Номенклатура,
	|	тчТовары.Характеристика,
	|	тчТовары.ЕдиницаИзмерения,
	|	тчТовары.Количество,
	|	тчТовары.КоличествоУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.Характеристика КАК Характеристика,
	|	втТаблица.Количество КАК Количество,
	|	втТаблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТаблица.КоличествоНомеровУпаковок КАК КоличествоНомеровУпаковок,
	|	втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок,
	|	ВЫБОР
	|		КОГДА втТаблица.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				И втТаблица.Количество < втТаблица.КоличествоУпаковок
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоБлистер
	|ИЗ
	|	втТаблица КАК втТаблица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА втТаблица.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|					И втТаблица.Количество < втТаблица.КоличествоУпаковок
	|				ТОГДА втТаблица.КоличествоНомеровУпаковок <> 1
	|						ИЛИ втТаблица.КоличествоУпаковок > втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок
	|			ИНАЧЕ втТаблица.Количество <> втТаблица.КоличествоНомеровУпаковок
	|					ИЛИ втТаблица.КоличествоНомеровУпаковок = 0
	|		КОНЕЦ";
	
	СписокКолонок = "НомерСтроки,Номенклатура,Характеристика,ЕдиницаИзмерения,Количество,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок";
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,СписокКолонок));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,СписокКолонок));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки"));
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонОбщий                    = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" '");
	ШаблонНомерВведенНеправильно   = НСтр("ru = 'указано по номерам упаковок %КоличествоНомеровУпаковок%. Необходимо указать %КоличествоТоваров%. Исправьте номера упаковок.'");
	ШаблонКолБлистеровНеправильное = НСтр("ru = 'указано количество %КоличествоУпаковок%. Максимальное количество %КоличествоПервичныхУпаковок%.'");
	
	Если ВыдаватьСообщения Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоБлистер Тогда
				
				Если Выборка.КоличествоУпаковок > Выборка.КоличествоПервичныхУпаковок
					ИЛИ Выборка.КоличествоНомеровУпаковок > 1
					ИЛИ КонтролироватьКоличествоНомеровУпаковок И НЕ ЕстьТранспортныеУпаковки Тогда
					
					ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
					ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
					
					Если Выборка.КоличествоНомеровУпаковок <> 1 Тогда
						ТекстСообщенияТело = СтрЗаменить(ШаблонНомерВведенНеправильно, "%КоличествоНомеровУпаковок%", Выборка.КоличествоНомеровУпаковок);
						ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоТоваров%", 1);
					Иначе
						ТекстСообщенияТело = СтрЗаменить(ШаблонКолБлистеровНеправильное, "%КоличествоУпаковок%",Выборка.КоличествоУпаковок);
						ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоПервичныхУпаковок%",Выборка.КоличествоПервичныхУпаковок);
					КонецЕсли;
					
					ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
					
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "НомерСтроки");
					
					#Если ТолстыйКлиентОбычноеПриложение Тогда
						Отказ = Истина;
					#Иначе
						ОбщегоНазначения.СообщитьПользователю(
							ТекстСообщения,
							Объект,
							Поле,
							"Объект",
							Отказ);
					#КонецЕсли
					
				КонецЕсли;
				
			Иначе
				
				Если Выборка.Количество < Выборка.КоличествоНомеровУпаковок
					ИЛИ КонтролироватьКоличествоНомеровУпаковок И НЕ ЕстьТранспортныеУпаковки Тогда
					
					ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
					ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
					
					ТекстСообщенияТело = СтрЗаменить(ШаблонНомерВведенНеправильно, "%КоличествоНомеровУпаковок%",Выборка.КоличествоНомеровУпаковок);
					ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоТоваров%",Выборка.Количество);
					
					ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
					
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "НомерСтроки");
					
					#Если ТолстыйКлиентОбычноеПриложение Тогда
						Отказ = Истина;
					#Иначе
						ОбщегоНазначения.СообщитьПользователю(
							ТекстСообщения,
							Объект,
							Поле,
							"Объект",
							Отказ);
					#КонецЕсли
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ЭтоБлистер Тогда
					
					Если Выборка.КоличествоУпаковок > Выборка.КоличествоПервичныхУпаковок
						ИЛИ Выборка.КоличествоНомеровУпаковок > 1
						ИЛИ КонтролироватьКоличествоНомеровУпаковок И НЕ ЕстьТранспортныеУпаковки Тогда
						
						ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
						ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
						
						Если Выборка.КоличествоНомеровУпаковок <> 1 Тогда
							ТекстСообщенияТело = СтрЗаменить(ШаблонНомерВведенНеправильно, "%КоличествоНомеровУпаковок%", Выборка.КоличествоНомеровУпаковок);
							ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоТоваров%", 1);
						Иначе
							ТекстСообщенияТело = СтрЗаменить(ШаблонКолБлистеровНеправильное, "%КоличествоУпаковок%",Выборка.КоличествоУпаковок);
							ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоПервичныхУпаковок%",Выборка.КоличествоПервичныхУпаковок);
						КонецЕсли;
						
						ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
						
					КонецЕсли;
					
				Иначе
					
					Если Выборка.Количество < Выборка.КоличествоНомеровУпаковок
						ИЛИ КонтролироватьКоличествоНомеровУпаковок И НЕ ЕстьТранспортныеУпаковки Тогда
						
						ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
						ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
						
						ТекстСообщенияТело = СтрЗаменить(ШаблонНомерВведенНеправильно, "%КоличествоНомеровУпаковок%",Выборка.КоличествоНомеровУпаковок);
						ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоТоваров%",Выборка.Количество);
						
						ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
						
						Отказ = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДублиНомеровУпаковок(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "") Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерКИЗ
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчНомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ПО тчТовары.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL";
	
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,"НомерСтроки,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"НомерСтроки,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки"));
	КонецЕсли;
	
	ТаблицаДублей = Запрос.Выполнить().Выгрузить();
	врТаблицаДублей = ТаблицаДублей.Скопировать();
	врТаблицаДублей.Свернуть("НомерКИЗ","Количество");
	
	Если ВыдаватьСообщения Тогда
		Для Каждого Строка Из врТаблицаДублей Цикл
			Если Строка.Количество > 1 Тогда
				
				НайденныеСтрокиДублейКиз = ТаблицаДублей.НайтиСтроки(Новый Структура("НомерКИЗ", Строка.НомерКИЗ));
				НомерСтрокиДубля = 0;
				Для Каждого СтрокаДубля Из НайденныеСтрокиДублейКиз Цикл
					Если СтрокаДубля.НомерСтроки > НомерСтрокиДубля Тогда
						НомерСтрокиДубля = СтрокаДубля.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" дублируется номер упаковки %НомерКИЗ%. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтрокиДубля);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерКИЗ%"   , Строка.НомерКИЗ);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, НомерСтрокиДубля, "НомерСтроки");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
				
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из врТаблицаДублей Цикл
			Если Строка.Количество > 1 Тогда
				
				НайденныеСтрокиДублейКиз = ТаблицаДублей.НайтиСтроки(Новый Структура("НомерКИЗ", Строка.НомерКИЗ));
				НомерСтрокиДубля = 0;
				Для Каждого СтрокаДубля Из НайденныеСтрокиДублейКиз Цикл
					Если СтрокаДубля.НомерСтроки > НомерСтрокиДубля Тогда
						НомерСтрокиДубля = СтрокаДубля.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" дублируется номер упаковки %НомерКИЗ%. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтрокиДубля);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерКИЗ%"   , Строка.НомерКИЗ);
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТранспортныхУпаковок(Объект,
	Отказ,
	ИмяТЧТУ = "ор_ТранспортныеУпаковки",
	ИмяТЧСоставТУ = "ор_СоставТранспортныхУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "",
	ПроверятьЦенуТУ = Истина) Экспорт
	
	Если ПроверятьЦенуТУ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
		|	ТаблицаТоваров.Цена КАК Цена,
		|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНомеровУпаковок.ИдентификаторСтроки
		|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
		|ИЗ
		|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тчТовары.НомерСтроки КАК НомерСтроки,
		|	тчТовары.НомерУпаковки КАК НомерУпаковки,
		|	тчТовары.Цена КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоНомеровУпаковок
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	ТаблицаТоваров КАК тчТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
		|		ПО тчТовары.ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	тчТовары.НомерСтроки,
		|	тчТовары.НомерУпаковки,
		|	тчТовары.Цена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.НомерСтроки КАК НомерСтроки,
		|	втТаблица.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	втТаблица КАК втТаблица
		|ГДЕ
		|	втТаблица.КоличествоНомеровУпаковок = 0
		|	И втТаблица.Цена = 0";
		
		
		Если ТипЗнч(Объект[ИмяТЧТУ]) = Тип("ТаблицаЗначений") Тогда
			Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТУ].Скопировать(,"НомерСтроки,НомерУпаковки,ИдентификаторСтроки,Цена"));
		Иначе
			Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТУ].Выгрузить(,"НомерСтроки,НомерУпаковки,ИдентификаторСтроки,Цена"));
		КонецЕсли;
		
		Если ТипЗнч(Объект[ИмяТЧСоставТУ]) = Тип("ТаблицаЗначений") Тогда
			Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСоставТУ].Скопировать(,"ИдентификаторСтроки"));
		Иначе
			Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСоставТУ].Выгрузить(,"ИдентификаторСтроки"));
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если ВыдаватьСообщения Тогда
			
			Пока Выборка.Следующий() Цикл
				
				ТекстСообщения = НСтр("ru = 'Для транспортной упаковки ""%НомерУпаковки%"" не заполнена цена. Заполните цену транспортной упакови.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%",Выборка.НомерУпаковки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТУ, Выборка.НомерСтроки, "Цена");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
				
			КонецЦикла;
		Иначе
			Если Не Запрос.Выполнить().Пустой() Тогда
				
				Пока Выборка.Следующий() Цикл
					
					ТекстСообщения = НСтр("ru = 'Для транспортной упаковки ""%НомерУпаковки%"" не заполнен цена. Заполните цену транспортной упакови.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%",Выборка.НомерУпаковки);
					
					Прервать;
				КонецЦикла;
				
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.НомерУпаковки КАК НомерУпаковки,
	|	1 КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары";
	
	Если ТипЗнч(Объект[ИмяТЧТУ]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТУ].Скопировать(,"НомерСтроки,НомерУпаковки"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТУ].Выгрузить(,"НомерСтроки,НомерУпаковки"));
	КонецЕсли;
	
	ТаблицаДублей = Запрос.Выполнить().Выгрузить();
	врТаблицаДублей = ТаблицаДублей.Скопировать();
	врТаблицаДублей.Свернуть("НомерУпаковки","Количество");
	
	Если ВыдаватьСообщения Тогда
		Для Каждого Строка Из врТаблицаДублей Цикл
			Если Строка.Количество > 1 Тогда
				
				НайденныеСтрокиДублейКиз = ТаблицаДублей.НайтиСтроки(Новый Структура("НомерУпаковки",Строка.НомерУпаковки));
				НомерСтрокиДубля = 0;
				Для Каждого СтрокаДубля Из НайденныеСтрокиДублейКиз Цикл
					Если СтрокаДубля.НомерСтроки > НомерСтрокиДубля Тогда
						НомерСтрокиДубля = СтрокаДубля.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" дублируется номер транспортной упаковки %НомерУпаковки%. Исправьте транспортные номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , НомерСтрокиДубля);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Строка.НомерУпаковки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТУ, НомерСтрокиДубля, "НомерУпаковки");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
				
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из врТаблицаДублей Цикл
			Если Строка.Количество > 1 Тогда
				
				НайденныеСтрокиДублейКиз = ТаблицаДублей.НайтиСтроки(Новый Структура("НомерУпаковки",Строка.НомерУпаковки));
				НомерСтрокиДубля = 0;
				Для Каждого СтрокаДубля Из НайденныеСтрокиДублейКиз Цикл
					Если СтрокаДубля.НомерСтроки > НомерСтрокиДубля Тогда
						НомерСтрокиДубля = СтрокаДубля.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" дублируется номер транспортной упаковки %НомерУпаковки%. Исправьте транспортные номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , НомерСтрокиДубля);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Строка.НомерУпаковки);
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеGTIN(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ИмяТЧСостав = "ор_СоставТранспортныхУпаковок") Экспорт
	
	втТовары = Объект[ИмяТЧТовары].Выгрузить(,"НомерСтроки,Номенклатура,Характеристика");
	втТовары.Колонки.Добавить("GTIN", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(14)));
	втТовары.Очистить();
	
	Для Каждого Строка Из Объект[ИмяТЧТовары] Цикл
		
		Если НЕ (ЗначениеЗаполнено(Строка.Номенклатура) И ЗначениеЗаполнено(Строка.Характеристика))
			ИЛИ Строка.ор_СтатусЗаполненияУпаковок = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеУпаковки = Объект[ИмяТЧСерии].НайтиСтроки(Новый структура("ИдентификаторСтроки",Строка.ор_ИдентификаторСтроки));
		Если НайденныеУпаковки.Количество() > 0 Тогда
			НоваяСтрока = втТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.GTIN = Лев(НайденныеУпаковки[0].НомерКИЗ, 14);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Объект[ИмяТЧСостав] Цикл
		
		Если НЕ (ЗначениеЗаполнено(Строка.Номенклатура) И ЗначениеЗаполнено(Строка.Характеристика) И ЗначениеЗаполнено(Строка.GTIN)) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = втТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	ДанныеGTIN = Новый Соответствие;
	Для Каждого СтрокаТабличнойЧасти Из втТовары Цикл
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.GTIN) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ПолученныйGTIN = ДанныеGTIN[СтрокаТабличнойЧасти.GTIN];
			Если ПолученныйGTIN = Неопределено Тогда
				ДанныеGTIN.Вставить(СтрокаТабличнойЧасти.GTIN, Новый Структура("Номенклатура", СтрокаТабличнойЧасти.Номенклатура));
			ИначеЕсли ПолученныйGTIN.Номенклатура <> СтрокаТабличнойЧасти.Номенклатура Тогда
				ТекстСообщения = НСтр("ru = 'В документе есть строки с одним и тем же GTIN %GTIN% для разной номенклатуры.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", СтрокаТабличнойЧасти.GTIN);
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.GTIN КАК GTIN
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Характеристика КАК Характеристика,
	|	Штрихкоды.Штрихкод КАК GTIN
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО тчТовары.Номенклатура = Штрихкоды.Номенклатура
	|			И тчТовары.Характеристика = Штрихкоды.Характеристика
	|			И тчТовары.GTIN <> Штрихкоды.Штрихкод
	|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
	|			И (Штрихкоды.Партия = &Партия)
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика";
	
	Запрос.УстановитьПараметр("ТаблицаТовары"   , втТовары);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
	
	ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		
		ВыборкаПоХарактеристике = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоХарактеристике.Следующий() Цикл
			
			ВыборкаПоGTIN = ВыборкаПоХарактеристике.Выбрать();
			
			МассивGTIN = Новый Массив;
			Пока ВыборкаПоGTIN.Следующий() Цикл
				Если НЕ ор_ИнтеграцияМДЛПКлиентСервер.ЭтоGTIN(ВыборкаПоGTIN.GTIN) Тогда
					Продолжить;
				КонецЕсли;
				МассивGTIN.Добавить(ВыборкаПоGTIN.GTIN);
			КонецЦикла;
			
			Если МассивGTIN.Количество() > 0 Тогда
				
				Если МассивGTIN.Количество() > 1 Тогда
					ТекстСообщения = НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%"" уже существуют записи с другими GTIN.'");
				Иначе
					ТекстСообщения = НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%""  уже существует запись с другим GTIN %GTIN%.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", МассивGTIN[0]);
				КонецЕсли;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%", ПредставлениеНоменклатуры(ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоХарактеристике.Характеристика));
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				#КонецЕсли
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьУпаковкиНоменклатуры(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "",
	ПроверятьТолькоБлистеры = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Характеристика КАК Характеристика,
	|	тчТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ор_КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО тчТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0";
		
	КолонкиТовары = "НомерСтроки,Номенклатура,Характеристика,ЕдиницаИзмерения,ор_СтатусЗаполненияУпаковок";
	
	Запрос.УстановитьПараметр("ТаблицаТовары" , Объект[ИмяТЧТовары].Выгрузить(,КолонкиТовары));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВыдаватьСообщения Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если ПроверятьТолькоБлистеры И Выборка.Коэффициент > 1 Тогда
				Продолжить;
			КонецЕсли;
			
			Если (Выборка.КоличествоПервичныхУпаковок - Цел(Выборка.КоличествоПервичныхУпаковок)) > 0 Тогда
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" указана единица измерения ""%ЕдиницаИзмерения%"" с некорректным количеством первичных упаковок ""%Количество%"".'");
				ТекстСообщения = ТекстСообщения + " " + НСтр("ru = 'Количество первичных упаковок должно быть целым числом'");
				
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"     , Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%"           , ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", Выборка.ЕдиницаИзмерения);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%"      , Выборка.КоличествоПервичныхУпаковок);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "Упаковка");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			Пока Выборка.Следующий() Цикл
				
				Если ПроверятьТолькоБлистеры И Выборка.Коэффициент > 1 Тогда
					Продолжить;
				КонецЕсли;
				
				Если (Выборка.КоличествоПервичныхУпаковок - Цел(Выборка.КоличествоПервичныхУпаковок)) > 0 Тогда
					
					ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" указана единица измерения ""%ЕдиницаИзмерения%"" с некорректным количеством первичных упаковок ""%Количество%"".'");
					ТекстСообщения = ТекстСообщения + " " + НСтр("ru = 'Количество первичных упаковок должно быть целым числом'");
					
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"     , Выборка.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%"           , ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", Выборка.ЕдиницаИзмерения);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%"      , Выборка.КоличествоПервичныхУпаковок);
					
					Отказ = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНомеровУпаковокУведомлениеДробноеКоличество(Объект, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТоваров.КоличествоПервичныхУпаковокВоВторичной КАК КоличествоПервичныхУпаковокВоВторичной,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерУпаковки
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Характеристика КАК Характеристика,
	|	тчТовары.Количество КАК Количество,
	|	тчТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаНомеровУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоНомеровУпаковок,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаНомеровУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТаблицаНомеровУпаковок.КоличествоПервичныхУпаковок = 0
	|						ТОГДА тчТовары.КоличествоПервичныхУпаковокВоВторичной
	|					ИНАЧЕ ТаблицаНомеровУпаковок.КоличествоПервичныхУпаковок
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоПервичныхУпаковок
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|		ПО тчТовары.ИдентификаторСтроки = ТаблицаНомеровУпаковок.ИдентификаторСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	тчТовары.НомерСтроки,
	|	тчТовары.Номенклатура,
	|	тчТовары.Характеристика,
	|	тчТовары.Количество,
	|	тчТовары.КоличествоУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Количество КАК Количество,
	|	втТаблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТаблица.КоличествоНомеровУпаковок КАК КоличествоНомеровУпаковок,
	|	втТаблица.КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок
	|ИЗ
	|	втТаблица КАК втТаблица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА втТаблица.КоличествоПервичныхУпаковок = 0
	|				ТОГДА втТаблица.Количество <> втТаблица.КоличествоНомеровУпаковок
	|			ИНАЧЕ втТаблица.КоличествоУпаковок <> втТаблица.КоличествоПервичныхУпаковок
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект.НомераУпаковок.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонСообщения = НСтр("ru = 'Количество товара (%1) отличается от количества номеров упаковок (%2).'");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоПервичныхУпаковок = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонСообщения, Выборка.Количество, Выборка.КоличествоНомеровУпаковок);
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонСообщения, Выборка.КоличествоУпаковок, Выборка.КоличествоПервичныхУпаковок);
		КонецЕсли;
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", Выборка.НомерСтроки, "КоличествоУпаковок");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, Поле,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНомеровУпаковокПриРозничнойПродаже(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "",
	ЭтоПодарки = Ложь) Экспорт
	
	КонтролироватьКоличествоНомеровУпаковок = Истина;
	
	ДатаОбъекта = Неопределено;
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ") Тогда
		Если Объект.Ссылка.Пустая() Тогда
			ДатаОбъекта = ТекущаяДата();
		Иначе
			ДатаОбъекта = Объект.Дата;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбработкаОбъект.РабочееМестоКассира") Тогда
		ДатаОбъекта = Объект.Дата;
	Иначе
		ДатаОбъекта = ТекущаяДата();
	КонецЕсли;
	
	Если ДатаОбъекта < ПолучитьДатуНачалаМаркировкиТоваров() Тогда
		КонтролироватьКоличествоНомеровУпаковок = Ложь;
	КонецЕсли;
	
	Если КонтролироватьКоличествоНомеровУпаковок Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика КАК Характеристика,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
		|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
		|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
		|ПОМЕСТИТЬ ТаблицаТоваров1
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТоваров.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ТаблицаТоваров.Количество * ТаблицаТоваров.ЕдиницаИзмерения.Коэффициент
		|		ИНАЧЕ ТаблицаТоваров.Количество
		|	КОНЕЦ КАК Количество,
		|	ТаблицаТоваров.Количество КАК КоличествоУпаковок,
		|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
		|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	ТаблицаТоваров1 КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерУпаковки
		|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
		|ИЗ
		|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тчТовары.НомерСтроки КАК НомерСтроки,
		|	тчТовары.Номенклатура КАК Номенклатура,
		|	тчТовары.Характеристика КАК Характеристика,
		|	тчТовары.Количество КАК Количество,
		|	тчТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	тчТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаНомеровУпаковок.ИдентификаторСтроки ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоНомеровУпаковок
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	ТаблицаТоваров КАК тчТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
		|		ПО тчТовары.ор_ИдентификаторСтроки = ТаблицаНомеровУпаковок.ИдентификаторСтроки
		|ГДЕ
		|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	тчТовары.НомерСтроки,
		|	тчТовары.Номенклатура,
		|	тчТовары.Характеристика,
		|	тчТовары.ЕдиницаИзмерения,
		|	тчТовары.Количество,
		|	тчТовары.КоличествоУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.НомерСтроки КАК НомерСтроки,
		|	втТаблица.Номенклатура КАК Номенклатура,
		|	втТаблица.Характеристика КАК Характеристика,
		|	втТаблица.Количество КАК Количество,
		|	втТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	втТаблица.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втТаблица.КоличествоНомеровУпаковок КАК КоличествоНомеровУпаковок,
		|	втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок
		|ИЗ
		|	втТаблица КАК втТаблица
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЭтоПодарки
		|				ТОГДА втТаблица.Количество <> втТаблица.КоличествоНомеровУпаковок
		|						ИЛИ втТаблица.КоличествоНомеровУпаковок = 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА втТаблица.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|						ТОГДА втТаблица.Количество <> втТаблица.КоличествоНомеровУпаковок
		|								ИЛИ втТаблица.КоличествоНомеровУпаковок <> 1
		|					ИНАЧЕ втТаблица.КоличествоНомеровУпаковок <> 1
		|							ИЛИ втТаблица.КоличествоУпаковок > втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок
		|				КОНЕЦ
		|		КОНЕЦ";
		
		КолонкиТовары = "НомерСтроки,Номенклатура,Характеристика,ЕдиницаИзмерения,Количество,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок";
		
		Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
			Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,КолонкиТовары));
		Иначе
			Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,КолонкиТовары));
		КонецЕсли;
		
		Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
			Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки"));
		Иначе
			Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки"));
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ЭтоПодарки", ЭтоПодарки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ШаблонОбщий                    = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" '");
		ШаблонПодарки                  = НСтр("ru = 'указано по номерам упаковок %КоличествоНомеровУпаковок%. Необходимо указать %КоличествоТоваров%. Исправьте номера упаковок.'");
		ШаблонНомерВведенНеправильно   = НСтр("ru = 'указано по номерам упаковок %КоличествоНомеровУпаковок%. Необходимо указать 1 номер упаковки.'");
		ШаблонКолНеправильное          = НСтр("ru = 'указано количество %Количество%. Максимальное количество 1.'");
		ШаблонКолБлистеровНеправильное = НСтр("ru = 'указано количество %КоличествоУпаковок%. Максимальное количество %КоличествоПервичныхУпаковок%.'");
		
		Если ВыдаватьСообщения Тогда
			
			Пока Выборка.Следующий() Цикл
				
				ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
				
				Если ЭтоПодарки Тогда
					ТекстСообщенияТело = СтрЗаменить(ШаблонПодарки, "%КоличествоНомеровУпаковок%",Выборка.КоличествоНомеровУпаковок);
					ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоТоваров%",Выборка.Количество);
					
				ИначеЕсли Выборка.КоличествоНомеровУпаковок <> 1 Тогда
					ТекстСообщенияТело = СтрЗаменить(ШаблонНомерВведенНеправильно, "%КоличествоНомеровУпаковок%", Выборка.КоличествоНомеровУпаковок);
					
				ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения)
					ИЛИ ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения)
					И Выборка.Количество > 1
					И Выборка.КоличествоПервичныхУпаковок < 1 Тогда
					ТекстСообщенияТело = СтрЗаменить(ШаблонКолНеправильное, "%Количество%", Выборка.Количество);
					
				Иначе
					ТекстСообщенияТело = СтрЗаменить(ШаблонКолБлистеровНеправильное, "%КоличествоУпаковок%",Выборка.КоличествоУпаковок);
					ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоПервичныхУпаковок%",Выборка.КоличествоПервичныхУпаковок);
					
				КонецЕсли;
				
				ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "НомерСтроки");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
				
			КонецЦикла;
		Иначе
			Если Не Запрос.Выполнить().Пустой() Тогда
				
				Пока Выборка.Следующий() Цикл
					
					ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
					ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
					
					Если ЭтоПодарки Тогда
						ТекстСообщенияТело = СтрЗаменить(ШаблонПодарки, "%КоличествоНомеровУпаковок%",Выборка.КоличествоНомеровУпаковок);
						ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоТоваров%",Выборка.Количество);
						
					ИначеЕсли Выборка.КоличествоНомеровУпаковок <> 1 Тогда
						ТекстСообщенияТело = СтрЗаменить(ШаблонНомерВведенНеправильно, "%КоличествоНомеровУпаковок%", Выборка.КоличествоНомеровУпаковок);
						
					ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения)
						ИЛИ ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения)
						И Выборка.Количество > 1
						И Выборка.КоличествоПервичныхУпаковок < 1 Тогда
						ТекстСообщенияТело = СтрЗаменить(ШаблонКолНеправильное, "%Количество%", Выборка.Количество);
						
					Иначе
						ТекстСообщенияТело = СтрЗаменить(ШаблонКолБлистеровНеправильное, "%КоличествоУпаковок%",Выборка.КоличествоУпаковок);
						ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоПервичныхУпаковок%",Выборка.КоличествоПервичныхУпаковок);
						
					КонецЕсли;
					
					ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
					
					Прервать;
				КонецЦикла;
				
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОстатокНомеровУпаковокПриРозничнойПродаже(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "",
	ЭтоПодарки = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров1
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Количество * ТаблицаТоваров.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ТаблицаТоваров.Количество КАК КоличествоУпаковок,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.СтатусЗаполненияУпаковок КАК СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров1 КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	ВЫБОР
	|		КОГДА СУММА(Доли.ДоляУпаковки) >= 1
	|			ТОГДА 0
	|		ИНАЧЕ 1.005 - СУММА(Доли.ДоляУпаковки)
	|	КОНЕЦ КАК ДоляУпаковки
	|ПОМЕСТИТЬ ОстаткиДолейУпаковок
	|ИЗ
	|	ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаНомеровУпаковок.ИдентификаторСтроки = ТаблицаТоваров.ИдентификаторСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДолиУпаковокМДЛП КАК Доли
	|		ПО (Доли.НомерУпаковки = ТаблицаНомеровУпаковок.НомерУпаковки)
	|			И (Доли.КлючУпаковки = ТаблицаНомеровУпаковок.КлючУпаковки)
	|			И (ВЫБОР
	|				КОГДА &ЕстьДокументРезерва
	|					ТОГДА Доли.ДокументРезерва <> &ДокументРезерва
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНомеровУпаковок.НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	ВЫБОР
	|		КОГДА СУММА(Доли.ДоляУпаковки) >= 1
	|			ТОГДА 0
	|		ИНАЧЕ 1.005 - СУММА(Доли.ДоляУпаковки)
	|	КОНЕЦ КАК ДоляУпаковкиРеестра
	|ПОМЕСТИТЬ ОстаткиДолейУпаковокРеестра
	|ИЗ
	|	ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаНомеровУпаковок.ИдентификаторСтроки = ТаблицаТоваров.ИдентификаторСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрВыбытияУпаковокМДЛП КАК Доли
	|		ПО (Доли.НомерУпаковки = ТаблицаНомеровУпаковок.НомерУпаковки)
	|			И (Доли.КлючУпаковки = ТаблицаНомеровУпаковок.КлючУпаковки)
	|			И (ВЫБОР
	|				КОГДА &ЕстьДокументРезерва
	|					ТОГДА Доли.ДокументРезерва <> &ДокументРезерва
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	Доли.СтатусВыбытия <> ЗНАЧЕНИЕ(Перечисление.СтатусыВыбытияУпаковокМДЛП.ОтклоненВыводИзОборота)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНомеровУпаковок.НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиДолейУпаковок.ДоляУпаковки, 1) > ЕСТЬNULL(ОстаткиДолейУпаковокРеестра.ДоляУпаковкиРеестра, 1)
	|			ТОГДА ЕСТЬNULL(ОстаткиДолейУпаковокРеестра.ДоляУпаковкиРеестра, 1)
	|		ИНАЧЕ ЕСТЬNULL(ОстаткиДолейУпаковок.ДоляУпаковки, 1)
	|	КОНЕЦ КАК ОстатокДоляУпаковки
	|ПОМЕСТИТЬ втНомераУпаковок
	|ИЗ
	|	ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДолейУпаковок КАК ОстаткиДолейУпаковок
	|		ПО ТаблицаНомеровУпаковок.НомерУпаковки = ОстаткиДолейУпаковок.НомерУпаковки
	|			И ТаблицаНомеровУпаковок.КлючУпаковки = ОстаткиДолейУпаковок.КлючУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДолейУпаковокРеестра КАК ОстаткиДолейУпаковокРеестра
	|		ПО ТаблицаНомеровУпаковок.НомерУпаковки = ОстаткиДолейУпаковокРеестра.НомерУпаковки
	|			И ТаблицаНомеровУпаковок.КлючУпаковки = ОстаткиДолейУпаковокРеестра.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(ВЫБОР
	|			КОГДА втНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоНомеровУпаковок
	|ПОМЕСТИТЬ втТаблицаНомеровУпаковок
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомераУпаковок КАК втНомераУпаковок
	|		ПО ТаблицаТоваров.ИдентификаторСтроки = втНомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТоваров.СтатусЗаполненияУпаковок <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &ЭтоПодарки
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаТоваров.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.КоличествоУпаковок / ТаблицаТоваров.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК ЧИСЛО(10, 5))
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК ДоляУпаковки,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втНомераУпаковок.ОстатокДоляУпаковки КАК ОстатокДоляУпаковки,
	|	втНомераУпаковок.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаНомеровУпаковок КАК втТаблицаНомеровУпаковок
	|		ПО ТаблицаТоваров.ИдентификаторСтроки = втТаблицаНомеровУпаковок.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомераУпаковок КАК втНомераУпаковок
	|		ПО ТаблицаТоваров.ИдентификаторСтроки = втНомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТоваров.СтатусЗаполненияУпаковок <> 0
	|	И втТаблицаНомеровУпаковок.КоличествоНомеровУпаковок > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерСтроки КАК НомерСтроки,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Количество КАК Количество,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТовары.ДоляУпаковки КАК ДоляУпаковки,
	|	втТовары.ОстатокДоляУпаковки КАК ОстатокДоляУпаковки,
	|	втТовары.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТовары КАК втТовары
	|ГДЕ
	|	втТовары.ДоляУпаковки > втТовары.ОстатокДоляУпаковки";
	
	КолонкиТовары = "НомерСтроки,ЕдиницаИзмерения,Количество,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок";
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,КолонкиТовары));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,КолонкиТовары));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		НомераУпаковок = Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки");
	Иначе
		НомераУпаковок = Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки");
	КонецЕсли;
	
	НомераУпаковок.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Для Каждого Строка Из НомераУпаковок Цикл
		Строка.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(Строка.НомерКиЗ);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", НомераУпаковок);
	
	Запрос.УстановитьПараметр("ЕстьДокументРезерва", ЗначениеЗаполнено(Объект.Ссылка));
	Запрос.УстановитьПараметр("ДокументРезерва"    , Объект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоПодарки"         , ЭтоПодарки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонЕстьОстаток = НСтр("ru = 'В строке ""%НомерСтроки%"" остаток частично израсходованной упаковки %НомерУпаковки% меньше требуемого.'");
	ШаблонНетОстатка  = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которого нет в наличии.'");
	
	Если ВыдаватьСообщения Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ОстатокДоляУпаковки > 0 Тогда
				ТекстСообщения = СтрЗаменить(ШаблонЕстьОстаток, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
			Иначе
				ТекстСообщения = СтрЗаменить(ШаблонНетОстатка, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
			КонецЕсли;
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "НомерСтроки");
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Отказ = Истина;
			#Иначе
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					Объект,
					Поле,
					"Объект",
					Отказ);
			#КонецЕсли
			
		КонецЦикла;
	Иначе
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.ОстатокДоляУпаковки > 0 Тогда
					ТекстСообщения = СтрЗаменить(ШаблонЕстьОстаток, "%НомерСтроки%", Выборка.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
				Иначе
					ТекстСообщения = СтрЗаменить(ШаблонНетОстатка, "%НомерСтроки%", Выборка.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
				КонецЕсли;
				Прервать;
			КонецЦикла;
			
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДублиНомеровУпаковокПриРозничнойПродаже(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "") Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерКИЗ
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчНомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	1 КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ПО тчТовары.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL";
	
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,"НомерСтроки,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"НомерСтроки,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки"));
	КонецЕсли;
	
	ТаблицаДублей = Запрос.Выполнить().Выгрузить();
	врТаблицаДублей = ТаблицаДублей.Скопировать();
	врТаблицаДублей.Свернуть("НомерКИЗ","Количество");
	
	Если ВыдаватьСообщения Тогда
		Для Каждого Строка Из врТаблицаДублей Цикл
			Если Строка.Количество > 1 Тогда
				
				НайденныеСтрокиДублейКиз = ТаблицаДублей.НайтиСтроки(Новый Структура("НомерКИЗ", Строка.НомерКИЗ));
				НомерСтрокиДубля = 0;
				Для Каждого СтрокаДубля Из НайденныеСтрокиДублейКиз Цикл
					Если СтрокаДубля.НомерСтроки > НомерСтрокиДубля Тогда
						НомерСтрокиДубля = СтрокаДубля.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" дублируется номер упаковки %НомерКИЗ%. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтрокиДубля);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерКИЗ%"   , Строка.НомерКИЗ);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, НомерСтрокиДубля, "НомерСтроки");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
				
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из врТаблицаДублей Цикл
			Если Строка.Количество > 1 Тогда
				
				НайденныеСтрокиДублейКиз = ТаблицаДублей.НайтиСтроки(Новый Структура("НомерКИЗ", Строка.НомерКИЗ));
				НомерСтрокиДубля = 0;
				Для Каждого СтрокаДубля Из НайденныеСтрокиДублейКиз Цикл
					Если СтрокаДубля.НомерСтроки > НомерСтрокиДубля Тогда
						НомерСтрокиДубля = СтрокаДубля.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" дублируется номер упаковки %НомерКИЗ%. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтрокиДубля);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерКИЗ%"   , Строка.НомерКИЗ);
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтатусыНомеровУпаковокПриРозничнойПродаже(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "") Экспорт
	
	Если НЕ ПолучитьПризнакКонтролироватьСтатусыКИЗ() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы)
	|		ИНАЧЕ &СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчНомераУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	тчНомераУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ПО тчТовары.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО тчТовары.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (СубъектыОбращенияМДЛП.СобственнаяОрганизация)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА тчТовары.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.НомерУпаковки КАК НомерУпаковки,
	|	ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") КАК НомерГрупповойУпаковки
	|ИЗ
	|	втТаблица КАК втТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкиМДЛП КАК СтатусыУпаковок
	|		ПО втТаблица.МестоДеятельности = СтатусыУпаковок.МестоДеятельности
	|			И втТаблица.НомерУпаковки = СтатусыУпаковок.НомерУпаковки
	|			И втТаблица.КлючУпаковки = СтатусыУпаковок.КлючУпаковки
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|			ИЛИ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|				И ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") <> """"
	|			ИЛИ ВЫБОР
	|				КОГДА СтатусыУпаковок.ДокументРезерва ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтатусыУпаковок.ДокументРезерва <> НЕОПРЕДЕЛЕНО
	|			КОНЕЦ)";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,"НомерСтроки,СтруктурнаяЕдиница,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"НомерСтроки,СтруктурнаяЕдиница,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		втНомераУпаковок = Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки");
	Иначе
		втНомераУпаковок = Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки");
	КонецЕсли;
	втНомераУпаковок.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Для Каждого Строка Из втНомераУпаковок Цикл
		Строка.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(Строка.НомерКИЗ);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", втНомераУпаковок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВыдаватьСообщения Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.НомерГрупповойУпаковки) Тогда
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которая вложена в групповую упаковку %КодУпаковки%. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерГрупповойУпаковки);
			Иначе
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которого нет в наличии. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
			КонецЕсли;
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "НомерСтроки");
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Отказ = Истина;
			#Иначе
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					Объект,
					Поле,
					"Объект",
					Отказ);
			#КонецЕсли
			
		КонецЦикла;
	Иначе
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.НомерГрупповойУпаковки) Тогда
					ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которая вложена в групповую упаковку %КодУпаковки%. Исправьте номера упаковок.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , Выборка.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерГрупповойУпаковки);
				Иначе
					ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которого нет в наличии. Исправьте номера упаковок.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , Выборка.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
				КонецЕсли;
				
				Прервать;
			КонецЦикла;
			
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСкладыВРозничнойПродаже(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ИмяТЧСерии = "ор_НомераУпаковок",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "") Экспорт
	
	ВедетсяМаркировка = ПолучитьПризнакВеденияУчетаМаркировки();
	
	Если НЕ ВедетсяМаркировка Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ОперацияСДенежнымиСредствами  Тогда
		Возврат;
	КонецЕсли;
	
	//Если Объект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
	//	Возврат;
	//КонецЕсли;
	
	ИспользоватьМестаДеятельности = ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.СтруктурнаяЕдиница
	|		ИНАЧЕ &СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерУпаковки
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	втТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ПО ТаблицаТоваров.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	тчТовары.Организация КАК Организация,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО тчТовары.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА тчТовары.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(втТаблица.НомерСтроки) КАК НомерСтроки,
	|	втТаблица.Организация КАК Организация,
	|	втТаблица.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	втТаблица КАК втТаблица
	|ГДЕ
	|	втТаблица.МестоДеятельности = ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблица.Организация,
	|	втТаблица.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТаблица.МестоДеятельности КАК МестоДеятельности
	|ИЗ
	|	втТаблица КАК втТаблица
	|ГДЕ
	|	втТаблица.МестоДеятельности <> ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ИспользоватьМестаДеятельности);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,"НомерСтроки,СтруктурнаяЕдиница,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"НомерСтроки,СтруктурнаяЕдиница,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки"));
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если ВыдаватьСообщения Тогда
		
		Выборка = Результат[5].Выбрать();
		
		Если Выборка.Количество() > 1 Тогда
			
			ТекстСообщения = НСтр("ru = 'В одном чеке могут быть маркируемые товары по одному месту деятельности МДЛП. Проверьте настройки соответствия МДЛП.'");
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Отказ = Истина;
			#Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			#КонецЕсли
			
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = Результат[4].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ИспользоватьМестаДеятельности Тогда
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" выбран склад ""%Склад%"" для которого не настроено место деятельности МДЛП.'");
				
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%"      , Выборка.СтруктурнаяЕдиница);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧТовары, Выборка.НомерСтроки, "СтруктурнаяЕдиница");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						Объект,
						Поле,
						"Объект",
						Отказ);
				#КонецЕсли
			Иначе
				
				ТекстСообщения = НСтр("ru = 'Для организации ""%Организация%"" не настроено место деятельности МДЛП.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Организация%", Выборка.Организация);
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Отказ = Истина;
				#Иначе
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				#КонецЕсли
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		
		Выборка = Результат[5].Выбрать();
		
		Если Выборка.Количество() > 1 Тогда
			
			ТекстСообщения = НСтр("ru = 'В одном чеке, пробиваемом в ККТ с передачей данных, могут пробиваться маркируемые товары по одному месту деятельности МДЛП. Проверьте настройки соответствия МДЛП.'");
			
			Отказ = Истина;
			
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Результат[4].Пустой() Тогда
			
			Выборка = Результат[4].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если ИспользоватьМестаДеятельности Тогда
					ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" выбран склад ""%Склад%"" для которого не настроено место деятельности МДЛП.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%"      , Выборка.СтруктурнаяЕдиница);
				Иначе
					ТекстСообщения = НСтр("ru = 'Для организации ""%Организация%"" не настроено место деятельности МДЛП.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Организация%", Выборка.Организация);
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеРецептовПриРозничнойПродаже(Объект,
	Отказ,
	ИмяТЧТовары = "Запасы",
	ВыдаватьСообщения = Истина,
	ТекстСообщения = "") Экспорт
	
	Если ЭтоКассаСФФД12(Объект.КассаККМ) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.ор_НомерСерииРецепта КАК ор_НомерСерииРецепта,
	|	ТаблицаТоваров.ор_НомерРецепта КАК ор_НомерРецепта,
	|	ТаблицаТоваров.ор_ДатаРегистрацииРецепта КАК ор_ДатаРегистрацииРецепта,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.ор_НомерСерииРецепта КАК ор_НомерСерииРецепта,
	|	тчТовары.ор_НомерРецепта КАК ор_НомерРецепта,
	|	тчТовары.ор_ДатаРегистрацииРецепта КАК ор_ДатаРегистрацииРецепта
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И тчТовары.ор_ДатаРегистрацииРецепта <> &ПустаяДатаРецепта
	|
	|СГРУППИРОВАТЬ ПО
	|	тчТовары.ор_НомерСерииРецепта,
	|	тчТовары.ор_НомерРецепта,
	|	тчТовары.ор_ДатаРегистрацииРецепта";
	
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать());
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустаяДатаРецепта", Дата(1,1,1));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 1 Тогда
		
		Если ВыдаватьСообщения Тогда
			
			ТекстСообщения = НСтр("ru = 'При использовании ККТ с версией ФФД ниже 1.2 в одном чеке можно вводить данные только одного рецепта. Исправьте данные по рецептам.'");
			
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Отказ = Истина;
			#Иначе
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					,
					,
					,
					Отказ);
			#КонецЕсли
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'При использовании ККТ с версией ФФД ниже 1.2 в одном чеке можно вводить данные только одного рецепта. Исправьте данные по рецептам.'");
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоПродажаУпаковокНеВОборотеВРежимеПредупреждения(Объект, НомераУпаковокНеВОбороте) Экспорт
	
	ИмяТЧТовары = "Запасы";
	ИмяТЧСерии = "ор_НомераУпаковок";
	
	ПродажаУпаковокНеВОборотеВРежимеПредупреждения = Ложь;
	
	Если НомераУпаковокНеВОбороте = Неопределено Тогда
		НомераУпаковокНеВОбороте = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПолучитьПризнакПредупреждатьСтатусыКИЗ() Тогда
		Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	КонецЕсли;
	
	Если Объект.ОперацияСДенежнымиСредствами  Тогда
		Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	КонецЕсли;
	
	//Если Объект.ВидОперации <> Перечисления.ВидыОперацийЧекККМ.Продажа Тогда 
	//	Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы)
	|		ИНАЧЕ &СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаТоваров.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ТаблицаТоваров.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНомеровУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаНомеровУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	ТаблицаНомеровУпаковок.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаНомеровУпаковок
	|ИЗ
	|	&ТаблицаНомеровУпаковок КАК ТаблицаНомеровУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Характеристика КАК Характеристика,
	|	тчНомераУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	тчНомераУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНомеровУпаковок КАК тчНомераУпаковок
	|		ПО тчТовары.ор_ИдентификаторСтроки = тчНомераУпаковок.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО тчТовары.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (СубъектыОбращенияМДЛП.СобственнаяОрганизация)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА тчТовары.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	тчТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И НЕ тчНомераУпаковок.ИдентификаторСтроки ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.Характеристика КАК Характеристика,
	|	втТаблица.НомерУпаковки КАК НомерУпаковки,
	|	ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") КАК НомерГрупповойУпаковки,
	|	ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	втТаблица КАК втТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкиМДЛП КАК СтатусыУпаковок
	|		ПО втТаблица.МестоДеятельности = СтатусыУпаковок.МестоДеятельности
	|			И втТаблица.НомерУпаковки = СтатусыУпаковок.НомерУпаковки
	|			И втТаблица.КлючУпаковки = СтатусыУпаковок.КлючУпаковки
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|			ИЛИ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|				И ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") <> """"
	|			ИЛИ ВЫБОР
	|				КОГДА СтатусыУпаковок.ДокументРезерва ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтатусыУпаковок.ДокументРезерва <> НЕОПРЕДЕЛЕНО
	|			КОНЕЦ)";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	Если ТипЗнч(Объект[ИмяТЧТовары]) = Тип("ТаблицаЗначений") Тогда
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Скопировать(,"НомерСтроки,Номенклатура,Характеристика,СтруктурнаяЕдиница,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТовары", Объект[ИмяТЧТовары].Выгрузить(,"НомерСтроки,Номенклатура,Характеристика,СтруктурнаяЕдиница,ор_ИдентификаторСтроки,ор_СтатусЗаполненияУпаковок"));
	КонецЕсли;
	
	Если ТипЗнч(Объект[ИмяТЧСерии]) = Тип("ТаблицаЗначений") Тогда
		втНомераУпаковок = Объект[ИмяТЧСерии].Скопировать(,"НомерКИЗ,ИдентификаторСтроки");
	Иначе
		втНомераУпаковок = Объект[ИмяТЧСерии].Выгрузить(,"НомерКИЗ,ИдентификаторСтроки");
	КонецЕсли;
	втНомераУпаковок.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Для Каждого Строка Из втНомераУпаковок Цикл
		Строка.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(Строка.НомерКИЗ);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТаблицаНомеровУпаковок", втНомераУпаковок);
	
	ТекстКизовВУпаковке = "";
	ТекстКизовОтсутствуют = "";
	ТекстКизовНеПриняты = "";
	ШаблонСтроки = НСтр("ru = 'Строка №%НомерСтроки% %Товар% %НомерУпаковки%'");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПродажаУпаковокНеВОборотеВРежимеПредупреждения = Истина;
		
		Если ЗначениеЗаполнено(Выборка.Статус) И Выборка.Статус = Перечисления.СтатусыУпаковокМДЛП.ВУпаковке Тогда
			
			ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Товар%", ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%НомерУпаковки%", Выборка.НомерУпаковки);
			
			Если ТекстКизовВУпаковке = "" Тогда
				ТекстКизовВУпаковке = НСтр("ru = 'Требуется завершение операции расформирования для:'") + Символы.ПС;
			КонецЕсли;
			ТекстКизовВУпаковке = ТекстКизовВУпаковке + ТекстСтроки + Символы.ПС;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Статус) Тогда
			
			ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Товар%", ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%НомерУпаковки%", Выборка.НомерУпаковки);
			
			Если ТекстКизовНеПриняты = "" Тогда
				ТекстКизовНеПриняты = НСтр("ru = 'Требуется завершение операции приемки для:'") + Символы.ПС;
			КонецЕсли;
			ТекстКизовНеПриняты = ТекстКизовНеПриняты + ТекстСтроки + Символы.ПС;
			
		Иначе
			
			ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Товар%", ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%НомерУпаковки%", Выборка.НомерУпаковки);
			
			Если ТекстКизовОтсутствуют = "" Тогда
				ТекстКизовОтсутствуют = НСтр("ru = 'Требуется выполнение операции приемки для:'") + Символы.ПС;;
			КонецЕсли;
			ТекстКизовОтсутствуют = ТекстКизовОтсутствуют + ТекстСтроки + Символы.ПС;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстВопроса = НСтр("ru = 'В чеке найдены позиции, для которых не завершены (или не выполнены) операции приемки или расформирования транспортных упаковок в рамках обмена с системой МДЛП.'") + Символы.ПС;
	ТекстВопроса = ТекстВопроса + НСтр("ru = 'Рекомендуем завершить эти операции перед выполнением розничной продажи.'") + Символы.ПС;
	ТекстВопроса = ТекстВопроса + Символы.ПС; //Отступ
	ТекстВопроса = ТекстВопроса + НСтр("ru = 'Продолжить пробитие чека?'") + Символы.ПС;
	
	ТекстВопроса = ТекстВопроса + Символы.ПС; //Отступ
	ТекстВопроса = ТекстВопроса + ТекстКизовОтсутствуют + Символы.ПС;
	ТекстВопроса = ТекстВопроса + ТекстКизовНеПриняты + Символы.ПС;
	ТекстВопроса = ТекстВопроса + ТекстКизовВУпаковке + Символы.ПС;
	
	НомераУпаковокНеВОбороте.Вставить("ЗаголовокИнформации", НСтр("ru = 'Продажа упаковок маркируемых товаров'"));
	НомераУпаковокНеВОбороте.Вставить("ТекстВопроса", ТекстВопроса);
	
	Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	
КонецФункции

Процедура ПроверитьНомераУпаковокТоваровРМК(Форма, КонтрольМДЛППройден, ТекстОшибки) Экспорт
	
	Отказ = Ложь;
	
	Если НЕ Отказ Тогда
		ПроверитьКоличествоВторичныхУпаковокРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьЗаполнениеКоличестваБлистеровРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьОстатокНомеровУпаковокРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьСтатусыНомеровУпаковокРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьУпаковкиНоменклатурыРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьСкладыВРозничнойПродажеРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьРецептыВРозничнойПродажеРМК(Форма, Отказ, ТекстОшибки);
	КонецЕсли;
	
	Если Отказ Тогда
		КонтрольМДЛППройден = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеКоличестваБлистеровРМК(Форма, Отказ, ТекстСообщения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.Упаковка) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.Характеристика КАК Характеристика,
	|	втТаблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок
	|ИЗ
	|	ТаблицаТоваров КАК втТаблица
	|ГДЕ
	|	втТаблица.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	И втТаблица.КоличествоУпаковок > втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок";
	
	Товары = Форма.Объект.Товары.Выгрузить();
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура)
			И ЗначениеЗаполнено(Строка.Характеристика)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			НоваяСтрока = ТоварыМДЛП.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонОбщий                    = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" '");
	ШаблонКолБлистеровНеправильное = НСтр("ru = 'указано количество %КоличествоУпаковок%. Максимальное количество %КоличествоПервичныхУпаковок%.'");
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			
			ТекстСообщенияТело = СтрЗаменить(ШаблонКолБлистеровНеправильное, "%КоличествоУпаковок%",Выборка.КоличествоУпаковок);
			ТекстСообщенияТело = СтрЗаменить(ТекстСообщенияТело, "%КоличествоПервичныхУпаковок%",Выборка.КоличествоПервичныхУпаковок);
			
			ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
			
			Отказ = Истина;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКоличествоВторичныхУпаковокРМК(Форма, Отказ, ТекстСообщения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Количество КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.Упаковка) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.Характеристика КАК Характеристика,
	|	втТаблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок
	|ИЗ
	|	ТаблицаТоваров КАК втТаблица
	|ГДЕ
	|	втТаблица.КоличествоУпаковок > 1
	|	И (втТаблица.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ИЛИ втТаблица.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок <= 1)";
	
	Товары = Форма.Объект.Товары.Выгрузить();
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура)
			И ЗначениеЗаполнено(Строка.Характеристика)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			НоваяСтрока = ТоварыМДЛП.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонОбщий           = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" '");
	ШаблонКолНеправильное = НСтр("ru = 'указано количество %Количество%. Максимальное количество 1.'");
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщенияОбщий = СтрЗаменить(ШаблонОбщий, "%НомерСтроки%", Выборка.НомерСтроки);
		ТекстСообщенияОбщий = СтрЗаменить(ТекстСообщенияОбщий, "%Товар%",ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		
		ТекстСообщенияТело = СтрЗаменить(ШаблонКолНеправильное, "%Количество%",Выборка.КоличествоУпаковок);
		
		ТекстСообщения = ТекстСообщенияОбщий + ТекстСообщенияТело;
		
		Отказ = Истина;
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьОстатокНомеровУпаковокРМК(Форма, Отказ, ТекстСообщения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.Упаковка) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.НомерКИЗ КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаТоваров1
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Количество * ТаблицаТоваров.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ТаблицаТоваров.Количество КАК КоличествоУпаковок,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров1 КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки,
	|	ВЫБОР
	|		КОГДА СУММА(Доли.ДоляУпаковки) >= 1
	|			ТОГДА 0
	|		ИНАЧЕ 1.005 - СУММА(Доли.ДоляУпаковки)
	|	КОНЕЦ КАК ДоляУпаковки
	|ПОМЕСТИТЬ ОстаткиДолейУпаковок
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДолиУпаковокМДЛП КАК Доли
	|		ПО (Доли.НомерУпаковки = ТаблицаТоваров.НомерУпаковки)
	|			И (Доли.КлючУпаковки = ТаблицаТоваров.КлючУпаковки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки,
	|	ВЫБОР
	|		КОГДА СУММА(Доли.ДоляУпаковки) >= 1
	|			ТОГДА 0
	|		ИНАЧЕ 1.005 - СУММА(Доли.ДоляУпаковки)
	|	КОНЕЦ КАК ДоляУпаковкиРеестра
	|ПОМЕСТИТЬ ОстаткиДолейУпаковокРеестра
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрВыбытияУпаковокМДЛП КАК Доли
	|		ПО (Доли.НомерУпаковки = ТаблицаТоваров.НомерУпаковки)
	|			И (Доли.КлючУпаковки = ТаблицаТоваров.КлючУпаковки)
	|ГДЕ
	|	Доли.СтатусВыбытия <> ЗНАЧЕНИЕ(Перечисление.СтатусыВыбытияУпаковокМДЛП.ОтклоненВыводИзОборота)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиДолейУпаковок.ДоляУпаковки, 1) > ЕСТЬNULL(ОстаткиДолейУпаковокРеестра.ДоляУпаковкиРеестра, 1)
	|			ТОГДА ЕСТЬNULL(ОстаткиДолейУпаковокРеестра.ДоляУпаковкиРеестра, 1)
	|		ИНАЧЕ ЕСТЬNULL(ОстаткиДолейУпаковок.ДоляУпаковки, 1)
	|	КОНЕЦ КАК ОстатокДоляУпаковки
	|ПОМЕСТИТЬ втНомераУпаковок
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДолейУпаковок КАК ОстаткиДолейУпаковок
	|		ПО ТаблицаТоваров.НомерУпаковки = ОстаткиДолейУпаковок.НомерУпаковки
	|			И ТаблицаТоваров.КлючУпаковки = ОстаткиДолейУпаковок.КлючУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДолейУпаковокРеестра КАК ОстаткиДолейУпаковокРеестра
	|		ПО ТаблицаТоваров.НомерУпаковки = ОстаткиДолейУпаковокРеестра.НомерУпаковки
	|			И ТаблицаТоваров.КлючУпаковки = ОстаткиДолейУпаковокРеестра.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.КоличествоУпаковок / ТаблицаТоваров.ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок КАК ЧИСЛО(10, 5))
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ДоляУпаковки,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втНомераУпаковок.ОстатокДоляУпаковки КАК ОстатокДоляУпаковки,
	|	втНомераУпаковок.НомерУпаковки КАК НомерУпаковки
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомераУпаковок КАК втНомераУпаковок
	|		ПО ТаблицаТоваров.НомерУпаковки = втНомераУпаковок.НомерУпаковки
	|			И ТаблицаТоваров.КлючУпаковки = втНомераУпаковок.КлючУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерСтроки КАК НомерСтроки,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.Количество КАК Количество,
	|	втТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТовары.ДоляУпаковки КАК ДоляУпаковки,
	|	втТовары.ОстатокДоляУпаковки КАК ОстатокДоляУпаковки,
	|	втТовары.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	втТовары КАК втТовары
	|ГДЕ
	|	втТовары.ДоляУпаковки > втТовары.ОстатокДоляУпаковки";
	
	Товары = Форма.Объект.Товары.Выгрузить();
	
	СимволGS1 = ОбщегоНазначенияБПОКлиентСервер.РазделительGS1();
	Разделитель = ОбщегоНазначенияБПОКлиентСервер.ЭкранированныйСимволGS1();
	
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	ТоварыМДЛП.Колонки.Добавить("НомерКИЗ", ОбщегоНазначения.ОписаниеТипаСтрока(27));
	ТоварыМДЛП.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.КодМаркировки)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			
			КодМаркировкиОригинал = СтрЗаменить(Строка.КодМаркировки, Разделитель, СимволGS1);
			СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(КодМаркировкиОригинал);
			
			Если СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар") Тогда
				НоваяСтрока = ТоварыМДЛП.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.НомерКИЗ = СтруктураМаркировкиМДЛП.Данные.sgtin;
				НоваяСтрока.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НоваяСтрока.НомерКиЗ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонЕстьОстаток = НСтр("ru = 'В строке ""%НомерСтроки%"" остаток частично израсходованной упаковки %НомерУпаковки% меньше требуемого.'");
	ШаблонНетОстатка  = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которого нет в наличии.'");
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ОстатокДоляУпаковки > 0 Тогда
				ТекстСообщения = СтрЗаменить(ШаблонЕстьОстаток, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
			Иначе
				ТекстСообщения = СтрЗаменить(ШаблонНетОстатка, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
			КонецЕсли;
			
			Отказ = Истина;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтатусыНомеровУпаковокРМК(Форма, Отказ, ТекстСообщения) Экспорт
	
	Если НЕ ПолучитьПризнакКонтролироватьСтатусыКИЗ() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКассККМ.Организация КАК Организация,
	|	ТаблицаКассККМ.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ ТаблицаКассККМ
	|ИЗ
	|	&ТаблицаКассККМ КАК ТаблицаКассККМ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ТаблицаТоваров.НомерКИЗ КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрКассыККМ.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ТаблицаТоваров.ТорговыйОбъект
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКассККМ КАК ТаблицаКассККМ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК СпрКассыККМ
	|			ПО ТаблицаКассККМ.КассаККМ = СпрКассыККМ.Ссылка
	|		ПО ТаблицаТоваров.Организация = ТаблицаКассККМ.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	втТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО ТаблицаТоваров.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (СубъектыОбращенияМДЛП.СобственнаяОрганизация)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА ТаблицаТоваров.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.НомерУпаковки КАК НомерУпаковки,
	|	ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") КАК НомерГрупповойУпаковки
	|ИЗ
	|	втТаблица КАК втТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкиМДЛП КАК СтатусыУпаковок
	|		ПО втТаблица.МестоДеятельности = СтатусыУпаковок.МестоДеятельности
	|			И втТаблица.НомерУпаковки = СтатусыУпаковок.НомерУпаковки
	|			И втТаблица.КлючУпаковки = СтатусыУпаковок.КлючУпаковки
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|			ИЛИ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|				И ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") <> """"
	|			ИЛИ ВЫБОР
	|				КОГДА СтатусыУпаковок.ДокументРезерва ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтатусыУпаковок.ДокументРезерва <> НЕОПРЕДЕЛЕНО
	|			КОНЕЦ)";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("ТаблицаКассККМ", Форма.ТаблицаКассККМОрганизаций.Выгрузить());
	
	Товары = Форма.Объект.Товары.Выгрузить();
	
	СимволGS1 = ОбщегоНазначенияБПОКлиентСервер.РазделительGS1();
	Разделитель = ОбщегоНазначенияБПОКлиентСервер.ЭкранированныйСимволGS1();
	
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	ТоварыМДЛП.Колонки.Добавить("НомерКИЗ", ОбщегоНазначения.ОписаниеТипаСтрока(27));
	ТоварыМДЛП.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.КодМаркировки)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			
			КодМаркировкиОригинал = СтрЗаменить(Строка.КодМаркировки, Разделитель, СимволGS1);
			СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(КодМаркировкиОригинал);
			
			Если СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар") Тогда
				НоваяСтрока = ТоварыМДЛП.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.НомерКИЗ = СтруктураМаркировкиМДЛП.Данные.sgtin;
				НоваяСтрока.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НоваяСтрока.НомерКиЗ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.НомерГрупповойУпаковки) Тогда
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которая вложена в групповую упаковку %КодУпаковки%. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерГрупповойУпаковки);
			Иначе
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" указан номер упаковки %НомерУпаковки%, которого нет в наличии. Исправьте номера упаковок.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"  , Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Выборка.НомерУпаковки);
			КонецЕсли;
			
			Отказ = Истина;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУпаковкиНоменклатурыРМК(Форма, Отказ, ТекстСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТоваров.Упаковка) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.ЕдиницыИзмерения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Характеристика КАК Характеристика,
	|	тчТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ор_КоличествоПервичныхУпаковок КАК КоличествоПервичныхУпаковок,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент
	|ИЗ
	|	ТаблицаТоваров КАК тчТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО тчТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка";
	
	Товары = Форма.Объект.Товары.Выгрузить();
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура)
			И ЗначениеЗаполнено(Строка.Характеристика)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			
			НоваяСтрока = ТоварыМДЛП.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Пока Выборка.Следующий() Цикл
			
			Если (Выборка.КоличествоПервичныхУпаковок - Цел(Выборка.КоличествоПервичныхУпаковок)) > 0 Тогда
				
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" для товара ""%Товар%"" указана единица измерения ""%ЕдиницаИзмерения%"" с некорректным количеством первичных упаковок ""%Количество%"".'");
				ТекстСообщения = ТекстСообщения + " " + НСтр("ru = 'Количество первичных упаковок должно быть целым числом'");
				
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%"     , Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%"           , ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", Выборка.ЕдиницаИзмерения);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%"      , Выборка.КоличествоПервичныхУпаковок);
				
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСкладыВРозничнойПродажеРМК(Форма, Отказ, ТекстСообщения) Экспорт
	
	ВедетсяМаркировка = ПолучитьПризнакВеденияУчетаМаркировки();
	
	Если НЕ ВедетсяМаркировка Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьМестаДеятельности = ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКассККМ.Организация КАК Организация,
	|	ТаблицаКассККМ.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ ТаблицаКассККМ
	|ИЗ
	|	&ТаблицаКассККМ КАК ТаблицаКассККМ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ТаблицаТоваров.ТорговыйОбъект КАК ТорговыйОбъект
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрКассыККМ.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ТаблицаТоваров.ТорговыйОбъект
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(СпрКассыККМ.ПодключаемоеОборудование, ЗНАЧЕНИЕ(Справочник.ПодключаемоеОборудование.ПустаяСсылка)) КАК ПодключаемоеОборудование,
	|	ЕСТЬNULL(СпрКассыККМ.ор_МДЛПОтправлятьДанныеМаркируемыхТоваровЧерезОФД, ЛОЖЬ) КАК ОтправлятьЧерезОФД
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКассККМ КАК ТаблицаКассККМ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК СпрКассыККМ
	|			ПО ТаблицаКассККМ.КассаККМ = СпрКассыККМ.Ссылка
	|		ПО ТаблицаТоваров.Организация = ТаблицаКассККМ.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	тчТовары.Организация КАК Организация,
	|	тчТовары.СистемаНалогообложения КАК СистемаНалогообложения,
	|	тчТовары.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	тчТовары.ОтправлятьЧерезОФД КАК ОтправлятьЧерезОФД,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	втТаблицаТоваров КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО тчТовары.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА тчТовары.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(втТаблица.НомерСтроки) КАК НомерСтроки,
	|	втТаблица.Организация КАК Организация,
	|	втТаблица.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	втТаблица КАК втТаблица
	|ГДЕ
	|	втТаблица.МестоДеятельности = ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблица.Организация,
	|	втТаблица.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.Организация КАК Организация,
	|	втТаблица.СистемаНалогообложения КАК СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД КАК ОтправлятьЧерезОФД,
	|	втТаблица.МестоДеятельности КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица1
	|ИЗ
	|	втТаблица КАК втТаблица
	|ГДЕ
	|	втТаблица.МестоДеятельности <> ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблица.Организация,
	|	втТаблица.СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД,
	|	втТаблица.МестоДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.Организация КАК Организация,
	|	втТаблица.СистемаНалогообложения КАК СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД КАК ОтправлятьЧерезОФД,
	|	Сумма(1) КАК Количество
	|ИЗ
	|	втТаблица1 КАК втТаблица
	|ГДЕ
	|	втТаблица.МестоДеятельности <> ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблица.Организация,
	|	втТаблица.СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ИспользоватьМестаДеятельности);
	Запрос.УстановитьПараметр("ТаблицаКассККМ", Форма.ТаблицаКассККМОрганизаций.Выгрузить());
	
	
	Товары = Форма.Объект.Товары.Выгрузить();
	
	СимволGS1 = ОбщегоНазначенияБПОКлиентСервер.РазделительGS1();
	Разделитель = ОбщегоНазначенияБПОКлиентСервер.ЭкранированныйСимволGS1();
	
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	ТоварыМДЛП.Колонки.Добавить("НомерКИЗ", ОбщегоНазначения.ОписаниеТипаСтрока(27));
	ТоварыМДЛП.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.КодМаркировки)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			
			НоваяСтрока = ТоварыМДЛП.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Не Результат[6].Пустой() Тогда
		
		Выборка = Результат[6].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ОтправлятьЧерезОФД
				И Выборка.Количество > 1 Тогда
				
				Если ЗначениеЗаполнено(Выборка.ПодключаемоеОборудование)
					И МенеджерОборудованияВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(Выборка.ПодключаемоеОборудование) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстСообщения = НСтр("ru = 'В чеке по организации ""%Организация%"" можно подбирать маркируемые товары только по одному месту деятельности МДЛП. Проверьте настройки соответствия МДЛП.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Организация%", Выборка.Организация);
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат[4].Пустой() Тогда
		
		Выборка = Результат[4].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ИспользоватьМестаДеятельности Тогда
				ТекстСообщения = НСтр("ru = 'В строке ""%НомерСтроки%"" выбран склад ""%Склад%"" для которого не настроено место деятельности МДЛП.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%"      , Выборка.СтруктурнаяЕдиница);
			Иначе
				ТекстСообщения = НСтр("ru = 'Для организации ""%Организация%"" не настроено место деятельности МДЛП.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Организация%", Выборка.Организация);
			КонецЕсли;
			
			Отказ = Истина;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРецептыВРозничнойПродажеРМК(Форма, Отказ, ТекстСообщения) Экспорт
	
	ВедетсяМаркировка = ПолучитьПризнакВеденияУчетаМаркировки();
	
	Если НЕ ВедетсяМаркировка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКассККМ.Организация КАК Организация,
	|	ТаблицаКассККМ.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ ТаблицаКассККМ
	|ИЗ
	|	&ТаблицаКассККМ КАК ТаблицаКассККМ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ТаблицаТоваров.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ТаблицаТоваров.ор_НомерСерииРецепта КАК ор_НомерСерииРецепта,
	|	ТаблицаТоваров.ор_НомерРецепта КАК ор_НомерРецепта,
	|	ТаблицаТоваров.ор_ДатаРегистрацииРецепта КАК ор_ДатаРегистрацииРецепта
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрКассыККМ.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ТаблицаТоваров.ТорговыйОбъект
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(СпрКассыККМ.ПодключаемоеОборудование, ЗНАЧЕНИЕ(Справочник.ПодключаемоеОборудование.ПустаяСсылка)) КАК ПодключаемоеОборудование,
	|	ЕСТЬNULL(СпрКассыККМ.ор_МДЛПОтправлятьДанныеМаркируемыхТоваровЧерезОФД, ЛОЖЬ) КАК ОтправлятьЧерезОФД,
	|	ТаблицаТоваров.ор_НомерСерииРецепта КАК ор_НомерСерииРецепта,
	|	ТаблицаТоваров.ор_НомерРецепта КАК ор_НомерРецепта,
	|	ТаблицаТоваров.ор_ДатаРегистрацииРецепта КАК ор_ДатаРегистрацииРецепта
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКассККМ КАК ТаблицаКассККМ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК СпрКассыККМ
	|			ПО ТаблицаКассККМ.КассаККМ = СпрКассыККМ.Ссылка
	|		ПО ТаблицаТоваров.Организация = ТаблицаКассККМ.Организация
	|ГДЕ
	|	ТаблицаТоваров.ор_ДатаРегистрацииРецепта <> &ПустаяДатаРецепта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.Организация КАК Организация,
	|	втТаблица.СистемаНалогообложения КАК СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД КАК ОтправлятьЧерезОФД,
	|	втТаблица.ор_НомерСерииРецепта КАК ор_НомерСерииРецепта,
	|	втТаблица.ор_НомерРецепта КАК ор_НомерРецепта,
	|	втТаблица.ор_ДатаРегистрацииРецепта КАК ор_ДатаРегистрацииРецепта
	|ПОМЕСТИТЬ втТаблицаГруппа
	|ИЗ
	|	втТаблица КАК втТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблица.Организация,
	|	втТаблица.СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД,
	|	втТаблица.ор_НомерСерииРецепта,
	|	втТаблица.ор_НомерРецепта,
	|	втТаблица.ор_ДатаРегистрацииРецепта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.Организация КАК Организация,
	|	втТаблица.СистемаНалогообложения КАК СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД КАК ОтправлятьЧерезОФД,
	|	Сумма(1) КАК Количество
	|ИЗ
	|	втТаблицаГруппа КАК втТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблица.Организация,
	|	втТаблица.СистемаНалогообложения,
	|	втТаблица.ПодключаемоеОборудование,
	|	втТаблица.ОтправлятьЧерезОФД";
	
	Запрос.УстановитьПараметр("ТаблицаКассККМ", Форма.ТаблицаКассККМОрганизаций.Выгрузить());
	Запрос.УстановитьПараметр("ПустаяДатаРецепта", Дата(1,1,1));
	
	Товары = Форма.Объект.Товары.Выгрузить();
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.КодМаркировки)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			НоваяСтрока = ТоварыМДЛП.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОтправлятьЧерезОФД
			И Выборка.Количество > 1 Тогда
			
			Если ЗначениеЗаполнено(Выборка.ПодключаемоеОборудование)
				И МенеджерОборудованияВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(Выборка.ПодключаемоеОборудование) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстСообщения = НСтр("ru = 'При использовании ККТ с версией ФФД ниже 1.2 в одном чеке можно вводить данные только одного рецепта. Исправьте данные по рецептам.'");
			//ТекстСообщения = НСтр("ru = 'При использовании ККТ с версией ФФД ниже 1.2 в одном чеке можно вводить данные только одного рецепта. Исправьте данные по рецептам по организации ""%Организация%"".'");
			//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Организация%", Выборка.Организация);
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоПродажаУпаковокНеВОборотеВРежимеПредупрежденияРМК(Форма, НомераУпаковокНеВОбороте, ПризнакЗапрета) Экспорт
	
	ПродажаУпаковокНеВОборотеВРежимеПредупреждения = Ложь;
	
	Если НомераУпаковокНеВОбороте = Неопределено Тогда
		НомераУпаковокНеВОбороте = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПолучитьПризнакПредупреждатьСтатусыКИЗ() Тогда
		Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	КонецЕсли;
	
	Если ПризнакЗапрета Тогда
		Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКассККМ.Организация КАК Организация,
	|	ТаблицаКассККМ.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ ТаблицаКассККМ
	|ИЗ
	|	&ТаблицаКассККМ КАК ТаблицаКассККМ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ТаблицаТоваров.НомерКИЗ КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрКассыККМ.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ТаблицаТоваров.ТорговыйОбъект
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКассККМ КАК ТаблицаКассККМ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК СпрКассыККМ
	|			ПО ТаблицаКассККМ.КассаККМ = СпрКассыККМ.Ссылка
	|		ПО ТаблицаТоваров.Организация = ТаблицаКассККМ.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.НомерУпаковки КАК НомерУпаковки,
	|	ТаблицаТоваров.КлючУпаковки КАК КлючУпаковки,
	|	ЕСТЬNULL(СубъектыОбращенияМДЛП.МестоДеятельности, ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)) КАК МестоДеятельности
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	втТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|		ПО ТаблицаТоваров.Организация = СубъектыОбращенияМДЛП.ОрганизацияКонтрагент
	|			И (СубъектыОбращенияМДЛП.СобственнаяОрганизация)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьМестаДеятельности
	|					ТОГДА ТаблицаТоваров.СтруктурнаяЕдиница = СубъектыОбращенияМДЛП.ОбъектМестаДеятельности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.Характеристика КАК Характеристика,
	|	втТаблица.НомерУпаковки КАК НомерУпаковки,
	|	ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") КАК НомерГрупповойУпаковки,
	|	ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	втТаблица КАК втТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкиМДЛП КАК СтатусыУпаковок
	|		ПО втТаблица.МестоДеятельности = СтатусыУпаковок.МестоДеятельности
	|			И втТаблица.НомерУпаковки = СтатусыУпаковок.НомерУпаковки
	|			И втТаблица.КлючУпаковки = СтатусыУпаковок.КлючУпаковки
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|			ИЛИ ЕСТЬNULL(СтатусыУпаковок.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыУпаковокМДЛП.ВОбороте)
	|				И ЕСТЬNULL(СтатусыУпаковок.НомерГрупповойУпаковки, """") <> """"
	|			ИЛИ ВЫБОР
	|				КОГДА СтатусыУпаковок.ДокументРезерва ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтатусыУпаковок.ДокументРезерва <> НЕОПРЕДЕЛЕНО
	|			КОНЕЦ)";
	
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("ТаблицаКассККМ", Форма.ТаблицаКассККМОрганизаций.Выгрузить());
	
	Товары = Форма.Объект.Товары.Выгрузить();
	
	СимволGS1 = ОбщегоНазначенияБПОКлиентСервер.РазделительGS1();
	Разделитель = ОбщегоНазначенияБПОКлиентСервер.ЭкранированныйСимволGS1();
	
	ТоварыМДЛП = Товары.Скопировать();
	ТоварыМДЛП.Очистить();
	ТоварыМДЛП.Колонки.Добавить("НомерКИЗ", ОбщегоНазначения.ОписаниеТипаСтрока(27));
	ТоварыМДЛП.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.КодМаркировки)
			И ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(Строка.Номенклатура)
			И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(Строка.Характеристика) Тогда
			
			КодМаркировкиОригинал = СтрЗаменить(Строка.КодМаркировки, Разделитель, СимволGS1);
			СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(КодМаркировкиОригинал);
			
			Если СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар") Тогда
				НоваяСтрока = ТоварыМДЛП.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.НомерКИЗ = СтруктураМаркировкиМДЛП.Данные.sgtin;
				НоваяСтрока.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НоваяСтрока.НомерКиЗ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТоварыМДЛП);
	
	ТекстКизовВУпаковке = "";
	ТекстКизовОтсутствуют = "";
	ТекстКизовНеПриняты = "";
	ШаблонСтроки = НСтр("ru = 'Строка №%НомерСтроки% %Товар% %НомерУпаковки%'");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПродажаУпаковокНеВОборотеВРежимеПредупреждения = Истина;
		
		Если ЗначениеЗаполнено(Выборка.Статус) И Выборка.Статус = Перечисления.СтатусыУпаковокМДЛП.ВУпаковке Тогда
			
			ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Товар%", ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%НомерУпаковки%", Выборка.НомерУпаковки);
			
			Если ТекстКизовВУпаковке = "" Тогда
				ТекстКизовВУпаковке = НСтр("ru = 'Требуется завершение операции расформирования для:'") + Символы.ПС;
			КонецЕсли;
			ТекстКизовВУпаковке = ТекстКизовВУпаковке + ТекстСтроки + Символы.ПС;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Статус) Тогда
			
			ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Товар%", ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%НомерУпаковки%", Выборка.НомерУпаковки);
			
			Если ТекстКизовНеПриняты = "" Тогда
				ТекстКизовНеПриняты = НСтр("ru = 'Требуется завершение операции приемки для:'") + Символы.ПС;
			КонецЕсли;
			ТекстКизовНеПриняты = ТекстКизовНеПриняты + ТекстСтроки + Символы.ПС;
			
		Иначе
			
			ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", Выборка.НомерСтроки);
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Товар%", ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
			ТекстСтроки = СтрЗаменить(ТекстСтроки, "%НомерУпаковки%", Выборка.НомерУпаковки);
			
			Если ТекстКизовОтсутствуют = "" Тогда
				ТекстКизовОтсутствуют = НСтр("ru = 'Требуется выполнение операции приемки для:'") + Символы.ПС;;
			КонецЕсли;
			ТекстКизовОтсутствуют = ТекстКизовОтсутствуют + ТекстСтроки + Символы.ПС;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстВопроса = НСтр("ru = 'В чеке найдены позиции, для которых не завершены (или не выполнены) операции приемки или расформирования транспортных упаковок в рамках обмена с системой МДЛП.'") + Символы.ПС;
	ТекстВопроса = ТекстВопроса + НСтр("ru = 'Рекомендуем завершить эти операции перед выполнением розничной продажи.'") + Символы.ПС;
	ТекстВопроса = ТекстВопроса + Символы.ПС; //Отступ
	ТекстВопроса = ТекстВопроса + НСтр("ru = 'Продолжить пробитие чека?'") + Символы.ПС;
	
	ТекстВопроса = ТекстВопроса + Символы.ПС; //Отступ
	ТекстВопроса = ТекстВопроса + ТекстКизовОтсутствуют + Символы.ПС;
	ТекстВопроса = ТекстВопроса + ТекстКизовНеПриняты + Символы.ПС;
	ТекстВопроса = ТекстВопроса + ТекстКизовВУпаковке + Символы.ПС;
	
	НомераУпаковокНеВОбороте.Вставить("ЗаголовокИнформации", НСтр("ru = 'Продажа упаковок маркируемых товаров'"));
	НомераУпаковокНеВОбороте.Вставить("ТекстВопроса", ТекстВопроса);
	
	Возврат ПродажаУпаковокНеВОборотеВРежимеПредупреждения;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОткрытияДопФорм

#Область ВводНомеровУпаковок

Функция ПолучитьПараметрыФормыВводаНомеровУпаковок(Объект, Форма, ПараметрыФормыУказания, ИспользоватьТранспортныеУпаковки = Ложь) Экспорт
	
	ИмяТЧТовары   = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии    = ПараметрыФормыУказания.ИмяТЧСерии;
	ИмяТЧТУ       = ПараметрыФормыУказания.ИмяТЧТУ;
	ИмяТЧСоставТУ = ПараметрыФормыУказания.ИмяТЧСоставТУ;
	
	ТекущиеДанныеИдентификатор = ПараметрыФормыУказания.ТекущиеДанныеИдентификатор;
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Если нужно будет изменять количество, то данные формы нужно заблокировать.
	// Если заблокировать не удастся - вылетит исключение.
	Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	
	ТекущиеДанные = Объект[ИмяТЧТовары].НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки);
	НайденныеСтрокиНомеров = Объект[ИмяТЧСерии].НайтиСтроки(СтруктураПоиска);
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	ТаблицаНомеров.Колонки.Добавить("НомерКИЗ", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(27)));
	ТаблицаНомеров.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаНомеров.Колонки.Добавить("ПолныйКодМаркировки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200)));
	ТаблицаНомеров.Колонки.Добавить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаНомеров.Колонки.Добавить("РазрешительныйРежимДатаЗапросаГИСМТ", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(14)));
	ТаблицаНомеров.Колонки.Добавить("РазрешительныйРежимИдентификаторЭкземпляраПО", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаНомеров.Колонки.Добавить("РазрешительныйРежимВерсияБазы", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	
	Для Каждого СтрокаМассива Из НайденныеСтрокиНомеров Цикл
		НоваяСтрока = ТаблицаНомеров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаНомеров", ТаблицаНомеров);
	
	Если ИспользоватьТранспортныеУпаковки Тогда
		
		ТранспортныеУпаковки = Новый ТаблицаЗначений;
		ТранспортныеУпаковки.Колонки.Добавить("НомерУпаковки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(18)));
		ТранспортныеУпаковки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
		
		СтруктураПоискаСостава = Новый Структура("ИдентификаторСтрокиТовара", ТекущиеДанные.ор_ИдентификаторСтроки);
		НайденныеСтрокиСостава = Объект[ИмяТЧСоставТУ].НайтиСтроки(СтруктураПоискаСостава);
		
		Для Каждого СтрокаСостава Из НайденныеСтрокиСостава Цикл
			СтруктураПоискаТУ = Новый Структура("ИдентификаторСтроки", СтрокаСостава.ИдентификаторСтроки);
			НайденныеСтрокиТУ = Объект[ИмяТЧТУ].НайтиСтроки(СтруктураПоискаТУ);
			Если НайденныеСтрокиТУ.Количество() > 0 Тогда
				НоваяСтрока = ТранспортныеУпаковки.Добавить();
				НоваяСтрока.НомерУпаковки = НайденныеСтрокиТУ[0].НомерУпаковки;
				НоваяСтрока.Количество = СтрокаСостава.Количество;
			КонецЕсли;
		КонецЦикла;
		
		ТранспортныеУпаковки.Свернуть("НомерУпаковки","Количество");
		СтруктураТаблиц.Вставить("ТранспортныеУпаковки", ТранспортныеУпаковки);
		
	КонецЕсли;
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СтруктураТаблиц, УникальныйИдентификаторФормы);
	
	ПараметрыФормыУказания.Вставить("Номенклатура"          , ТекущиеДанные.Номенклатура);
	ПараметрыФормыУказания.Вставить("Характеристика"        , ТекущиеДанные.Характеристика);
	
	Количество = ТекущиеДанные.Количество * ПолучитьКоэффициентЕдиницыИзмерения(ТекущиеДанные.ЕдиницаИзмерения);
	ПараметрыФормыУказания.Вставить("Количество"            , Количество);
	ПараметрыФормыУказания.Вставить("ор_ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ор_НомерСерииРецепта") Тогда
		ПараметрыФормыУказания.Вставить("НомерСерииРецепта", ТекущиеДанные.ор_НомерСерииРецепта);
		ПараметрыФормыУказания.Вставить("НомерРецепта", ТекущиеДанные.ор_НомерРецепта);
		ПараметрыФормыУказания.Вставить("ДатаРегистрацииРецепта", ТекущиеДанные.ор_ДатаРегистрацииРецепта);
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ор_ДатаРегистрацииРецепта) Тогда
			рСтруктураПоиска = Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура);
			рНайденныеСтрокиТоваров = Объект[ИмяТЧТовары].НайтиСтроки(рСтруктураПоиска);
			
			Для Каждого рСтрокаМассива Из рНайденныеСтрокиТоваров Цикл
				Если ЗначениеЗаполнено(рСтрокаМассива.ор_ДатаРегистрацииРецепта) Тогда
					СтруктураРецепта = Новый Структура();
					СтруктураРецепта.Вставить("ДатаРегистрацииРецепта", рСтрокаМассива.ор_ДатаРегистрацииРецепта);
					СтруктураРецепта.Вставить("НомерРецепта", рСтрокаМассива.ор_НомерРецепта);
					СтруктураРецепта.Вставить("НомерСерииРецепта", рСтрокаМассива.ор_НомерСерииРецепта);
					ПараметрыФормыУказания.Вставить("ДанныеПредыдущегоРецепта",СтруктураРецепта);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормыУказания.Вставить("ИспользоватьТранспортныеУпаковки", ИспользоватьТранспортныеУпаковки);
	ПараметрыФормыУказания.Вставить("АдресВоВременномХранилище",АдресВоВременномХранилище);
	ПараметрыФормыУказания.Вставить("ТекущиеДанныеИдентификатор",ТекущиеДанныеИдентификатор);
	
	ИмяФормы = "ОбщаяФорма.ор_МДЛПФормаВводаНомеровУпаковок";
	ПараметрыФормыУказания.Вставить("ИмяФормы", ИмяФормы);
	
	Возврат ПараметрыФормыУказания;
	
КонецФункции

Процедура ЗаполнитьНомераУпаковок(Объект, ДополнительныеПараметры, Форма) Экспорт
	
	Результат                  = ДополнительныеПараметры.Результат;
	ТекущиеДанныеИдентификатор = ДополнительныеПараметры.ТекущиеДанныеИдентификатор;
	ИмяТЧТовары                = ДополнительныеПараметры.ИмяТЧТовары;
	ИмяТЧСерии                 = ДополнительныеПараметры.ИмяТЧСерии;
	ИмяТЧТУ                    = ДополнительныеПараметры.ИмяТЧТУ;
	ИмяТЧСоставТУ              = ДополнительныеПараметры.ИмяТЧСоставТУ;
	
	СтруктураТаблиц = ПолучитьИзВременногоХранилища(Результат.АдресВоВременномХранилище);
	
	ТекущиеДанные = Объект[ИмяТЧТовары].НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ор_НомерСерииРецепта") Тогда
		ТекущиеДанные.ор_НомерСерииРецепта = СтруктураТаблиц.НомерСерииРецепта;
		ТекущиеДанные.ор_НомерРецепта = СтруктураТаблиц.НомерРецепта;
		ТекущиеДанные.ор_ДатаРегистрацииРецепта = СтруктураТаблиц.ДатаРегистрацииРецепта;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки);
	НайденныеСтрокиНомеров = Объект[ИмяТЧСерии].НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаМассива Из НайденныеСтрокиНомеров Цикл
		Объект[ИмяТЧСерии].Удалить(СтрокаМассива);
	КонецЦикла;
	
	ТаблицаНомеров = СтруктураТаблиц.ТаблицаНомеров;
	Для Каждого СтрокаМассива Из ТаблицаНомеров Цикл
		НоваяСтрока = Объект[ИмяТЧСерии].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ор_ИдентификаторСтроки;
	КонецЦикла;
	
	Если ДополнительныеПараметры.ИспользоватьТранспортныеУпаковки Тогда
		
		// Удаляем строки состава по идентификатору строки товара.
		СтруктураПоискаСоставТУ = Новый Структура("ИдентификаторСтрокиТовара",ТекущиеДанные.ор_ИдентификаторСтроки);
		НайденныеСтрокиСоставаТУ = Объект[ИмяТЧСоставТУ].НайтиСтроки(СтруктураПоискаСоставТУ);
		Для Каждого СтрокаСоставаТУ Из НайденныеСтрокиСоставаТУ Цикл
			Объект[ИмяТЧСоставТУ].Удалить(СтрокаСоставаТУ);
		КонецЦикла;
		
		ТранспортныеУпаковки = СтруктураТаблиц.ТранспортныеУпаковки;
		Для Каждого СтрокаТУ Из ТранспортныеУпаковки Цикл
			
			СтруктураПоискаТУ = Новый Структура("НомерУпаковки", СтрокаТУ.НомерУпаковки);
			НайденныеСтрокиТУ = Объект[ИмяТЧТУ].НайтиСтроки(СтруктураПоискаТУ);
			
			Если НайденныеСтрокиТУ.Количество() > 0 Тогда
				СтрокаТУДокумент = НайденныеСтрокиТУ[0];
			Иначе
				СтрокаТУДокумент = Объект[ИмяТЧТУ].Добавить();
				СтрокаТУДокумент.НомерУпаковки = СтрокаТУ.НомерУпаковки;
				СтрокаТУДокумент.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
			СтрокаСоставТУДокумент = Объект[ИмяТЧСоставТУ].Добавить();
			СтрокаСоставТУДокумент.Номенклатура   = ТекущиеДанные.Номенклатура;
			СтрокаСоставТУДокумент.Характеристика = ТекущиеДанные.Характеристика;
			СтрокаСоставТУДокумент.GTIN           = Результат.GTIN;
			СтрокаСоставТУДокумент.НомерСерии     = ТекущиеДанные.Характеристика.ор_СерияПроизводителя;
			СтрокаСоставТУДокумент.Количество     = СтрокаТУ.Количество;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Цена") Тогда
				Если ТекущиеДанные.Количество = 0 Тогда
					СтрокаСоставТУДокумент.Цена     = 0;
					СтрокаСоставТУДокумент.СуммаНДС = 0;
				Иначе
					СтрокаСоставТУДокумент.Цена     = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
					СтрокаСоставТУДокумент.СуммаНДС = ТекущиеДанные.СуммаНДС / ТекущиеДанные.Количество;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаСоставТУДокумент.ИдентификаторСтроки = СтрокаТУДокумент.ИдентификаторСтроки;
			СтрокаСоставТУДокумент.ИдентификаторСтрокиТовара = ТекущиеДанные.ор_ИдентификаторСтроки;
			
		КонецЦикла;
		
		ЗаполнитьТУПоСостауТУ(Объект, ИмяТЧТУ, ИмяТЧСоставТУ);
		
	КонецЕсли;
	
	ЗапрещенВводНесколькихУпаковок = ДополнительныеПараметры.Свойство("ЗапрещенВводНесколькихУпаковок");
	
	Если ЗапрещенВводНесколькихУпаковок Тогда
		Если ТекущиеДанные.Количество <> Результат.Количество
			И (ТекущиеДанные.Количество = 0
			ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения)
			ИЛИ (ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения)
			и ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"))) Тогда
			ТекущиеДанные.Количество = Результат.Количество;
		КонецЕсли;
	Иначе
		Если ТекущиеДанные.Количество <> Результат.Количество
			И Результат.Количество > 0
			И Результат.Количество > ТекущиеДанные.Количество Тогда
			ТекущиеДанные.Количество = Результат.Количество;
			Если ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения)
				И ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				ТекущиеДанные.ЕдиницаИзмерения = ТекущиеДанные.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Функция ПолучитьПараметрыФормыЗаполненияНомеровУпаковок(Объект, Форма, ПараметрыФормыУказания, ИспользоватьТранспортныеУпаковки = Истина) Экспорт
	
	ИмяТЧТовары   = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии    = ПараметрыФормыУказания.ИмяТЧСерии;
	ИмяТЧТУ       = ПараметрыФормыУказания.ИмяТЧТУ;
	ИмяТЧСоставТУ = ПараметрыФормыУказания.ИмяТЧСоставТУ;
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Если нужно будет изменять количество, то данные формы нужно заблокировать.
	// Если заблокировать не удастся - вылетит исключение.
	Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	
	// ВыгружаемТовары
	ТаблицаТоваров = Объект[ИмяТЧТовары].Выгрузить();
	Если ТаблицаТоваров.Количество() = 0 Тогда
		ПараметрыФормыУказания.Вставить("Отказ");
		Возврат ПараметрыФормыУказания;
	КонецЕсли;
	
	// Получаем количество единиц товара
	Для Каждого Строка Из ТаблицаТоваров Цикл
		Строка.Количество = Строка.Количество * ПолучитьКоэффициентЕдиницыИзмерения(Строка.ЕдиницаИзмерения);
	КонецЦикла;
	
	// Выгружаем таблицы
	ТаблицаНомеров = Объект[ИмяТЧСерии].Выгрузить();
	Если ИспользоватьТранспортныеУпаковки Тогда
		ТаблицаТУ = Объект[ИмяТЧТУ].Выгрузить();
		ТаблицаСоставТУ = Объект[ИмяТЧСоставТУ].Выгрузить();
	КонецЕсли;
	
	// формируем параметры
	Структурапараметров = Новый Структура;
	Структурапараметров.Вставить("ТаблицаТоваров", ТаблицаТоваров);
	Структурапараметров.Вставить("ТаблицаНомеров", ТаблицаНомеров);
	
	Если ИспользоватьТранспортныеУпаковки Тогда
		Структурапараметров.Вставить("ТаблицаТУ", ТаблицаТУ);
		Структурапараметров.Вставить("ТаблицаСоставТУ", ТаблицаСоставТУ);
	КонецЕсли;
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Структурапараметров, УникальныйИдентификаторФормы);
	
	ПараметрыФормыУказания.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	ПараметрыФормыУказания.Вставить("ИмяФормы", "ОбщаяФорма.ор_МДЛПЗаполнитьНомераУпаковок");
	ПараметрыФормыУказания.Вставить("ИспользоватьТранспортныеУпаковки", ИспользоватьТранспортныеУпаковки);
	
	Возврат ПараметрыФормыУказания;
	
КонецФункции

Процедура ЗаполнитьТоварыИНомераУпаковок(Объект, ДополнительныеПараметры, Форма, СтруктураДействий = Неопределено) Экспорт
	
	Результат   = ДополнительныеПараметры.Результат;
	ИмяТЧТовары = ДополнительныеПараметры.ИмяТЧТовары;
	ИмяТЧСерии  = ДополнительныеПараметры.ИмяТЧСерии;
	ИмяТЧТУ       = ДополнительныеПараметры.ИмяТЧТУ;
	ИмяТЧСоставТУ = ДополнительныеПараметры.ИмяТЧСоставТУ;
	
	Структурапараметров = ПолучитьИзВременногоХранилища(Результат.АдресВоВременномХранилище);
	ТаблицаТоваров = Структурапараметров.ТаблицаТоваров;
	ТаблицаНомеров = Структурапараметров.ТаблицаНомеров;
	ТаблицаТУ = Структурапараметров.ТаблицаТУ;
	ТаблицаСоставТУ = Структурапараметров.ТаблицаСоставТУ;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧСерии].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаНомеров Цикл
		НоваяСтрока = Объект[ИмяТЧСерии].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	Если ДополнительныеПараметры.ИспользоватьТранспортныеУпаковки Тогда
		
		// Удаляем строки состава ТУ по идентификатору строки товара.
		Для Каждого СтрокаТоваров Из Объект[ИмяТЧТовары] Цикл
			СтруктураПоискаСоставТУ = Новый Структура("ИдентификаторСтрокиТовара",СтрокаТоваров.ор_ИдентификаторСтроки);
			НайденныеСтрокиСоставаТУ = Объект[ИмяТЧСоставТУ].НайтиСтроки(СтруктураПоискаСоставТУ);
			Для Каждого СтрокаСоставаТУ Из НайденныеСтрокиСоставаТУ Цикл
				Объект[ИмяТЧСоставТУ].Удалить(СтрокаСоставаТУ);
			КонецЦикла;
		КонецЦикла;
		
		// Добавляем новые ТУ
		Для Каждого СтрокаТУ Из ТаблицаТУ Цикл
			СтруктураПоискаТУ = Новый Структура("НомерУпаковки", СтрокаТУ.НомерУпаковки);
			НайденныеСтрокиТУ = Объект[ИмяТЧТУ].НайтиСтроки(СтруктураПоискаТУ);
			Если НайденныеСтрокиТУ.Количество() = 0 Тогда
				НоваяСтрока = Объект[ИмяТЧТУ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТУ);
			КонецЕсли;
		КонецЦикла;
		
		// Добавляем состав ТУ
		Для Каждого СтрокаМассива Из ТаблицаСоставТУ Цикл
			НоваяСтрока = Объект[ИмяТЧСоставТУ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "Цена") Тогда
				НайденныеСтроки = Объект[ИмяТЧТовары].НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", НоваяСтрока.ИдентификаторСтрокиТовара));
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекущиеДанныеТовара = НайденныеСтроки[0];
					Если ТекущиеДанныеТовара.Количество = 0 Тогда
						НоваяСтрока.Цена     = 0;
						НоваяСтрока.СуммаНДС = 0;
					Иначе
						НоваяСтрока.Цена     = ТекущиеДанныеТовара.Сумма / ТекущиеДанныеТовара.Количество;
						НоваяСтрока.СуммаНДС = ТекущиеДанныеТовара.СуммаНДС / ТекущиеДанныеТовара.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьТУПоСостауТУ(Объект, ИмяТЧТУ, ИмяТЧСоставТУ);
		
	КонецЕсли;
	
	// Заполнение товаров
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		НайденныеСтроки = Объект[ИмяТЧТовары].НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", СтрокаТоваров.ор_ИдентификаторСтроки));
		ТекущиеДанные = НайденныеСтроки[0];
		Если ТекущиеДанные.Количество <> СтрокаТоваров.Количество
			И СтрокаТоваров.Количество > 0 Тогда
			ТекущиеДанные.Количество = СтрокаТоваров.Количество;
			Если ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				ТекущиеДанные.ЕдиницаИзмерения = ТекущиеДанные.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеНомеровУпаковокПоУведомлению

Функция ПолучитьПараметрыФормыЗаполненияНомеровУпаковокПоУведомлению(Объект, Форма, ПараметрыФормыУказания) Экспорт
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Если нужно будет изменять количество, то данные формы нужно заблокировать.
	// Если заблокировать не удастся - вылетит исключение.
	Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	
	// формируем параметры
	Структурапараметров = Новый Структура;
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Структурапараметров, УникальныйИдентификаторФормы);
	
	ПараметрыФормыУказания.Вставить("АдресВоВременномХранилище",АдресВоВременномХранилище);
	ПараметрыФормыУказания.Вставить("ОснованиеСсылка", Объект.Ссылка);
	ПараметрыФормыУказания.Вставить("ИмяФормы", "ОбщаяФорма.ор_МДЛПЗаполнитьПоУведомлению");
	
	Возврат ПараметрыФормыУказания;
	
КонецФункции

Процедура ЗаполнитьТоварыИНомераУпаковокПоУведомлению(Объект, ДополнительныеПараметры, Форма) Экспорт
	
	Результат     = ДополнительныеПараметры.Результат;
	ИмяТЧТовары   = ДополнительныеПараметры.ИмяТЧТовары;
	ИмяТЧСерии    = ДополнительныеПараметры.ИмяТЧСерии;
	ИмяТЧТУ       = ДополнительныеПараметры.ИмяТЧТУ;
	ИмяТЧСоставТУ = ДополнительныеПараметры.ИмяТЧСоставТУ;
	
	Структурапараметров = ПолучитьИзВременногоХранилища(Результат.АдресВоВременномХранилище);
	
	ТаблицаТоваров = Структурапараметров.ТаблицаТоваров;
	ТаблицаНомеров = Структурапараметров.ТаблицаНомеров;
	ТаблицаТранспортныхУпаковок = Структурапараметров.ТаблицаТранспортныхУпаковок;
	ТаблицаСоставаТранспортныхУпаковок = Структурапараметров.ТаблицаСоставаТранспортныхУпаковок;
	
	// Заполнение товаров
	Объект[ИмяТЧТовары].Очистить();
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		НоваяСтрока = Объект[ИмяТЧТовары].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		НоваяСтрока.ор_ИдентификаторСтроки = СтрокаТоваров.ИдентификаторСтроки;
		НоваяСтрока.Количество = СтрокаТоваров.КоличествоУпаковок;
	КонецЦикла;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧСерии].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаНомеров Цикл
		НоваяСтрока = Объект[ИмяТЧСерии].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧТУ].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаТранспортныхУпаковок Цикл
		НоваяСтрока = Объект[ИмяТЧТУ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧСоставТУ].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаСоставаТранспортныхУпаковок Цикл
		НоваяСтрока = Объект[ИмяТЧСоставТУ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		НоваяСтрока.НомерСерии = СтрокаМассива.СерияПроизводителя;
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаСоставаТранспортныхУпаковок Цикл
		НоваяСтрока = Объект[ИмяТЧТовары].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ор_ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
	ЗаполнитьТУПоСостауТУ(Объект, ИмяТЧТУ, ИмяТЧСоставТУ);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Функция ПолучитьПараметрыФормыСопоставленияНомеровУпаковокПоУведомлению(Объект, Форма, ПараметрыФормыУказания, ЭтоУведомление = Ложь) Экспорт
	
	ИмяТЧТовары   = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии    = ПараметрыФормыУказания.ИмяТЧСерии;
	ИмяТЧТУ       = ПараметрыФормыУказания.ИмяТЧТУ;
	ИмяТЧСоставТУ = ПараметрыФормыУказания.ИмяТЧСоставТУ;
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Если нужно будет изменять количество, то данные формы нужно заблокировать.
	// Если заблокировать не удастся - вылетит исключение.
	Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	
	// формируем параметры
	Структурапараметров = Новый Структура;
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Структурапараметров, УникальныйИдентификаторФормы);
	
	ПараметрыФормыУказания.Вставить("АдресВоВременномХранилище",АдресВоВременномХранилище);
	Если ЭтоУведомление Тогда
		ПараметрыФормыУказания.Вставить("УведомлениеСсылка", Объект.Ссылка);
	Иначе
		ПараметрыФормыУказания.Вставить("ОснованиеСсылка", Объект.Ссылка);
	КонецЕсли;
	ПараметрыФормыУказания.Вставить("ФормаОткрытаИзУведомления", ЭтоУведомление);
	ПараметрыФормыУказания.Вставить("ИмяФормы", "ОбщаяФорма.ор_МДЛПСопоставленияНомераУпаковокПоУведомлению");
	
	Возврат ПараметрыФормыУказания;
	
КонецФункции

Процедура СопоставитьТоварыИНомераУпаковокПоУведомлению(Объект, ДополнительныеПараметры, Форма) Экспорт
	
	Результат   = ДополнительныеПараметры.Результат;
	
	ИмяТЧСерии    = ДополнительныеПараметры.ИмяТЧСерии;
	ИмяТЧТУ       = ДополнительныеПараметры.ИмяТЧТУ;
	ИмяТЧСоставТУ = ДополнительныеПараметры.ИмяТЧСоставТУ;
	
	Структурапараметров = ПолучитьИзВременногоХранилища(Результат.АдресВоВременномХранилище);
	ТаблицаНомеров                     = Структурапараметров.ТаблицаНомеров;
	ТаблицаТранспортныхУпаковок        = Структурапараметров.ТаблицаТранспортныхУпаковок;
	ТаблицаСоставаТранспортныхУпаковок = Структурапараметров.ТаблицаСоставаТранспортныхУпаковок;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧСерии].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаНомеров Цикл
		НоваяСтрока = Объект[ИмяТЧСерии].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧТУ].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаТранспортныхУпаковок Цикл
		НоваяСтрока = Объект[ИмяТЧТУ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	// Заполнение номеров упаковок
	Объект[ИмяТЧСоставТУ].Очистить();
	Для Каждого СтрокаМассива Из ТаблицаСоставаТранспортныхУпаковок Цикл
		НоваяСтрока = Объект[ИмяТЧСоставТУ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	ЗаполнитьТУПоСостауТУ(Объект, ИмяТЧТУ, ИмяТЧСоставТУ);
	
	Форма.Модифицированность = Результат.МодифицированностьВладельца;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСоставаТранспортнойУпаковки

Функция ПолучитьПараметрыФормыЗаполненияСоставаТранспортнойУпаковки(Объект, Форма, ПараметрыФормыУказания) Экспорт
	
	ИмяТЧТовары   = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии    = ПараметрыФормыУказания.ИмяТЧСерии;
	ИмяТЧТУ       = ПараметрыФормыУказания.ИмяТЧТУ;
	ИмяТЧСоставТУ = ПараметрыФормыУказания.ИмяТЧСоставТУ;
	
	ТекущиеДанныеИдентификатор = ПараметрыФормыУказания.ТекущиеДанныеИдентификатор;
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Если нужно будет изменять количество, то данные формы нужно заблокировать.
	// Если заблокировать не удастся - вылетит исключение.
	Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	
	ТекущиеДанные = Объект[ИмяТЧТУ].НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	
	ЭтоОрдер = Ложь;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдер")
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		ЭтоОрдер = Истина;
	КонецЕсли;
	
	СуммаВключаетНДС = Ложь;
	
	Если НЕ ЭтоОрдер Тогда
		СтруктурапересчетаНДС = Новый Структура;
		СтруктурапересчетаНДС.Вставить("Дата" , Объект.Дата);
		СтруктурапересчетаНДС.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
		СтруктурапересчетаНДС.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
		СтруктурапересчетаНДС.Вставить("Организация"    , Объект.Организация);
		СтруктурапересчетаНДС.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
		СуммаВключаетНДС = Объект.СуммаВключаетНДС;
	КонецЕсли;
	
	ТаблицаТоваров = Объект[ИмяТЧТовары].Выгрузить();
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		Если НЕ Строка.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Характеристика) Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		Строка.Количество = Строка.Количество * ПолучитьКоэффициентЕдиницыИзмерения(Строка.ЕдиницаИзмерения);
		
		ПересчитыватьСуммы = Ложь;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки", Строка.ор_ИдентификаторСтроки);
		НайденныеСтрокиНомеров = Объект[ИмяТЧСерии].НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтрокиНомеров.Количество() > 0 Тогда
			Строка.Количество = Строка.Количество - НайденныеСтрокиНомеров.Количество();
			ПересчитыватьСуммы = Истина;
		КонецЕсли;
		
		Если Строка.Количество <= 0 Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТовара", Строка.ор_ИдентификаторСтроки);
		НайденныеСтрокиНомеров = Объект[ИмяТЧСоставТУ].НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаСостава Из НайденныеСтрокиНомеров Цикл
			
			СтруктураПоискаТУ = Новый Структура("ИдентификаторСтроки", СтрокаСостава.ИдентификаторСтроки);
			НайденныеСтрокиТУ = Объект[ИмяТЧТУ].НайтиСтроки(СтруктураПоискаТУ);
			
			Если НайденныеСтрокиТУ.Количество() > 0 И НайденныеСтрокиТУ[0].НомерУпаковки <> ТекущиеДанные.НомерУпаковки  Тогда
				Строка.Количество = Строка.Количество - СтрокаСостава.Количество;
				ПересчитыватьСуммы = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Строка.Количество <= 0 Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоОрдер И ПересчитыватьСуммы Тогда
			ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(Строка, СтруктурапересчетаНДС);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивСтрокДляУдаления Цикл
		ТаблицаТоваров.Удалить(ЭлементМассива);
	КонецЦикла;
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		ПараметрыФормыУказания.Вставить("ТекстОшибки", НСтр("ru = 'Нет данных для заполнения.'"));
		ПараметрыФормыУказания.Вставить("Отказ");
		Возврат ПараметрыФормыУказания;
	КонецЕсли;
	
	// формируем параметры
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТаблицаТоваров, УникальныйИдентификаторФормы);
	
	ПараметрыФормыУказания.Вставить("НомерУпаковки"            , ТекущиеДанные.НомерУпаковки);
	ПараметрыФормыУказания.Вставить("ИдентификаторСтроки"      , ТекущиеДанные.ИдентификаторСтроки);
	
	ПараметрыФормыУказания.Вставить("АдресВоВременномХранилище" , АдресВоВременномХранилище);
	ПараметрыФормыУказания.Вставить("ТекущиеДанныеИдентификатор", ТекущиеДанныеИдентификатор);
	ПараметрыФормыУказания.Вставить("СуммаВключаетНДС"          , СуммаВключаетНДС);
	ПараметрыФормыУказания.Вставить("ЭтоОрдер"                  , ЭтоОрдер);
	ПараметрыФормыУказания.Вставить("ИмяФормы"                  , "ОбщаяФорма.ор_МДЛПЗаполнениеСоставаТранспортнойУпаковки");
	
	Возврат ПараметрыФормыУказания;
	
КонецФункции

Процедура ЗаполнитьСоставТранспортныхУпаковок(Объект, ДополнительныеПараметры, Форма, СтруктураДействий = Неопределено) Экспорт
	
	Результат                  = ДополнительныеПараметры.Результат;
	ТекущиеДанныеИдентификатор = ДополнительныеПараметры.ТекущиеДанныеИдентификатор;
	
	ИмяТЧТУ       = ДополнительныеПараметры.ИмяТЧТУ;
	ИмяТЧСоставТУ = ДополнительныеПараметры.ИмяТЧСоставТУ;
	
	ТекущиеДанные = Объект[ИмяТЧТУ].НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	
	// Удаляем строки состава ТУ
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	НайденныеСтрокиСостава = Объект[ИмяТЧСоставТУ].НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаМассива Из НайденныеСтрокиСостава Цикл
		Объект[ИмяТЧСоставТУ].Удалить(СтрокаМассива);
	КонецЦикла;
	
	ТаблицаСостава = ПолучитьИзВременногоХранилища(Результат.АдресВоВременномХранилище);
	
	Для Каждого СтрокаМассива Из ТаблицаСостава Цикл
		НоваяСтрока = Объект[ИмяТЧСоставТУ].Добавить();
		
		НоваяСтрока.Номенклатура   = СтрокаМассива.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаМассива.Характеристика;
		НоваяСтрока.GTIN           = СтрокаМассива.GTIN;
		НоваяСтрока.НомерСерии     = СтрокаМассива.НомерСерии;
		НоваяСтрока.Количество     = СтрокаМассива.Количество;
		
		Если СтрокаМассива.Количество = 0 Тогда
			НоваяСтрока.Цена           = 0;
			НоваяСтрока.СуммаНДС       = 0;
		ИначеЕсли СтрокаМассива.КоличествоВТоварах = 0 Тогда
			НоваяСтрока.Цена           = 0;
			НоваяСтрока.СуммаНДС       = 0;
		Иначе
			НоваяСтрока.Цена           = СтрокаМассива.Сумма / СтрокаМассива.КоличествоВТоварах;
			НоваяСтрока.СуммаНДС       = СтрокаМассива.СуммаНДС / СтрокаМассива.КоличествоВТоварах;
		КонецЕсли;
		
		НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		НоваяСтрока.ИдентификаторСтрокиТовара = СтрокаМассива.ор_ИдентификаторСтроки;
		
	КонецЦикла;
	
	ЗаполнитьТУПоСостауТУ(Объект, ИмяТЧТУ, ИмяТЧСоставТУ);
	
КонецПроцедуры

Процедура ЗаполнитьТУПоСостауТУ(Объект, ИмяТЧТУ, ИмяТЧСоставТУ)
	
	Для Каждого СтрокаТУ Из Объект[ИмяТЧТУ] Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТУ, "Цена") Тогда
			
			НайденныеСтрокиСостава = Объект[ИмяТЧСоставТУ].НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТУ.ИдентификаторСтроки));
			
			Если НайденныеСтрокиСостава.Количество() > 1 Тогда
				СтрокаТУ.Цена = 0;
				СтрокаТУ.СуммаНДС = 0;
			ИначеЕсли НайденныеСтрокиСостава.Количество() = 1 Тогда
				СтрокаТУ.Цена = НайденныеСтрокиСостава[0].Цена;
				СтрокаТУ.СуммаНДС = НайденныеСтрокиСостава[0].СуммаНДС;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

 #Область СозданиеКомандыРегистрацииGTIN

Функция ПолучитьКомандыРегистрацииGTIN()
	
	МассивКоманд = Новый Массив;
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОПриемкеМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОПриемкеМДЛП.ТабличныеЧасти.Товары.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "ТоварыКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях", Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОПриемкеМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОПриемкеМДЛП.ТабличныеЧасти.СоставТранспортныхУпаковок.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "СоставТранспортныхУпаковокКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях", Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОбОприходованииМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОбОприходованииМДЛП.ТабличныеЧасти.Товары.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "ТоварыКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях", Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОбОприходованииМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОбОприходованииМДЛП.ТабличныеЧасти.СоставТранспортныхУпаковок.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "СоставТранспортныхУпаковокКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях", Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОПеремещенииМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОПеремещенииМДЛП.ТабличныеЧасти.Товары.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "ТоварыКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях"      , Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОПеремещенииМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОПеремещенииМДЛП.ТабличныеЧасти.СоставТранспортныхУпаковок.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "СоставТранспортныхУпаковокКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях", Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Документы.УведомлениеОПовторномВводеВОборотМДЛП.Формы.ФормаДокумента.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Документы.УведомлениеОПовторномВводеВОборотМДЛП.ТабличныеЧасти.Товары.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "ТоварыКоманднаяПанель");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях"      , Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Обработки.ПолучитьСоставТранспортныхУпаковокМДЛП.Формы.ПолучитьСоставТранспортныхУпаковок.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Обработки.ПолучитьСоставТранспортныхУпаковокМДЛП.ТабличныеЧасти.ДанныеУпаковок.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "ГруппаПодключаемыеКоманды");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях", Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.Обработки.СверкаОстатковМДЛП.Формы.СверкаОстатков.ПолноеИмя());
	СтруктураКоманды.Вставить("ИмяТабличнойЧасти", Метаданные.Обработки.СверкаОстатковМДЛП.ТабличныеЧасти.ДанныеПотребительскихУпаковок.Имя);
	СтруктураКоманды.Вставить("ИмяРодителя"      , "ГруппаПодключаемыеКоманды");
	СтруктураКоманды.Вставить("ТолькоВоВсехДействиях"      , Истина);
	СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	МассивКоманд.Добавить(СтруктураКоманды);
	
	//СтруктураКоманды = Новый Структура;
	//СтруктураКоманды.Вставить("ИмяФормы"         , Метаданные.ОбщиеФормы.ПодборНоменклатурыПоСоответствиюШтрихкодов.ПолноеИмя());
	//СтруктураКоманды.Вставить("ИмяТабличнойЧасти", "Товары");
	//СтруктураКоманды.Вставить("ИмяРодителя"      , "Группа");
	//СтруктураКоманды.Вставить("ТолькоВоВсехДействиях"      , Ложь);
	//СтруктураКоманды.Вставить("ИмяЭлементаПорядка", "ПеренестиВДокумент");
	//СтруктураКоманды.Вставить("ПроверятьТабЧасть", Истина);
	//МассивКоманд.Добавить(СтруктураКоманды);
	
	Возврат МассивКоманд;
	
КонецФункции

Процедура СоздатьКомандуРегистрацииGTIN(Форма, Команда)
	
	Если Команда.ПроверятьТабЧасть И Форма.Элементы.Найти(Команда.ИмяТабличнойЧасти) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРодителя = Форма.Элементы.Найти(Команда.ИмяРодителя);
	Если ЭлементРодителя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПорядка = Неопределено;
	Если Команда.Свойство("ИмяЭлементаПорядка") Тогда
		ЭлементПорядка = Форма.Элементы.Найти(Команда.ИмяЭлементаПорядка);
	КонецЕсли;
	
	ИмяКоманды = Команда.ИмяТабличнойЧасти + "ЗарегистрироватьGTIN";
	
	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Заголовок = НСтр("ru = 'Зарегистрировать GTIN'");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	
	НовыйЭлемент = Форма.Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементРодителя, ЭлементПорядка);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	НовыйЭлемент.ТолькоВоВсехДействиях = Команда.ТолькоВоВсехДействиях;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьФлагМаркируемогоТовара(Владелец) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		КатегорияНоменклатуры = Владелец.КатегорияНоменклатуры;
	ИначеЕсли ТипЗнч(Владелец)=Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		КатегорияНоменклатуры = Владелец;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПолучитьФункциональнуюОпцию("ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов")
		И КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров;
	
КонецФункции

Функция ПроверитьНоменклатуруМаркировки(Номенклатура) Экспорт
	
	Возврат ПолучитьФлагМаркируемогоТовара(Номенклатура.КатегорияНоменклатуры);
	
КонецФункции

Функция ПроверитьХарактеристикуМаркировки(Характеристика) Экспорт
	
	ФлагМаркируемогоТовара = ПолучитьФлагМаркируемогоТовара(Характеристика.Владелец);
	
	Если ФлагМаркируемогоТовара Тогда
		Возврат Характеристика.ор_МаркируемыйТовар;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьФлагМаркируемогоТовараХарактеристики(Характеристика) Экспорт
	
	Возврат Характеристика.ор_МаркируемыйТовар;
	
КонецФункции

Функция ПолучитьКоэффициентЕдиницыИзмерения(ЕдиницаИзмерения) Экспорт
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) И ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		Возврат ЕдиницаИзмерения.Коэффициент;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьСлужебныеРеквизитыМДЛП(СтруктураДанные) Экспорт
	
	ИспользоватьНомераУпаковок = Истина;
	
	Если НЕ СтруктураДанные.Свойство("ЗапретитьВводНомеров") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанные.ЗапретитьВводНомеров Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов") Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураДанные.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если ИспользоватьНомераУпаковок
		И СтруктураДанные.Свойство("Характеристика")
		И ЗначениеЗаполнено(СтруктураДанные.Характеристика) Тогда
		СтруктураДанные.Вставить("ИспользоватьНомераУпаковок", СтруктураДанные.Характеристика.ор_МаркируемыйТовар);
	Иначе
		СтруктураДанные.Вставить("ИспользоватьНомераУпаковок", Ложь);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ор_ИдентификаторСтроки", Строка(Новый УникальныйИдентификатор));
	
КонецПроцедуры

Функция ЭтоМаркируемыйТовар(Характеристика, ЗапретитьВводНомеров = Ложь) Экспорт
	
	ИспользоватьНомераУпаковок = Истина;
	
	Если ЗапретитьВводНомеров Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов") Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если ИспользоватьНомераУпаковок И ЗначениеЗаполнено(Характеристика) Тогда
		ИспользоватьНомераУпаковок = Характеристика.ор_МаркируемыйТовар;
	Иначе
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Возврат ИспользоватьНомераУпаковок;
	
КонецФункции

Функция ПолучитьДокументУведомлениеПоОснованию(Основание, ИмяДокумента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Уведомление.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ." + ИмяДокумента + " КАК Уведомление
	               |ГДЕ
	               |	Уведомление.Основание = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСписокУведомленийПоОснованию(Основание, ИмяДокумента) Экспорт
	
	СписокДокументов = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат СписокДокументов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Уведомление.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ." + ИмяДокумента + " КАК Уведомление
	               |ГДЕ
	               |	Уведомление.Основание = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокДокументов.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции

Процедура ПроверитьЗаполнениеНоменклатуры(Объект, МассивНепроверяемыхРеквизитов, Отказ) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.УдалитьЗапросСоставаУпаковкиМДЛП") Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Номенклатура");
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.УведомлениеОПриемкеМДЛП") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.УведомлениеОбОтгрузкеМДЛП") Тогда
		
		ЭтоПриемка = ТипЗнч(Объект) = Тип("ДокументОбъект.УведомлениеОПриемкеМДЛП");
		
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНомеров.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаНомеров.СостояниеПодтверждения КАК СостояниеПодтверждения
		|ПОМЕСТИТЬ втНомера
		|ИЗ
		|	&ТаблицаНомеров КАК ТаблицаНомеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.НомерСтроки КАК НомерСтроки,
		|	втТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ СтрокиСОшибками
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНомера КАК втНомера
		|		ПО втТовары.ИдентификаторСтроки = втНомера.ИдентификаторСтроки
		|ГДЕ
		|	втТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И втНомера.СостояниеПодтверждения <> &Состояние
		|
		|СГРУППИРОВАТЬ ПО
		|	втТовары.НомерСтроки,
		|	втТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиСОшибками.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	СтрокиСОшибками КАК СтрокиСОшибками";
		
		Запрос.Текст = ТекстЗапроса;
		
		Если ЭтоПриемка Тогда
			Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияПодтвержденияМДЛП.Отказаться);
		Иначе
			Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияПодтвержденияМДЛП.Отозвать);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТаблицаТоваров", Объект.Товары.Выгрузить(,"НомерСтроки,Номенклатура,ИдентификаторСтроки"));
		Запрос.УстановитьПараметр("ТаблицаНомеров", Объект.НомераУпаковок.Выгрузить(,"ИдентификаторСтроки,СостояниеПодтверждения"));
		
	Иначе
		
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.НомерСтроки КАК НомерСтроки,
		|	втТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ СтрокиСОшибками
		|ИЗ
		|	втТовары КАК втТовары
		|ГДЕ
		|	втТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втТовары.НомерСтроки,
		|	втТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиСОшибками.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	СтрокиСОшибками КАК СтрокиСОшибками";
		
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ТаблицаТоваров", Объект.Товары.Выгрузить(,"НомерСтроки,Номенклатура"));
		
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%Номенклатура%"" в строке %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%", "Номенклатура");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", "Товары");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", Выборка.НомерСтроки, "Номенклатура");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Поле,"Объект",Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНоменклатурыТранспортнойУпаковки(Объект, МассивНепроверяемыхРеквизитов, Отказ) Экспорт
	
	ЭтоПриемка = ТипЗнч(Объект) = Тип("ДокументОбъект.УведомлениеОПриемкеМДЛП");
	ЭтоПеремещенеи = ТипЗнч(Объект) = Тип("ДокументОбъект.УведомлениеОПеремещенииМДЛП");
	
	МассивНепроверяемыхРеквизитов.Добавить("СоставТранспортныхУпаковок.Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНомеров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	&СостояниеПодтверждения КАК СостояниеПодтверждения
	|ПОМЕСТИТЬ втНомера
	|ИЗ
	|	&ТаблицаНомеров КАК ТаблицаНомеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерСтроки КАК НомерСтроки,
	|	втТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ СтрокиСОшибками
	|ИЗ
	|	втНомера КАК втНомера
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТовары КАК втТовары
	|		ПО втНомера.ИдентификаторСтроки = втТовары.ИдентификаторСтроки
	|ГДЕ
	|	втТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И &ПроверкаСостояниеПодтверждения
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.НомерСтроки,
	|	втТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСОшибками.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	СтрокиСОшибками КАК СтрокиСОшибками";
	
	Запрос.УстановитьПараметр("ТаблицаНомеров",  Объект.ТранспортныеУпаковки.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаТоваров",  Объект.СоставТранспортныхУпаковок.Выгрузить());
	
	Если ЭтоПеремещенеи Тогда
		
		Запрос.УстановитьПараметр("СостояниеПодтверждения", Перечисления.СостоянияПодтвержденияМДЛП.ПустаяСсылка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПроверкаСостояниеПодтверждения", "Истина");
		
	Иначе
		
		Если ЭтоПриемка Тогда
			Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияПодтвержденияМДЛП.Отказаться);
		Иначе
			Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияПодтвержденияМДЛП.Отозвать);
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СостояниеПодтверждения", "ТаблицаНомеров.СостояниеПодтверждения");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПроверкаСостояниеПодтверждения", "втНомера.СостояниеПодтверждения <> &Состояние");
		
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%Номенклатура%"" в строке %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%", "Номенклатура");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", "Состав транспортных упаковок");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставТранспортныхУпаковок", Выборка.НомерСтроки, "Номенклатура");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Поле,"Объект",Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОрганизациюИМестоДеятельностиМДЛП(Организация, МестоДеятельности, СобственнаяОрганизация = Истина) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Организация"      , Справочники.ОрганизацииМДЛП.ПустаяСсылка());
	СтруктураВозврата.Вставить("МестоДеятельности", Справочники.МестаДеятельностиМДЛП.ПустаяСсылка());
	СтруктураВозврата.Вставить("Идентификатор"    , "");
	СтруктураВозврата.Вставить("ВестиУчетВЭтойИБ" , Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СубъектыОбращенияМДЛП.Организация КАК Организация,
	|	СубъектыОбращенияМДЛП.МестоДеятельности КАК МестоДеятельности,
	|	СубъектыОбращенияМДЛП.МестоДеятельности.Идентификатор КАК Идентификатор,
	|	СубъектыОбращенияМДЛП.МестоДеятельности.ВестиУчетВЭтойИБ КАК ВестиУчетВЭтойИБ
	|ИЗ
	|	РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|ГДЕ
	|	СубъектыОбращенияМДЛП.ОрганизацияКонтрагент = &Организация
	|	И СубъектыОбращенияМДЛП.СобственнаяОрганизация = &СобственнаяОрганизация
	|	И (ВЫБОР
	|			КОГДА &ИспользоватьМестаДеятельности
	|				ТОГДА СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = &МестоДеятельности
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|";
	
	Запрос.УстановитьПараметр("Организация"                  , Организация);
	Запрос.УстановитьПараметр("ИспользоватьМестаДеятельности", ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций());
	Запрос.УстановитьПараметр("МестоДеятельности"            , МестоДеятельности);
	Запрос.УстановитьПараметр("СобственнаяОрганизация"       , СобственнаяОрганизация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Организация       = Выборка.Организация;
		СтруктураВозврата.МестоДеятельности = Выборка.МестоДеятельности;
		СтруктураВозврата.Идентификатор     = Выборка.Идентификатор;
		СтруктураВозврата.ВестиУчетВЭтойИБ  = Выборка.ВестиУчетВЭтойИБ;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьОрганизациюИМестоДеятельности(ОрганизацияМДЛП, МестоДеятельностиМДЛП, СобственнаяОрганизация = Истина) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Организация"      , Справочники.Организации.ПустаяСсылка());
	СтруктураВозврата.Вставить("МестоДеятельности", Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СубъектыОбращенияМДЛП.ОрганизацияКонтрагент КАК Организация,
	|	СубъектыОбращенияМДЛП.ОбъектМестаДеятельности КАК МестоДеятельности
	|ИЗ
	|	РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
	|ГДЕ
	|	СубъектыОбращенияМДЛП.Организация = &Организация
	|	И СубъектыОбращенияМДЛП.СобственнаяОрганизация = &СобственнаяОрганизация
	|	И ВЫБОР
	|			КОГДА &СобственнаяОрганизация
	|				ТОГДА СубъектыОбращенияМДЛП.МестоДеятельности = &МестоДеятельности
	|			ИНАЧЕ СубъектыОбращенияМДЛП.МестоДеятельности = &МестоДеятельности
	|					ИЛИ СубъектыОбращенияМДЛП.МестоДеятельности = ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация"                  , ОрганизацияМДЛП);
	Запрос.УстановитьПараметр("МестоДеятельности"            , МестоДеятельностиМДЛП);
	Запрос.УстановитьПараметр("СобственнаяОрганизация"       , СобственнаяОрганизация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Организация       = Выборка.Организация;
		СтруктураВозврата.МестоДеятельности = Выборка.МестоДеятельности;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗаполнитьНоменклатуруХарактеристикуПоGTIN(Объект, ТекущаяСтрока, ТолькоНоменклатуру = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.GTIN) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
		И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Характеристика)
		И НЕ ТолькоНоменклатуру Тогда
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки);
		НайденныеСтроки = Объект.НомераУпаковок.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НомерУпаковки", НайденныеСтроки[0].НомерКИЗ);
			Запрос.УстановитьПараметр("КлючУпаковки", ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НайденныеСтроки[0].НомерКИЗ));
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	&НомерУпаковки КАК НомерУпаковки,
			|	&КлючУпаковки КАК КлючУпаковки
			|ПОМЕСТИТЬ втТовары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УпаковкиМаркируемыхТоваров.Номенклатура КАК Номенклатура,
			|	УпаковкиМаркируемыхТоваров.Характеристика КАК Характеристика
			|ИЗ
			|	втТовары КАК втТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
			|		ПО втТовары.НомерУпаковки = УпаковкиМаркируемыхТоваров.НомерУпаковки
			|			И втТовары.КлючУпаковки = УпаковкиМаркируемыхТоваров.КлючУпаковки";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущаяСтрока.Номенклатура = Выборка.Номенклатура;
				ТекущаяСтрока.Характеристика = Выборка.Характеристика;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("GTIN", ТекущаяСтрока.GTIN);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
		Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&GTIN КАК GTIN
		|ПОМЕСТИТЬ втТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.GTIN КАК GTIN,
		|	Штрихкоды.Номенклатура КАК Номенклатура
		|ИЗ
		|	втТовары КАК втТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|		ПО втТовары.GTIN = Штрихкоды.Штрихкод
		|			И (Штрихкоды.Номенклатура ССЫЛКА Справочник.Номенклатура)
		|			И (Штрихкоды.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров)
		|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
		|			И (Штрихкоды.Партия = &Партия)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура)
		|ПО
		|	GTIN";
		
		Результат = Запрос.Выполнить();
		
		ВыборкаПоGTIN = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаПоGTIN.Следующий() Тогда
			Если ВыборкаПоGTIN.Номенклатура = 1 Тогда
				ВыборкаПоТоварам = ВыборкаПоGTIN.Выбрать();
				Если ВыборкаПоТоварам.Следующий() Тогда
					ТекущаяСтрока.Номенклатура = ВыборкаПоТоварам.Номенклатура;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиНоменклатруПоGTIN(GTIN) Экспорт
	
	Если НЕ ЗначениеЗаполнено(GTIN) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &GTIN
	|	И Штрихкоды.Номенклатура ССЫЛКА Справочник.Номенклатура
	|	И Штрихкоды.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров
	|	И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|	И Штрихкоды.Партия = &Партия";
	Запрос.УстановитьПараметр("GTIN"            , GTIN);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Номенклатура;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиНоменклатуруПоНомеруИКлючуУпаковки(Данные) Экспорт
	
	Если Не Данные.Свойство("GTIN")
		И Не Данные.Свойство("SGTIN") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ор_МДЛПУпаковкиМаркируемыхТоваров.Номенклатура КАК Номенклатура,
	|	ор_МДЛПУпаковкиМаркируемыхТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК ор_МДЛПУпаковкиМаркируемыхТоваров
	|ГДЕ
	|	ор_МДЛПУпаковкиМаркируемыхТоваров.НомерУпаковки = &НомерУпаковки
	|	И ор_МДЛПУпаковкиМаркируемыхТоваров.КлючУпаковки = &КлючУпаковки";
	
	Запрос.УстановитьПараметр("НомерУпаковки", 	Данные.SGTIN);
	Запрос.УстановитьПараметр("КлючУпаковки", 	ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(Данные.SGTIN));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		СтруктураВозврата = Новый Структура();
		СтруктураВозврата.Вставить("Номенклатура", 	 ВыборкаДетальныеЗаписи.Номенклатура);
		СтруктураВозврата.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиХарактеристикуПоСерииИСроку(Номенклатура, Данные) Экспорт
	
	Если НЕ Данные.Свойство("Серия") ИЛИ НЕ Данные.Свойство("ГоденДо") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И ХарактеристикиНоменклатуры.ор_СерияПроизводителя = &ор_СерияПроизводителя
	|	И ХарактеристикиНоменклатуры.ор_СрокГодности = &ор_СрокГодности";
	
	Запрос.УстановитьПараметр("ор_СерияПроизводителя", Данные.Серия);
	Запрос.УстановитьПараметр("ор_СрокГодности"      , Данные.ГоденДо);
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Характеристика;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ИспользуетсяОрдернаяСхемаПриемкиОтгрузки(ОснованиеСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОснованиеСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура();
	
	Если ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		ИЛИ ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		СтруктураРеквизитов.Вставить("ОрдерныйСклад", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеСсылка, СтруктураРеквизитов);
	
	Возврат Реквизиты.ОрдерныйСклад;
	
КонецФункции

Функция ПолучитьОснованиеПоСылке(Ссылка) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			ДокументОснованиеСсылка = РеквизитыДокумента.ДокументОснование;
			
		ИначеЕсли ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			Поступление = ПолучитьПоступлениеТоваровПоЗаказуПоставщику(РеквизитыДокумента.ДокументОснование);
			
			Если Поступление <> Неопределено Тогда
				ДокументОснованиеСсылка = Поступление;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		ИначеЕсли ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		ДокументОснованиессылка = Ссылка;
	КонецЕсли;
	
	Возврат ДокументОснованиессылка
	
КонецФункции

Функция ПолучитьСписокСостоянийПодтверждения(ДобавитьОтказы = Ложь) Экспорт
	
	СписокСостояний = Новый СписокЗначений;
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.Подтвердить);
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.Подтверждено);
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.КПередаче);
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ);
	
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках);
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы);
	
	СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ОприходованоНовымВладельцем);
	
	Если ДобавитьОтказы Тогда
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.Отозвать);
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.Отказаться);
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.НеТребуется);
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ);
		
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ОтказатьсяОтклоненоГИСМ);
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ОтозватьОтклоненоГИСМ);
		СписокСостояний.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ПодтвердитьОтклоненоГИСМ);
	КонецЕсли;
	
	Возврат СписокСостояний;
	
КонецФункции

Функция СтатусДоступенДляЗаполнения(Статус) Экспорт
	
	Если Статус = Перечисления.СтатусыИнформированияМДЛП.ПринятоИзМДЛП
		ИЛИ Статус = Перечисления.СтатусыИнформированияМДЛП.Закрыто
		ИЛИ Статус = Перечисления.СтатусыИнформированияМДЛП.Принято
		ИЛИ Статус = Перечисления.СтатусыИнформированияМДЛП.ОприходованоНовымВладельцем
		ИЛИ Статус = Перечисления.СтатусыИнформированияМДЛП.ЧастичноПринято
		ИЛИ Статус = Перечисления.СтатусыИнформированияМДЛП.Черновик Тогда
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция НайтиGTINПоНоменклатре(Номенклатура, Характеристика) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК GTIN
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Номенклатура = &Номенклатура
	|	И Штрихкоды.Характеристика = &Характеристика
	|	И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|	И Штрихкоды.Партия = &Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Штрихкод";
	Запрос.УстановитьПараметр("Номенклатура"    , Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеGTIN = Новый Соответствие;
		ПоследнееЗначениеВыборки = "";
		Пока Выборка.Следующий() Цикл
			Если ор_ИнтеграцияМДЛПКлиентСервер.ЭтоGTIN(Выборка.GTIN)
				И МенеджерОборудованияКлиентСервер.ПроверитьКорректностьGTIN(Выборка.GTIN) Тогда
				ЗначениеGTIN = ДанныеGTIN[Выборка.GTIN];
				Если ЗначениеGTIN = Неопределено Тогда
					ДанныеGTIN.Вставить(Выборка.GTIN);
					ПоследнееЗначениеВыборки = Выборка.GTIN;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ДанныеGTIN.Количество() > 1 Тогда
			Возврат Неопределено;
		ИначеЕсли ДанныеGTIN.Количество() = 1 Тогда
			Возврат ПоследнееЗначениеВыборки;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеGTIN = Новый Соответствие;
	ПоследнееЗначениеВыборки = "";
	Пока Выборка.Следующий() Цикл
		Если ор_ИнтеграцияМДЛПКлиентСервер.ЭтоGTIN(Выборка.GTIN)
			И МенеджерОборудованияКлиентСервер.ПроверитьКорректностьGTIN(Выборка.GTIN) Тогда
			ЗначениеGTIN = ДанныеGTIN[Выборка.GTIN];
			Если ЗначениеGTIN = Неопределено Тогда
				ДанныеGTIN.Вставить(Выборка.GTIN);
				ПоследнееЗначениеВыборки = Выборка.GTIN;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеGTIN.Количество() = 1 Тогда
		Возврат ПоследнееЗначениеВыборки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект, ИмяТЧ = "Товары") Экспорт
	
	Для Каждого СтрокаТовара Из Объект[ИмяТЧ] Цикл
		
		СтрокаТовара.КоличествоУпаковок = СтрокаТовара.Количество / ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТовара.Упаковка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект, ИмяТЧТовары = "Товары", ТолькоНоменклатуру = Ложь) Экспорт
	
	вТаблицаТовары = Объект[ИмяТЧТовары].Выгрузить(, "НомерСтроки, GTIN");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрокаНомерУпаковки = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(27));
	ОписаниеТиповСтрокаКлючУпаковки = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(100));
	вТаблицаТовары.Колонки.Добавить("НомерУпаковки", ОписаниеТиповСтрокаНомерУпаковки);
	вТаблицаТовары.Колонки.Добавить("КлючУпаковки", ОписаниеТиповСтрокаКлючУпаковки);
	
	вТаблицаТовары.Очистить();
	
	Для Каждого СтрокаТовара Из Объект[ИмяТЧТовары] Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Номенклатура)
			И НЕ ЗначениеЗаполнено(СтрокаТовара.Характеристика)
			И НЕ ТолькоНоменклатуру Тогда
			СтруктураПоиска = Новый Структура("ИдентификаторСтроки", СтрокаТовара.ИдентификаторСтроки);
			НайденныеСтроки = Объект.НомераУпаковок.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрока = вТаблицаТовары.Добавить();
				НоваяСтрока.НомерСтроки = СтрокаТовара.НомерСтроки;
				НоваяСтрока.НомерУпаковки = НайденныеСтроки[0].НомерКИЗ;
				НоваяСтрока.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НайденныеСтроки[0].НомерКИЗ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если вТаблицаТовары.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТовары.НомерУпаковки КАК НомерУпаковки,
		|	ТаблицаТовары.КлючУпаковки КАК КлючУпаковки
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.НомерСтроки КАК НомерСтроки,
		|	УпаковкиМаркируемыхТоваров.Номенклатура КАК Номенклатура,
		|	УпаковкиМаркируемыхТоваров.Характеристика КАК Характеристика
		|ИЗ
		|	втТовары КАК втТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
		|		ПО втТовары.НомерУпаковки = УпаковкиМаркируемыхТоваров.НомерУпаковки
		|			И втТовары.КлючУпаковки = УпаковкиМаркируемыхТоваров.КлючУпаковки";
		
		Запрос.УстановитьПараметр("ТаблицаТовары", вТаблицаТовары);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТаблицы = Объект[ИмяТЧТовары][Выборка.НомерСтроки - 1];
			СтрокаТаблицы.Номенклатура = Выборка.Номенклатура;
			СтрокаТаблицы.Характеристика = Выборка.Характеристика;
		КонецЦикла;
	КонецЕсли;
	
	вТаблицаТовары.Очистить();
	
	Для Каждого СтрокаТовара Из Объект[ИмяТЧТовары] Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			НоваяСтрока = вТаблицаТовары.Добавить();
			НоваяСтрока.НомерСтроки = СтрокаТовара.НомерСтроки;
			НоваяСтрока.GTIN = СтрокаТовара.GTIN;
		КонецЕсли;
	КонецЦикла;
	
	Если вТаблицаТовары.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТовары.GTIN КАК GTIN
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.НомерСтроки КАК НомерСтроки,
		|	Штрихкоды.Номенклатура КАК Номенклатура
		|ИЗ
		|	втТовары КАК втТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|		ПО втТовары.GTIN = Штрихкоды.Штрихкод
		|			И (Штрихкоды.Номенклатура ССЫЛКА Справочник.Номенклатура)
		|			И (Штрихкоды.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров)
		|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
		|			И (Штрихкоды.Партия = &Партия)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура)
		|ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("ТаблицаТовары"   , вТаблицаТовары);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
		Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
		
		Результат = Запрос.Выполнить();
		
		ВыборкаПоНомерСтроки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНомерСтроки.Следующий() Цикл
			Если ВыборкаПоНомерСтроки.Номенклатура = 1 Тогда
				ВыборкаПоТоварам = ВыборкаПоНомерСтроки.Выбрать();
				Если ВыборкаПоТоварам.Следующий() Тогда
					СтрокаТаблицы = Объект[ИмяТЧТовары][ВыборкаПоТоварам.НомерСтроки - 1];
					СтрокаТаблицы.Номенклатура = ВыборкаПоТоварам.Номенклатура;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из Объект[ИмяТЧТовары] Цикл
		Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитыНоменклатуры(СтрокаТовара);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьМассивТоваровДляРегистрацииGTIN(МассивТоваров) Экспорт
	
	втТовары = Новый ТаблицаЗначений;
	втТовары.Колонки.Добавить("GTIN", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(14)));
	втТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	втТовары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	Для Каждого СтрокаМассива Из МассивТоваров Цикл
		НоваяСтрока = втТовары.Добавить();
		НоваяСтрока.GTIN           = СтрокаМассива.GTIN;
		НоваяСтрока.Номенклатура   = СтрокаМассива.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаМассива.Характеристика;
	КонецЦикла;
	
	НовыйМассивТоваров = Новый Массив;
	
	ОбработатьТаблицуТоваровДляРегистрацииGTIN(втТовары);
	
	Для Каждого Строка Из втТовары Цикл
		СтруктураСтроки = Новый Структура("ДляХарактеристики,GTIN,Номенклатура,Характеристика");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
		НовыйМассивТоваров.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	МассивТоваров = НовыйМассивТоваров;
	
КонецПроцедуры

Процедура ОбработатьТаблицуТоваровДляРегистрацииGTIN(ТоварыРегистрацииGTIN) Экспорт
	
	Если ТоварыРегистрацииGTIN.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.GTIN КАК GTIN,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.GTIN КАК GTIN,
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ втТоварыБезШК
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|		ПО втТовары.GTIN = Штрихкоды.Штрихкод
		|			И втТовары.Номенклатура = Штрихкоды.Номенклатура
		|			И (втТовары.Характеристика = Штрихкоды.Характеристика
		|				ИЛИ Штрихкоды.Характеристика = &ПустаяХарактеристика)
		|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
		|			И (Штрихкоды.Партия = &Партия)
		|ГДЕ
		|	Штрихкоды.Штрихкод ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	втТовары.GTIN,
		|	втТовары.Номенклатура,
		|	втТовары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК GTIN,
		|	Штрихкоды.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ втШтрихкодыПоGTIN
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТоварыБезШК КАК втТоварыБезШК
		|		ПО Штрихкоды.Штрихкод = втТоварыБезШК.GTIN
		|			И Штрихкоды.Номенклатура = втТоварыБезШК.Номенклатура
		|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
		|			И (Штрихкоды.Партия = &Партия)
		|			И Штрихкоды.Характеристика <> втТоварыБезШК.Характеристика
		|			И (Штрихкоды.Характеристика <> &ПустаяХарактеристика)
		|
		|СГРУППИРОВАТЬ ПО
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штрихкоды.Номенклатура КАК Номенклатура,
		|	Штрихкоды.Штрихкод КАК GTIN,
		|	ВЫБОР
		|			КОГДА Штрихкоды.Характеристика = &ПустаяХарактеристика
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ КАК ДляХарактеристики
		|ПОМЕСТИТЬ втШтрихкодыПоНоменклатуреВременная
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТоварыБезШК КАК втТоварыБезШК
		|		ПО Штрихкоды.Номенклатура = втТоварыБезШК.Номенклатура
		|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
		|			И (Штрихкоды.Партия = &Партия)
		|;
		|";
		
		Запрос.УстановитьПараметр("ТаблицаТовары"       , ТоварыРегистрацииGTIN);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения"    , Справочники.ЕдиницыИзмерения.ПустаяСсылка());
		Запрос.УстановитьПараметр("Партия"              , Справочники.ПартииНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
		ОтобратьТолькоGTIN(Запрос.МенеджерВременныхТаблиц, "втШтрихкодыПоНоменклатуреВременная");
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	втШтрихкодыПоНоменклатуреВременная.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(втШтрихкодыПоНоменклатуреВременная.ДляХарактеристики) КАК ДляХарактеристики
		|ПОМЕСТИТЬ втШтрихкодыПоНоменклатуре
		|ИЗ
		|	втШтрихкодыПоНоменклатуреВременная КАК втШтрихкодыПоНоменклатуреВременная
		|
		|СГРУППИРОВАТЬ ПО
		|	втШтрихкодыПоНоменклатуреВременная.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТоварыБезШК.GTIN КАК GTIN,
		|	втТоварыБезШК.Номенклатура КАК Номенклатура,
		|	втТоварыБезШК.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА НЕ втШтрихкодыПоGTIN.GTIN ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ втШтрихкодыПоНоменклатуре.Номенклатура ЕСТЬ NULL
		|					ТОГДА втШтрихкодыПоНоменклатуре.ДляХарактеристики
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ДляХарактеристики
		|ИЗ
		|	втТоварыБезШК КАК втТоварыБезШК
		|		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкодыПоGTIN КАК втШтрихкодыПоGTIN
		|		ПО втТоварыБезШК.GTIN = втШтрихкодыПоGTIN.GTIN
		|			И втТоварыБезШК.Номенклатура = втШтрихкодыПоGTIN.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкодыПоНоменклатуре КАК втШтрихкодыПоНоменклатуре
		|		ПО втТоварыБезШК.Номенклатура = втШтрихкодыПоНоменклатуре.Номенклатура";
		
		ТоварыРегистрацииGTIN = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтобратьТолькоGTIN(МенеджерВременныхТаблиц, ИмяТаблицы = "втШтрихкоды") Экспорт
	
	МассивДляУдаления = Новый Массив;
	ТаблицаGTIN = МенеджерВременныхТаблиц.Таблицы[ИмяТаблицы].ПолучитьДанные().Выгрузить();
	
	Для Каждого Строка Из ТаблицаGTIN Цикл
		Если НЕ ор_ИнтеграцияМДЛПКлиентСервер.ЭтоGTIN(Строка.GTIN) Тогда
			МассивДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из МассивДляУдаления Цикл
		ТаблицаGTIN.Удалить(Строка);
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить("
	|УНИЧТОЖИТЬ #ИмяТаблицы
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ #ИмяТаблицы
	|ИЗ
	|	&ТаблицаGTIN КАК ТаблицаGTIN
	|", "#ИмяТаблицы", ИмяТаблицы);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаGTIN", ТаблицаGTIN);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СверткаИнформационнойБазыПометитьДокументНаУдаление(ИмяДокумента,ДокументОбъект) Экспорт
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("СверткаИнформационнойБазыПометитьДокументНаУдалениеМДЛП");
	
КонецПроцедуры

Функция РазрешеноУдалениеПриСвертке(Объект) Экспорт
	
	Результат = Ложь;
	
	ЕстьДополнительныеСвойства = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДополнительныеСвойства");
	
	Если НЕ ЕстьДополнительныеСвойства Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
	Если НЕ ТипЗнч(ДополнительныеСвойства) = Тип("Структура")
		И НЕ ДополнительныеСвойства.Свойство("СверткаИнформационнойБазыПометитьДокументНаУдалениеМДЛП") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекущийСтатус = ИнтеграцияМДЛП.ТекущийСтатусУведомления(Объект.Ссылка);
	СтатусМДЛП = ТекущийСтатус.Статус;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УведомлениеОбОтгрузкеМДЛП")
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
		
		Если СтатусМДЛП = Перечисления.СтатусыИнформированияМДЛП.Закрыто Тогда
			Результат = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УведомлениеВладельцаОбОприходованииМДЛП") Тогда
		
		Если СтатусМДЛП = Перечисления.СтатусыИнформированияМДЛП.Закрыто Тогда
			Результат = Истина;
		КонецЕсли;
		
	Иначе
		
		Если СтатусМДЛП = Перечисления.СтатусыИнформированияМДЛП.Закрыто
			ИЛИ СтатусМДЛП = Перечисления.СтатусыИнформированияМДЛП.Принято Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры(НоменклатураПредставление, ХарактеристикаПредставление, СерияПредставление = "") Экспорт

	СтрПредставление = СокрЛП(НоменклатураПредставление);

	Если ЗначениеЗаполнено(ХарактеристикаПредставление) И НЕ ХарактеристикаПредставление = "<>" Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(ХарактеристикаПредставление);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерияПредставление)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(СерияПредставление);
	КонецЕсли;

	Возврат СтрПредставление;

КонецФункции

Функция ПолучитьПоступлениеТоваровПоЗаказуПоставщику(ЗаказПоставщику) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Заказ = &ЗаказПоставщику
	|	И НЕ ПриходнаяНакладная.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И ПриходнаяНакладная.Проведен";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция УведомлениеОбщийТекстЗапросаОформите(Уведомление) Экспорт
	
	Основания = Новый Массив;
	Для Каждого ТипОснования Из Уведомление.Реквизиты.Основание.Тип.Типы() Цикл
		
		Если ОбщегоНазначения.ЭтоСсылка(ТипОснования) Тогда
			Основания.Добавить(Метаданные.НайтиПоТипу(ТипОснования));
		КонецЕсли;
		
	КонецЦикла;
	
	Если Основания.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтатусыОформления.Основание) КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.СтатусыОформленияДокументовМДЛП КАК СтатусыОформления
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыОформленияДокументовМДЛП КАК ДругиеУведомленияПоОснованию
	|	ПО
	|		ДругиеУведомленияПоОснованию.Основание = СтатусыОформления.Основание
	|		И ДругиеУведомленияПоОснованию.СтатусОформления <> ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеОформлено)
	|		И НЕ ДругиеУведомленияПоОснованию.Документ В (&СовместноВводимыеУведомления)
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СубъектыОбращенияМДЛП КАК ОрганизацииМДЛП
	|	ПО
	|		ОрганизацииМДЛП.ОрганизацияКонтрагент = СтатусыОформления.Организация
	|		И ОрганизацииМДЛП.ОбъектМестаДеятельности = СтатусыОформления.МестоДеятельности
	|//СОЕДИНЕНИЯ
	|ГДЕ
	|	СтатусыОформления.Документ = &Уведомление
	|	И СтатусыОформления.СтатусОформления В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеОформлено),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.ОформленоЧастично)
	|	)
	|	И ДругиеУведомленияПоОснованию.Основание ЕСТЬ NULL
	|	И (&Организация = НЕОПРЕДЕЛЕНО ИЛИ ОрганизацииМДЛП.Организация = &Организация)
	|	И (&МестоДеятельности = НЕОПРЕДЕЛЕНО ИЛИ ОрганизацииМДЛП.МестоДеятельности = &МестоДеятельности)
	|//УСЛОВИЯ
	|";
	
	Соединения = "";
	УсловияСсылка = Новый Массив;
	
	Для Каждого Основание Из Основания Цикл
		
		Если Не ПравоДоступа("Чтение", Основание) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТаблицы = Основание.ПолноеИмя();
		Псевдоним  = Основание.Имя;
		
		Соединения = Соединения + СтрШаблон("
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		%1 КАК %2
			|	ПО
			|		%2.Ссылка = СтатусыОформления.Основание
			|",
			ИмяТаблицы,
			Псевдоним);
		УсловияСсылка.Добавить(СтрШаблон("%1.Ссылка ЕСТЬ НЕ NULL", Псевдоним));
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Уведомление", СтрШаблон("ЗНАЧЕНИЕ(%1.ПустаяСсылка)", Уведомление.ПолноеИмя()));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СовместноВводимыеУведомления", СтрШаблон("ЗНАЧЕНИЕ(%1.ПустаяСсылка)", Уведомление.ПолноеИмя()));
	
	Если Не ПустаяСтрока(Соединения) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//СОЕДИНЕНИЯ", Соединения);
	КонецЕсли;
	
	Если УсловияСсылка.Количество() > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЯ", СтрШаблон("И (%1)", СтрСоединить(УсловияСсылка, " ИЛИ ")) + Символы.ПС + "//УСЛОВИЯ");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПроверитьЗаполнениеХарактеристик(Объект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки = Неопределено) Экспорт
	
	Перем СуффиксДопРеквизита;
	Перем ИмяТЧ;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроверки <> Неопределено Тогда
		
		ПараметрыПроверки.Свойство("ИмяТЧ",ИмяТЧ);
		ПараметрыПроверки.Свойство("СуффиксДопРеквизита",СуффиксДопРеквизита);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяТЧ) Тогда
		ИмяТЧ = "Товары";
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить(ИмяТЧ+".Характеристика");
	
	Если ЗначениеЗаполнено(СуффиксДопРеквизита) Тогда
		МассивНепроверяемыхРеквизитов.Добавить(ИмяТЧ+".Характеристика"+СуффиксДопРеквизита);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("УправляемаяФорма") Тогда
		МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	Иначе
		МетаданныеОбъекта = Объект.Метаданные();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки,";
	Если ЗначениеЗаполнено(СуффиксДопРеквизита) Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	ТаблицаТоваров.Номенклатура"+СуффиксДопРеквизита+" КАК Номенклатура"+СуффиксДопРеквизита+",
	|	ТаблицаТоваров.Характеристика"+СуффиксДопРеквизита+" КАК Характеристика"+СуффиксДопРеквизита+",";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ СтрокиСОшибками
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	Если ЗначениеЗаполнено(СуффиксДопРеквизита) Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	ИЛИ ТаблицаТоваров.Характеристика"+СуффиксДопРеквизита+" = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСОшибками.НомерСтроки,";
	Если ЗначениеЗаполнено(СуффиксДопРеквизита) Тогда
		ТекстЗапроса = ТекстЗапроса + "	
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура" + СуффиксДопРеквизита +" КАК Справочник.Номенклатура).ИспользоватьХарактеристики)
		|			И СтрокиСОшибками.Характеристика"+СуффиксДопРеквизита+" = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеЗаполненаХарактеристика" + СуффиксДопРеквизита +",";
		
		// Получение признака использования характеристик.
		ТекстЗапроса = ТекстЗапроса + "	
		|	ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура" + СуффиксДопРеквизита +" КАК Справочник.Номенклатура).ИспользоватьХарактеристики КАК ИспользуетсяХарактеристики" + СуффиксДопРеквизита +",";
		
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "	
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользоватьХарактеристики
	|			И СтрокиСОшибками.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеЗаполненаХарактеристика
	// Получение признака использования характеристик.
	|	,ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользоватьХарактеристики КАК ИспользуетсяХарактеристики
	|ИЗ
	|	СтрокиСОшибками КАК СтрокиСОшибками
	|ГДЕ
	|	ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ИспользоватьХарактеристики
	| 	И СтрокиСОшибками.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	Если ЗначениеЗаполнено(СуффиксДопРеквизита) Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	ИЛИ ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура" + СуффиксДопРеквизита +" КАК Справочник.Номенклатура).ИспользоватьХарактеристики
	|	И СтрокиСОшибками.Характеристика"+СуффиксДопРеквизита+" = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	СтрокаДопРеквизитов = ?(Не ЗначениеЗаполнено(СуффиксДопРеквизита), "", ",Номенклатура"+СуффиксДопРеквизита+",Характеристика"+СуффиксДопРеквизита);
	
	Если Не ПараметрыПроверки = Неопределено Тогда
		СписокСтрок = Неопределено;
		ОтборПроверяемыхСтрок = Неопределено;
		ЕстьСписокСтрок = ПараметрыПроверки.Свойство("СписокСтрок",СписокСтрок);
		ЕстьОтборПроверяемыхСтрок = ПараметрыПроверки.Свойство("ОтборПроверяемыхСтрок",ОтборПроверяемыхСтрок);
		
		Если СписокСтрок = Неопределено 
			И ЕстьОтборПроверяемыхСтрок 
			И (Не ОтборПроверяемыхСтрок = Неопределено) 
			И ОтборПроверяемыхСтрок.Количество() >0 Тогда
			
			ОтборСтрокДляПроверки = ПараметрыПроверки.ОтборПроверяемыхСтрок;
		Иначе
			ОтборСтрокДляПроверки = СписокСтрок;
		КонецЕсли;
		
		Если ОтборСтрокДляПроверки = Неопределено Тогда
			Запрос.УстановитьПараметр("ТаблицаТоваров",  Объект[ИмяТЧ].Выгрузить(,"НомерСтроки,Номенклатура,Характеристика"+СтрокаДопРеквизитов));
		Иначе
			Запрос.УстановитьПараметр("ТаблицаТоваров",
			Объект[ИмяТЧ].Выгрузить(ОтборСтрокДляПроверки, "НомерСтроки,Номенклатура,Характеристика"+СтрокаДопРеквизитов));
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТоваров",  Объект[ИмяТЧ].Выгрузить(,"НомерСтроки,Номенклатура,Характеристика"+СтрокаДопРеквизитов));
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%Характеристика%"" в строке %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПредставлениеТЧ                      = МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Синоним;
	ПредставлениеРеквизитаХарактеристика = МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Реквизиты.Характеристика.Синоним;
	ПредставлениеРеквизитаХарактеристикаДоп = МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Реквизиты["Характеристика"+СуффиксДопРеквизита].Синоним;
	
	ИгнорироватьНезаполненныеСерии = ПараметрыПроверки <> Неопределено И ПараметрыПроверки.Свойство("ИгнорироватьОбязательноеЗаполнениеХарактеристикСерий");
	
	Пока Выборка.Следующий() Цикл
		
		// Добавляем обработку проверки заполнения характеристик для товара не являющегося ЛС.
		Если ИгнорироватьНезаполненныеСерии Тогда
			ОшибкаЗаполненияХарактеристик     =  НЕ Выборка.ИспользуетсяХарактеристики И Выборка.НеЗаполненаХарактеристика;
			ОшибкаЗаполненияХарактеристикСуфф = НЕ ПустаяСтрока(СуффиксДопРеквизита) И НЕ Выборка["ИспользуетсяХарактеристики" + СуффиксДопРеквизита] И Выборка["НеЗаполненаХарактеристика" + СуффиксДопРеквизита];
		Иначе
			ОшибкаЗаполненияХарактеристик     = Выборка.НеЗаполненаХарактеристика;
			ОшибкаЗаполненияХарактеристикСуфф = НЕ ПустаяСтрока(СуффиксДопРеквизита) И Выборка["НеЗаполненаХарактеристика" + СуффиксДопРеквизита];
		КонецЕсли;
		
		Если ОшибкаЗаполненияХарактеристик Тогда
			
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Характеристика%", ПредставлениеРеквизитаХарактеристика);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", ПредставлениеТЧ);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, Выборка.НомерСтроки, "Характеристика");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Поле,"Объект",Отказ);
		КонецЕсли;
		
		Если ОшибкаЗаполненияХарактеристикСуфф Тогда
			
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Характеристика%", ПредставлениеРеквизитаХарактеристикаДоп);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", ПредставлениеТЧ);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, Выборка.НомерСтроки, "Характеристика"+СуффиксДопРеквизита);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Поле,"Объект",Отказ);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьПризнакХарактеристикиИспользуются(ТекущаяСтрока) Экспорт
	
	Номенклатура = ТекущаяСтрока.Номенклатура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ИспользоватьХарактеристики КАК ИспользованиеХарактеристик
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСтрока[Номенклатура]);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекущаяСтрока.ХарактеристикиИспользуются = Выборка.ИспользованиеХарактеристик;
	Иначе
		ТекущаяСтрока.ХарактеристикиИспользуются = Ложь;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

