
#Область ПрограммныйИнтерфейс

// Функция - получить характеристики номеклатуры с остатками
//
// Параметры:
//  Параметры - структура параметров:
// 		- "Магазин"  			 - Магазин которому принадлежит номеклатура
//		- "Номенклатура" 		 - Номеклатура для которой ищатся характеристики 
//		- "Количество" 			 - требуемое количестов номеклатуры
//		- "СортировкаПоУбыванию" - (Необязательный) Напрвление сортировки
// 
// Возвращаемое значение:
//   ТаблицаЗначений - характеристики для данной номеклатуры.
//
Функция ПолучитьХарактеристикиНомеклатурыСОстатками(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	|ПОМЕСТИТЬ СписокХарактеристик
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Количество КАК КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.Резерв КАК РезервОстаток
	|ПОМЕСТИТЬ ОстаткиНоменклатуры
	|ИЗ
	|	РегистрСведений.ОстаткиТоваров КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.СтруктурнаяЕдиница В
	|			(ВЫБРАТЬ
	|				ТаблицаСклады.Склад КАК Склад
	|			ИЗ
	|				ТаблицаСклады КАК ТаблицаСклады)
	|	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	|	И НЕ ТоварыНаСкладахОстатки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ОстаткиНоменклатуры.КоличествоОстаток, 0) КАК Доступно,
	|	ЕСТЬNULL(ОстаткиНоменклатуры.РезервОстаток, 0) КАК ВРезерве,
	|	ВЫБОР
	|		КОГДА &КоличествоНоменклатуры > ЕСТЬNULL(ОстаткиНоменклатуры.КоличествоОстаток, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтстаткаНеХватает
	|ИЗ
	|	СписокХарактеристик КАК СписокХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
	|		ПО СписокХарактеристик.Характеристика = ОстаткиНоменклатуры.Характеристика";
	
	Если Параметры.Свойство("ПоказыватьТолькоХарактеристикиВНаличии") И Параметры.ПоказыватьТолькоХарактеристикиВНаличии Тогда
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ЕСТЬNULL(ОстаткиНоменклатуры.КоличествоОстаток, 0) > 0";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТорговыйОбъект", Параметры.ТорговыйОбъект);
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	Запрос.УстановитьПараметр("КоличествоНоменклатуры", Параметры.Количество);
	Запрос.УстановитьПараметр("Владелец", ПолучитьВладельцаХарактеристики(Параметры.Номенклатура));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - возвращает владельца характеристики
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - ссылка на номенклатуру
// 
// Возвращаемое значение:
//   Неопределено - ссылка не определена
//   СправочникСсылка.Номенклатура - ссылка на номенклатуру
//   СправочникСсылка.КатегорииНоменклатуры - ссылка на категорию
//
Функция ПолучитьВладельцаХарактеристики(Номенклатура) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено;
	ИначеЕсли НЕ ТипЗнч(Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(Номенклатура.КатегорияНоменклатуры) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Номенклатура.ИспользоватьХарактеристики Тогда
		Возврат Номенклатура;
	ИначеЕсли Номенклатура.КатегорияНоменклатуры.ИспользоватьХарактеристики Тогда
		Возврат Номенклатура.КатегорияНоменклатуры;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьВладельцаХарактеристики()

// Функция - Подготовить структуру печати
//
// Параметры:
//  ПараметрКоманды	 - СправочникСсылка.КатегорииНоменклатуры - ссылка на категорию
// 
// Возвращаемое значение:
//   Структура - структура настроек
//
Функция ПодготовитьСтруктуруПечати(ПараметрКоманды) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Ссылка.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
	|	Номенклатура.Ссылка.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.ор_ШаблонЦенника = ЗНАЧЕНИЕ(Справочник.ШаблоныЭтикетокИЦенниковБПО.ПустаяСсылка)
	|			ТОГДА Номенклатура.ор_ШаблонЦенника
	|		ИНАЧЕ Номенклатура.КатегорияНоменклатуры.ШаблонЦенникаБПО
	|	КОНЕЦ КАК ШаблонЦенникаЭтикетки
	|ПОМЕСТИТЬ СпрНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.КатегорияНоменклатуры.Ссылка В ИЕРАРХИИ(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	СпрНоменклатура.ШаблонЦенникаЭтикетки КАК ШаблонЦенникаЭтикетки
	|ПОМЕСТИТЬ НоменклатураХарактеристики
	|ИЗ
	|	СпрНоменклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ВЫБОР
	|				КОГДА НЕ СпрНоменклатура.ИспользоватьХарактеристики
	|						И СпрНоменклатура.КатегорияНоменклатуры.ИспользоватьХарактеристики
	|					ТОГДА СпрНоменклатура.КатегорияНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СпрНоменклатура.ИспользоватьХарактеристики
	|							ТОГДА СпрНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	|					КОНЕЦ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураХарактеристики.Номенклатура КАК НоменклатураБПО,
	|	НоменклатураХарактеристики.Характеристика КАК ХарактеристикаБПО,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	НоменклатураХарактеристики КАК НоменклатураХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Актуальность
	|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НоменклатураХарактеристики.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И НоменклатураХарактеристики.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураХарактеристики.Номенклатура КАК НоменклатураБПО,
	|	НоменклатураХарактеристики.Характеристика КАК ХарактеристикаБПО,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ втШтрихкодыНоменклатуры
	|ИЗ
	|	НоменклатураХарактеристики КАК НоменклатураХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО НоменклатураХарактеристики.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И НоменклатураХарактеристики.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураХарактеристики.Номенклатура КАК НоменклатураБПО,
	|	НоменклатураХарактеристики.Характеристика КАК ХарактеристикаБПО,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ втШтрихкодыБезХарактеристик
	|ИЗ
	|	НоменклатураХарактеристики КАК НоменклатураХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО НоменклатураХарактеристики.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И (ШтрихкодыНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураХарактеристики.Номенклатура КАК НоменклатураБПО,
	|	НоменклатураХарактеристики.Характеристика КАК ХарактеристикаБПО,
	|	НоменклатураХарактеристики.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА Штрихкоды.Штрихкод ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ШтрихкодыПХ.Штрихкод, """")
	|		ИНАЧЕ Штрихкоды.Штрихкод
	|	КОНЕЦ КАК Штрихкод
	|ИЗ
	|	НоменклатураХарактеристики КАК НоменклатураХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО НоменклатураХарактеристики.Номенклатура = Штрихкоды.НоменклатураБПО
	|			И НоменклатураХарактеристики.Характеристика = Штрихкоды.ХарактеристикаБПО
	|		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкодыБезХарактеристик КАК ШтрихкодыПХ
	|		ПО НоменклатураХарактеристики.Номенклатура = ШтрихкодыПХ.НоменклатураБПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураХарактеристики.Номенклатура КАК НоменклатураБПО,
	|	НоменклатураХарактеристики.Упаковка КАК УпаковкаБПО,
	|	НоменклатураХарактеристики.Характеристика КАК ХарактеристикаБПО,
	|	НоменклатураХарактеристики.ШаблонЦенникаЭтикетки КАК ШаблонЦенникаЭтикетки,
	|	НоменклатураХарактеристики.Номенклатура.Склад.Организация КАК ОрганизацияБПО
	|ИЗ
	|	НоменклатураХарактеристики КАК НоменклатураХарактеристики
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураХарактеристики.Номенклатура,
	|	НоменклатураХарактеристики.Характеристика";
	
	Запрос.УстановитьПараметр("МассивСсылок", ПараметрКоманды);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦен", ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойВидЦенПродажи"));
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();
	ТоварыСЦеной 		= РезультатЗапроса[2].Выгрузить();
	ТоварыСоШтрихкодом 	= РезультатЗапроса[5].Выгрузить();
	ТоварыЗапроса 		= РезультатЗапроса[6].Выгрузить();
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("НоменклатураБПО",          Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("ХарактеристикаБПО",        Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("УпаковкаБПО",              Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	Товары.Колонки.Добавить("ОрганизацияБПО",           Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОрганизацияБПО.Тип));
	Товары.Колонки.Добавить("Количество",               Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Цена",                     Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Штрихкод",                 Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЦенникаЭтикетки",    Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенниковБПО"));
	
	Для Каждого Товар Из ТоварыЗапроса Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
		
		РезультатПоиска = ТоварыСоШтрихкодом.НайтиСтроки(Новый Структура("НоменклатураБПО, ХарактеристикаБПО",
			Товар.НоменклатураБПО, Товар.ХарактеристикаБПО));
		Если РезультатПоиска.Количество() > 0 Тогда
			НоваяСтрока.Штрихкод = РезультатПоиска[0].Штрихкод;
		КонецЕсли;
		
		РезультатПоиска = ТоварыСЦеной.НайтиСтроки(Новый Структура("НоменклатураБПО, ХарактеристикаБПО",
			Товар.НоменклатураБПО, Товар.ХарактеристикаБПО));
		Если РезультатПоиска.Количество() > 0 Тогда
			НоваяСтрока.Цена = РезультатПоиска[0].Цена;
		КонецЕсли;

	КонецЦикла;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Запасы", Товары);
	
	// Параметр необходимый для печати.
	// Добавляем ссылки на объекты печати.
	СтруктураРезультат.Вставить("МассивДокументов", ОбщегоНазначения.ТаблицаЗначенийВМассив(Товары));
	
	СтруктураПараметры = Новый Структура("АдресВХранилище", ПоместитьВоВременноеХранилище(СтруктураРезультат));
	
	Возврат СтруктураПараметры;
КонецФункции

// Функция - Получить настройку учитывать характеристики при подборе сопутствующих товаров
// 
// Возвращаемое значение:
//   Булево - признак учитывания характеристик при подборе сопутствующих товаров
//
Функция ПолучитьНастройкуУчитыватьХарактеристикиПриПодбореСопутствующихТоваров() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ор_УчитыватьХарактеристикиПриПодбореСопутствующихТоваров.Получить()
		И ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
КонецФункции

// Функция - Выполнить контроль номера входящего документа
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.ПриходнаяНакладная - приходная накладная
// 
// Возвращаемое значение:
//   ДокументСсылка.ПриходнаяНакладная - приходная накладная
//   Неопределено -  если контроль выполнен успешно или он не требуется
//
Функция ВыполнитьКонтрольНомераВходящегоДокумента(ДокументОбъект) Экспорт
	
	Если ТипЗнч(ДокументОбъект)<>Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПерсональныеНастройкиРУНФ.Прочитать(
		"ор_КонтролироватьУникальностьНомераВходящегоДокументаВПриходнойНакладной") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УчитыватьДатуПриКонтроле = ПерсональныеНастройкиРУНФ.Прочитать(
		"ор_УчитыватьПриКонтролеВПределахГодаДатуВходящегоДокумента");
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.НомерВходящегоДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если УчитыватьДатуПриКонтроле И Не ЗначениеЗаполнено(ДокументОбъект.ДатаВходящегоДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПриходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка <> &Ссылка
	|	И ПриходнаяНакладная.Проведен
	|	И ПриходнаяНакладная.Контрагент = &Контрагент
	|	И ПриходнаяНакладная.НомерВходящегоДокумента = &НомерВходящегоДокумента";
	
	Запрос.УстановитьПараметр("Ссылка"                 , ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Контрагент"             , ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", ДокументОбъект.НомерВходящегоДокумента);
	
	Если УчитыватьДатуПриКонтроле Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.Таб + "И ПриходнаяНакладная.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		                                                        |	И ПриходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", ДокументОбъект.ДатаВходящегоДокумента);
		Запрос.УстановитьПараметр("ДатаНачала"            , НачалоГода(ДокументОбъект.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания"         , КонецГода(ДокументОбъект.Дата));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

// Позволяет задать значения параметров, необходимых для работы клиентского кода
// при запуске конфигурации (в обработчиках событий ПередНачаломРаботыСистемы и ПриНачалеРаботыСистемы) 
// без дополнительных серверных вызовов. 
// Для получения значений этих параметров из клиентского кода
// см. СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске.
//
// Важно: недопустимо использовать команды сброса кэша повторно используемых модулей, 
// иначе запуск может привести к непредсказуемым ошибкам и лишним серверным вызовам.
//
// Параметры:
//   Параметры - Структура - имена и значения параметров работы клиента при запуске, которые необходимо задать.
//                           Для установки параметров работы клиента при запуске:
//                           Параметры.Вставить(<ИмяПараметра>, <код получения значения параметра>);
//
Процедура ЗаполнитьПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Параметры.Вставить("ЗапуститьИнфоКиоск", ЗапуститьИнфоКиоск(Параметры));
	
	УстановленСоставФормТребуетсяОбновлениеИнтерфейса = Ложь;
	НастроитьРабочийСтолДляИнфоКиоска(Параметры.ЗапуститьИнфоКиоск, УстановленСоставФормТребуетсяОбновлениеИнтерфейса);
	Параметры.Вставить("УстановленСоставФормТребуетсяОбновлениеИнтерфейса", УстановленСоставФормТребуетсяОбновлениеИнтерфейса);
	
КонецПроцедуры

// Настраивает состав форм начальной страницы приложения
//
// Параметры:
//  ИспользоватьИнфоКиоск		 						 - Булево - признак использования инфокиоска
//  УстановленСоставФормТребуетсяОбновлениеИнтерфейса	 - Булево - признак необходимости обновления интерфейса
//
Процедура НастроитьРабочийСтолДляИнфоКиоска(ИспользоватьИнфоКиоск, УстановленСоставФормТребуетсяОбновлениеИнтерфейса) Экспорт
	
	НастройкиНачальнойСтраницы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(
		"Общее/НастройкиНачальнойСтраницы",
		"");
	
	Если НастройкиНачальнойСтраницы = Неопределено Тогда
		УстановленСоставФормТребуетсяОбновлениеИнтерфейса = Истина;
		Если ИспользоватьИнфоКиоск Тогда
			НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
			СоставФорм = Новый СоставФормНачальнойСтраницы;
			СоставФорм.ЛеваяКолонка.Добавить("Обработка.ор_ИнформационныйКиоск.Форма.Форма");
			НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
			ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить(
				"Общее/НастройкиНачальнойСтраницы",
				"",
				НастройкиНачальнойСтраницы);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	
	ЛеваяКолонка = СоставФорм.ЛеваяКолонка;
	ПраваяКолонка = СоставФорм.ПраваяКолонка;
	ФормаПоиска = "Обработка.ор_ИнформационныйКиоск.Форма.Форма";
	
	// В правой колонке не должно быть формы ИнфоКиоска.
	ЭлементМассива = ПраваяКолонка.Найти(ФормаПоиска);
	Если Не ЭлементМассива = Неопределено Тогда
		УстановленСоставФормТребуетсяОбновлениеИнтерфейса = Истина;
		ПраваяКолонка.Удалить(ЭлементМассива);
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Общее/НастройкиНачальнойСтраницы",
			"",
			НастройкиНачальнойСтраницы);
	КонецЕсли;
	
	ЭлементМассива = ЛеваяКолонка.Найти(ФормаПоиска);
	Если ЭлементМассива = Неопределено
		И ИспользоватьИнфоКиоск Тогда
		УстановленСоставФормТребуетсяОбновлениеИнтерфейса = Истина;
		ЛеваяКолонка.Очистить();
		ПраваяКолонка.Очистить();
		ЛеваяКолонка.Добавить(ФормаПоиска);
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Общее/НастройкиНачальнойСтраницы",
			"",
			НастройкиНачальнойСтраницы);
	ИначеЕсли Не ЭлементМассива = Неопределено
		И Не ИспользоватьИнфоКиоск Тогда
		УстановленСоставФормТребуетсяОбновлениеИнтерфейса = Истина;
		НачалоРаботыСПрограммойСервер.УстановитьСтандартныйИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает таблицу значений на основании массива структур
// 
// Параметры:
//	МассивСтруктур - МассивСтруктур - массив структур, которые будут преобразованы в таблиц значений.
//										Свойства структуры первого элемента массива определяют состав колонок результирующей таблицы
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица значений, созданная из массива структур
// 
Функция МассивВТаблицуЗначений(МассивСтруктур) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	// Создадим колонки по первой структуре массива
	Если ТипЗнч(МассивСтруктур) = Тип("Массив") И МассивСтруктур.Количество() <> 0 Тогда
		
		ПерваяСтруктура = МассивСтруктур[0];
		Для Каждого Свойство Из ПерваяСтруктура Цикл 
			Таблица.Колонки.Добавить(Свойство.Ключ, ОписаниеТиповПоТипу(ТипЗнч(Свойство.Значение)));
		КонецЦикла;
		
		Для Каждого Структура Из МассивСтруктур Цикл 
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Структура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Описание типов по типу
//
// Параметры:
//  Тип - Тип - тип, на основании которого следует получить описание типов
// 
// Возвращаемое значение:
//  ОписаниеТипов - описание типов на основе переданного типа
//
Функция ОписаниеТиповПоТипу(Тип) Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип);
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТипов;
	
КонецФункции

// Получение индентификатора отраслевого XDTO-пакета.
// 
// Возвращаемое значение:
//   - Строка - идентификатор.
//
Функция ИдентификаторОтраслевогоXDTOПакета() Экспорт
	
	Возврат "RetPharm";
	
КонецФункции

// Определение используется ли версия формата для отраслевого обмена.
//
// Параметры:
//  СтрокаВерсии - Строка	 - версия формата обмена.
// 
// Возвращаемое значение:
//   - Булево - признак того что это отраслевой формат обмена.
//
Функция ЭтоОтраслевойОбмен(СтрокаВерсии) Экспорт
	Если Не ЗначениеЗаполнено(СтрокаВерсии) Или СтрокаВерсии = "1.0.beta" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторXDTO = ИдентификаторОтраслевогоXDTOПакета();
	Если ПустаяСтрока(ИдентификаторXDTO) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторXDTO = НРег(ИдентификаторXDTO);
	
	Возврат СтрНайти(НРег(СтрокаВерсии), ИдентификаторXDTO) > 0
		Или СокрЛП(СтрокаВерсии) = "1.10.0"
		Или ВерсияФорматаЧислом(СтрокаВерсии) = ВерсияФорматаЧислом("1.14");
	
КонецФункции

// Дополнение структуры данных с информацией о единицах измерения для номенклатуры.
//
// Параметры:
//  Данные			 - Структура	 - данные по единице измерения.
//  Номенклатура			 - СправочникСсылка.Номенклатура	 - текущая номенклатура.
//  ТекущаяЕдиницаИзмерения	 - СправочникСсылка.ЕдиницыИзмерения	 - текущая упаковка.
//  ЕдиницаИзмерения		 - СправочникСсылка.ЕдиницыИзмерения	 - новая выбраная упаковка.
//
Процедура ДополнитьДанныеЕдиницыИзмерения(Данные, ТекущаяЕдиницаИзмерения, ЕдиницаИзмерения) Экспорт
	
	Если Не (ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки()
		И УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ор_РассчитыватьЦенуОтКоличестваПервичныхУпаковок")) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕдиницыИзмерения.Владелец КАК Владелец
	|ПОМЕСТИТЬ ВладельцыУпаковки
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Ссылка В(&Массив)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВладельцыУпаковки.Владелец КАК КатегорияНоменклатуры
	|ПОМЕСТИТЬ КатегорииНоменклатуры
	|ИЗ
	|	ВладельцыУпаковки КАК ВладельцыУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК СпрКатегорииНоменклатуры
	|		ПО ВладельцыУпаковки.Владелец = СпрКатегорииНоменклатуры.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.КатегорияНоменклатуры
	|ИЗ
	|	ВладельцыУпаковки КАК ВладельцыУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВладельцыУпаковки.Владелец = СпрНоменклатура.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.КатегорияНоменклатуры
	|ИЗ
	|	ВладельцыУпаковки КАК ВладельцыУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВладельцыУпаковки.Владелец = СпрНоменклатура.НаборЕдиницИзмерения
	|			И (СпрНоменклатура.ИспользоватьНаборыЕдиницИзмерения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КатегорииНоменклатуры.КатегорияНоменклатуры КАК КатегорияНоменклатуры
	|ИЗ
	|	КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК СпрКатегорииНоменклатуры
	|		ПО КатегорииНоменклатуры.КатегорияНоменклатуры = СпрКатегорииНоменклатуры.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(СпрКатегорииНоменклатуры.ор_УчетМаркируемыхТоваров, ЛОЖЬ)");
	
	Массив = Новый Массив;
	Массив.Добавить(ТекущаяЕдиницаИзмерения);
	Массив.Добавить(ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Массив", Массив);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Вычисляем данные для пересчета цены по количеству первичных упаковок, а не от коэффициента.
	ТекущееКоличество = 0;
	НовоеКоличество   = 0;
	
	Если ЗначениеЗаполнено(ТекущаяЕдиницаИзмерения)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяЕдиницаИзмерения, "ор_КоличествоПервичныхУпаковок") Тогда
		ТекущееКоличество = ТекущаяЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЕдиницаИзмерения, "ор_КоличествоПервичныхУпаковок") Тогда
		НовоеКоличество = ЕдиницаИзмерения.ор_КоличествоПервичныхУпаковок;
	КонецЕсли;
	
	Если НовоеКоличество = 0 И ТекущееКоличество = 0 Тогда
		Возврат;
	ИначеЕсли ТекущееКоличество = 0 Тогда
		ТекущееКоличество = 1;
	ИначеЕсли НовоеКоличество = 0 Тогда
		НовоеКоличество = 1
	КонецЕсли;
	
	// Запищем данные наоборот, так как далее при вычислении цены будет рассчет:
	// Цена * Новый коэффициент / Старый коэффициент
	// а коэффициент обратно пропорционален количеству первичных упаковок.
	Данные.Коэффициент = ТекущееКоличество;
	Данные.ТекущийКоэффициент = НовоеКоличество;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЧекККМ") И Источник.Архивный Тогда
		Возврат;
	КонецЕсли;
	
	Если НайтиФальсификаты(Источник) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Отказ = Отказ Или Источник.ДополнительныеСвойства.Свойство("УстановитьОтказПриПроведении");
	КонецЕсли;
	
	Если Отказ И Источник.ДополнительныеСвойства.Свойство("Отказ") Тогда
		Источник.ДополнительныеСвойства.Отказ = Отказ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДокументПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЧекККМ") И Источник.Архивный Тогда
		Возврат;
	КонецЕсли;
	
	Если НайтиПросроченныеСерии(Источник)
		И Источник.ДополнительныеСвойства.Свойство("УстановитьОтказПриПроведении") Тогда
		// Если произвести отказ записи, то событие "при проведении" не возникнет и не пройдут проверки.
		Отказ = РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
КонецПроцедуры 

#Область ПроцедурыИФункцииАптеки

#Область ВспомогательныеПроцедурыИФункции

// Получение реестровых цен ЖНВЛП
//
Функция ПолучитьРеестровыеЦеныЖНВЛП(ТаблицаТоваров) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Ссылка,
	|	ТаблицаТовары.Характеристика КАК Серия
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ВнешнийИсточник КАК ТаблицаТовары
	|ГДЕ
	|	НЕ ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Серии.ор_Производитель ЕСТЬ NULL
	|				ИЛИ Серии.ор_Производитель = ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)
	|			ТОГДА Номенклатура.ор_Производитель
	|		ИНАЧЕ Серии.ор_Производитель
	|	КОНЕЦ КАК Производитель
	|ПОМЕСТИТЬ ТоварыИПроизводители
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Товары.Ссылка = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Серии
	|		ПО Товары.Серия = Серии.Ссылка
	|ГДЕ
	|	Номенклатура.ор_ЖНВЛС
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	ВЫБОР
	|		КОГДА Серии.ор_Производитель ЕСТЬ NULL
	|				ИЛИ Серии.ор_Производитель = ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)
	|			ТОГДА Номенклатура.ор_Производитель
	|		ИНАЧЕ Серии.ор_Производитель
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИПроизводители.Ссылка КАК Номенклатура,
	|	ТоварыИПроизводители.Производитель КАК Производитель,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК ЦенаРуб,
	|	ЕСТЬNULL(Цены.ДатаРегистрацииЦены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрацииЦены,
	|	ВЫБОР
	|		КОГДА Цены.Действует
	|			ТОГДА 1
	|		КОГДА НЕ Цены.Действует
	|			ТОГДА 0
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК Действует,
	|	ЕСТЬNULL(Цены.Производитель, ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)) КАК ПроизводительИзРеестра
	|ИЗ
	|	ТоварыИПроизводители КАК ТоварыИПроизводители
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП КАК Цены
	|		ПО (ТоварыИПроизводители.Ссылка = Цены.Номенклатура
	|					И ТоварыИПроизводители.Производитель = Цены.Производитель
	|				ИЛИ ТоварыИПроизводители.Ссылка = Цены.Номенклатура
	|					И ЕСТЬNULL(Цены.Производитель, ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Действует УБЫВ,
	|	ЦенаРуб");
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаТоваров);
	ВыборкаЖНВЛП = Запрос.Выполнить().Выгрузить();
	
	Возврат ВыборкаЖНВЛП;
	
КонецФункции

// Функция получения списка серий переданного документа
//
// Параметры:
//  ОбъектДокумент - ДанныеФормыСтруктура - содержит объект документа.
//
// Возвращаемое значение:
// СписокЗначений - список серий.
//
Функция ПолучитьСписокСерийДокумента(Знач ОбъектДокумент) Экспорт
	
	СписокСерий = Новый СписокЗначений;
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат СписокСерий;
	КонецЕсли;
	
	ТаблицаТоваров = ОбъектДокумент.Запасы.Выгрузить();
	
	СписокСерий.ЗагрузитьЗначения(ТаблицаТоваров.ВыгрузитьКолонку("Характеристика"));
	
	Возврат СписокСерий;
	
КонецФункции // ПолучитьСписокСерийДокумента()

// Функция получения флага налогооблажения НДС
//
// Параметры:
//  СистемаНалогообложения - <ПеречислениеСсылка.СистемыНалогообложения> - система налогооблажения.
//
// Возвращаемое значение:
// Булево. Истина - система налогооблажения является общей, иначе ложь.
//
Функция ПолучитьФлагНалогообложениеНДС(СистемаНалогообложения) Экспорт
	
	ФлагНалогообложениеНДС = СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	Возврат ФлагНалогообложениеНДС;
	
КонецФункции // ПолучитьФлагНалогообложениеНДС()

// Процедура добавляет индикацию ЖНВЛС в табличную часть Товары
//
Процедура ДобавитьИндикациюЖНВЛСВТаблицуТоваров(ЭтаФорма, ИмяТЧ="Запасы", ТЧОбъекта = Истина, Префикс="", ПрефиксФормы="", ГруппаРодитель = Неопределено) Экспорт
	
	Если ГруппаРодитель = Неопределено Тогда
		Родитель = ЭтаФорма.Элементы[ИмяТЧ];
	Иначе
		Родитель = ГруппаРодитель;
	КонецЕсли;
	
	// Создаем группу колонок для отображения индикации ЖНВЛС
	ГруппаКолонок = ЭтаФорма.Элементы.Добавить(ИмяТЧ + "ГруппаНоменклатура" + ПрефиксФормы + "ЖНВЛС", Тип("ГруппаФормы"), Родитель);
	ГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
	
	// Для группы колонок установим значение фиксации в таблице по значению в элементе номенклатуры.
	ПолеНоменклатуры = ЭтаФорма.Элементы.Найти(ИмяТЧ + "ГруппаНоменклатура" + ПрефиксФормы);
	Если ПолеНоменклатуры = Неопределено Тогда
		ПолеНоменклатуры = ЭтаФорма.Элементы[ИмяТЧ + "Номенклатура" + ПрефиксФормы];
	КонецЕсли;
	
	ГруппаКолонок.ФиксацияВТаблице = ПолеНоменклатуры.ФиксацияВТаблице;
	
	// Создаем поле картинки для отображения индикации ЖНВЛС
	ПолеЖНВЛС = ЭтаФорма.Элементы.Добавить(ИмяТЧ + "Номенклатура" + ПрефиксФормы + "ЖНВЛС", Тип("ПолеФормы"), ГруппаКолонок);
	ПолеЖНВЛС.Вид                = ВидПоляФормы.ПолеКартинки;
	ПолеЖНВЛС.ПутьКДанным        = ?(ТЧОбъекта, "Объект.", "") + ИмяТЧ + ".Номенклатура" + Префикс + ".ор_ЖНВЛС";
	ПолеЖНВЛС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеЖНВЛС.КартинкаЗначений   = БиблиотекаКартинок.ор_ЖНВЛП;
	ПолеЖНВЛС.РастягиватьПоГоризонтали = Ложь;
	ПолеЖНВЛС.АвтоМаксимальнаяШирина   = Ложь;
	ПолеЖНВЛС.Ширина = 2;
	
	// Перемещаем группу колонок перед номенклатурой
	ЭтаФорма.Элементы.Переместить(ГруппаКолонок, Родитель, ПолеНоменклатуры);
	
КонецПроцедуры

// Функция возвращает флаг серийного учета по характеристике
//
// Параметры
//  Владелец - <СправочникСсылка.Номенклатура>, <СправочникСсылка.КатегорииНоменклатуры> -
//             владелец характеристики, для которой проверяется ведение серийного учета.
//
// Возвращаемое значение:
// Булево. Истина - серийный учет по характеристикам ведется, иначе ложь.
//
Функция ПолучитьФлагСерийногоУчетаСервер(Владелец) Экспорт
	
	Если ТипЗнч(Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		КатегорияНоменклатуры = Владелец.КатегорияНоменклатуры;
	ИначеЕсли ТипЗнч(Владелец)=Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		КатегорияНоменклатуры = Владелец;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат КатегорияНоменклатуры.ор_ВестиСерийныйУчет;
	
КонецФункции // ПолучитьФлагСерийногоУчета()

#Область ВводПустыхСерийНоменклатуры

// Функция возращает булево значение необходимости заполнения характеристик в документе.
//
// Параметры:
//  Объект	 - <ДокументОбъект> - Объект документа, проверяемый на необходимость заполнение характеристик.
// 
// Возвращаемое значение:
// ХарактеристикиНеОбязательныВЗаказах - <Булево> - Необходимость заполение характеристик.
//
Функция ПолучитьЗначениеХарактеристикиНеОбязательныВЗаказах(Объект) Экспорт
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение")
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
		ХарактеристикиНеОбязательныВЗаказах = Объект.ор_ХарактеристикиНеОбязательныКЗаполнению;
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ХарактеристикиНеОбязательныВЗаказах = Не Документы.СчетНаОплату.ХарактеристикиОбязательныКЗаполнению(Объект);
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ХарактеристикиНеОбязательныВЗаказах = Не Документы.СчетНаОплатуПоставщика.ХарактеристикиОбязательныКЗаполнению(Объект);
	Иначе
		ХарактеристикиНеОбязательныВЗаказах = Ложь;
	КонецЕсли;
	
	Возврат ХарактеристикиНеОбязательныВЗаказах;
	
КонецФункции

// Процедура исправляет таблицы движения документов, которые были созданны на основании заказов.
//
// Параметры:
//  Таблица			 - <ТаблицаЗначений> - Таблица движения регистра.
//  ТипРегистра		 - <Строка> - Наименование регистра накопления.
//  СсылкаДокумента	 - <ДокументСсылка> - Ссылка на документ, из которого вызывается процедура.
//
Процедура ИсправитьДанныеТаблицыЗаказов(Таблица, ТипРегистра, СсылкаДокумента) Экспорт
	
	// Определим наличие возвратов в тч, так как в тч могут быть смешанно и приходы и возвраты (КорректировкаПоступления, КорректировкаРеализации,ОтчетОРозничныхПродажах).
	ТаблицаСВозвратами = Ложь;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Если СтрокаТаблицы.Количество < 0 Тогда
			ТаблицаСВозвратами = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Если ТаблицаСВозвратами Тогда
		Запрос.Текст = ПолучитьТекстИсправитьДанныеВозвратов();
	Иначе
		Запрос.Текст = ПолучитьТекстИсправитьДанныеТаблицыЗаказов();
	КонецЕсли;
	
	Если ТипРегистра = "ЗаказПокупателя"  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипРегистра%", "ЗаказыПокупателей");
	ИначеЕсли ТипРегистра = "ЗаказПоставщику" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипРегистра%", "ЗаказыПоставщикам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказПокупателя", "ЗаказПоставщику");
	ИначеЕсли ТипРегистра = "ЗаказНаПеремещение" Тогда
		ДобавитьПолеВЗапросЗаказов(Запрос.Текст, "ТипДвижения");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипРегистра%", "ЗаказыНаПеремещение");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказПокупателя", "ЗаказНаПеремещение");
	ИначеЕсли ТипРегистра = "РазмещениеЗаказов" Тогда
		ИзменитьЗапросДляРегистраРазмещениеЗаказов(Запрос.Текст);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ТипРегистра%", "РазмещениеЗаказов");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	Если Не ТаблицаСВозвратами Тогда
		Запрос.УстановитьПараметр("СсылкаДокумента", СсылкаДокумента);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДляКорректировки = РезультатЗапроса[3].Выгрузить();
	
	// Если количество = 0, тогда корректировать ничего не надо оставляем таблицу как есть.
	Если ТаблицаДляКорректировки.Количество() <> 0 Тогда
		
		Таблица = РезультатЗапроса[1].Выгрузить();
		
		Если ТаблицаСВозвратами Тогда
			ТаблицаЗаказов = РезультатЗапроса[4].Выгрузить();
		Иначе
			ТаблицаЗаказов = РезультатЗапроса[5].Выгрузить();
		КонецЕсли;
		
		ДополнительнаяТаблица = ТаблицаДляКорректировки.СкопироватьКолонки();
		
		ВыполнитьКорректировкуХарактеристик(Таблица, ТаблицаЗаказов, ДополнительнаяТаблица,ТаблицаДляКорректировки, ТипРегистра);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура корректирует таблицу движений с учетом возможных пустых характеристик.
//
Процедура ВыполнитьКорректировкуХарактеристик(Таблица, ТаблицаЗаказов, ДополнительнаяТаблица,ТаблицаДляКорректировки, ТипРегистра) 
	
	Для Каждого СтрокаТаблицыКорректировки Из ТаблицаДляКорректировки Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыКорректировки.Характеристика) Тогда
			
			ОтборСтрок = Новый Структура("Номенклатура, Характеристика",
								СтрокаТаблицыКорректировки.Номенклатура,
								СтрокаТаблицыКорректировки.Характеристика);
			
			Если ТипРегистра = "ЗаказНаПеремещение" Тогда
				ОтборСтрок.Вставить("Склад", СтрокаТаблицыКорректировки.Склад);
				ОтборСтрок.Вставить("ТипДвижения", СтрокаТаблицыКорректировки.ТипДвижения);
			КонецЕсли;
			
			ОпределитьТипОтбора(ОтборСтрок, СтрокаТаблицыКорректировки, ТипРегистра);
			
			НайденныеСтроки = ТаблицаЗаказов.НайтиСтроки(ОтборСтрок);
			
			Если НайденныеСтроки.Количество() <> 0 Тогда
				
				Для Каждого СтрокаЗаказа Из НайденныеСтроки Цикл
					
					Если СтрокаТаблицыКорректировки.Количество <= СтрокаЗаказа.КоличествоОстаток Тогда
						
						НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, СтрокаТаблицыКорректировки);
						
					ИначеЕсли СтрокаТаблицыКорректировки.Количество > СтрокаЗаказа.КоличествоОстаток Тогда
						
						НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, СтрокаТаблицыКорректировки);
						
						НоваяСтрокаИтоговойТаблицы.Количество = СтрокаЗаказа.КоличествоОстаток;
						
						НоваяСтрокаДопТаблицы = ДополнительнаяТаблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаДопТаблицы, СтрокаТаблицыКорректировки);
						НоваяСтрокаДопТаблицы.Количество = СтрокаТаблицыКорректировки.Количество - СтрокаЗаказа.КоличествоОстаток;
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				// Если ничего не нашли попробуем поискать только по номенклатуре
				НоваяСтрокаДопТаблицы = ДополнительнаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДопТаблицы, СтрокаТаблицыКорректировки);
				
			КонецЕсли;
			
		Иначе
			// Если характеристика не заполнена, то так её и добавляем в итоговую таблицу
			НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы,СтрокаТаблицыКорректировки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДополнительнаяТаблица.Количество() <> 0 Тогда
		СкорректироватьТаблицуДвижений(Таблица, ДополнительнаяТаблица, ТаблицаЗаказов, ТипРегистра);
	КонецЕсли;
	
КонецПроцедуры

Процедура СкорректироватьТаблицуДвижений(Таблица, ДополнительнаяТаблица, ТаблицаЗаказов, ТипРегистра);
	
	Для Каждого СтрокаДопТаблицы Из ДополнительнаяТаблица Цикл
		
		ОтборСтрок = Новый Структура("Номенклатура, Характеристика",
										СтрокаДопТаблицы.Номенклатура,
										Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		
		Если ТипРегистра = "ЗаказНаПеремещение" Тогда
			ОтборСтрок.Вставить("Склад", СтрокаДопТаблицы.Склад);
			ОтборСтрок.Вставить("ТипДвижения", СтрокаДопТаблицы.ТипДвижения);
		КонецЕсли;
		
		ОпределитьТипОтбора(ОтборСтрок, СтрокаДопТаблицы, ТипРегистра);
		
		НайденныеСтроки = ТаблицаЗаказов.НайтиСтроки(ОтборСтрок);
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			
			Для Каждого СтрокаЗаказа Из НайденныеСтроки Цикл
				
				Если СтрокаДопТаблицы.Количество = СтрокаЗаказа.КоличествоОстаток Тогда
					
					НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, СтрокаДопТаблицы);
					НоваяСтрокаИтоговойТаблицы.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					ТаблицаЗаказов.Удалить(СтрокаЗаказа);
					
				ИначеЕсли СтрокаДопТаблицы.Количество < СтрокаЗаказа.КоличествоОстаток Тогда
					
					НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, СтрокаДопТаблицы);
					НоваяСтрокаИтоговойТаблицы.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					
					СтрокаЗаказа.КоличествоОстаток = СтрокаЗаказа.КоличествоОстаток - СтрокаДопТаблицы.Количество;
					
				ИначеЕсли СтрокаДопТаблицы.Количество > СтрокаЗаказа.КоличествоОстаток Тогда
					
					НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, СтрокаДопТаблицы);
					
					НоваяСтрокаИтоговойТаблицы.Количество = СтрокаЗаказа.КоличествоОстаток;
					НоваяСтрокаИтоговойТаблицы.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					
					// Превысили по заказу, поэтому оставшееся добавляем как есть.
					НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, СтрокаДопТаблицы);
					НоваяСтрокаИтоговойТаблицы.Количество = СтрокаДопТаблицы.Количество - СтрокаЗаказа.КоличествоОстаток;
					
					ТаблицаЗаказов.Удалить(СтрокаЗаказа);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			// Если ничего не нашли то добавляем как есть, скорее всего превысили количество по заказу
			НоваяСтрокаИтоговойТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы,СтрокаДопТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сгруппируем всё что получилось.
	ЗапросДляГруппировки = Новый Запрос;
	ЗапросДляГруппировки.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказов.Количество КАК Количество,
	|	ТаблицаЗаказов.Инвертировать КАК Инвертировать
	|ПОМЕСТИТЬ ТаблицаЗаказов
	|ИЗ
	|	&Таблица КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Инвертировать
	|			ТОГДА -ТаблицаЗаказов.Количество
	|		ИНАЧЕ ТаблицаЗаказов.Количество
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ИнвертированнаяТаблицаИтогов
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ТаблицаЗаказов.Количество) КАК Количество
	|ИЗ
	|	ИнвертированнаяТаблицаИтогов КАК ТаблицаЗаказов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказов.ВидДвижения,
	|	ТаблицаЗаказов.НомерСтроки,
	|	ТаблицаЗаказов.Организация,
	|	ТаблицаЗаказов.Склад,
	|	ТаблицаЗаказов.ЗаказПокупателя,
	|	ТаблицаЗаказов.Характеристика,
	|	ТаблицаЗаказов.Номенклатура,
	|	ТаблицаЗаказов.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ТипРегистра = "ЗаказПоставщику" Тогда
		ЗапросДляГруппировки.Текст = СтрЗаменить(ЗапросДляГруппировки.Текст, "ЗаказПокупателя", "ЗаказПоставщику");
	ИначеЕсли ТипРегистра = "ЗаказНаПеремещение" Тогда
		ЗапросДляГруппировки.Текст = СтрЗаменить(ЗапросДляГруппировки.Текст, "ЗаказПокупателя", "ЗаказНаПеремещение");
		// Для регистра "ЗаказыНаПеремещение" необходимо поле "ТипДвижения".
		ЗапросДляГруппировки.Текст = СтрЗаменить(ЗапросДляГруппировки.Текст,
										"ВидДвижения,",
										"ВидДвижения,
										|ТаблицаЗаказов.ТипДвижения,");
	ИначеЕсли ТипРегистра = "РазмещениеЗаказов" Тогда
		ЗапросДляГруппировки.Текст = ПолучитьТекстЗапросаГруппировкиДляРазмещенийЗаказов();
	КонецЕсли;
	
	ЗапросДляГруппировки.УстановитьПараметр("Таблица", Таблица);
	
	РезультатЗапроса = ЗапросДляГруппировки.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить()
	
КонецПроцедуры
	
// Процедура добавляет отбор строк в зависимости от типа регистра.
//
Процедура ОпределитьТипОтбора(ОтборСтрок,Строка,ТипРегистра)
	
	Если ТипРегистра = "ЗаказПокупателя" Тогда
		ОтборСтрок.Вставить("ЗаказПокупателя"		, Строка.ЗаказПокупателя);
	ИначеЕсли ТипРегистра = "ЗаказПоставщику" Тогда
		ОтборСтрок.Вставить("ЗаказПоставщику"		, Строка.ЗаказПоставщику);
	ИначеЕсли ТипРегистра = "ЗаказНаПеремещение" Тогда
		ОтборСтрок.Вставить("ЗаказНаПеремещение"	, Строка.ЗаказНаПеремещение);
	ИначеЕсли ТипРегистра = "РазмещениеЗаказов" Тогда
		ОтборСтрок.Вставить("ЗаказПокупателя"		, Строка.ЗаказПокупателя);
		ОтборСтрок.Вставить("ИсточникОбеспечения"	, Строка.ИсточникОбеспечения);
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает текст запроса для группировки скорректированной таблицы движений региста.
//
Функция ПолучитьТекстЗапросаГруппировкиДляРазмещенийЗаказов();
	
	Возврат "ВЫБРАТЬ
	|	ТаблицаРазмещениеЗаказов.Период КАК Период,
	|	ТаблицаРазмещениеЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаРазмещениеЗаказов.Организация КАК Организация,
	|	ТаблицаРазмещениеЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмещениеЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаРазмещениеЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаРазмещениеЗаказов.ИсточникОбеспечения КАК ИсточникОбеспечения,
	|	ТаблицаРазмещениеЗаказов.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаРазмещениеЗаказов
	|ИЗ
	|	&Таблица КАК ТаблицаРазмещениеЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмещениеЗаказов.Период КАК Период,
	|	ТаблицаРазмещениеЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаРазмещениеЗаказов.Организация КАК Организация,
	|	ТаблицаРазмещениеЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмещениеЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаРазмещениеЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаРазмещениеЗаказов.ИсточникОбеспечения КАК ИсточникОбеспечения,
	|	СУММА(ТаблицаРазмещениеЗаказов.Количество) КАК Количество
	|ИЗ
	|	ТаблицаРазмещениеЗаказов КАК ТаблицаРазмещениеЗаказов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРазмещениеЗаказов.Период,
	|	ТаблицаРазмещениеЗаказов.ВидДвижения,
	|	ТаблицаРазмещениеЗаказов.Организация,
	|	ТаблицаРазмещениеЗаказов.Номенклатура,
	|	ТаблицаРазмещениеЗаказов.Характеристика,
	|	ТаблицаРазмещениеЗаказов.ЗаказПокупателя,
	|	ТаблицаРазмещениеЗаказов.ИсточникОбеспечения";
	
КонецФункции

// Функция возвращает текст запроса для корректировки таблицы движений, в которой присутсвует возвраты.
//
Функция ПолучитьТекстИсправитьДанныеВозвратов()
	
	Возврат "ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказов.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаЗаказов
	|ИЗ
	|	&Таблица КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказов.Количество КАК Количество,
	|	ЛОЖЬ КАК Инвертировать
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ГДЕ
	|	НЕ ТаблицаЗаказов.ЗаказПокупателя.ор_ХарактеристикиНеОбязательныКЗаполнению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Количество < 0
	|			ТОГДА -ТаблицаЗаказов.Количество
	|		ИНАЧЕ ТаблицаЗаказов.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Количество < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Инвертировать
	|ПОМЕСТИТЬ ТаблицаЗаказовДляКорректировки
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ГДЕ
	|	ТаблицаЗаказов.ЗаказПокупателя.ор_ХарактеристикиНеОбязательныКЗаполнению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказовДляКорректировки.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказовДляКорректировки.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказовДляКорректировки.Период КАК Период,
	|	ТаблицаЗаказовДляКорректировки.Склад КАК Склад,
	|	ТаблицаЗаказовДляКорректировки.Организация КАК Организация,
	|	ТаблицаЗаказовДляКорректировки.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказовДляКорректировки.Характеристика КАК Характеристика,
	|	ТаблицаЗаказовДляКорректировки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказовДляКорректировки.Количество КАК Количество,
	|	ТаблицаЗаказовДляКорректировки.Инвертировать КАК Инвертировать
	|ИЗ
	|	ТаблицаЗаказовДляКорректировки КАК ТаблицаЗаказовДляКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв КАК Склад,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК КоличествоОстаток,
	|	ЗаказПокупателяЗапасы.Ссылка КАК ЗаказПокупателя
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаЗаказовДляКорректировки.ЗаказПокупателя КАК ЗаказПокупателя
	|			ИЗ
	|				ТаблицаЗаказовДляКорректировки КАК ТаблицаЗаказовДляКорректировки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв,
	|	ЗаказПокупателяЗапасы.Ссылка";
	
КонецФункции

// Функция возвращает шаблон текста запроса таблицы заказов
//
Функция ПолучитьТекстИсправитьДанныеТаблицыЗаказов()
	
	Возврат "ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказов.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаЗаказов
	|ИЗ
	|	&Таблица КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказов.Количество КАК Количество,
	|	ЛОЖЬ КАК Инвертировать
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ГДЕ
	|	НЕ ТаблицаЗаказов.ЗаказПокупателя.ор_ХарактеристикиНеОбязательныКЗаполнению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказов.Период КАК Период,
	|	ТаблицаЗаказов.Склад КАК Склад,
	|	ТаблицаЗаказов.Организация КАК Организация,
	|	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказов.Характеристика КАК Характеристика,
	|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказов.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаЗаказовДляКорректировки
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ГДЕ
	|	ТаблицаЗаказов.ЗаказПокупателя.ор_ХарактеристикиНеОбязательныКЗаполнению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказовДляКорректировки.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаказовДляКорректировки.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗаказовДляКорректировки.Период КАК Период,
	|	ТаблицаЗаказовДляКорректировки.Склад КАК Склад,
	|	ТаблицаЗаказовДляКорректировки.Организация КАК Организация,
	|	ТаблицаЗаказовДляКорректировки.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказовДляКорректировки.Характеристика КАК Характеристика,
	|	ТаблицаЗаказовДляКорректировки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗаказовДляКорректировки.Количество КАК Количество,
	|	ЛОЖЬ КАК Инвертировать
	|ИЗ
	|	ТаблицаЗаказовДляКорректировки КАК ТаблицаЗаказовДляКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.Характеристика КАК Характеристика,
	|	ЗаказыПокупателейОстатки.Склад КАК Склад,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиЗаказов
	|ИЗ
	|	РегистрНакопления.%ТипРегистра%.Остатки(
	|			,
	|			ЗаказПокупателя В
	|				(ВЫБРАТЬ
	|					ТаблицаЗаказовДляКорректировки.ЗаказПокупателя КАК ЗаказПокупателя
	|				ИЗ
	|					ТаблицаЗаказовДляКорректировки КАК ТаблицаЗаказовДляКорректировки)) КАК ЗаказыПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыДокумента.ЗаказПокупателя,
	|	ЗаказыДокумента.Номенклатура,
	|	ЗаказыДокумента.Характеристика,
	|	ЗаказыДокумента.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ЗаказыДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ЗаказыДокумента.Количество
	|		ИНАЧЕ -ЗаказыДокумента.Количество
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.%ТипРегистра% КАК ЗаказыДокумента
	|ГДЕ
	|	ЗаказыДокумента.Регистратор = &СсылкаДокумента
	|	И ЗаказыДокумента.ЗаказПокупателя.ор_ХарактеристикиНеОбязательныКЗаполнению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ОстаткиЗаказов.Номенклатура КАК Номенклатура,
	|	ОстаткиЗаказов.Характеристика КАК Характеристика,
	|	ОстаткиЗаказов.Склад КАК Склад,
	|	СУММА(ОстаткиЗаказов.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	ОстаткиЗаказов КАК ОстаткиЗаказов
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЗаказов.ЗаказПокупателя,
	|	ОстаткиЗаказов.Склад,
	|	ОстаткиЗаказов.Номенклатура,
	|	ОстаткиЗаказов.Характеристика";
	
КонецФункции

// Процедура изменяет текст запроса для приведения полученных данных к струтуре регистра "РазмещениеЗаказов".
//
Процедура ИзменитьЗапросДляРегистраРазмещениеЗаказов(ТекстЗапроса)
	
	ДобавитьПолеВЗапросЗаказов(ТекстЗапроса, "ИсточникОбеспечения");
	УдалитьПолеИзЗапросаЗаказов(ТекстЗапроса, "Склад");
	УдалитьПолеИзЗапросаЗаказов(ТекстЗапроса, "НомерСтроки");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"ЗаказПокупателя.ор_ХарактеристикиНеОбязательныКЗаполнению",
									"ИсточникОбеспечения.ор_ХарактеристикиНеОбязательныКЗаполнению");
	
КонецПроцедуры

// Процедура добавляет поле в текст шаблон запроса.
//
Процедура ДобавитьПолеВЗапросЗаказов(ТекстЗапроса, НаименованиеПоля)
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,",
								СтрШаблон("ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
											|ТаблицаЗаказов.%1 КАК %1,", НаименованиеПоля));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ТаблицаЗаказовДляКорректировки.ЗаказПокупателя КАК ЗаказПокупателя,",
								СтрШаблон("ТаблицаЗаказовДляКорректировки.ЗаказПокупателя КАК ЗаказПокупателя,
											|ТаблицаЗаказовДляКорректировки.%1 КАК %1,", НаименованиеПоля));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,",
								СтрШаблон("ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
											|ЗаказыПокупателейОстатки.%1 КАК %1,", НаименованиеПоля));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ЗаказыДокумента.ЗаказПокупателя,",
								СтрШаблон("ЗаказыДокумента.ЗаказПокупателя,
											|ЗаказыДокумента.%1,", НаименованиеПоля));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ОстаткиЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,",
								СтрШаблон("ОстаткиЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
											|ОстаткиЗаказов.%1 КАК %1,", НаименованиеПоля));
								
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ОстаткиЗаказов.ЗаказПокупателя,",
								СтрШаблон("ОстаткиЗаказов.ЗаказПокупателя,
											|ОстаткиЗаказов.%1,", НаименованиеПоля));

КонецПроцедуры

// Процедура удаляет поле из текста шаблона запроса.
//
Процедура УдалитьПолеИзЗапросаЗаказов(ТекстЗапроса, НаименованиеПоля)
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ТаблицаЗаказов.%1 КАК %1,", НаименованиеПоля), "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ТаблицаЗаказовДляКорректировки.%1 КАК %1,", НаименованиеПоля), "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ЗаказыДокумента.%1 КАК %1,", НаименованиеПоля), "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ЗаказыПокупателейОстатки.%1 КАК %1,", НаименованиеПоля), "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ОстаткиЗаказов.%1 КАК %1,", НаименованиеПоля), "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ОстаткиЗаказов.%1,", НаименованиеПоля), "");
	
КонецПроцедуры

// Для получения остатков с пустыми характеристиками процедура изменяет текст запроса,
// который формирует таблицу движений по регистру РазмещениеЗаказов.
//
Процедура СкорректироватьТекстЗапросаТаблицыРазмещениеЗаказов(ТекстЗапроса, ДокументСсылка) Экспорт
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
						", Характеристика,", 
						",");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
								"И ТаблицаРазмещениеЗаказов.Характеристика = РазмещениеЗаказовОстатки.Характеристика", 
								"");
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"ТаблицаРазмещениеЗаказов.Номенклатура КАК Номенклатура,
				|						ТаблицаРазмещениеЗаказов.Характеристика КАК Характеристика,", 
									"ТаблицаРазмещениеЗаказов.Номенклатура КАК Номенклатура,");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"КОНЕЦ <> 0", 
									"КОНЕЦ <> 0
				|						СГРУППИРОВАТЬ ПО
				|							ТаблицаРазмещениеЗаказов.Период,
				|							ТаблицаРазмещениеЗаказов.Организация,
				|							ТаблицаРазмещениеЗаказов.ЗаказПокупателя,
				|							ТаблицаРазмещениеЗаказов.Номенклатура,
				|							ТаблицаРазмещениеЗаказов.Характеристика,
				|							ТаблицаРазмещениеЗаказов.ЗаказНаПеремещение,
				|							ВЫБОР
				|								КОГДА ТаблицаРазмещениеЗаказов.Количество > ЕСТЬNULL(РазмещениеЗаказовОстатки.Количество, 0)
				|									ТОГДА ЕСТЬNULL(РазмещениеЗаказовОстатки.Количество, 0)
				|								КОГДА ТаблицаРазмещениеЗаказов.Количество <= ЕСТЬNULL(РазмещениеЗаказовОстатки.Количество, 0)
				|									ТОГДА ТаблицаРазмещениеЗаказов.Количество
				|							КОНЕЦ");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"ТаблицаРазмещениеЗаказов.Номенклатура КАК Номенклатура,
	|								ТаблицаРазмещениеЗаказов.Характеристика КАК Характеристика,", 
									"ТаблицаРазмещениеЗаказов.Номенклатура КАК Номенклатура,");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"КОНЕЦ <> 0", 
									"КОНЕЦ <> 0
									|
									|СГРУППИРОВАТЬ ПО
									|	ТаблицаРазмещениеЗаказов.Заказ,
									|	ТаблицаРазмещениеЗаказов.Период,
									|	ТаблицаРазмещениеЗаказов.Характеристика,
									|	ВЫБОР
									|		КОГДА ТаблицаРазмещениеЗаказов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
									|			ТОГДА ИСТИНА
									|		ИНАЧЕ ЛОЖЬ
									|	КОНЕЦ,
									|	ТаблицаРазмещениеЗаказов.Номенклатура,
									|	РазмещениеЗаказовОстатки.ЗаказПокупателя,
									|	ТаблицаРазмещениеЗаказов.Организация,
									|	ВЫБОР
									|		КОГДА ТаблицаРазмещениеЗаказов.Количество > ЕСТЬNULL(РазмещениеЗаказовОстатки.Количество, 0)
									|			ТОГДА ЕСТЬNULL(РазмещениеЗаказовОстатки.Количество, 0)
									|		КОГДА ТаблицаРазмещениеЗаказов.Количество <= ЕСТЬNULL(РазмещениеЗаказовОстатки.Количество, 0)
									|			ТОГДА ТаблицаРазмещениеЗаказов.Количество
									|	КОНЕЦ");
										
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

// Процедура выполняет выполнение корректировки таблицы движений регистра РазмещениеЗаказов при необходимости.
//
// Параметры:
//  ДокументСсылка					 - <ДокументСсылка.ПриходнаяНакладная> - Ссылка на приходную накладную, из которой вызвана процедура.
//  СтруктураДополнительныеСвойства	 - <Структура> - Дополнительные свойства для проведения документа.
//
Процедура СкорректироватьТаблицуРазмещенияЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Если СтруктураДополнительныеСвойства.НеобходимоСкорректироватьХарактеристикиВДвижениях
		И СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРазмещениеЗаказов.Количество() <> 0 Тогда
		ИсправитьДанныеТаблицыЗаказов(СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРазмещениеЗаказов,
										"РазмещениеЗаказов",
										ДокументСсылка);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Функция - Проверка текущего остатка номенклатуры
//
// Параметры:
//  Номенклатура - <СправочникСсылка.Номенклатура> - 
//                 номенклатура, для которой проверяется остаток
//  Характеристика - <СправочникСсылка.ХарактеристикиНоменклатуры> - 
//                   характеристика текущей номенклатуры
//  Склад          - <СправочникСсылка.СтруктурныеЕдиницы> - 
//                   склад, на котором проверяется остаток
//  ЭтоЛекарственноеСредство - <Булево> - признак лекарственного средства
// 
// Возвращаемое значение:
//   Число - текущий остаток номенклатуры 
//
Функция ПроверкаТекущегоОстаткаНоменклатуры(Номенклатура, Характеристика, ЭтоЛекарственноеСредство, Склад) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОстаткиТоваров.Количество КАК КоличествоОстаток
	|ИЗ
	|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
	|ГДЕ
	|	ОстаткиТоваров.Номенклатура = &Номенклатура
	|	И ОстаткиТоваров.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	%ПроверятьХарактеристики%";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("Номенклатура",       Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",     Характеристика);
	
	Если Не ЭтоЛекарственноеСредство Тогда
		ПроверкаХарактеристики = "И Характеристика = &Характеристика";
	Иначе
		ПроверкаХарактеристики = "";
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПроверятьХарактеристики%", ПроверкаХарактеристики);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток ;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Процедура - Заполнить таблицу индикации серий по срокам годности
//
// Параметры:
//  ТаблицаИндикацииСерий	 - ТаблицаЗначений - Таблица индикации серий
//
Процедура ЗаполнитьТаблицуИндикацииСерийПоСрокамГодности(ТаблицаИндикацииСерий) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИндикацияСерийПоСрокамГодности.КоличествоДней КАК КоличествоДней,
	|	ИндикацияСерийПоСрокамГодности.Цвет КАК ЦветВРегистре
	|ИЗ
	|	РегистрСведений.ор_ИндикацияСерийПоСрокамГодности КАК ИндикацияСерийПоСрокамГодности
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоДней
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	мТаблицаИндикацииСерий = Запрос.Выполнить().Выгрузить();
	мТаблицаИндикацииСерий.Колонки.Добавить("ДатаС");
	мТаблицаИндикацииСерий.Колонки.Добавить("Дата");
	мТаблицаИндикацииСерий.Колонки.Добавить("Цвет");
	
	Для Каждого Строка Из мТаблицаИндикацииСерий Цикл
		Строка.Дата = НачалоДня(ТекущаяДатаСеанса() + Строка.КоличествоДней * 86400);
		Строка.Цвет = строка.ЦветВРегистре.Получить();
	КонецЦикла;
	
	мТаблицаИндикацииСерий.Колонки.Удалить("КоличествоДней");
	мТаблицаИндикацииСерий.Колонки.Удалить("ЦветВРегистре");
	мТаблицаИндикацииСерий.Сортировать("Дата Возр");
	
	Если мТаблицаИндикацииСерий.Количество() <> 0 Тогда
		Для Сч = 0 По мТаблицаИндикацииСерий.Количество() - 1 Цикл
			Если Сч = 0 Тогда
				мТаблицаИндикацииСерий[Сч].ДатаС =  Дата("00010101");
			ИначеЕсли Сч = мТаблицаИндикацииСерий.Количество() - 1 И Сч = 0 Тогда
				мТаблицаИндикацииСерий[Сч].ДатаС =  Дата("00010101");
			Иначе
				мТаблицаИндикацииСерий[Сч].ДатаС =  мТаблицаИндикацииСерий[Сч - 1].Дата;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	мТаблицаИндикацииСерий.Сортировать("ДатаС Возр");
	ТаблицаИндикацииСерий.Загрузить(мТаблицаИндикацииСерий);
	
КонецПроцедуры

#КонецОбласти

#Область ВводСерийПоПараметрам

// Функция выполняет поиск серий в базе данных по переданным параметрам
//
Функция НайтиСериюПоПараметрам(Номенклатура, СерияПроизводителя, СрокГодности) Экспорт 
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ИспользоватьХарактеристики", "ИспользоватьХарактеристики");
	СтруктураРеквизитов.Вставить("КатегорияНоменклатуры", "КатегорияНоменклатуры");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураРеквизитов);
	
	Если ЗначенияРеквизитов.ИспользоватьХарактеристики Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	(ХарактеристикиНоменклатуры.Владелец = &Номенклатура
		|	ИЛИ ХарактеристикиНоменклатуры.Владелец = &КатегорияНоменклатуры)
		|	И ХарактеристикиНоменклатуры.ор_СерияПроизводителя = &СерияПроизводителя
		|	И ХарактеристикиНоменклатуры.ор_СрокГодности = &СрокГодности";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("КатегорияНоменклатуры", ЗначенияРеквизитов.КатегорияНоменклатуры);
		Запрос.УстановитьПараметр("СерияПроизводителя", СерияПроизводителя);
		Запрос.УстановитьПараметр("СрокГодности", СрокГодности);
		
		Выборка =  Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
	Иначе
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Функция выполняет создание новой серии по переданным параметрам
//
Функция СоздатьСериюПоПараметрам(Номенклатура, СерияПроизводителя, СрокГодности, СоздаватьШК, ЗначениеШК, МаркируемыйТовар = Ложь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ИспользоватьХарактеристики", "ИспользоватьХарактеристики");
	СтруктураРеквизитов.Вставить("КатегорияНоменклатуры", "КатегорияНоменклатуры");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураРеквизитов);
	
	ВладелецХарактеристики = Неопределено;
	Если ЗначенияРеквизитов.ИспользоватьХарактеристики Тогда
		
		НоваяСерия = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НоваяСерия.УстановитьНовыйКод();
		НоваяСерия.Владелец              = Номенклатура;
		НоваяСерия.ор_СерияПроизводителя = СерияПроизводителя;
		НоваяСерия.ор_СрокГодности       = СрокГодности;
		НоваяСерия.Наименование          = ор_ОбщегоНазначенияКлиентСервер.СформироватьНаименованиеСерии(СерияПроизводителя, СрокГодности);
		НоваяСерия.НаименованиеДляПечати = НоваяСерия.Наименование;
		НоваяСерия.ор_МаркируемыйТовар   = МаркируемыйТовар;
		
		НоваяСерия.ОбменДанными.Загрузка = Истина;
		Попытка
			НоваяСерия.Записать();
		Исключение
			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецПопытки;
		НоваяСерия.ОбменДанными.Загрузка = Ложь;
		
		Если СоздаватьШК Тогда
			ЗначениеШК = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
		КонецЕсли;
		
		Если НЕ ЗначениеШК = "" Тогда
			ЗарегистрироватьШКСерии(ЗначениеШК, Номенклатура, НоваяСерия.Ссылка);
		КонецЕсли;
		
		Возврат НоваяСерия.Ссылка;
		
	Иначе
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Процедура выполняет регистрацию штрихкода для серии номенклатуры
//
Процедура ЗарегистрироватьШКСерии(ШтрихКод, Номенклатура, Серия)
	
	ТекЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	ТекЗапись.Номенклатура   = Номенклатура;
	ТекЗапись.Характеристика = Серия;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегШтрихкоды.Номенклатура КАК Номенклатура,
	|	РегШтрихкоды.ШтрихКод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК РегШтрихкоды
	|ГДЕ
	|	РегШтрихкоды.ШтрихКод = &ШтрихКод
	|");
	
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() ИЛИ Константы.ИспользоватьНеуникальныеШтрихкоды.Получить() Тогда
		ТекЗапись.Штрихкод = ШтрихКод;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ТекстОшибки = НСтр("ru= 'Штрихкод %1 уже имеет владельца <%2>. Установка штрихкода отменена'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.ШтрихКод, СокрЛП(Выборка.Номенклатура));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	Попытка
		ТекЗапись.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапуститьИнфоКиоск(Параметры)
	
	ЗапуститьИнфоКиоск = Ложь;
	
	Если Не ПолучитьФункциональнуюОпцию("ор_ИспользоватьИнформационныйКиоск")
		Или ОбщегоНазначения.ЭтоМобильныйКлиент()
		Или ОбщегоНазначения.ЭтоВебКлиент()
		Или Параметры.Свойство("ЗапуститьНовыйРМК") И Параметры.ЗапуститьНовыйРМК
		Или Параметры.Свойство("РежимКассыСамообслуживания") И Параметры.РежимКассыСамообслуживания Тогда
		Возврат ЗапуститьИнфоКиоск;
	КонецЕсли;
	
	ПолучитьТекущегоПользователя = Истина;
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Если ИнтернетПоддержкаПользователей.СеансЗапущенБезРазделителей() Тогда
			ПолучитьТекущегоПользователя = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	Если ПолучитьТекущегоПользователя Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ЕстьПрофиль   = УправлениеДоступомУНФ.ЕстьПрофильИнформационныйКиоск(ТекущийПользователь);
		ВключенЗапуск = ПерсональныеНастройкиРУНФ.Прочитать("ор_ЗапускатьИнформационныйКиоскПриСтартеСистемы");
		ЗапуститьИнфоКиоск = ВключенЗапуск И ЕстьПрофиль;
	КонецЕсли;
	
	Возврат ЗапуститьИнфоКиоск;
	
КонецФункции

Функция ВерсияФорматаЧислом(СтрокаВерсии)
	ВерсияФорматаЧислом = 0;
	
	РазрядыВерсии = СтрРазделить(СтрокаВерсии, ".");
	
	МножительРазряда = 10000;
	Для ИндексРазрядаОбратный = 0 По 1 Цикл
		ВерсияФорматаЧислом = ВерсияФорматаЧислом + Число(РазрядыВерсии[ИндексРазрядаОбратный])*МножительРазряда;
		МножительРазряда = МножительРазряда / 100;
	КонецЦикла;
	Возврат ВерсияФорматаЧислом;
КонецФункции

// Поиск забракованных товаров в табличной части
//
// Параметры:
//  ТабличнаяЧасть - ТабличнаяЧасть - табличная часть документа.
//
// Возвращаемое значение:
// ТаблицаЗначений. Таблица, хранящая найденные фальсификаты.
//
Функция НайтиФальсификатыВТабличнойЧастиСервер(ТабличнаяЧасть, ЭтоПересортица = Ложь)
	
	Результат = Новый ТаблицаЗначений;
	Если ТабличнаяЧасть.Количество() = 0 Тогда
		Возврат ТабличнаяЧасть;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВнешняяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВнешняяТаблица.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблица.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТабличнаяЧастьДокумента
	|ИЗ
	|	&ВнешняяТаблица КАК ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьДокумента.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧастьДокумента.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧастьДокумента.Характеристика КАК Характеристика,
	|	ХарактеристикиНоменклатуры.ор_СерияПроизводителя КАК НомерСерии
	|ИЗ
	|	ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ТабличнаяЧастьДокумента.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	ХарактеристикиНоменклатуры.ор_Фальсификат");
	
	Если ЭтоПересортица Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнешняяТаблица.Номенклатура",
			"ВнешняяТаблица.НоменклатураОприходование");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнешняяТаблица.Характеристика",
			"ВнешняяТаблица.ХарактеристикаОприходование");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВнешняяТаблица", ТабличнаяЧасть);
	
	Попытка
		Результат = Запрос.Выполнить().Выгрузить();
	Исключение
		Результат = Новый ТаблицаЗначений;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Поиск забракованных товаров в определенных документах
//
// Параметры:
//  ОбъектДокумент - ДокументОбъект - документ, в данных которого необходимо произвести поиск фальсификатов.
//
// Возвращаемое значение:
// Булево. Истина - поиск удачен, иначе ложь.
//
Функция НайтиФальсификаты(ОбъектДокумент)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазрешитьПроведениеДокументовСФальсификатами = Пользователи.РолиДоступны(
		"ор_ПравоРазрешитьПроведениеДокументовСФальсификатами");
	
	ТипОбъекта = ТипЗнч(ОбъектДокумент);
	Если НЕ ТипОбъекта = Тип("ДокументОбъект.ПриходнаяНакладная")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ПеремещениеЗапасов")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ЧекККМ")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.РасходнаяНакладная")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ОприходованиеЗапасов")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ПересортицаЗапасов")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыСеанса.ор_ОтключитьПроверкуФальсификатовИСроковГодностиПриОбновлении Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьФальсификатВШапке = Ложь;
	Если ТипОбъекта = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм") Тогда
		Если ОбъектДокумент.Характеристика.ор_Фальсификат Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Серия %1 лекарственной формы %2 является фальсификатом'"),
				ОбъектДокумент.Характеристика,
				ОбъектДокумент.Номенклатура);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОбъектДокумент);
			ЕстьФальсификатВШапке = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоПересортица = ТипОбъекта = Тип("ДокументОбъект.ПересортицаЗапасов");
	НайденныеФальсификаты = НайтиФальсификатыВТабличнойЧастиСервер(ОбъектДокумент.Запасы, ЭтоПересортица);
	ЕстьФальсификатыВПодарках = Ложь;
	Если ТипОбъекта = Тип("ДокументОбъект.ЧекККМ") Тогда
		НайденныеФальсификатыВПодарках = НайтиФальсификатыВТабличнойЧастиСервер(ОбъектДокумент.Подарки, Ложь);
		Если НайденныеФальсификатыВПодарках.Количество()<>0 Тогда
			ЕстьФальсификатыВПодарках = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НайденныеФальсификаты.Количество() = 0 И НЕ ЕстьФальсификатыВПодарках И Не ЕстьФальсификатВШапке Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'В списке товаров найдены фальсификаты:'");
	Для Каждого ТекСтрока Из НайденныеФальсификаты Цикл
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			|Строка №%2 <%3> серия: %4'"),
			ТекстСообщения,
			ТекСтрока.НомерСтроки,
			ТекСтрока.Номенклатура,
			ТекСтрока.Характеристика);
	КонецЦикла;
	
	Если НайденныеФальсификаты.Количество() <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОбъектДокумент);
	КонецЕсли;
	
	Если ЕстьФальсификатыВПодарках Тогда
		ТекстСообщения = НСтр("ru = 'В списке подарков найдены фальсификаты:'");
		Для Каждого ТекСтрока Из НайденныеФальсификатыВПодарках Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
				|Строка №%2 <%3> серия: %4'"),
				ТекстСообщения,
				ТекСтрока.НомерСтроки,
				ТекСтрока.Номенклатура,
				ТекСтрока.Характеристика);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОбъектДокумент);
	КонецЕсли;
	
	Если РазрешитьПроведениеДокументовСФальсификатами Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // НайтиФальсификатыСервер()

// Поиск просроченных товаров в определенных документах
//
// Параметры:
//  ОбъектДокумент - ДокументОбъект - документ, в данных которого необходимо произвести поиск просроченных товаров.
//
// Возвращаемое значение:
// Булево. Истина - поиск удачен, иначе ложь.
//
Функция НайтиПросроченныеСерии(ОбъектДокумент)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазрешитьЗаписьДокументов = Пользователи.РолиДоступны(
		"ор_ПравоРазрешитьЗаписьДокументовСодержащихМедикаментыСИстекшимСрокомГодности");
	
	ТипОбъекта = ТипЗнч(ОбъектДокумент);
	Если НЕ ТипОбъекта = Тип("ДокументОбъект.ЗаказПокупателя")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ЧекККМ")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ОприходованиеЗапасов")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ПриходнаяНакладная")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ПриходныйОрдер")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ПеремещениеЗапасов")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ПересортицаЗапасов")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.РасходнаяНакладная")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.РасходныйОрдер")
		И НЕ ТипОбъекта = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыСеанса.ор_ОтключитьПроверкуФальсификатовИСроковГодностиПриОбновлении Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьПросрочкаВШапке = Ложь;
	Если ТипОбъекта = Тип("ДокументОбъект.ор_ИзготовлениеЛекарственныхФорм") Тогда
		Если ор_ОбщегоНазначенияКлиентСервер.ПолучитьФлагСерийногоУчета(ОбъектДокумент.Номенклатура)
			И ЗначениеЗаполнено(ОбъектДокумент.Характеристика.ор_СрокГодности)
			И КонецДня(ОбъектДокумент.Характеристика.ор_СрокГодности) < ОбъектДокумент.Дата Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У серия %1 лекарственной формы %2 срок годности истек: %3'"),
				ОбъектДокумент.Характеристика,
				ОбъектДокумент.Номенклатура,
				ОбъектДокумент.Характеристика.ор_СрокГодности);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОбъектДокумент);
			ЕстьПросрочкаВШапке = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоПересортица = ТипОбъекта = Тип("ДокументОбъект.ПересортицаЗапасов");
	НайденнаяПросрочка = НайтиПросроченныеСерииВТабличнойЧастиСервер(ОбъектДокумент.Запасы, ОбъектДокумент.Дата, ЭтоПересортица);
	ЕстьПросрочкаВПодарках = Ложь;
	Если ТипОбъекта = Тип("ДокументОбъект.ЧекККМ") Тогда
		НайденнаяПросрочкаВПодарках = НайтиПросроченныеСерииВТабличнойЧастиСервер(ОбъектДокумент.Подарки, ОбъектДокумент.Дата);
		ЕстьПросрочкаВПодарках = НайденнаяПросрочкаВПодарках.Количество() <> 0;
	КонецЕсли;
	Если НайденнаяПросрочка.Количество() = 0 И НЕ ЕстьПросрочкаВПодарках И Не ЕстьПросрочкаВШапке Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'В списке товаров найдены просроченные серии:'");
	Для Каждого ТекСтрока Из НайденнаяПросрочка Цикл
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			|Строка №%2 <%3> серия: %4 срок годности: %5'"),
			ТекстСообщения,
			ТекСтрока.НомерСтроки,
			ТекСтрока.Номенклатура,
			ТекСтрока.Характеристика,
			ТекСтрока.СрокГодности);
	КонецЦикла;
	
	Если НайденнаяПросрочка.Количество() <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОбъектДокумент);
	КонецЕсли;
	
	Если ЕстьПросрочкаВПодарках Тогда
		ТекстСообщения = НСтр("ru = 'В списке подарков найдены просроченные серии:'");
		Для Каждого ТекСтрока Из НайденнаяПросрочкаВПодарках Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
				|Строка №%2 <%3> серия: %4 срок годности: %5'"),
				ТекстСообщения,
				ТекСтрока.НомерСтроки,
				ТекСтрока.Номенклатура,
				ТекСтрока.Характеристика,
				ТекСтрока.СрокГодности);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОбъектДокумент);
	КонецЕсли;
	
	Если Не РазрешитьЗаписьДокументов Тогда
		// Установим признак того, что при проведении, после проверок надо осуществить отказ,
		// т.к. не были пройдены проверки при записи.
		ОбъектДокумент.ДополнительныеСвойства.Вставить("УстановитьОтказПриПроведении");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Поиск просроченных товаров в табличной части
//
// Параметры:
//  ТабличнаяЧасть - ТабличнаяЧасть - табличная часть документа.
//
// Возвращаемое значение:
// ТаблицаЗначений. Таблица, хранящая найденные просроченные серии.
//
Функция НайтиПросроченныеСерииВТабличнойЧастиСервер(ТабличнаяЧасть, Дата, ЭтоПересортица = Ложь)
	
	Результат = Новый ТаблицаЗначений;
	Если ТабличнаяЧасть.Количество() = 0 Тогда
		Возврат ТабличнаяЧасть;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВнешняяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВнешняяТаблица.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблица.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТабличнаяЧастьДокумента
	|ИЗ
	|	&ВнешняяТаблица КАК ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьДокумента.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧастьДокумента.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧастьДокумента.Характеристика КАК Характеристика,
	|	СпрХарактеристики.ор_СерияПроизводителя КАК НомерСерии,
	|	СпрХарактеристики.ор_СрокГодности КАК СрокГодности
	|ИЗ
	|	ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристики
	|		ПО ТабличнаяЧастьДокумента.Характеристика = СпрХарактеристики.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабличнаяЧастьДокумента.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СпрНоменклатура.КатегорияНоменклатуры.ор_ВестиСерийныйУчет
	|	И СпрХарактеристики.ор_СрокГодности <> &ПустаяДата
	|	И СпрХарактеристики.ор_СрокГодности < &Дата");
	
	Если ЭтоПересортица Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнешняяТаблица.Номенклатура",
			"ВнешняяТаблица.НоменклатураОприходование");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнешняяТаблица.Характеристика",
			"ВнешняяТаблица.ХарактеристикаОприходование");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВнешняяТаблица", ТабличнаяЧасть);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("Дата", КонецДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса())));
	
	Попытка
		Результат = Запрос.Выполнить().Выгрузить();
	Исключение
		Результат = Новый ТаблицаЗначений;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция - Загрузить данные аналогов
//
// Параметры:
//  Параметры	 - Структура - структура таблиц
// 
// Возвращаемое значение:
//  Структура - структура таблиц
//
Функция ЗагрузитьДанныеАналогов(Параметры) Экспорт
	
	Обработки.ор_ЗагрузкаАналогов.ЗагрузитьАналогиИзФайлаИлиПолучитьСписокЛистов(Параметры);
	
	Если Параметры.ЭтоЗаполнениеСпискаЛистов Тогда
		Возврат Параметры.ВыбранныеЛисты;
	Иначе
		
		СтруктураВозврата = Новый Структура();
		СтруктураВозврата.Вставить("ТаблицаЗагрузки", 		Параметры.ТаблицаЗагрузки);
		СтруктураВозврата.Вставить("ДеревоДляОтображения",	Параметры.ДеревоДляОтображения);
		СтруктураВозврата.Вставить("СопоставленныеАналоги", Параметры.СопоставленныеАналоги);
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
