				
&НаСервере				
Функция СохранитьОтборВоВременноеХранилище()
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	НастройкиКомпоновки = ОтборКомпоновщикНастроек.ПолучитьНастройки(); 
	
	УстановитьПараметр(НастройкиКомпоновки, "Магазин",         Магазин);
	УстановитьПараметр(НастройкиКомпоновки, "Период",          Период);

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки1 	= КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки1);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТабЗнач = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТабЗнач);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ПроцессорВывода.ЗакончитьВывод(); 
	
	
	Возврат ПоместитьВоВременноеХранилище(ТабЗнач, АдресФормыВладельца);

КонецФункции
				
&НаКлиенте
Процедура ВыполнитьПодбор(Команда)
	
	АдресТаблицыРезультата = СохранитьОтборВоВременноеХранилище();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Результат = Новый Структура;
	Результат.Вставить("АдресТаблицыРезультата", АдресТаблицыРезультата);
	
	ОповеститьОВыборе(Результат); 

КонецПроцедуры

&НаСервере   
Процедура УстановитьПараметр(НастройкиКомпоновки, Рекв, Значение)

	ПараметрКомпоновки   = Новый ПараметрКомпоновкиДанных(Рекв);
	ПараметрСКД          = НастройкиКомпоновки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = Значение;
	ПараметрСКД.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементОтбора(Родитель, ИмяОтбора, ВидСравненияКомпоновки, Значение)
	
	ЭлементОтбора = Родитель.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновки;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Значение;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресФормыВладельца = Параметры.УникальныйИдентификатор;
	
	СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СКД");
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки , УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	ОтборКомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	НастройкиКомпоновки = ОтборКомпоновщикНастроек.ПолучитьНастройки(); 
	
	ОтборКомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
    Магазин = Параметры.Магазин;
    Период  = Параметры.Период;
	
КонецПроцедуры


