
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция, вызываемая перед началом работы системы.
//
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	Если ПараметрыРаботыКлиента.Свойство("ЗапуститьИнфоКиоск") И ПараметрыРаботыКлиента.ЗапуститьИнфоКиоск Тогда
		КлиентскоеПриложение.УстановитьРежимОсновногоОкна(РежимОсновногоОкнаКлиентскогоПриложения.Киоск);
		КлиентскоеПриложение.УстановитьОтображениеЗаголовкаОС(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Проверка необходимости сопоставления фальсификатов при поступлении.
//
// Параметры:
//  ОбъектДокумент	 - ДокументОбъект - документ, который необходимо проверить.
//  СписокСерий		 - СписокЗначений - серии которые необходимо сопоставить.
// 
// Возвращаемое значение:
//  Булево - необходимости сопоставления.
//
Функция НеобходимоСопоставитьФальсификаты(ОбъектДокумент, СписокСерий) Экспорт
	
	ТипОбъекта = ТипЗнч(ОбъектДокумент.Ссылка);
	// Для документов не являющихся документами поступления нет необходимости сопоставлять фальсификаты.
	Если НЕ (ТипОбъекта = Тип("ДокументСсылка.ПриходнаяНакладная") ИЛИ ТипОбъекта = Тип("ДокументСсылка.ОприходованиеЗапасов")) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Для проверенных документов нет необходимости повторно сопоставлять фальсификаты
	Если ОбъектДокумент.ор_ПроверенНаФальсификаты Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокСерий = ор_ОбщегоНазначенияСервер.ПолучитьСписокСерийДокумента(ОбъектДокумент);
	
	Возврат СписокСерий.Количество() = 0;
	
КонецФункции

#КонецОбласти
