
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("МассивТоваров") Тогда
		ТекстСообщения = НСтр("ru='Предусмотрено открытие формы только из документов.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Товары.Очистить();
	
	Для Каждого СтрокаМассива Из Параметры.МассивТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьGTIN(Команда)
	
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	РезультатПроверки = ПроверитьGTINПоРегиструШК();
	
	Если РезультатПроверки.Свойство("ТекстПредупреждения") Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаGTINЗавершение", ЭтотОбъект, РезультатПроверки);
		ПоказатьВопрос(ОписаниеОповещения, РезультатПроверки.ТекстПредупреждения, РежимДиалогаВопрос.ДаНет,,,НСтр("ru = 'Регистрация GTIN.'"));
		Возврат;
	КонецЕсли;
	
	РегистрацияGTINПродолжить(РезультатПроверки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаGTINЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РегистрацияGTINПродолжить(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияGTINПродолжить(РезультатПроверки)
	
	Если ЗарегистрироватьGTINНаСервере(РезультатПроверки) Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьGTINПоРегиструШК()
	
	РезультатПроверки = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.ДляХарактеристики КАК ДляХарактеристики,
	|	ТаблицаТовары.GTIN КАК GTIN,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК GTIN,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО втТовары.Номенклатура = Штрихкоды.Номенклатура
	|			И втТовары.Характеристика = Штрихкоды.Характеристика
	|			И втТовары.GTIN <> Штрихкоды.Штрихкод
	|			И (втТовары.ДляХарактеристики)
	|			И (Штрихкоды.Партия = &Партия)
	|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
	|
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика";
	
	Запрос.УстановитьПараметр("ТаблицаТовары"   , Товары.Выгрузить());
	Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	
	GtinДляУдаления = Новый Массив;
	ТекстПредупреждения = "";
	
	ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		
		ВыборкаПоХарактеристике = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоХарактеристике.Следующий() Цикл
			
			ПредставлениеТовара = ор_ИнтеграцияМДЛП.ПредставлениеНоменклатуры(ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоХарактеристике.Характеристика);
			
			ВыборкаПоGTIN = ВыборкаПоХарактеристике.Выбрать();
			
			GtinТекИтерация = Новый Массив;
			Пока ВыборкаПоGTIN.Следующий() Цикл
				Если НЕ ор_ИнтеграцияМДЛПКлиентСервер.ЭтоGTIN(ВыборкаПоGTIN.GTIN) Тогда
					Продолжить;
				КонецЕсли;
				СтруктураGTIN = Новый Структура("GTIN,Номенклатура,Характеристика");
				ЗаполнитьЗначенияСвойств(СтруктураGTIN, ВыборкаПоGTIN);
				GtinДляУдаления.Добавить(СтруктураGTIN);
				GtinТекИтерация.Добавить(ВыборкаПоGTIN.GTIN);
			КонецЦикла;
			
			Если GtinТекИтерация.Количество() = 1 Тогда
				ТекстПредупреждения = НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%""  уже существует запись с другим GTIN %GTIN%.'");
				ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%GTIN%", GtinТекИтерация[0]);
				ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%Товар%", ПредставлениеТовара);
			ИначеЕсли GtinТекИтерация.Количество() > 1 Тогда
				ТекстПредупреждения = НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%"" уже существуют записи с другими GTIN.'");
				ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%Товар%", ПредставлениеТовара);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если GtinДляУдаления.Количество() > 0 Тогда
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + НСтр("ru = 'Записи будут удалены. Продолжить?'");
		РезультатПроверки.Вставить("ТекстПредупреждения", ТекстПредупреждения);
		РезультатПроверки.Вставить("УдалитьСтарыеЗаписи", GtinДляУдаления);
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция ЗарегистрироватьGTINНаСервере(РезультатПроверки)
	
	ЕстьОшибки = Ложь;
	
	НачатьТранзакцию();
	
	Если РезультатПроверки.Свойство("УдалитьСтарыеЗаписи") Тогда
		GtinДляУдаления = РезультатПроверки.УдалитьСтарыеЗаписи;
		Для Каждого СтрокаGTIN Из GtinДляУдаления Цикл
			НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			НовыйШтрихкод.Штрихкод = СтрокаGTIN.GTIN;
			НовыйШтрихкод.Номенклатура = СтрокаGTIN.Номенклатура;
			НовыйШтрихкод.Характеристика = СтрокаGTIN.Характеристика;
			НовыйШтрихкод.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
			НовыйШтрихкод.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Попытка
				НовыйШтрихкод.Удалить();
			Исключение
				ОтменитьТранзакцию();
				ТекстСообщения = НСтр("ru= 'Не удалось удалить GTIN %GTIN% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", СтрокаGTIN.GTIN);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ЕстьОшибки = Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонеЦЕсли;
	
	Для Каждого Строка Из Товары Цикл
		НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		НовыйШтрихкод.Штрихкод = Строка.GTIN;
		НовыйШтрихкод.Номенклатура = Строка.Номенклатура;
		НовыйШтрихкод.Характеристика = ?(Строка.ДляХарактеристики, Строка.Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		НовыйШтрихкод.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		НовыйШтрихкод.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Попытка
			НовыйШтрихкод.Записать(Истина);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru= 'Не удалось записать GTIN %GTIN% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", Строка.GTIN);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонеЦЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

#КонецОбласти
