
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Параметры.Свойство("СтруктурныеЕдиницы") Тогда
		МассивМагазинов = ЭтотОбъект.Параметры.СтруктурныеЕдиницы.ВыгрузитьЗначения();
		СтруктурныеЕдиницы.ЗагрузитьЗначения(МассивМагазинов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МагазиныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.СтруктурныеЕдиницы.ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.СтруктурныеЕдиницы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Элементы.СтруктурныеЕдиницы.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти
