
Функция ВыполнитьДействие(Знач СтруктураПараметров) Экспорт 
		
	Запись = РегистрыСведений.эв_Инв_ДанныеСканирования.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураПараметров);
	Запись.Прочитать();	
	
	Если СтруктураПараметров.Действие = "Поиск" Тогда
		Если Запись.Выбран() Тогда  
			Возврат Истина;
		Иначе	   
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Запись.Выбран() И СтруктураПараметров.Действие = "Добавить" Тогда
		Запись.Количество = Запись.Количество + СтруктураПараметров.Количество;
	Иначе
		ЗаполнитьЗначенияСвойств(Запись, СтруктураПараметров);	
	КонецЕсли;	
	
	Сообщить(Запись.Количество);
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции	
