
#Область ПрограммныйИнтерфейс

#Область НастройкиРазрешительногоРежима

// Возвращает номер товарной группы Лекарственные средства числом
//
// Возвращаемое значение:
//  Число - номер товарной группы Лекарственные средства числом.
//
Функция НомерТоварнойГруппыЛекарственныеСредства() Экспорт
	
	Возврат 7;
	
КонецФункции

// Возвращает признак использования тестового контура ГИС МТ.
//
// Возвращаемое значение:
//  Булево - Истина, если включен тестовый контур.
//
Функция РежимРаботыСТестовымКонтуромГИСМТ() Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.РежимРаботыСТестовымКонтуромИСМП();
	
КонецФункции

// Возвращает сохраненные настройки разрешительного режима.
//
// Возвращаемое значение:
//  Результат - Структура - См. НастройкиРазрешительногоРежимаПоУмолчанию().
//
Функция НастройкиРазрешительногоРежима() Экспорт
	
	Возврат РазрешительныйРежимМДЛПКлиентСерверПовтИсп.НастройкиРазрешительногоРежима();
	
КонецФункции

// Возвращает настройки разрешительного режима по умолчанию.
//
// Возвращаемое значение:
//  Результат - Структура - Настройки:
//   * ВремяБлокировкиCDNПлощадок                                  - Число - время блокировки CDN-площадок, в минутах.
//   * ВремяОтветаCDNПлощадокПриПробитииЧека                       - Число - время ожидания ответа от CDN-площадок при пробитии чека, в секундах.
//   * ЧастотаОбновленияCDNПлощадок                                - Число - частота обновления, в часах.
//   * СрокДействияИдентификатораРазрешительногоРежима             - Число - срок действия идентификатора, в секундах.
//   * АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата - Дата  - универсальная дата.
//
Функция НастройкиРазрешительногоРежимаПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВремяБлокировкиCDNПлощадок",                                  15);     // в минутах
	Результат.Вставить("ВремяОтветаCDNПлощадокПриПробитииЧека",                       1.5);    // в секундах
	Результат.Вставить("ЧастотаОбновленияCDNПлощадок",                                6);      // в часах
	Результат.Вставить("СрокДействияИдентификатораРазрешительногоРежима",             300);    // в секундах
	Результат.Вставить("АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата", Дата(1, 1, 1));
	
	Возврат Результат;
	
КонецФункции

// Возвращает настройку времени блокировки CDN-площадок при их некорретных ответах,
// при работе с разрешительным режимом.
//
// Возвращаемое значение:
//  Число - время блокировки CDN-площадок, в минутах.
//
Функция ВремяБлокировкиCDNПлощадки() Экспорт
	
	Возврат РазрешительныйРежимМДЛПКлиентСерверПовтИсп.ВремяБлокировкиCDNПлощадки();
	
КонецФункции

// Возвращает настройку времени ожидания ответа от ГИС МТ при пробитии чека,
// при работе с разрешительным режимом.
//
// Возвращаемое значение:
//  Число - время ожидания ответа от CDN-площадок при пробитии чека, в секундах.
//
Функция ВремяОтветаCDNПлощадокПриПробитииЧека() Экспорт
	
	Возврат РазрешительныйРежимМДЛПКлиентСерверПовтИсп.ВремяОтветаCDNПлощадокПриПробитииЧека();
	
КонецФункции

// Возвращает настройку частоты актуализации и загрузки CDN-площадок
// для обращения к розничному методу продажи ГИС МТ.
//
// Возвращаемое значение:
//  Число - частота обновления, в часах.
//
Функция ЧастотаОбновленияCDNПлощадок() Экспорт
	
	Возврат РазрешительныйРежимМДЛПКлиентСерверПовтИсп.ЧастотаОбновленияCDNПлощадок();
	
КонецФункции

// Возвращает настройку времени действия идентификатора разрешительного режима при
// розничной продаже, после истечение времени идентификатор требуется обновить и переполучить.
//
// Возвращаемое значение:
//  Число - срок действия идентификатора, в секундах.
//
Функция СрокДействияИдентификатораНаПродажуРазрешительногоРежима() Экспорт
	
	Возврат РазрешительныйРежимМДЛПКлиентСерверПовтИсп.СрокДействияИдентификатораНаПродажуРазрешительногоРежима();
	
КонецФункции

// Возвращает признак действия аварийного режима при розничных продажах.
// Запросы разрешительного режима не выполняются, их результаты не контролируются.
//
// Возвращаемое значение:
//  Булево - Истина, если аварийный режим включен.
//
Функция ДействуетАварийныйРежимДляРозничныхПродаж() Экспорт
	
	ДатаДействияАварийногоРежима = РазрешительныйРежимМДЛПКлиентСерверПовтИсп.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата();
	
	Возврат ДатаДействияАварийногоРежима > ТранспортМДЛПАПИКлиентСервер.ПолучитьТекущуюУниверсальнуюДату();
	
КонецФункции

// Возвращает дату окончания действия токена авторизации ГИС МТ розница.
//
// Возвращаемое значение:
//  Дата - дата окончания действия токена авторизации ГИС МТ розница.
//
Функция ДатаДействияТокенаГИСМТРозница() Экспорт
	
	Возврат Дата(2099, 12, 31);
	
КонецФункции

// Возвращает дату начала действия разрешительного режима онлайн.
//
// Возвращаемое значение:
//  Дата - дата начала действия разрешительного режима онлайн.
//
Функция ДатаНачалаДействияОнлайнРазрешительногоРежимаДляЛекарств() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ПолучитьДатуНачалаРазрешительногоРежима();
	
КонецФункции

// Возвращает дату начала действия разрешительного режима офлайн (на локальном модуле ЧЗ).
//
// Возвращаемое значение:
//  Дата - дата начала действия разрешительного режима офлайн (на локальном модуле ЧЗ).
//
Функция ДатаНачалаДействияОфлайнРазрешительногоРежимаДляЛекарств() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ПолучитьДатуНачалаОфлайнРазрешительногоРежима();
	
КонецФункции

// Проверка, подлежит ли продукция обязательной онлайн-проверке перед розничной продажей.
//
// Возвращаемое значение:
//  Булево - продукция подлежит обязательной онлайн проверке перед розничной продажей.
//
Функция ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей() Экспорт
	
	ДатаРозницаРазрешительныйРежим = ДатаНачалаДействияОнлайнРазрешительногоРежимаДляЛекарств();
	
	Если Не ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДатаРозницаРазрешительныйРежим <= ТранспортМДЛПАПИКлиентСервер.ПолучитьТекущуюДатуСеанса();
	
КонецФункции

// Проверка, подлежит ли продукция обязательной офлайн (на локальном модуле ЧЗ) проверке перед розничной продажей.
//
// Возвращаемое значение:
//  Булево - Продукция подлежит обязательной онлайн проверке перед розничной продажей
//
Функция ПродукцияПодлежитОбязательнойОфлайнПроверкеПередРозничнойПродажей() Экспорт
	
	ДатаРозницаЛокальныйРазрешительныйРежим = ДатаНачалаДействияОфлайнРазрешительногоРежимаДляЛекарств();
	
	Возврат ДатаРозницаЛокальныйРазрешительныйРежим <= ТранспортМДЛПАПИКлиентСервер.ПолучитьТекущуюДатуСеанса();
	
КонецФункции

#КонецОбласти // НастройкиРазрешительногоРежима

#Область ПроверкаКодаМаркировки

// Возвращает параметры, необходимые для выполнения проверки КМ.
//
// Параметры:
// Возвращаемое значение:
//  См. ПараметрыПроверкиКМОнлайн().
//  См. ПараметрыПроверкиКМНаЛокальномМодуле().
//
Функция ПараметрыПроверкиКМНаКлиентеНаСервере() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, ПараметрыПроверкиКМОнлайн(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, ПараметрыПроверкиКМНаЛокальномМодуле(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПроверкиКМНаТСПИоТ(), Истина);
	
	// ор ++
	ВозвращаемоеЗначение.Вставить("ККТФФД12МДЛП", Неопределено);
	// ор --
	ВозвращаемоеЗначение.Вставить("РезультатПроверки", НовыйРезультатПроверкиКМНаКлиентеНаСервере());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает структуру элемента проверки КМ.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - описание элемента проверки КМ.
//   См. НовыйЭлементДанныхДляПроверкиОнлайн().
//   См. НовыйЭлементДанныхДляПроверкиНаЛокальномМодуле().
//
Функция НовыйЭлементДанныхДляПроверкиНаКлиентеНаСервере() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, НовыйЭлементДанныхДляПроверкиОнлайн(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, НовыйЭлементДанныхДляПроверкиНаЛокальномМодуле(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, ИнтеграцияТСПИоТМДЛПКлиентСервер.НовыйЭлементДанныхДляПроверкиНаТСПИоТ(), Истина);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата проверки КМ.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - описание элемента проверки КМ.
//   См. НовыйРезультатПроверкиКМОнлайн().
//   См. НовыйРезультатПроверкиКМНаЛокальномМодуле().
//
Функция НовыйРезультатПроверкиКМНаКлиентеНаСервере() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, НовыйРезультатПроверкиКМОнлайн(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, НовыйРезультатПроверкиКМНаЛокальномМодуле(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, ИнтеграцияТСПИоТМДЛПКлиентСервер.НовыйРезультатПроверкиКМНаТСПИоТ(), Истина);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата проверки конкретного кода маркировки.
//
//  ВозвращаемоеЗначение - Структура - описание элемента проверки КМ.
//   См. НовыйРезультатЭлементаПроверкиКМОнлайн().
//   См. НовыйРезультатЭлементаПроверкиКМНаЛокальномМодуле().
//
Функция НовыйРезультатЭлементаПроверкиКМНаКлиентеНаСервере() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, НовыйРезультатЭлементаПроверкиКМОнлайн(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, НовыйРезультатЭлементаПроверкиКМНаЛокальномМодуле(), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, ИнтеграцияТСПИоТМДЛПКлиентСервер.НовыйРезультатЭлементаПроверкиКМНаТСПИоТ(), Истина);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает результат онлайн и офлайн проверки КМ по умолчанию, для передачи на кассовое оборудование или в логи проверки КМ.
//
// Возвращаемое значение:
//  Структура - результат проверки:
//   * Заблокирован                                 - Булево - признак заблокированного кода маркировки.
//   * РазрешительныйРежимИдентификаторЗапросаГИСМТ - Строка - уникальный идентификатор квитанции.
//   * РазрешительныйРежимДатаЗапросаГИСМТ          - Строка - метка времени (универсальная UNIX дата) формирования запроса.
//   * РазрешительныйРежимАдресСервера              - Строка - адрес площадки онлайн проверки или адрес подключения локального модуля ЧЗ.
//   * РазрешительныйРежимТелоЗапросаJSON           - Строка - тело запроса проверки КМ.
//   * РазрешительныйРежимТелоОтветаJSON            - Строка - тело ответа проверки КМ.
//   * РазрешительныйРежимКодОтвета                 - Строка - код состояния.
//   * РазрешительныйРежимИдентификаторЭкземпляраПО - Строка - идентификатор экземпляра ПО локального модуля ЧЗ.
//   * РазрешительныйРежимВерсияБазыЧерногоСписка   - Строка - версии базы локального модуля ЧЗ, на которой осуществлялася проверка КМ.
//
Функция РезультатЭлементаПроверкиКМПоУмолчанию() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("Заблокирован"                                           , Ложь);
	
	// Общие результаты
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ"           , "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ"                    , "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимАдресСервера"                        , "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимТелоЗапросаJSON"                     , "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимТелоОтветаJSON"                      , "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимКодОтвета"                           , "");
	
	// Результаты локального модуля
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимИдентификаторЭкземпляраПО"           , "");
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимВерсияБазыЧерногоСписка"             , "");
	// ор ++
	ВозвращаемоеЗначение.Вставить("РазрешительныйРежимВерсияБазы", "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима", Новый Массив);
	ВозвращаемоеЗначение.Вставить("ПараметрыОшибки", Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаПоДаннымОффлайнРежима", Ложь);
	// ор --
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Подготавливает параметры выполнения проверки КМ по исходным параметрам.
//
// Параметры:
//  ПараметрыВыполненияПроверки - Структура - служебные параметры, необходимые для проверки КМ.
//  ПараметрыПроверкиКМ         - Структура - См. ПараметрыПроверкиКМНаКлиентеНаСервере().
//  ДополнительныеПараметры     - Структура - дополнительные параметры подготовки служебных параметров.
//
Процедура ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЭлементыПроверки            = ПараметрыПроверкиКМ.ДанныеДляПроверки;
	ПредыдущийРезультатПроверки = ПараметрыПроверкиКМ.РезультатПроверки;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМНаКлиентеНаСервере(), Истина);
	
	// Механизм заполнения параметров выполнения из входящих параметров.
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ,, "ДанныеДляПроверки, РезультатПроверки");
	
	ДействуетАварийныйРежим = ДействуетАварийныйРежимДляРозничныхПродаж();
	РазрешительныйРежимКодОтветаАварийныйРежим = АварийныйРежимКодОтветаСервисаГИСМТ();
	
	ПропуститьПолучениеИсходногоКодаМаркировки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПропуститьПолучениеИсходногоКодаМаркировки", Ложь);
	
	// Заполнение параметров элементов проверки
	Для Каждого ЭлементПроверки Из ЭлементыПроверки Цикл
		
		ПредыдущийРезультатЭлементаПроверки = ПредыдущийРезультатПроверки.ДанныеПроверки[ЭлементПроверки.ИдентификаторЭлемента];
		
		// Инициализация элемента коллекции результатов проверки.
		РезультатЭлементаПроверки = НовыйРезультатЭлементаПроверкиКМНаКлиентеНаСервере();
		
		РезультатЭлементаПроверки.ПолныйКодМаркировки = ЭлементПроверки.ПолныйКодМаркировки;
		
		Если Не ЗначениеЗаполнено(РезультатЭлементаПроверки.ПолныйКодМаркировки) Тогда
			РезультатЭлементаПроверки.ЕстьОшибки = Истина;
			РезультатЭлементаПроверки.ТребуетсяПолныйКодМаркировки = Истина;
		КонецЕсли;
		
		Если ДействуетАварийныйРежим Тогда
			РезультатЭлементаПроверки.РазрешительныйРежимКодОтвета = РазрешительныйРежимКодОтветаАварийныйРежим;
		КонецЕсли;
		
		Если ПроверитьАктуальностьРезультатовПроверкиКМ(ПредыдущийРезультатЭлементаПроверки) Тогда
			
			// Предыдущий результат не просрочен, еще действует.
			ЗаполнитьЗначенияСвойств(РезультатЭлементаПроверки, ПредыдущийРезультатЭлементаПроверки);
			
		// ор ++
		ИначеЕсли ПредыдущийРезультатЭлементаПроверки <> Неопределено
			И ПредыдущийРезультатЭлементаПроверки.ЕстьОшибки Тогда
			ЗаполнитьЗначенияСвойств(РезультатЭлементаПроверки, ПредыдущийРезультатЭлементаПроверки);
		// ор --
		КонецЕсли;
		
		СформироватьПредставлениеРезультатаЭлементаПроверки(РезультатЭлементаПроверки);
		
		ПараметрыВыполненияПроверки.РезультатПроверки.ДанныеПроверки.Вставить(ЭлементПроверки.ИдентификаторЭлемента, РезультатЭлементаПроверки);
		
		// Формирование коллеции элементов проверки.
		Если ЗначениеЗаполнено(РезультатЭлементаПроверки.ПолныйКодМаркировки)
			И Не ДействуетАварийныйРежим
			И Не РезультатЭлементаПроверки.ДанныеПроверкиКМПолучены Тогда
			
			Если Не ПропуститьПолучениеИсходногоКодаМаркировки Тогда
				
				// Пропустить получение исходного полного кода маркировки может потребоваться в случае, если параметры будут передаваться с клиента на сервер.
				// Символ GS не сериализуется.
				
				Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементПроверки, "ПолныйКодМаркировкиИсходный") Тогда
					ПолныйКодМаркировкиИсходный = ИнтеграцияМДЛПКлиентСервер.Base64ВШтрихкод(ЭлементПроверки.ПолныйКодМаркировки);
					ЭлементПроверки.Вставить("ПолныйКодМаркировкиИсходный", ПолныйКодМаркировкиИсходный);
				КонецЕсли;
				
				Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементПроверки, "СокращенныйКодМаркировки") Тогда
					ДанныеШтрихкода = ИнтеграцияМДЛПКлиентСервер.ДанныеШтрихкода(ЭлементПроверки.ПолныйКодМаркировкиИсходный);
					СокращенныйКодМаркировки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("01[GTIN]21[СерийныйНомерУпаковки]", ДанныеШтрихкода);
					ЭлементПроверки.Вставить("СокращенныйКодМаркировки", СокращенныйКодМаркировки);
				КонецЕсли;
				
			КонецЕсли;
			
			ПараметрыВыполненияПроверки.ДанныеДляПроверки.Добавить(ЭлементПроверки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДействуетАварийныйРежим Или Не ЗначениеЗаполнено(ПараметрыВыполненияПроверки.ДанныеДляПроверки) Тогда
		
		ПараметрыВыполненияПроверки.ВыполнятьПроверкуОнлайн  = Ложь;
		ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле = Ложь;
		ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ = Ложь;
		ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаВнутреннемТСПИоТ = Ложь;
		
	Иначе
		
		Если ИнтеграцияТСПИоТМДЛПКлиентСервер.ПродукцияПодлежитОбязательнойПроверкеНаТСПИоТПередРозничнойПродажей() Тогда
			// Обязательно выполняется проверка на ТС ПИоТ, не зависимо от того, какой параметр был установлен.
			ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ = Истина;
		КонецЕсли;
		
		Если ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей() Тогда
			// Обязательно выполняется онлайн проверка (если ТС ПИоТ не настроен), не зависимо от того, какой параметр был установлен.
			ПараметрыВыполненияПроверки.ВыполнятьПроверкуОнлайн = Истина;
		КонецЕсли;
		
		Если ПродукцияПодлежитОбязательнойОфлайнПроверкеПередРозничнойПродажей() Тогда
			// Обязательно выполняется офлайн проверка (если ТС ПИоТ не настроен или если онлайн проверка не будет выполнена), не зависимо от того, какой параметр был установлен.
			ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ
	 Или ПараметрыВыполненияПроверки.ВыполнятьПроверкуОнлайн
	 Или ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле Тогда
		
		Если Не ЗначениеЗаполнено(ПараметрыВыполненияПроверки.НомерФискальногоНакопителя) Тогда
			ПараметрыВыполненияПроверки.НомерФискальногоНакопителя = ПолучитьНомерФискальногоНакопителя(ПараметрыВыполненияПроверки);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПараметрыВыполненияПроверки.ККТФФД12МДЛП) Тогда
			ПараметрыВыполненияПроверки.ККТФФД12МДЛП = ПолучитьККТФФД12МДЛП(ПараметрыВыполненияПроверки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыВыполненияПроверки.НомерФискальногоНакопителя) Или ЗначениеЗаполнено(ПараметрыВыполненияПроверки.ККТФФД12МДЛП) Тогда
			
			НастройкиПодключенияЭкземпляраТСПИоТ = ИнтеграцияТСПИоТМДЛПКлиентСервер.НастройкиПодключенияЭкземпляраТСПИоТ(ПараметрыВыполненияПроверки.НомерФискальногоНакопителя, ПараметрыВыполненияПроверки.ККТФФД12МДЛП);
			// ор ++
			ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ = ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ
				И НастройкиПодключенияЭкземпляраТСПИоТ.Настроено;
			// ор --
			
			Если ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ Тогда
				// Если есть настройки внутреннего ТС ПИоТ, то используем внутренний ТС ПИоТ.
				ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаВнутреннемТСПИоТ = НастройкиПодключенияЭкземпляраТСПИоТ.НастройкиПодключения.ВнутреннийТСПИоТ;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Переносит результат выполнения запроса проверки КМ в итоговый результат проверки КМ.
//
// Параметры:
//  РезультатПроверки - Структура - итоговый результат проверки.
//  РезультатЗапроса  - Структура - результат выполнения запроса проверки КМ.
//
Процедура ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(РезультатПроверки, РезультатЗапроса) Экспорт
	
	ЗаполнитьЗначенияСвойств(РезультатПроверки, РезультатЗапроса); // Свойство ДанныеПроверки не перезаполняется.
	
	Если ЗначениеЗаполнено(РезультатПроверки.ТекстОшибки) Тогда
		РезультатПроверки.ЕстьОшибки = Истина;
		// ор ++
		Для Каждого КлючИЗначение Из РезультатПроверки.ДанныеПроверки Цикл
			РезультатЭлементаПроверки = КлючИЗначение.Значение;
			
			РезультатЭлементаПроверки.ЕстьОшибки = Истина;
			РезультатЭлементаПроверки.ТекстОшибки = РезультатПроверки.ТекстОшибки;
			РезультатЭлементаПроверки.ПредставлениеРезультата = РезультатПроверки.ТекстОшибки;
		КонецЦикла;
		// ор --
		Возврат;
	КонецЕсли;
	
	ДействуетАварийныйРежим = ДействуетАварийныйРежимДляРозничныхПродаж();
	РазрешительныйРежимКодОтветаАварийныйРежим = АварийныйРежимКодОтветаСервисаГИСМТ();
	
	Для Каждого КлючИЗначение Из РезультатПроверки.ДанныеПроверки Цикл
		
		ИдентификаторЭлемента     = КлючИЗначение.Ключ;
		РезультатЭлементаПроверки = КлючИЗначение.Значение;
		
		Если Не ЗначениеЗаполнено(РезультатЭлементаПроверки.ПолныйКодМаркировки) Тогда
			РезультатЭлементаПроверки.ЕстьОшибки = Истина;
			РезультатЭлементаПроверки.ТребуетсяПолныйКодМаркировки = Истина;
			СформироватьПредставлениеРезультатаЭлементаПроверки(РезультатЭлементаПроверки);
			Продолжить;
		КонецЕсли;
		
		Если ДействуетАварийныйРежим Тогда
			РезультатЭлементаПроверки.РазрешительныйРежимКодОтвета = РазрешительныйРежимКодОтветаАварийныйРежим;
			СформироватьПредставлениеРезультатаЭлементаПроверки(РезультатЭлементаПроверки);
			Продолжить;
		КонецЕсли;
		
		// Результаты контроля разрешительного режима.
		СтатусыКодаМаркировки = РезультатЗапроса.СтатусыКодовМаркировкиГИСМТ.Получить(ИдентификаторЭлемента);
		Если ЗначениеЗаполнено(СтатусыКодаМаркировки) Тогда
			Для Каждого СтатусИЗначение Из СтатусыКодаМаркировки Цикл
				Если ЗначениеЗаполнено(СтатусИЗначение.Значение) И РезультатЭлементаПроверки.Свойство(СтатусИЗначение.Ключ) Тогда
					РезультатЭлементаПроверки[СтатусИЗначение.Ключ] = СтатусИЗначение.Значение;
				КонецЕсли;
			КонецЦикла;
			РезультатЭлементаПроверки.ДанныеПроверкиКМПолучены = Истина;
		КонецЕсли;
		
		// Коды маркировки, по которым не были получены ответы ГИС МТ.
		ЭлементБезПроверки = РезультатЗапроса.КодыМаркировкиБезДанных.Получить(ИдентификаторЭлемента);
		Если ЭлементБезПроверки <> Неопределено Тогда
			РезультатЭлементаПроверки.ДанныеПроверкиКМПолучены = Ложь;
		КонецЕсли;
		
		// Ошибки кода маркировки контроля разрешительного режима.
		КонтролиРазрешительногоРежима = РезультатЗапроса.КонтролиРазрешительногоРежима.Получить(ИдентификаторЭлемента);
		Если ЗначениеЗаполнено(КонтролиРазрешительногоРежима) Тогда
			РезультатЭлементаПроверки.ЕстьОшибки  = Истина;
			РезультатЭлементаПроверки.ТекстОшибки = СтрСоединить(КонтролиРазрешительногоРежима, Символы.ПС);
			// ор ++
			РезультатЭлементаПроверки.КонтролиРазрешительногоРежима = КонтролиРазрешительногоРежима;
			// ор --
		КонецЕсли;
		
		СформироватьПредставлениеРезультатаЭлементаПроверки(РезультатЭлементаПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

#Область CDNПлощадки

// Возвращает параметры необходимые для выполнения проверки КМ онлайн.
//
// Возвращаемое значение:
//   УникальныйИдентификатор    - УникальныйИдентификатор - идентификатор формы объекта, в котором выполняется проверка,
//                                или новый уникальный идентификатор, к которому можно подключить длительную операцию.
//   Организация                - СправочникСсылка.ОрганизацииМДЛП - организация по которой выполняется проверка КМ.
//   НомерФискальногоНакопителя - Строка - заводской номер фискального накопителя, позволяющий идентифицировать конкретную кассу
//                                с аутентификационным токеном и в случае подозрительной активности заблокировать конкретную кассу,
//                                а не весь токен полностью (блокировка на стороне ГИС МТ).
//   ВыполнятьПроверкуОнлайн    - Булево - признак необходимости выполнения онлайн проверки.
//                                Выставляется по умолчанию по дате начела действия онлайн проверки разрешительного режима.
//   ДанныеДляПроверки          - Массив - данные для проверки КМ.
//                                См. НовыйЭлементДанныхДляПроверкиОнлайн().
//   РезультатПроверки          - Структура - результаты проверки КМ.
//                                См. НовыйРезультатПроверкиКМОнлайн().
//
Функция ПараметрыПроверкиКМОнлайн() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор"   , Неопределено);
	ВозвращаемоеЗначение.Вставить("Организация"               , ПредопределенноеЗначение("Справочник.ОрганизацииМДЛП.ПустаяСсылка"));
	ВозвращаемоеЗначение.Вставить("НомерФискальногоНакопителя", "");
	
	ВозвращаемоеЗначение.Вставить("ВыполнятьПроверкуОнлайн"   , ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей());
	
	ВозвращаемоеЗначение.Вставить("ДанныеДляПроверки"         , Новый Массив);
	
	ВозвращаемоеЗначение.Вставить("РезультатПроверки"         , НовыйРезультатПроверкиКМОнлайн());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает структуру элемента проверки КМ онлайн.
//
// Возвращаемое значение:
//  ПолныйКодМаркировки   - Строка - полный код маркировки в формате Base64.
//  ИдентификаторЭлемента - Строка - идентификатор по которому можно будет получить элемент проверки из общего результата проверки КМ.
//
Функция НовыйЭлементДанныхДляПроверкиОнлайн() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки"  , "");
	ВозвращаемоеЗначение.Вставить("ИдентификаторЭлемента", СокрЛП(Новый УникальныйИдентификатор));
	
	// ор ++
	ВозвращаемоеЗначение.Вставить("ПредставлениеНоменклатуры", "");
	// ор --
	Возврат ВозвращаемоеЗначение;
	
КонецФункции


// Возвращает описание результата проверки КМ онлайн.
//
// Возвращаемое значение:
//  ЕстьОшибки                     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//  ТекстОшибки                    - Строка - текст критических ошибок выполнения проверки КМ.
//  ТребуетсяОбновлениеКлючаСессии - Булево - признак необходимости обновления ключа сессии.
//  ОтсутствуютCDNПлощадки         - Булево - признак отсутсвия настроенных CDN-площадок.
//  ТребуетсяОбновлениеCDNПлощадок - Булево - признак необходимости обновления CDN-площадок.
//  ДанныеПроверки                 - Соответствие - коллекция результатов проверки кодов маркировки.
//   * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМОнлайн и НовыйЭлементДанныхДляПроверкиОнлайн).
//   * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию НовыйРезультатЭлементаПроверкиКМОнлайн).
//
Функция НовыйРезультатПроверкиКМОнлайн() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки" , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютCDNПлощадки", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеCDNПлощадок", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеПроверки", Новый Соответствие);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата онайлн проверки конкретного кода маркировки.
//
// Возвращаемое значение:
//  ЕстьОшибки                   - Булево - признак наличия ошибок проверки КМ.
//  ТекстОшибки                  - Строка - текст ошибки проверки КМ.
//  ПредставлениеРезультата      - Строка - представление результата проверки КМ (если ЕстьОшибки, то ТекстОшибки).
//  ПолныйКодМаркировки          - Строка - полный код маркировки в формате Base64.
//  ТребуетсяПолныйКодМаркировки - Булево - признак необходимости получения полного кода маркировки.
//  ДанныеПроверкиКМПолучены     - Булево - признак получения даннях проверки КМ (Ложь, если проверка не выполнена).
//  См. также РезультатЭлементаПроверкиКМПоУмолчанию().
//
Функция НовыйРезультатЭлементаПроверкиКМОнлайн() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки"             , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"            , "");
	ВозвращаемоеЗначение.Вставить("ПредставлениеРезультата", "");
	
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки"    , "");
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяПолныйКодМаркировки", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеПроверкиКМПолучены", Ложь);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, РезультатЭлементаПроверкиКМПоУмолчанию());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает результат проверки кодов маркировки онлайн.
//
// Параметры:
//  ПараметрыПроверкиКМ - Структура - См. ПараметрыПроверкиКМОнлайн.
//
// Возвращаемое значение:
//  РезультатПроверки - Структура - см. НовыйРезультатПроверкиКМОнлайн.
//
Функция ПроверитьКМОнлайн(ПараметрыПроверкиКМ) Экспорт
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ);
	
	РезультатПроверки = ПараметрыВыполненияПроверки.РезультатПроверки;
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуОнлайн Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатОнлайнЗапроса = ДанныеОнлайнПроверкиКМ(
		ПараметрыВыполненияПроверки.ДанныеДляПроверки,
		ПараметрыВыполненияПроверки.Организация,
		ПараметрыВыполненияПроверки.НомерФискальногоНакопителя);
	
	ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(РезультатПроверки, РезультатОнлайнЗапроса);
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти // CDNПлощадки

#Область ЛокальныйМодульЧЗ

// Возвращает параметры необходимые для выполнения проверки КМ офлайн (на локальном модуле ЧЗ).
//
// Возвращаемое значение:
//   УникальныйИдентификатор            - УникальныйИдентификатор - идентификатор формы объекта, в котором выполняется проверка,
//                                        или новый уникальный идентификатор, к которому можно подключить длительную операцию.
//   Организация                        - СправочникСсылка.ОрганизацииМДЛП - организация по которой выполняется проверка КМ.
//   НомерФискальногоНакопителя         - Строка - заводской номер фискального накопителя, позволяющий идентифицировать конкретную кассу
//                                        с аутентификационным токеном и в случае подозрительной активности заблокировать конкретную кассу,
//                                        а не весь токен полностью (блокировка на стороне ГИС МТ).
//   ВыполнятьПроверкуНаЛокальномМодуле - Булево - признак необходимости выполнения офлайн проверки (на локальном модуле ЧЗ).
//                                        Выставляется по умолчанию по дате начела действия офлайн проверки разрешительного режима.
//   РабочееМесто                       - СправочникСсылка.РабочиеМеста, Неопределено - рабочее место, подключенное к локальному модулю.
//                                        Неопределено - если локальный модуль используется на сервере.
//   ДанныеДляПроверки                  - Массив - данные для проверки КМ.
//                                        См. НовыйЭлементДанныхДляПроверкиНаЛокальномМодуле().
//   РезультатПроверки                  - Структура - результаты проверки КМ.
//                                        См. НовыйРезультатПроверкиКМНаЛокальномМодуле().
//
Функция ПараметрыПроверкиКМНаЛокальномМодуле() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор"   , Неопределено);
	ВозвращаемоеЗначение.Вставить("Организация"               , ПредопределенноеЗначение("Справочник.ОрганизацииМДЛП.ПустаяСсылка"));
	ВозвращаемоеЗначение.Вставить("НомерФискальногоНакопителя", "");
	
	ВозвращаемоеЗначение.Вставить("ВыполнятьПроверкуНаЛокальномМодуле", ПродукцияПодлежитОбязательнойОфлайнПроверкеПередРозничнойПродажей());
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ВозвращаемоеЗначение.Вставить("РабочееМесто", Неопределено);
	#Иначе
	ВозвращаемоеЗначение.Вставить("РабочееМесто", МенеджерОборудованияКлиент.РабочееМестоКлиента());
	#КонецЕсли
	
	ВозвращаемоеЗначение.Вставить("ДанныеДляПроверки"         , Новый Массив);
	
	ВозвращаемоеЗначение.Вставить("РезультатПроверки"         , НовыйРезультатПроверкиКМНаЛокальномМодуле());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает структуру элемента проверки КМ офлайн (на локальном модуле ЧЗ).
//
// Возвращаемое значение:
//  ПолныйКодМаркировки   - Строка - полный код маркировки в формате Base64.
//  ИдентификаторЭлемента - Строка - идентификатор по которому можно будет получить элемент проверки из общего результата проверки КМ.
//
Функция НовыйЭлементДанныхДляПроверкиНаЛокальномМодуле() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки"  , "");
	ВозвращаемоеЗначение.Вставить("ИдентификаторЭлемента", СокрЛП(Новый УникальныйИдентификатор));
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции


// Возвращает описание результата проверки КМ офлайн (на локальном модуле ЧЗ).
//
// Возвращаемое значение:
//  ЕстьОшибки                     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//  ТекстОшибки                    - Строка - текст критических ошибок выполнения проверки КМ.
//  ОтсутствуютУстановленныеЛМ     - Булево - признак отсутствия установленных локальных модулей ЧЗ.
//  НезавершеннаяНастройкаЛМ       - Булево - признак незавершенной настройки локального модуля ЧЗ.
//  НекорректныеДанныеАвторизации  - Булево - признак некорректных данных авторизации на локальном модуле ЧЗ.
//  ОтсутствиеСинхронизацииЛМ      - Булево - признак отсутствия синхронизации с локальным модулем ЧЗ.
//  ТребуетсяПроверкаНаКлиенте     - Булево - признак необходимости проверки КМ на клиенте.
//  ДанныеПроверки                 - Соответствие - коллекция результатов проверки кодов маркировки.
//   * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМНаЛокальномМодуле и НовыйЭлементДанныхДляПроверкиНаЛокальномМодуле).
//   * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию НовыйРезультатЭлементаПроверкиКМНаЛокальномМодуле).
//
Функция НовыйРезультатПроверкиКМНаЛокальномМодуле() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки" , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");
	
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМ", Ложь);
	ВозвращаемоеЗначение.Вставить("НезавершеннаяНастройкаЛМ", Ложь);
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизации", Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствиеСинхронизацииЛМ", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаКлиенте", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеПроверки", Новый Соответствие);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата офлайн проверки конкретного кода маркировки.
//
// Возвращаемое значение:
//  ЕстьОшибки                   - Булево - признак наличия ошибок проверки КМ.
//  ТекстОшибки                  - Строка - текст ошибки проверки КМ.
//  ПредставлениеРезультата      - Строка - представление результата проверки КМ (если ЕстьОшибки, то ТекстОшибки).
//  ПолныйКодМаркировки          - Строка - полный код маркировки в формате Base64.
//  ТребуетсяПолныйКодМаркировки - Булево - признак необходимости получения полного кода маркировки.
//  ДанныеПроверкиКМПолучены     - Булево - признак получения даннях проверки КМ (Ложь, если проверка не выполнена).
//  См. также РезультатЭлементаПроверкиКМПоУмолчанию()
//
Функция НовыйРезультатЭлементаПроверкиКМНаЛокальномМодуле() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки"             , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"            , "");
	ВозвращаемоеЗначение.Вставить("ПредставлениеРезультата", "");
	
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки"    , "");
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяПолныйКодМаркировки", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеПроверкиКМПолучены", Ложь);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, РезультатЭлементаПроверкиКМПоУмолчанию());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции


// Возвращает результат проверки кодов маркировки офлайн (на локальном модуле ЧЗ).
//
// Параметры:
//  ПараметрыПроверкиКМ - Структура - См. ПараметрыПроверкиКМНаЛокальномМодуле.
//
// Возвращаемое значение:
//  РезультатПроверки - Структура - см. НовыйРезультатПроверкиКМНаЛокальномМодуле.
//
Функция ПроверитьКМНаЛокальномМодуле(ПараметрыПроверкиКМ) Экспорт
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ);
	
	РезультатПроверки = ПараметрыВыполненияПроверки.РезультатПроверки;
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатОфлайнЗапроса = ДанныеЛокальногоМодуля(
		ПараметрыВыполненияПроверки.ДанныеДляПроверки,
		ПараметрыВыполненияПроверки.Организация,
		ПараметрыВыполненияПроверки.НомерФискальногоНакопителя,
		ПараметрыВыполненияПроверки.РабочееМесто);
	
	ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(РезультатПроверки, РезультатОфлайнЗапроса);
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти // ЛокальныйМодульЧЗ

#КонецОбласти // ПроверкаКодаМаркировки

#Область МетодыИнтерфейсаРазрешительногоРежима

#Область ПараметрыМетодовИнтерфейсаРазрешительногоРежима

// Возвращает параметры для отправки HTTP запросов ГИС МТ.
//
// Параметры:
//   ИспользоватьTrueAPI - Булево - Использовать true-api.
//   РазрешительныйРежим - Булево - Истина, если обращение к выделенному серверу для загрузки CDN-площадок и токена.
//
// Возвращаемое значение:
//  Структура - Описание:
//   * ПредставлениеСервиса - Строка - Представления сервиса.
//   * Адрес                - Строка - Адрес сервера.
//   * Порт                 - Число - Порт соединения.
//   * Таймаут              - Число - Таймаут соединения.
//   * ЗащищенноеСоединение - Булево - Признак использования SSL.
//
Функция ПараметрыОтправкиHTTPЗапросов(ИспользоватьTrueAPI = Ложь, РазрешительныйРежим = Ложь) Экспорт
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса", НСтр("ru = 'ГИС МТ'"));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Адрес"               , АдресСервера(ИспользоватьTrueAPI, РазрешительныйРежим));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт"                , 443);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут"             , 60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ЗащищенноеСоединение", Истина);
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

// Инициализировать структуру параметров запроса в ГИС МТ для получения ключа сессии розничной продажи.
//
// Параметры:
//  Организация - СправочникСсылка.ОрганизацииМДЛП - Организация.
//
// Возвращаемое значение:
//  Структура - Описание:
//   * Организация                         - СправочникСсылка.ОрганизацииМДЛП - организация, от имени которой необходимо авторизоваться.
//   * ИНН                                 - Строка     - ИНН организации.
//   * ПредставлениеСервиса                - Строка     - представление сервиса, например: ГИС МТ.
//   * Адрес                               - Строка     - адрес сервера, например: markirovka.crpt.ru.
//   * Порт                                - Число      - например: 443.
//   * Таймаут                             - Число      - таймаут, по умолчанию 60 секунд.
//   * ЗащищенноеСоединение                - Булево     - если Истина, то используется протокол HTTPS, иначе - HTTP.
//   * ВремяЖизни                          - Число      - время жизни токена по умолчанию у в секундах.
//   * ИмяПараметраКлючаСессии             - Строка     - имя соответствующего параметра ключа сессии.
//   * АдресЗапросаПараметровАвторизации   - Строка     - например: "api/v3/true-api/auth/key".
//   * АдресЗапросаКлючаСессии             - Строка     - например: "api/v3/true-api/auth/permissive-access".
//   * РазрешенаПодписьДоверенногоЛицаСМЧД - Булево     - Истина, если сообщение разрешено подписывать с МЧД.
//
Функция ПараметрыЗапросаКлючаСессииГИСМТРозница(Организация = Неопределено) Экспорт
	
	ПараметрыОтправкиHTTPЗапросов = ПараметрыОтправкиHTTPЗапросов(Истина);
	
	ПараметрыЗапроса = СтруктураПараметровЗапросаКлючаСессии();
	ПараметрыЗапроса.Организация = Организация;
	
	ПараметрыЗапроса.ПредставлениеСервиса             = ПараметрыОтправкиHTTPЗапросов.ПредставлениеСервиса;
	ПараметрыЗапроса.Адрес                            = ПараметрыОтправкиHTTPЗапросов.Адрес;
	ПараметрыЗапроса.Порт                             = ПараметрыОтправкиHTTPЗапросов.Порт;
	ПараметрыЗапроса.Таймаут                          = ПараметрыОтправкиHTTPЗапросов.Таймаут;
	ПараметрыЗапроса.ЗащищенноеСоединение             = ПараметрыОтправкиHTTPЗапросов.ЗащищенноеСоединение;
	
	ПараметрыЗапроса.ИмяПараметраКлючаСессии             = ИмяДанныхКлючаСессии(ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница"));
	ПараметрыЗапроса.АдресЗапросаПараметровАвторизации   = "api/v3/true-api/auth/key";
	ПараметрыЗапроса.АдресЗапросаКлючаСессии             = "api/v3/true-api/auth/permissive-access";
	ПараметрыЗапроса.РазрешенаПодписьДоверенногоЛицаСМЧД = Ложь;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Возвращает префикс версии программного интерфейса локального модуля.
//
// Параметры:
//  ФорматОбмена - ПеречислениеСсылка.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.
//
// Возвращаемое значение:
//  Строка - префикс версии программного интерфейса.
//
Функция ПрефиксВерсииИнтерфейсаЛокальногоМодулья(ФорматОбмена)
	
	Возврат СтрШаблон("api/v%1/", ПолучитьНомерВерсииФорматаОбменаЛокальногоМодуля(ФорматОбмена));
	
КонецФункции

// Возвращает номер версии формата обмена локального модуля.
//
// Параметры:
//  ФорматОбмена - ПеречислениеСсылка.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.
//
// Возвращаемое значение:
//  НомерВерсииЧислом - Число - номер версии.
//
Функция ПолучитьНомерВерсииФорматаОбменаЛокальногоМодуля(ФорматОбмена)
	
	Если ТипЗнч(ФорматОбмена) <> Тип("ПеречислениеСсылка.ВерсииФорматаОбменаЛокальногоМодуляМДЛП") Тогда
		ВызватьИсключение НСтр("ru = 'Неизвестный тип версии формата обмена локального модулья МДЛП.'");;
	КонецЕсли;
	
	НомерВерсии = 0;
	Пока Истина Цикл
		
		НомерВерсии = НомерВерсии + 1;
		
		ИмяПредопределенногоЗначения = СтрШаблон("Перечисление.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.V%1", НомерВерсии);
		
		Попытка
			Если ФорматОбмена = ПредопределенноеЗначение(ИмяПредопределенногоЗначения) Тогда
				Прервать;
			КонецЕсли;
		Исключение
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось получить номер формата обмена локального модуля МДЛП для значения ""%1""'"),
				ФорматОбмена);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат НомерВерсии;
	
КонецФункции

#КонецОбласти // ПараметрыМетодовИнтерфейсаРазрешительногоРежима

#Область ЛокальныйМодульЧЗ

// Конструктор параметров подключения локального модуля ЧЗ - адрес подключения, данные авторизации.
//
// Возвращаемое значение:
//  Структура - параметры подключения локального модуля ЧЗ:
// * Адрес                - Строка - адрес сервера.
// * ЗащищенноеСоединение - Булево - Истина, если используется протокол https://, и Ложь, если http://.
// * Порт                 - Число - порт службы отправки запросов. По умолчанию 5995.
// * Логин                - Строка - логин администратора, заданный при установке.
// * Пароль               - Строка - пароль администратора, заданный при установке.
//
Функция ПараметрыПодключенияЛокальногоМодуляЧЗ() Экспорт
	
	ПараметрыУстановки = Новый Структура;
	
	ПараметрыУстановки.Вставить("Адрес"               , "");
	ПараметрыУстановки.Вставить("Порт"                , 5995);
	ПараметрыУстановки.Вставить("Логин"               , "");
	ПараметрыУстановки.Вставить("Пароль"              , "");
	ПараметрыУстановки.Вставить("ЗащищенноеСоединение", Ложь);
	ПараметрыУстановки.Вставить("ФорматОбмена"        , ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.ПустаяСсылка"));
	
	Возврат ПараметрыУстановки;
	
КонецФункции

// Возвращает параметры для отправки HTTP запросов Локальному модулю ЧЗ
// по переданным настройкам подключения.
//
// Параметры:
//   ПараметрыУстановки - см. ПараметрыПодключенияЛокальногоМодуляЧЗ.
//
// Возвращаемое значение:
//  Структура - Описание:
//   * ПредставлениеСервиса - Строка - Представления сервиса.
//   * Адрес                - Строка - Адрес сервера.
//   * Порт                 - Число - Порт соединения.
//   * Таймаут              - Число - Таймаут соединения.
//   * ЗащищенноеСоединение - Булево - Признак использования SSL.
//
Функция ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки) Экспорт
	
	ПараметрыОтправкиHTTPЗапросов = ПараметрыОтправкиHTTPЗапросов();
	ПараметрыОтправкиHTTPЗапросов.ПредставлениеСервиса = НСтр("ru = 'ЛМ ЧЗ'");
	ПараметрыОтправкиHTTPЗапросов.Адрес                = ПараметрыУстановки.Адрес;
	ПараметрыОтправкиHTTPЗапросов.Порт                 = ПараметрыУстановки.Порт;
	ПараметрыОтправкиHTTPЗапросов.ЗащищенноеСоединение = ПараметрыУстановки.ЗащищенноеСоединение;
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции


// Инициализация конфигурации Локального модуля Честный знак. Выполняется для первичной установки и настройки.
//
// Параметры:
//  Организация        - СправочникСсылка.ОрганизацииМДЛП - Организация.
//  ПараметрыУстановки - Структура - см. ПараметрыПодключенияЛокальногоМодуляЧЗ
//  ИдентификаторФискальногоНакопителя - Строка - идентификатор фискального накопителя.
//
// Возвращаемое значение:
//  Структура - результат иницициализации:
//   * ТребуетсяОбновлениеКлючаСессииРозница - Булево - признак необходимости обновления ключа сессии.
//   * ОтказАвторизации                      - Булево - Истина, если переданы некорректные данные администратора ЛМ ЧЗ.
//   * ТекстОшибки                           - Строка - текст ошибки, полученной от ЛМ ЧЗ.
//
Функция ИнициализацияКонфигурацииЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, ИдентификаторФискальногоНакопителя = "") Экспорт
	
	КлючСессии = РазрешительныйРежимМДЛПВызовСервера.ПроверитьОбновитьКлючСессии(ПараметрыЗапросаКлючаСессииГИСМТРозница(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",                      Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = ПодготовитьДанныеЗапросаИнициализацииКонфигурацииЛокальногоМодуляЧЗ(КлючСессии, ПараметрыУстановки, ИдентификаторФискальногоНакопителя);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ОбработатьОтветИнициализацияКонфигурацииЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает подготовленные данные запроса инициализации конфигурации локального модуля ЧЗ.
//
Функция ПодготовитьДанныеЗапросаИнициализацииКонфигурацииЛокальногоМодуляЧЗ(КлючСессии, ПараметрыУстановки, ИдентификаторФискальногоНакопителя) Экспорт
	
	ПрефиксВерсии = ПрефиксВерсииИнтерфейсаЛокальногоМодулья(ПараметрыУстановки.ФорматОбмена);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	ДанныеЗапроса.АдресЗапроса = ПрефиксВерсии + "init";
	
	ДанныеЗапроса.ТелоЗапроса = Новый Структура;
	ДанныеЗапроса.ТелоЗапроса.Вставить("token", КлючСессии);
	
	ДанныеАвторизацииBase64 = ИнтеграцияМДЛПКлиентСервер.ШтрихкодВBase64(СтрШаблон("%1:%2", ПараметрыУстановки.Логин, ПараметрыУстановки.Пароль));
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Accept"        , "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Authorization" , СтрШаблон("Basic %1", ДанныеАвторизацииBase64));
	
	Если ЗначениеЗаполнено(ИдентификаторФискальногоНакопителя) Тогда
		ЗаголовкиHTTP.Вставить("X-ClientId", ИдентификаторФискальногоНакопителя);
	КонецЕсли;
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

// Обрабатывает ответ запроса инициализации конфигурации локального модуля ЧЗ.
//
Процедура ОбработатьОтветИнициализацияКонфигурацииЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, URLЗапроса) Экспорт
	
	Если РезультатОтправкиЗапроса.Статус = "Успешно" Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда
		
		// некорректный логин/пароль администратора
		ВозвращаемоеЗначение.ОтказАвторизации = Истина;
		
	ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
		
		ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
		
		Если ДанныеОтвета.Получить("errorCode") = 4015 Тогда
			
			// некорректный токен
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
			
		ИначеЕсли ДанныеОтвета.Получить("errorCode") = 6010 Тогда
			
			// не передан токен
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
			
		Иначе
			
			ТекстОшибки = ДанныеОтвета.Получить("reason");
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры


// Запрос статуса системы Локального модуля Честный знак. Выполняется для проверки актуального состояния.
//
// Параметры:
//  Организация        - СправочникСсылка.ОрганизацииМДЛП - Организация.
//  ПараметрыУстановки - Структура - см. ПараметрыПодключенияЛокальногоМодуляЧЗ.
//
// Возвращаемое значение:
//  Структура - результат иницициализации:
//   * ОтказАвторизации           - Булево - Истина, если переданы некорректные данные администратора ЛМ ЧЗ.
//   * ТекстОшибки                - Строка - текст ошибки, полученной от ЛМ ЧЗ.
//   * ВерсияСборки               - Строка - номер версии сборки ЛМ ЧЗ.
//   * Статус                     - Строка - статус текущего состояния системы - готова к работе, в процессе инициализации, ошибка синхронизации.
//   * ДатаПоследнейСинхронизации - Дата - дата последней синхронизации системы.
//   * ТребуетсяЗагрузка          - Булево - Истина, если требуется обновление токена.
//
Функция ЗапроситьСтатусЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ВерсияСборки",               "");
	ВозвращаемоеЗначение.Вставить("Статус",                     "");
	ВозвращаемоеЗначение.Вставить("ДатаПоследнейСинхронизации", Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("ТребуетсяЗагрузка",          Ложь);
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = ПодготовитьДанныеЗапросаСтатусаЛокальногоМодуляЧЗ(ПараметрыУстановки);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ОбработатьОтветЗапроситьСтатусЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает подготовленные данные запроса статуса локального модуля ЧЗ.
//
Функция ПодготовитьДанныеЗапросаСтатусаЛокальногоМодуляЧЗ(ПараметрыУстановки) Экспорт
	
	ПрефиксВерсии = ПрефиксВерсииИнтерфейсаЛокальногоМодулья(ПараметрыУстановки.ФорматОбмена);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("GET");
	ДанныеЗапроса.АдресЗапроса = ПрефиксВерсии + "status";
	
	ДанныеАвторизацииBase64 = ИнтеграцияМДЛПКлиентСервер.ШтрихкодВBase64(СтрШаблон("%1:%2", ПараметрыУстановки.Логин, ПараметрыУстановки.Пароль));
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Accept",         "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Authorization",  СтрШаблон("Basic %1", ДанныеАвторизацииBase64));
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

// Обрабатывает ответ запроса статуса локального модуля ЧЗ.
//
Процедура ОбработатьОтветЗапроситьСтатусЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, URLЗапроса) Экспорт
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
		
		Если РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда
			
			// некорректный логин/пароль администратора
			ВозвращаемоеЗначение.ОтказАвторизации = Истина;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
	
	Если ДанныеОтвета = Неопределено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
		Возврат;
	КонецЕсли;
	
	Значение = ДанныеОтвета.Получить("version");
	Если ЗначениеЗаполнено(Значение) Тогда
		ВозвращаемоеЗначение.ВерсияСборки = Значение;
	КонецЕсли;
	
	Значение = ДанныеОтвета.Получить("status");
	Если ЗначениеЗаполнено(Значение) Тогда
		ВозвращаемоеЗначение.Статус = Значение;
	КонецЕсли;
	
	Значение = ДанныеОтвета.Получить("requiresDownload");
	Если ЗначениеЗаполнено(Значение) Тогда
		ВозвращаемоеЗначение.ТребуетсяЗагрузка = Значение;
	КонецЕсли;
	
	Значение = ДанныеОтвета.Получить("lastSync");
	Если ЗначениеЗаполнено(Значение) Тогда
		ВозвращаемоеЗначение.ДатаПоследнейСинхронизации = ТранспортМДЛПКлиентСервер.ДатаИзСтрокиUNIX(Значение);
	КонецЕсли;
	
КонецПроцедуры


// Изменение пароля администратора системы Локального модуля Честный знак. Выполняется по желанию.
//
// Параметры:
//  Организация        - СправочникСсылка.ОрганизацииМДЛП - Организация.
//  ПараметрыУстановки - Структура - см. ПараметрыПодключенияЛокальногоМодуляЧЗ.
//  НовыйПароль - Строка - согласно API ЛМ ЧЗ должна отвечать следующим требованиям:
//    Пароль не может содержать пустую строку.
//    Длина пароля должна быть не менее 8 символов.
//    Пароль должен содержать буквы и цифры.
//
// Возвращаемое значение:
//  Структура - результат иницициализации:
//   * ОтказАвторизации           - Булево - Истина, если переданы некорректные данные администратора ЛМ ЧЗ.
//   * ТекстОшибки                - Строка - текст ошибки, полученной от ЛМ ЧЗ.
//   * ОшибкаПроверкиНовогоПароля - Булево - если передан пароль, не соответствующий заявленным параметрам.
//
Функция ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, НовыйПароль) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ОшибкаПроверкиНовогоПароля", Ложь);
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = ПодготовитьДанныеЗапросаИзмененияПароляАдминистратораЛокальногоМодуляЧЗ(ПараметрыУстановки, НовыйПароль);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ОбработатьОтветИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает подготовленные данные запроса изменения пароля администратора локального модуля ЧЗ.
//
Функция ПодготовитьДанныеЗапросаИзмененияПароляАдминистратораЛокальногоМодуляЧЗ(ПараметрыУстановки, НовыйПароль) Экспорт
	
	ПрефиксВерсии = ПрефиксВерсииИнтерфейсаЛокальногоМодулья(ПараметрыУстановки.ФорматОбмена);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("PUT");
	ДанныеЗапроса.АдресЗапроса = ПрефиксВерсии + "changePassword";
	
	ДанныеЗапроса.ТелоЗапроса = Новый Структура;
	ДанныеЗапроса.ТелоЗапроса.Вставить("newPassword", НовыйПароль);
	
	ДанныеАвторизацииBase64 = ИнтеграцияМДЛПКлиентСервер.ШтрихкодВBase64(СтрШаблон("%1:%2", ПараметрыУстановки.Логин, ПараметрыУстановки.Пароль));
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Accept",         "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Authorization",  СтрШаблон("Basic %1", ДанныеАвторизацииBase64));
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

// Обрабатывает ответ запроса изменения пароля администратора локального модуля ЧЗ.
//
Процедура ОбработатьОтветИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, URLЗапроса) Экспорт
	
	Если РезультатОтправкиЗапроса.Статус = "Успешно" Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда
		
		// некорректный логин/пароль администратора
		ВозвращаемоеЗначение.ОтказАвторизации = Истина;
		
	ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
		
		ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
		
		Если ДанныеОтвета.Получить("errorCode") = 6020 Тогда
			
			ВозвращаемоеЗначение.ОшибкаПроверкиНовогоПароля = Истина;
			
		Иначе
			
			ТекстОшибки = ДанныеОтвета.Получить("reason");
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры


// Зафиксировать факт продажи/возврата марок из списка в локальной базе Локального модуля Честный знак.
//
// Параметры:
//  МассивКодовИдентификации - Массив Из Строка - массив нормализованных кодов для записи в ЛМ ЧЗ.
//  Операция - Строка - признак пробития чека возврата или продажи.
//  НастройкиПодключенияЛокальногоМодуля - см. НастройкиПодключенияЛокальныхМодулейМДЛП.КонструкторПодключенияЛокальногоМодуляЧестныйЗнак.
// Возвращаемое значение:
//  Структура - Получить информацию по КМ от ККТ:
//  * ТекстОшибки - Строка - текст ошибки, полученной от ГИС МТ.
//                  Общий текст ошибки, ошибки запросов по всем кодам.
//  * НекорректныеДанныеАвторизации - Булево - Истина, если указаны некорректные логин/пароль подключения.
//  * НезавершеннаяНастройкаЛМ - Булево - Истина, если настройка подключения к ЛМ ЧЗ не завершена, возвращается код статуса не готовый к работе.
//  * ОтсутствиеСинхронизацииЛМ - Булево - Истина, если ЛМ возвращает статус отсутствия синхронизации более 72 часов.
//  * ПараметрыНастройкиЛМЧЗ - Неопределено, Структура из КлючИЗначение - структура для поиска настройки ЛМ ЧЗ.
// 
Функция ЗафиксироватьФактПродажиВозвратаКодовМаркировки(МассивКодовИдентификации, Операция, ПараметрыУстановки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатФиксацииПродажиВозврата", Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                     , "");
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизации"   , Ложь);
	ВозвращаемоеЗначение.Вставить("НезавершеннаяНастройкаЛМ"        , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствиеСинхронизацииЛМ"       , Ложь);
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	ПараметрыПодключения.Таймаут = ПараметрыУстановки.Таймаут;
	
	ДанныеЗапроса = ПодготовитьДанныеЗапросаФиксацииФактаПродажиВозвратаНаЛокальномМодулеЧЗ(МассивКодовИдентификации, Операция, ПараметрыУстановки);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ОбработатьОтветФиксацииФактаПродажиВозвратаНаЛокальномМодулеЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает подготовленные данные запроса фиксации факта продажи/возврата на локальном модуле ЧЗ.
//
Функция ПодготовитьДанныеЗапросаФиксацииФактаПродажиВозвратаНаЛокальномМодулеЧЗ(МассивКодовИдентификацииДляОтправки, Операция, ПараметрыУстановки) Экспорт
	
	ПрефиксВерсии = ПрефиксВерсииИнтерфейсаЛокальногоМодулья(ПараметрыУстановки.ФорматОбмена);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	
	Если Операция = ОперацииПриРаботеСКодамиМаркировки().Продажа Тогда
		ДанныеЗапроса.АдресЗапроса = ПрефиксВерсии + "cis/sell";
	Иначе
		ДанныеЗапроса.АдресЗапроса = ПрефиксВерсии + "cis/return";
	КонецЕсли;
	
	ДанныеЗапроса.ТелоЗапроса = Новый Структура;
	ДанныеЗапроса.ТелоЗапроса.Вставить("cis_list", МассивКодовИдентификацииДляОтправки);
	
	ДанныеАвторизацииBase64 = ИнтеграцияМДЛПКлиентСервер.ШтрихкодВBase64(СтрШаблон("%1:%2", ПараметрыУстановки.Логин, ПараметрыУстановки.Пароль));
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Accept"        , "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Authorization" , СтрШаблон("Basic %1", ДанныеАвторизацииBase64));
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

// Обрабатывает ответ запроса запроса фиксации факта продажи/возврата на локальном модуле ЧЗ.
//
Процедура ОбработатьОтветФиксацииФактаПродажиВозвратаНаЛокальномМодулеЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, URLЗапроса) Экспорт
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
		
		Если Не ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния) Тогда
			
			// Не получен ответ при инициализации, таймаут или иные проблемы.
			ДополнениеТекстаОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
			
		ИначеЕсли РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда // РезультатОтправкиЗапроса.КодСостояния = 401
			
			ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = Истина;
			
			// Некорректный логин/пароль администратора.
			ДополнениеТекстаОшибки = НСтр("ru = 'Некорректные данные авторизации в настройке Локального модуля Честный знак.'");
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			// код ошибки 4045 - не инициализировано, или в статусе инициализации
			// код ошибки 4050 - ошибка синхронизации
			ДополнениеТекстаОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
			
		Иначе
			
			ДополнениеТекстаОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
	
	Если ДанныеОтвета = Неопределено Тогда
		ДополнениеТекстаОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеОтветаЛокальногоМодуля = ДанныеОтвета.Получить("results");
	
	Если ТипЗнч(ДанныеОтветаЛокальногоМодуля) <> Тип("Массив") Или ДанныеОтветаЛокальногоМодуля.Количество() = 0 Тогда
		ДополнениеТекстаОшибки = НСтр("ru = 'Некорректный формат ответа от Локального модуля Честный знак.'");
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеФиксацииКода Из ДанныеОтветаЛокальногоМодуля Цикл
		
		КИЗ               = ДанныеФиксацииКода.Получить("cis");
		РезультатФиксации = ДанныеФиксацииКода.Получить("success");
		
		ВозвращаемоеЗначение.РезультатФиксацииПродажиВозврата.Вставить(КИЗ, РезультатФиксации);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЛокальныйМодульЧЗ

#КонецОбласти // МетодыИнтерфейсаРазрешительногоРежима

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаКодаМаркировки

// Возвращает код ответа, зафиксированный ГИС МТ как код ответа, означающий наступление аварийного режима.
//
// Возвращаемое значение:
//  Число - Код ответа аварийного режима.
//
Функция АварийныйРежимКодОтветаСервисаГИСМТ() Экспорт
	
	Возврат 203;
	
КонецФункции

Функция ПроверитьАктуальностьРезультатовПроверкиКМ(РезультатЭлементаПроверки)
	
	Если Не ЗначениеЗаполнено(РезультатЭлементаПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазрешительныйРежимДатаЗапросаГИСМТ          = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЭлементаПроверки, "РазрешительныйРежимДатаЗапросаГИСМТ");
	РазрешительныйРежимИдентификаторЗапросаГИСМТ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЭлементаПроверки, "РазрешительныйРежимИдентификаторЗапросаГИСМТ");
	
	Если Не ЗначениеЗаполнено(РазрешительныйРежимДатаЗапросаГИСМТ) Или Не ЗначениеЗаполнено(РазрешительныйРежимИдентификаторЗапросаГИСМТ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаПолученияИдентификатораРазрешительногоРежима = ТранспортМДЛПКлиентСервер.ДатаИзСтрокиUNIX(РазрешительныйРежимДатаЗапросаГИСМТ);
	Если ДатаПолученияИдентификатораРазрешительногоРежима < ТекущаяДата() - СрокДействияИдентификатораНаПродажуРазрешительногоРежима() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Идентификатор не просрочен, еще действует.
	Возврат Истина;
	
КонецФункции

Процедура СформироватьПредставлениеРезультатаЭлементаПроверки(РезультатЭлементаПроверки)
	
	РазрешительныйРежимКодОтветаАварийныйРежим = АварийныйРежимКодОтветаСервисаГИСМТ();
	
	Если РезультатЭлементаПроверки.ЕстьОшибки Тогда
		
		Если Не ЗначениеЗаполнено(РезультатЭлементаПроверки.ТекстОшибки) Тогда
			Если РезультатЭлементаПроверки.ТребуетсяПолныйКодМаркировки Тогда
				РезультатЭлементаПроверки.ТекстОшибки = НСтр("ru = 'Отсутствует полный код маркировки.'");
			Иначе
				РезультатЭлементаПроверки.ТекстОшибки = НСтр("ru = 'Неизвестная ошибка.'");
			КонецЕсли;
		КонецЕсли;
		
		РезультатЭлементаПроверки.ПредставлениеРезультата = РезультатЭлементаПроверки.ТекстОшибки;
		
	ИначеЕсли РезультатЭлементаПроверки.РазрешительныйРежимКодОтвета = РазрешительныйРежимКодОтветаАварийныйРежим Тогда
		
		РезультатЭлементаПроверки.ПредставлениеРезультата = НСтр("ru = 'Аварийный режим разрешительного режима.'");
		
	ИначеЕсли Не РезультатЭлементаПроверки.ДанныеПроверкиКМПолучены Тогда
		
		РезультатЭлементаПроверки.ПредставлениеРезультата = НСтр("ru = 'Не получены данные разрешительного режима.'");
		
	ИначеЕсли РезультатЭлементаПроверки.ДанныеПроверкиКМПолучены Тогда
		
		РезультатЭлементаПроверки.ПредставлениеРезультата = НСтр("ru = 'Данные разрешительного режима получены.'");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНомерФискальногоНакопителя(ПараметрыВыполненияПроверки)
	
	ККТФФД12МДЛП = ПолучитьККТФФД12МДЛП(ПараметрыВыполненияПроверки);
	Если ККТФФД12МДЛП = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.ПолучитьНомерФискальногоНакопителяУстройства(ККТФФД12МДЛП);
	
КонецФункции

Функция ПолучитьККТФФД12МДЛП(ПараметрыВыполненияПроверки)
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		Если Не ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
			Возврат Неопределено;
		КонецЕсли;
		// ор ++
		Если ПараметрыВыполненияПроверки.Свойство("ККТФФД12МДЛП") И ЗначениеЗаполнено(ПараметрыВыполненияПроверки.ККТФФД12МДЛП) Тогда
			ККТФФД12МДЛП = ПараметрыВыполненияПроверки.ККТФФД12МДЛП;
			Возврат РазрешительныйРежимМДЛПВызовСервера.ПолучитьНомерФискальногоНакопителяУстройства(ККТФФД12МДЛП);
		КонецЕсли;
		// ор --
		
		Возврат КонтрольКодовМаркировкиМДЛПВызовСервера.ПолучитьККТФФД12ПоОрганизацииМДЛП(ПараметрыВыполненияПроверки.Организация);
		
	#Иначе
		
		Если Не ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
			Возврат Неопределено;
		КонецЕсли;
		// ор ++
		Если ПараметрыВыполненияПроверки.Свойство("ККТФФД12МДЛП") И ЗначениеЗаполнено(ПараметрыВыполненияПроверки.ККТФФД12МДЛП) Тогда
			ККТФФД12МДЛП = ПараметрыВыполненияПроверки.ККТФФД12МДЛП;
			Возврат РазрешительныйРежимМДЛПВызовСервера.ПолучитьНомерФискальногоНакопителяУстройства(ККТФФД12МДЛП);
		КонецЕсли;
		// ор --
		
		ПараметрыПолученияККТФФД12МДЛП = КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.ПараметрыПолученияККТФФД12МДЛП(Неопределено);
		ЗаполнитьЗначенияСвойств(ПараметрыПолученияККТФФД12МДЛП, ПараметрыВыполненияПроверки);
		
		Возврат КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.ПолучитьККТФФД12МДЛП(ПараметрыПолученияККТФФД12МДЛП);
		
	#КонецЕсли
	
КонецФункции

Функция ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиГИСМТ(КодОшибки, ОписаниеОшибкиГИСМТ = Неопределено) Экспорт
	
	ТекстОшибки = "";
	
	Если КодОшибки = 1 Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка валидации КМ в ГИС МТ.'");
	ИначеЕсли КодОшибки = 2 Тогда
		ТекстОшибки = НСтр("ru = 'КМ не содержит GTIN.'");
	ИначеЕсли КодОшибки = 3 Тогда
		ТекстОшибки = НСтр("ru = 'КМ не содержит серийный номер.'");
	ИначеЕсли КодОшибки = 4 Тогда
		ТекстОшибки = НСтр("ru = 'КМ содержит недопустимые символы.'");
	ИначеЕсли КодОшибки = 5 Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка верификации крипто-подписи КМ в ГИС МТ (формат крипто-подписи не соответствует типу КМ).'");
	ИначеЕсли КодОшибки = 6 Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка верификации крипто-подписи КМ в ГИС МТ (крипто-подпись не валидная).'");
	ИначеЕсли КодОшибки = 7 Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка верификации крипто-подписи КМ в ГИС МТ (крипто-ключ не валиден).'");
	ИначеЕсли КодОшибки = 8 Тогда
		ТекстОшибки = НСтр("ru = 'КМ не прошел верификацию в стране эмитента.'");
	ИначеЕсли КодОшибки = 9 Тогда
		ТекстОшибки = НСтр("ru = 'Найденные AI в КМ не поддерживаются.'");
	ИначеЕсли КодОшибки = 10 Тогда
		ТекстОшибки = НСтр("ru = 'КМ не найден в ГИС МТ.'");
	ИначеЕсли КодОшибки = 11 Тогда
		ТекстОшибки = НСтр("ru = 'КМ не найден в трансгране.'");
	Иначе
		
		ШаблонПодсказки = НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ГИС МТ.
			|Описание из сервиса: %1.'");
			
		Если ОписаниеОшибкиГИСМТ <> Неопределено Тогда
			ТекстИзГИСМТ = СтрЗаменить(ОписаниеОшибкиГИСМТ, Символ(29), "");
		Иначе
			ТекстИзГИСМТ = "отсутствует";
		КонецЕсли;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПодсказки, ТекстИзГИСМТ);
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(ЭлементДанных = Неопределено) Экспорт
	
	ПараметрыКодаМаркировки = ИнициализироватьПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима();
	
	Если Не ЗначениеЗаполнено(ЭлементДанных) Тогда
		Возврат ПараметрыКодаМаркировки;
	КонецЕсли;
	
	Значение = ЭлементДанных["gtin"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.GTIN = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["producerInn"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИННПроизводителя = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["productionDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаПроизводства = ТранспортМДЛПАПИКлиентСервер.СтрокаВДатуСУчетомВременнойЗоны(Значение);
	КонецЕсли;
	
	Значение = ЭлементДанных["expireDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ГоденДо = ТранспортМДЛПАПИКлиентСервер.СтрокаВДатуСУчетомВременнойЗоны(Значение);
	КонецЕсли;
	
	Значение = ЭлементДанных["productionSerialNumber"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.НомерСерии = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["isBlocked"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.Заблокирован = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["ogvs"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ = Значение;
		ПараметрыКодаМаркировки.Заблокирован = ПараметрыКодаМаркировки.Заблокирован Или ЗначениеЗаполнено(ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ);
	КонецЕсли;
	
	Значение = ЭлементДанных["valid"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.Валидность = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["verified"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.УспешнаяПроверкаКриптоподписи = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["found"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.Наличие = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["utilised"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.Нанесен = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["sold"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.Продано = Значение;
	КонецЕсли;
	
	Значение = ЭлементДанных["realizable"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ВозможностьРеализации = Значение;
	КонецЕсли;
	// ор ++
	Значение = ЭлементДанных["isGreyGtin"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ЕстьВСеромСписке = Значение;
	КонецЕсли;
	// ор --
	
	Возврат ПараметрыКодаМаркировки;
	
КонецФункции

Функция ИнициализироватьПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима()
	
	ПараметрыКодаМаркировки = РезультатЭлементаПроверкиКМПоУмолчанию();
	
	ПараметрыКодаМаркировки.Вставить("GTIN"                                        , "");
	
	ПараметрыКодаМаркировки.Вставить("ИННПроизводителя"                            , "");
	ПараметрыКодаМаркировки.Вставить("ДатаПроизводства"                            , "");
	
	ПараметрыКодаМаркировки.Вставить("ГоденДо"                                     , "");
	ПараметрыКодаМаркировки.Вставить("НомерСерии"                                  , "");
	
	ПараметрыКодаМаркировки.Вставить("СписокОрганизацийБлокировкиКМ"               , Новый Массив);
	
	ПараметрыКодаМаркировки.Вставить("Валидность"                                  , Неопределено);
	ПараметрыКодаМаркировки.Вставить("УспешнаяПроверкаКриптоподписи"               , Неопределено);
	ПараметрыКодаМаркировки.Вставить("Наличие"                                     , Неопределено);
	ПараметрыКодаМаркировки.Вставить("Нанесен"                                     , Неопределено);
	ПараметрыКодаМаркировки.Вставить("Продано"                                     , Неопределено);
	ПараметрыКодаМаркировки.Вставить("ВозможностьРеализации"                       , Неопределено);
	// ор ++
	ПараметрыКодаМаркировки.Вставить("ЕстьВСеромСписке", Ложь);
	// ор --
	
	Возврат ПараметрыКодаМаркировки;
	
КонецФункции

Функция ОрганыВластиУстанавливающиеБлокировкуНаКМПоДаннымГИСМТ(МассивИдентификаторов)
	
	МассивПредставлений = Новый Массив;
	
	Если ТипЗнч(МассивИдентификаторов) <> Тип("Массив") Тогда
		Возврат МассивПредставлений;
	КонецЕсли;
	
	СоответствиеПредставлений = Новый Соответствие();
	СоответствиеПредставлений.Вставить("RAR",  НСтр("ru = 'Росалкогольрегулирование'"));
	СоответствиеПредставлений.Вставить("FTS",  НСтр("ru = 'ФТС России'"));
	СоответствиеПредставлений.Вставить("FNS",  НСтр("ru = 'ФНС России'"));
	СоответствиеПредставлений.Вставить("RSHN", НСтр("ru = 'Россельхознадзор (РСХН)'"));
	СоответствиеПредставлений.Вставить("RPN",  НСтр("ru = 'Роспотребнадзор (РПН)'"));
	СоответствиеПредставлений.Вставить("MVD",  НСтр("ru = 'МВД России'"));
	СоответствиеПредставлений.Вставить("RZN",  НСтр("ru = 'Росздравнадзор'"));
	СоответствиеПредставлений.Вставить("VETRF", НСтр("ru = 'ВетИС (аннулированный ВСД)'"));
	СоответствиеПредставлений.Вставить("RD"   , НСтр("ru = 'Государственные органы контроля за соблюдением требований технических регламентов'"));
	
	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
		
		ЗначениеПредставления = СоответствиеПредставлений.Получить(Идентификатор);
		
		Если ЗначениеПредставления = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПредставлений.Добавить(ЗначениеПредставления);
		
	КонецЦикла;
	
	Возврат МассивПредставлений;
	
КонецФункции

Функция ТекстыОшибокРазрешительногоРежимаПоПараметрамКодаМаркировки(ПараметрыКодаМаркировки, ПродажаПоДаннымОффлайнРежима = Ложь) Экспорт
	
	// ор ++
	// Функция была изменена так как библиотека зачем то переделала проверки и сделала каждую проверку независимой,
	// но на самом деле часть проверок взаимоисключающие.
	ТекстыОшибок = Новый Массив;
	
	Если ПараметрыКодаМаркировки.Заблокирован Тогда
		
		ТекстОшибки = НСтр("ru = 'Оборот товара был заблокирован.'");
		Если ЗначениеЗаполнено(ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ) Тогда
			
			ПредставленияОрганизаций = ОрганыВластиУстанавливающиеБлокировкуНаКМПоДаннымГИСМТ(ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ);
			ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Организации, принявшие решение о блокировке товара: %1.'"), СтрСоединить(ПредставленияОрганизаций, ", "));
			
		КонецЕсли;
		ТекстыОшибок.Добавить(ТекстОшибки);
		
	КонецЕсли;
	// ор ++
	// При оффлайне другие проверки не важны.
	Если ПродажаПоДаннымОффлайнРежима Тогда
		Возврат ТекстыОшибок;
	КонецЕсли;
	// ор --
	
	Если ЗначениеЗаполнено(ПараметрыКодаМаркировки.ГоденДо) И ТранспортМДЛПАПИКлиентСервер.ПолучитьТекущуюДатуСеанса() >= ПараметрыКодаМаркировки.ГоденДо Тогда
		ТекстОшибки = НСтр("ru = 'Истек срок годности.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Если ПараметрыКодаМаркировки.Валидность = Ложь Тогда
		ТекстОшибки = НСтр("ru = 'Структура данных кода маркировки некорректна.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	ИначеЕсли ПараметрыКодаМаркировки.УспешнаяПроверкаКриптоподписи = Ложь Тогда
		ТекстОшибки = НСтр("ru = 'Проверка крипто-подписи кода маркировки в ГИС МТ завершилась с ошибкой.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	ИначеЕсли ПараметрыКодаМаркировки.Наличие = Ложь Тогда
		ТекстОшибки = НСтр("ru = 'Код маркировки не найден в ГИС МТ.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	ИначеЕсли ПараметрыКодаМаркировки.Нанесен = Ложь Тогда
		ТекстОшибки = НСтр("ru = 'Нет информации о нанесении кода маркировки.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	ИначеЕсли ПараметрыКодаМаркировки.Продано = Истина Тогда
		ТекстОшибки = НСтр("ru = 'Гражданский оборот лекарственного препарата прекращен; КИ находится в реестре ожидания; все части товара выведены из оборота.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	ИначеЕсли ПараметрыКодаМаркировки.Продано = Ложь И ПараметрыКодаМаркировки.ВозможностьРеализации = Ложь Тогда
		ТекстОшибки = НСтр("ru = 'Нет информации о вводе в оборот кода идентификации.'");
		ТекстыОшибок.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Возврат ТекстыОшибок;
	
КонецФункции

#Область CDNПлощадки

Функция ДанныеОнлайнПроверкиКМ(ДанныеПроверкиКМ, Организация, НомерФискальногоНакопителя)
	
	КлючСессии = РазрешительныйРежимМДЛПВызовСервера.ПроверитьОбновитьКлючСессии(ПараметрыЗапросаКлючаСессииГИСМТРозница(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим"                , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютCDNПлощадки"        , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеCDNПлощадок", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                   , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима" , Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"   , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"       , Новый Соответствие);
	
	ВозвращаемоеЗначение.АварийныйРежим = ДействуетАварийныйРежимДляРозничныхПродаж();
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		// На срок действия аварийного режима разрешена продажа без разрешительного режима
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, НСтр("ru = 'Требуется обновление ключа сессии.'"));
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеCDNПлощадок = РазрешительныйРежимМДЛПВызовСервера.СортированнаяТаблицаCDNПлощадок();
	
	ВозвращаемоеЗначение.ТребуетсяОбновлениеCDNПлощадок = ДанныеCDNПлощадок.ТребуетсяОбновлениеПлощадок;
	
	Если Не ЗначениеЗаполнено(ДанныеCDNПлощадок.ТаблицаПлощадок) Тогда
		// если список площадок отсутствует вовсе - вернуть ошибку
		ВозвращаемоеЗначение.ОтсутствуютCDNПлощадки = Истина;
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, НСтр("ru = 'CDN-площадки отсутствуют.'"));
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	МассивПлощадокКБлокировке = Новый Массив;
	КешСоединенийCDNПлощадок = Новый Соответствие;
	
	СтруктураДополнительныхПараметров = Новый Структура;
	СтруктураДополнительныхПараметров.Вставить("Организация", Организация);
	СтруктураДополнительныхПараметров.Вставить("НомерФН"    , НомерФискальногоНакопителя);
	
	Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
		// ор ++
		СтруктураДополнительныхПараметров.Вставить("ПредставлениеНоменклатуры", ЭлементПроверки.ПредставлениеНоменклатуры);
		// ор --
		
		РезультатОбработкиКМ = ОбработатьКодМаркировкиНаCDNПлощадках(
			ЭлементПроверки.ПолныйКодМаркировкиИсходный,
			ДанныеCDNПлощадок.ТаблицаПлощадок,
			КлючСессии,
			МассивПлощадокКБлокировке,
			СтруктураДополнительныхПараметров,
			КешСоединенийCDNПлощадок);
		
		ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОбработкиКМ.АварийныйРежим;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОбработкиКМ.ТребуетсяОбновлениеКлючаСессии;
		
		Если ЗначениеЗаполнено(РезультатОбработкиКМ.ТекстОшибки) Тогда
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, РезультатОбработкиКМ.ТекстОшибки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОбработкиКМ.КонтролиРазрешительногоРежима) Тогда
			ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Вставить(ЭлементПроверки.ИдентификаторЭлемента, РезультатОбработкиКМ.КонтролиРазрешительногоРежима);
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
			// Если была получена ошибка 401 хотя бы по одному КМ - прервать обработку,
			// Необходимо обновление ключа сессии.
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.АварийныйРежим Тогда
			// Если был получен код 203 хотя бы по одному КМ - прервать обработку,
			// действует аварийный режим
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Если РезультатОбработкиКМ.ПараметрыКодаМаркировки <> Неопределено Тогда
			// По КМ был получен ответ из ГИС МТ.
			ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ЭлементПроверки.ИдентификаторЭлемента, РезультатОбработкиКМ.ПараметрыКодаМаркировки);
		КонецЕсли;
		
		Если РезультатОбработкиКМ.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ Тогда
			// Продажа разрешена по таймауту и нет ошибок контроля КМ.
			ВозвращаемоеЗначение.КодыМаркировкиБезДанных.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ЭлементПроверки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивПлощадокКБлокировке) Тогда
		РазрешительныйРежимМДЛПВызовСервера.ПеренестиCDNПлощадкиСОшибкамиИзПараметровСеансаВРегистр(МассивПлощадокКБлокировке);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОбработатьКодМаркировкиНаCDNПлощадках(КодМаркировки, ТаблицаCDNПлощадок, КлючСессии, МассивПлощадокКБлокировке, СтруктураДополнительныхПараметров, КешСоединенийCDNПлощадок = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                         Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",         Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                            "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима"         , Новый Массив);
	
	ВозвращаемоеЗначение.Вставить("ПараметрыКодаМаркировки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаРазрешенаВОтсутствиеОтветаГИСМТ", Ложь);
	
	ЗаголовокHTTP = Новый Соответствие;
	ЗаголовокHTTP.Вставить("Content-Type"  , "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY"     , КлючСессии);
	
	URLЗапроса = "api/v4/true-api/codes/check";
	
	МассивКодовМаркировкиДляОтправки = Новый Массив;
	МассивКодовМаркировкиДляОтправки.Добавить(КодМаркировки);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("codes",             МассивКодовМаркировкиДляОтправки);
	ПараметрыЗапроса.Вставить("fiscalDriveNumber", СтруктураДополнительныхПараметров.НомерФН);
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросов(, Истина);
	
	ТелоЗапросаJSON = ТранспортМДЛПКлиентСервер.ПреобразоватьЗначениеВJSON(ПараметрыЗапроса,, Истина);
	
	ОтправленЗапрос                      = Ложь;
	ПолученОтвет                         = Ложь;
	ВремяОжиданияОтветаГИСМТ             = ВремяОтветаCDNПлощадокПриПробитииЧека();
	ТаймерНачалоЗапросаВМиллисекундах    = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТаймерОкончаниеЗапросаВМиллисекундах = ТаймерНачалоЗапросаВМиллисекундах + ВремяОжиданияОтветаГИСМТ * 1000;
	
	ЗапросыДляЛогирования = Новый Массив;
	
	Для Каждого СтрокаПлощадок Из ТаблицаCDNПлощадок Цикл
		
		// если площадка уже в списке к блокировке, и мы уже выполнили формальный запрос, не надо к ней обращаться
		Если МассивПлощадокКБлокировке.Найти(СтрокаПлощадок.АдресПлощадки) <> Неопределено И ОтправленЗапрос Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТаймерОкончаниеЗапросаВМиллисекундах < ТекущаяУниверсальнаяДатаВМиллисекундах() Тогда
			
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			Прервать;
			
		КонецЕсли;
		
		Если Не СтрокаПлощадок.ПлощадкаДоступна И ОтправленЗапрос Тогда
			
			// либо все площадки доступные уже перебрали, и остались недоступные,
			// либо все были недоступные, но мы уже отправили один обязательный запрос, можно продавать
			// переход к следующему КМ, по нему тоже надо отправить хотя бы один запрос
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			Прервать;
			
		КонецЕсли;
		
		ПараметрыЗапросов.ЗащищенноеСоединение = СтрокаПлощадок.ЗащищенноеСоединение;
		ПараметрыЗапросов.Порт                 = СтрокаПлощадок.Порт;
		ПараметрыЗапросов.Адрес                = СтрокаПлощадок.Сервер;
		
		ДанныеДляОтправкиЗапросаНаПлощадку = Новый Структура;
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("URLЗапроса"          , URLЗапроса);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("ТелоЗапросаJSON"     , ТелоЗапросаJSON);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("КлючСессии"          , КлючСессии);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("ПараметрыЗапроса"    , ПараметрыЗапроса);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("ПараметрыЗапросов"   , ПараметрыЗапросов);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("ЗаголовокHTTP"       , ЗаголовокHTTP);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("АдресПлощадки"       , СтрокаПлощадок.АдресПлощадки);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("Адрес"               , СтрокаПлощадок.Сервер);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("Порт"                , СтрокаПлощадок.Порт);
		ДанныеДляОтправкиЗапросаНаПлощадку.Вставить("ЗащищенноеСоединение", СтрокаПлощадок.ЗащищенноеСоединение);
		
		// таймаут на запрос соответствует оставшемуся времени на получение ответа от площадок
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов.Таймаут = (ТаймерОкончаниеЗапросаВМиллисекундах - ТекущаяУниверсальнаяДатаВМиллисекундах()) / 1000;
		
		РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(
			ДанныеДляОтправкиЗапросаНаПлощадку,
			МассивПлощадокКБлокировке,
			КешСоединенийCDNПлощадок);
		
		ОтправленЗапрос = Истина;
		
		ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
		ВозвращаемоеЗначение.КонтролиРазрешительногоРежима  = РезультатОтправкиНаПлощадку.КонтролиРазрешительногоРежима;
		
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, РезультатОтправкиНаПлощадку.ТекстОшибки);
		
		// ор ++
		Для Каждого ТекЗапрос Из РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования Цикл
			ТекЗапрос.Наименование = СтруктураДополнительныхПараметров.ПредставлениеНоменклатуры;
		КонецЦикла;
		// ор --
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗапросыДляЛогирования, РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования);
		
		Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
			
			РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
			
			// если была получена ошибка 401 хотя бы по одной площадке - прервать обработку,
			// необходимо обновление ключа сессии
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, НСтр("ru = 'Требуется обновление ключа сессии.'"));
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.АварийныйРежим Тогда
			
			РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
			
			// если был получен код 203 хотя бы по одной площадке - прервать обработку,
			// действует аварийный режим
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки <> Неопределено Тогда
			
			// По КМ по площадке был получен ответ из ГИС МТ.
			ВозвращаемоеЗначение.ПараметрыКодаМаркировки = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
			
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ Тогда
			
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			
		КонецЕсли;
		
		Если Не ПолученОтвет Тогда
			ПолученОтвет = РезультатОтправкиНаПлощадку.ПолученОтветОтГИСМТ;
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке Тогда
			Продолжить;
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ Тогда
			Прервать;
		КонецЕсли;
		
		Если ПолученОтвет Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтправленЗапрос И Не ПолученОтвет Тогда
		ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
	КонецЕсли;
	
	РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, КешСоединенийCDNПлощадок = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим"                        , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии"        , Ложь);
	
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования"                 , Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                           , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима"         , Новый Массив);
	
	ВозвращаемоеЗначение.Вставить("ПерейтиКСледующейПлощадке"             , Ложь);
	ВозвращаемоеЗначение.Вставить("ПерейтиКСледующемуКМ"                  , Ложь);
	
	ВозвращаемоеЗначение.Вставить("ПолученОтветОтГИСМТ"                   , Ложь);
	ВозвращаемоеЗначение.Вставить("ПараметрыКодаМаркировки"               , Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаРазрешенаВОтсутствиеОтветаГИСМТ", Ложь);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	ДанныеЗапроса.АдресЗапроса = ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса;
	ДанныеЗапроса.ТелоЗапроса  = ДанныеДляОтправкиЗапросаНаПлощадку.ТелоЗапросаJSON;
	
	Если ДанныеДляОтправкиЗапросаНаПлощадку.ЗаголовокHTTP = Неопределено Тогда
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
		ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
		Если ДанныеДляОтправкиЗапросаНаПлощадку.КлючСессии <> Неопределено Тогда
			ЗаголовкиHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", ДанныеДляОтправкиЗапросаНаПлощадку.КлючСессии));
		КонецЕсли;
	Иначе
		ЗаголовкиHTTP = ДанныеДляОтправкиЗапросаНаПлощадку.ЗаголовокHTTP;
	КонецЕсли;
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов);
	ПараметрыПодключения.ПропуститьДиагностикуОшибок = Истина;
	
	Если КешСоединенийCDNПлощадок = Неопределено Тогда
		Соединение = Неопределено;
	Иначе
		Соединение = КешСоединенийCDNПлощадок.Получить(ДанныеДляОтправкиЗапросаНаПлощадку);
	КонецЕсли;
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса,, Соединение);
	
	АдресСервера = ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки;
	ТекстЗапроса = ДанныеДляОтправкиЗапросаНаПлощадку.ТелоЗапросаJSON;
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Или РезультатОтправкиЗапроса.КодСостояния = АварийныйРежимКодОтветаСервисаГИСМТ() Тогда
		
		Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния) Тогда
			КодОшибки = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
		Иначе
			КодОшибки = НСтр("ru = 'Таймаут'");
		КонецЕсли;
		
		ПолныйКодМаркировки = ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапроса.codes[0];
		
		ОтветТранспортногоМодуля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "ОтветТранспортногоМодуля");
		Если ЗначениеЗаполнено(ОтветТранспортногоМодуля) Тогда
			ТекстОтвета = ОтветТранспортногоМодуля;
		Иначе
			ТекстОтвета = РезультатОтправкиЗапроса.ОписаниеОшибки;
		КонецЕсли;
		
		ПараметрыЗаписиВЛог = РазрешительныйРежимМДЛПВызовСервера.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ПолныйКодМаркировки, ТекстОтвета, ТекстЗапроса);
		ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		
		Если Не ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния) Тогда
			
			// Ответ не получен, либо таймаут, либо иные проблемы, продолжить в рамках исходного таймера проход по площадкам.
			
			ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = Истина;
			
			РазрешительныйРежимМДЛПВызовСервера.ДобавитьCDNПлощадкиСОшибкамиОбменаВПараметрыСеанса(АдресСервера, МассивПлощадокКБлокировке, Ложь, Истина);
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда // РезультатОтправкиЗапроса.КодСостояния = 401
			
			// Если нет ключа сессии, остальные коды можно не проверять.
			
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 429 Или Лев(Строка(РезультатОтправкиЗапроса.КодСостояния), 1) = "5" Тогда
			
			// Если ошибки обмена, запомнить ошибку и перейти к следующей площадке.
			
			ПлощадкаУжеДобавлена = Ложь;
			РазрешительныйРежимМДЛПВызовСервера.ДобавитьCDNПлощадкиСОшибкамиОбменаВПараметрыСеанса(АдресСервера, МассивПлощадокКБлокировке, Истина, Ложь, ПлощадкаУжеДобавлена);
			
			Если ПлощадкаУжеДобавлена Тогда
				
				// Превышение счетчика получений ошибки 500.
				// Разрешить продажу и заблокировать площадку.
				
				ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
				ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке              = Истина;
				
				Возврат ВозвращаемоеЗначение;
				
			КонецЕсли;
			
			// Получение очередного ответа 500, счетчик ошибок пока не превышен.
			// Выполнение повторной отправки запроса.
			
			РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(
				ДанныеДляОтправкиЗапросаНаПлощадку,
				МассивПлощадокКБлокировке,
				КешСоединенийCDNПлощадок);
			
			ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
			ВозвращаемоеЗначение.ЗапросыДляЛогирования          = РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования;
			
			Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Или ВозвращаемоеЗначение.АварийныйРежим Тогда
				Возврат ВозвращаемоеЗначение;
			КонецЕсли;
			
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ;
			ВозвращаемоеЗначение.ПараметрыКодаМаркировки                = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
			
			ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке;
			ВозвращаемоеЗначение.ПерейтиКСледующемуКМ      = РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ;
			ВозвращаемоеЗначение.ПолученОтветОтГИСМТ       = РезультатОтправкиНаПлощадку.ПолученОтветОтГИСМТ;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = АварийныйРежимКодОтветаСервисаГИСМТ() Тогда
			
			// Если аварийный режим, остальные коды можно не проверять.
			
			РазрешительныйРежимМДЛПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы();
			
			ВозвращаемоеЗначение.АварийныйРежим                         = Истина;
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			ВозвращаемоеЗначение.ПерейтиКСледующемуКМ                   = Истина;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса, РезультатОтправкиЗапроса);
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
	
	Если ДанныеОтвета = Неопределено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса, РезультатОтправкиЗапроса);
		ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеПоКодамМаркировки = ДанныеОтвета.Получить("codes");
	Если ТипЗнч(ДанныеПоКодамМаркировки) <> Тип("Массив") Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
		
		КодОшибки         = ЭлементДанных["errorCode"];
		СообщениеОбОшибке = ?(ЗначениеЗаполнено(ЭлементДанных["message"]), СтрЗаменить(ЭлементДанных["message"], Символ(29), ""), "");
		
		Если ЗначениеЗаполнено(КодОшибки) Тогда
			ТекстОшибки = ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиГИСМТ(КодОшибки, СообщениеОбОшибке);
			ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
		КонецЕсли;
		
		ПараметрыКодаМаркировки = ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(ЭлементДанных);
		
		ТекстыОшибок = ТекстыОшибокРазрешительногоРежимаПоПараметрамКодаМаркировки(ПараметрыКодаМаркировки);
		Если ЗначениеЗаполнено(ТекстыОшибок) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВозвращаемоеЗначение.КонтролиРазрешительногоРежима, ТекстыОшибок);
		ИначеЕсли ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ГИС МТ.
					|Описание из сервиса: %1.'"),
				СообщениеОбОшибке);
			ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
		КонецЕсли;
		
		ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(ДанныеОтвета.Получить("reqTimestamp"), "ЧГ=;");
		ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ДанныеОтвета.Получить("reqId");
		ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = АдресСервера;
		ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = ТекстЗапроса;
		ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = РезультатОтправкиЗапроса.ОтветТранспортногоМодуля;
		ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
		
		ВозвращаемоеЗначение.ПараметрыКодаМаркировки = ПараметрыКодаМаркировки;
		ВозвращаемоеЗначение.ПерейтиКСледующемуКМ    = Истина;
		ВозвращаемоеЗначение.ПолученОтветОтГИСМТ     = Истина;
		
		// ор ++
		Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ХранитьУспешныеОперацииПриПроверкеКМ() Тогда
			ПолныйКодМаркировки = ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапроса.codes[0];
			
			ОтветТранспортногоМодуля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "ОтветТранспортногоМодуля");
			Если ЗначениеЗаполнено(ОтветТранспортногоМодуля) Тогда
				ТекстОтвета = ОтветТранспортногоМодуля;
			Иначе
				ТекстОтвета = РезультатОтправкиЗапроса.ОписаниеОшибки;
			КонецЕсли;
			
			ПараметрыЗаписиВЛог = РазрешительныйРежимМДЛПВызовСервера.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
				АдресСервера,
				Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;"),
				ПолныйКодМаркировки,
				ТекстОтвета,
				ТекстЗапроса);
				
			ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		КонецЕсли;
		// ор --
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // CDNПлощадки

#Область ЛокальныйМодульЧЗ

Функция ДанныеЛокальногоМодуля(ДанныеПроверкиКМ, Организация, НомерФискальногоНакопителя, РабочееМесто = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим"                         , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМ"             , Ложь);
	ВозвращаемоеЗначение.Вставить("НезавершеннаяНастройкаЛМ"               , Ложь);
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизации"          , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствиеСинхронизацииЛМ"              , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаКлиенте"             , Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                            , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима"          , Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"            , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"                , Новый Соответствие);
	
	ВозвращаемоеЗначение.АварийныйРежим = ДействуетАварийныйРежимДляРозничныхПродаж();
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		// На срок действия аварийного режима разрешена продажа без разрешительного режима.
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеУстановленныхЛокальныхМодулей = РазрешительныйРежимМДЛПВызовСервера.СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто);
	
	СписокКлиентскихМодулей = ДанныеУстановленныхЛокальныхМодулей.КлиентскиеМодули;
	СписокСерверныхМодулей  = ДанныеУстановленныхЛокальныхМодулей.СерверныеМодули;
	
	НетКлиентскихМодулей = Не ЗначениеЗаполнено(СписокКлиентскихМодулей);
	НетСерверныхМодулей  = Не ЗначениеЗаполнено(СписокСерверныхМодулей);
	
	Если НетКлиентскихМодулей И НетСерверныхМодулей Тогда
		// Если локальных модулей не установлено, то не отправлять запрос
		ВозвращаемоеЗначение.ОтсутствуютУстановленныеЛМ = Истина;
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, НСтр("ru = 'Локальный модуль Честный знак не установлен.'"));
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	СтруктураДополнительныхПараметров = Новый Структура;
	СтруктураДополнительныхПараметров.Вставить("НомерФН", НомерФискальногоНакопителя);
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ОбменНаСервере = Истина;
	#Иначе
		ОбменНаСервере = Ложь;
	#КонецЕсли
	
	Если ОбменНаСервере И НетСерверныхМодулей Тогда
		
		// Обмен на сервере, нет настроенных серверных, но есть настроенные клиентские модули.
		// Вернуть флаг необходимости возврата на клиент для запроса на клиентских ЛМ.
		ВозвращаемоеЗначение.ТребуетсяПроверкаНаКлиенте = Истина;
		
		Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
			ВозвращаемоеЗначение.КодыМаркировкиБезДанных.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ЭлементПроверки);
		КонецЦикла;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	СписокМодулейДляОбработки = ?(ОбменНаСервере, СписокСерверныхМодулей, СписокКлиентскихМодулей);
	
	РезультатОбработкиКМ = ОбработатьКодыМаркировкиНаЛокальномМодулеЧестногоЗнака(
		ДанныеПроверкиКМ,
		СписокМодулейДляОбработки,
		СтруктураДополнительныхПараметров);
	
	ВозвращаемоеЗначение.НезавершеннаяНастройкаЛМ      = РезультатОбработкиКМ.НезавершеннаяНастройкаЛМ;
	ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = РезультатОбработкиКМ.НекорректныеДанныеАвторизации;
	ВозвращаемоеЗначение.ОтсутствиеСинхронизацииЛМ     = РезультатОбработкиКМ.ОтсутствиеСинхронизацииЛМ;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.ТекстОшибки) Тогда
		ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, РезультатОбработкиКМ.ТекстОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.КонтролиРазрешительногоРежима) Тогда
		ВозвращаемоеЗначение.КонтролиРазрешительногоРежима = РезультатОбработкиКМ.КонтролиРазрешительногоРежима;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.СтатусыКодовМаркировкиГИСМТ) Тогда
		ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ = РезультатОбработкиКМ.СтатусыКодовМаркировкиГИСМТ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.КодыМаркировкиБезДанных) Тогда
		ВозвращаемоеЗначение.КодыМаркировкиБезДанных = РезультатОбработкиКМ.КодыМаркировкиБезДанных;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОбработатьКодыМаркировкиНаЛокальномМодулеЧестногоЗнака(ДанныеПроверкиКМ, ДанныеУстановленныхЛокальныхМодулей, СтруктураДополнительныхПараметров)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизации", Ложь);
	ВозвращаемоеЗначение.Вставить("НезавершеннаяНастройкаЛМ"     , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствиеСинхронизацииЛМ"    , Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                  , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима", Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"  , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"      , Новый Соответствие);
	
	МассивКодовИдентификацииДляОтправки = Новый Массив;
	СоответствиеКИЗСтрокам              = Новый Соответствие;
	КодыМаркировкиБезДанных             = Новый Соответствие;
	
	Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
		МассивКодовИдентификацииДляОтправки.Добавить(ЭлементПроверки.СокращенныйКодМаркировки);
		СоответствиеКИЗСтрокам.Вставить(ЭлементПроверки.СокращенныйКодМаркировки, ЭлементПроверки);
		// Изначально, считаем все элементы проверки без данных.
		КодыМаркировкиБезДанных.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ЭлементПроверки);
	КонецЦикла;
	
	ЗапросыДляЛогирования = Новый Массив;
	
	Для Каждого ДанныеЛокальногоМодуля Из ДанныеУстановленныхЛокальныхМодулей Цикл
		
		ДанныеЗапроса = ПодготовитьДанныеЗапросаОбработкиКодовМаркировкиНаЛокальномМодулеЧЗ(ДанныеЛокальногоМодуля, МассивКодовИдентификацииДляОтправки, СтруктураДополнительныхПараметров);
		
		ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ДанныеЛокальногоМодуля);
		ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
		ПараметрыПодключения.Таймаут = ДанныеЛокальногоМодуля.Таймаут;
		
		РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
		
		АдресСервера = ДанныеЛокальногоМодуля.АдресПодключения;
		
		Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
			
			Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния) Тогда
				КодОшибки = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
			Иначе
				КодОшибки = НСтр("ru = 'Таймаут'");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля) Тогда
				ТекстОтвета = РезультатОтправкиЗапроса.ОтветТранспортногоМодуля;
			Иначе
				ТекстОтвета = РезультатОтправкиЗапроса.ОписаниеОшибки;
			КонецЕсли;
			
			Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
				ПараметрыЗаписиВЛог = РазрешительныйРежимМДЛПВызовСервера.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ЭлементПроверки.ПолныйКодМаркировки, ТекстОтвета, ДанныеЗапроса.АдресЗапроса);
				// ор ++
				ПараметрыЗаписиВЛог.Наименование = ЭлементПроверки.ПредставлениеНоменклатуры;
				// ор --
				ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
			КонецЦикла;
			
			Если РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда // РезультатОтправкиЗапроса.КодСостояния = 401
				
				ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = Истина;
				
				// Некорректный логин/пароль администратора.
				ТекстОшибки = НСтр("ru = 'Указаны некорректные логин/пароль подключения к Локальному модулю ""Честный знак"" %1.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, АдресСервера);
				
				ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
				
				Продолжить;
				
			ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
				
				// Код ошибки 4045 - не инициализировано, или в статусе инициализации.
				// Код ошибки 4050 - ошибка синхронизации.
				
				// В обоих случаях переходим к следующему ЛМ.
				
				ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
				
				Если ДанныеОтвета = Неопределено Тогда
					ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
					ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				КодРасшифровкиОшибки = ДанныеОтвета.Получить("errorCode");
				Если КодРасшифровкиОшибки = Неопределено Тогда
					ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
					ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если КодРасшифровкиОшибки = 4045 Тогда
					ВозвращаемоеЗначение.НезавершеннаяНастройкаЛМ = Истина;
					ТекстОшибки = НСтр("ru = 'Не завершена настройка подключения к Локальному модулю ""Честный знак"" %1.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,  АдресСервера);
					ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если КодРасшифровкиОшибки = 4050 Тогда
					ВозвращаемоеЗначение.ОтсутствиеСинхронизацииЛМ = Истина;
					ТекстОшибки = НСтр("ru = 'Статус Локального модуля ""Честный знак"" %1 - ошибка синхронизации.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,  АдресСервера);
					ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				ТекстОшибкиИзСервиса = ДанныеОтвета.Получить("reason");
				Если ЗначениеЗаполнено(ТекстОшибкиИзСервиса) Тогда
					ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибкиИзСервиса);
					Продолжить;
				КонецЕсли;
				
				ДополнениеТекстаОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
				ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
				Продолжить;
				
			Иначе
				ДополнениеТекстаОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
				ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
		
		Если ДанныеОтвета = Неопределено Тогда
			ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		КодОтветаОшибки = ДанныеОтвета.Получить("code");
		Если ЗначениеЗаполнено(КодОтветаОшибки) Тогда
			ТекстОшибки = НСтр("ru = 'Локальный модуль ""Честный знак"" вернул ошибку.
			|Код ошибки %1, описание ошибки:
			|%2.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, КодОтветаОшибки, ДанныеОтвета.Получить("description"));
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		ДанныеОтветаЛокальногоМодуля = ДанныеОтвета.Получить("results");
		
		Если ТипЗнч(ДанныеОтветаЛокальногоМодуля) <> Тип("Массив") Или Не ЗначениеЗаполнено(ДанныеОтветаЛокальногоМодуля) Тогда
			ТекстОшибки = НСтр("ru = 'Некорректный формат ответа от Локального модуля Честный знак.'");
			ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОбщиеДанныеОтветаЛокальногоМодуля Из ДанныеОтветаЛокальногоМодуля Цикл
			
			ДанныеПоКодамМаркировки = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("codes");
			// ор ++
			ЕстьВСеромСписке = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("isGreyGtin");
			// ор --
			
			Если ТипЗнч(ДанныеПоКодамМаркировки) <> Тип("Массив") Или Не ЗначениеЗаполнено(ДанныеПоКодамМаркировки) Тогда
				ТекстОшибки = НСтр("ru = 'Некорректный формат ответа от Локального модуля Честный знак.'");
				ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
				
				КИЗСтроки = ЭлементДанных.Получить("cis");
				Если Не ЗначениеЗаполнено(КИЗСтроки) Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементПроверки = СоответствиеКИЗСтрокам.Получить(КИЗСтроки);
				Если Не ЗначениеЗаполнено(ЭлементПроверки) Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыКодаМаркировки = ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(ЭлементДанных);
				
				ТекстыОшибок = ТекстыОшибокРазрешительногоРежимаПоПараметрамКодаМаркировки(ПараметрыКодаМаркировки);
				Если ЗначениеЗаполнено(ТекстыОшибок) Тогда
					ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ТекстыОшибок);
				КонецЕсли;
				
				ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(ОбщиеДанныеОтветаЛокальногоМодуля.Получить("reqTimestamp"), "ЧГ=;");
				ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("reqId");
				ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = АдресСервера;
				ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = ДанныеЗапроса.АдресЗапроса;
				ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = РезультатОтправкиЗапроса.ОтветТранспортногоМодуля;
				ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
				
				ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЭкземпляраПО = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("inst");
				ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазыЧерногоСписка   = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("version");
				// ор ++
				ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазы = ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазыЧерногоСписка;
				// ор --
				
				ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ПараметрыКодаМаркировки);
				
				// Если по элементу проверки удалось получить данные, тогда нужно удалить его из коллекции.
				КодыМаркировкиБезДанных.Удалить(ЭлементПроверки.ИдентификаторЭлемента);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КодыМаркировкиБезДанных) Тогда
			ВозвращаемоеЗначение.КодыМаркировкиБезДанных = КодыМаркировкиБезДанных;
		КонецЕсли;
		
		// Если получили ответ хотя бы от одного ЛМ, тогда ошибки отключаем.
		ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = Ложь;
		ВозвращаемоеЗначение.НезавершеннаяНастройкаЛМ = Ложь;
		ВозвращаемоеЗначение.ОтсутствиеСинхронизацииЛМ = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = "";
		
		// Достаточно одного ответа от одного ЛМ.
		Прервать;
		
	КонецЦикла;
	
	РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПодготовитьДанныеЗапросаОбработкиКодовМаркировкиНаЛокальномМодулеЧЗ(ДанныеЛокальногоМодуля, МассивКодовИдентификацииДляОтправки, СтруктураДополнительныхПараметров) Экспорт
	
	ПрефиксВерсии = ПрефиксВерсииИнтерфейсаЛокальногоМодулья(ДанныеЛокальногоМодуля.ФорматОбмена);
	НомерВерсии = ПолучитьНомерВерсииФорматаОбменаЛокальногоМодуля(ДанныеЛокальногоМодуля.ФорматОбмена);
	
	Если НомерВерсии >= 2 Тогда
		МассивКодовИдентификации = Новый Массив;
		Для Каждого СокращенныйКодМаркировки Из МассивКодовИдентификацииДляОтправки Цикл
			СтруктураКодовИдентификации = Новый Структура;
			СтруктураКодовИдентификации.Вставить("cis", СокращенныйКодМаркировки);
			СтруктураКодовИдентификации.Вставить("pg", НомерТоварнойГруппыЛекарственныеСредства());
			МассивКодовИдентификации.Добавить(СтруктураКодовИдентификации);
		КонецЦикла;
	Иначе
		МассивКодовИдентификации = МассивКодовИдентификацииДляОтправки;
	КонецЕсли;
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	ДанныеЗапроса.АдресЗапроса = ПрефиксВерсии + "cis/outCheck";
	
	ДанныеЗапроса.ТелоЗапроса = Новый Структура;
	ДанныеЗапроса.ТелоЗапроса.Вставить("cis_list", МассивКодовИдентификации);
	
	ДанныеАвторизацииBase64 = ИнтеграцияМДЛПКлиентСервер.ШтрихкодВBase64(СтрШаблон("%1:%2", ДанныеЛокальногоМодуля.Логин, ДанныеЛокальногоМодуля.Пароль));
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Accept"        , "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Authorization" , СтрШаблон("Basic %1", ДанныеАвторизацииBase64));
	ЗаголовкиHTTP.Вставить("X-ClientId"    , СтруктураДополнительныхПараметров.НомерФН);
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

#КонецОбласти // ЛокальныйМодульЧЗ

#КонецОбласти // ПроверкаКодаМаркировки

// Возвращает адрес сервера ГИС МТ.
//
// Параметры:
//   ИспользоватьTrueAPI - Булево - Использовать true-api.
//   РазрешительныйРежим - Булево - Истина, если обращение к выделенному серверу для загрузки CDN-площадок и токена.
//
// Возвращаемое значение:
//  Строка - адрес сервера ГИС МТ.
//
Функция АдресСервера(ИспользоватьTrueAPI = Ложь, РазрешительныйРежим = Ложь) Экспорт
	
	РежимРаботыСТестовымКонтуромГИСМТ = РежимРаботыСТестовымКонтуромГИСМТ();
	
	Если РежимРаботыСТестовымКонтуромГИСМТ Тогда
		Если ИспользоватьTrueAPI Или РазрешительныйРежим Тогда
			Возврат "markirovka.sandbox.crptech.ru";
		Иначе
			Возврат "sandbox.crptech.ru";
		КонецЕсли;
	Иначе
		Если РазрешительныйРежим Тогда
			Возврат "cdn.crpt.ru";
		ИначеЕсли ИспользоватьTrueAPI Тогда
			Возврат "markirovka.crpt.ru";
		Иначе
			Возврат "ismp.crpt.ru";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ДоступныеМетодыИнтерфейса() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	ВозвращаемоеЗначение.Вставить("ПолучениеРозничногоТокена"                     , "ПолучениеРозничногоТокена");
	
	ВозвращаемоеЗначение.Вставить("АктуализацияCDNПлощадок"                       , "АктуализацияCDNПлощадок");
	
	ВозвращаемоеЗначение.Вставить("ИнициализацияКонфигурацииЛокальногоМодуляЧЗ"   , "ИнициализацияКонфигурацииЛокальногоМодуляЧЗ");
	ВозвращаемоеЗначение.Вставить("ОбновлениеСтатусаЛокальногоМодуляЧЗ"           , "ОбновлениеСтатусаЛокальногоМодуляЧЗ");
	ВозвращаемоеЗначение.Вставить("СменаПароляАдминистрированияЛокальногоМодуляЧЗ", "СменаПароляАдминистрированияЛокальногоМодуляЧЗ");
	
	ВозвращаемоеЗначение.Вставить("ПолучениеДанныхНастройкиТСПИоТ"                , "ПолучениеДанныхНастройкиТСПИоТ");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СтруктураПараметровЗапросаКлючаСессии()
	
	ПараметрыЗапроса = Новый Структура;
	
	ПараметрыЗапроса.Вставить("ПредставлениеСервиса"               , "");
	ПараметрыЗапроса.Вставить("Организация"                        , Неопределено);
	ПараметрыЗапроса.Вставить("ИНН",                               "");
	
	ПараметрыЗапроса.Вставить("Адрес"                              , "");
	ПараметрыЗапроса.Вставить("Порт"                               , 443);
	ПараметрыЗапроса.Вставить("Таймаут"                            , 60);
	ПараметрыЗапроса.Вставить("ЗащищенноеСоединение"               , Истина);
	ПараметрыЗапроса.Вставить("ВремяЖизни"                         , 900);
	
	ПараметрыЗапроса.Вставить("ИмяПараметраКлючаСессии"            , "");
	ПараметрыЗапроса.Вставить("АдресЗапросаПараметровАвторизации"  , "api/v3/auth/cert/key");
	ПараметрыЗапроса.Вставить("АдресЗапросаКлючаСессии"            , "api/v3/auth/cert/");
	ПараметрыЗапроса.Вставить("РазрешенаПодписьДоверенногоЛицаСМЧД", Истина);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ИмяДанныхКлючаСессии(ТипТокенаАвторизации) Экспорт
	
	Если ТипТокенаАвторизации = ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница") Тогда
		Возврат "ДанныеКлючаСессииГИСМТРозницаМДЛП";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ТипТокенаАвторизацииПоИмениДанныхКлючаСессии(ИмяДанныхКлючаСессии) Экспорт
	
	Если ИмяДанныхКлючаСессии = "ДанныеКлючаСессииГИСМТРозницаМДЛП" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница");
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизацииМДЛП.ПустаяСсылка");
	
КонецФункции


Процедура ДополнитьТекстОшибки(ИсходныйТекстОшибки, ДополнениеТекстаОшибки) Экспорт
	
	ИсходныйТекстОшибки = ИсходныйТекстОшибки + ?(ЗначениеЗаполнено(ИсходныйТекстОшибки), Символы.ПС, "") + ДополнениеТекстаОшибки;
	
КонецПроцедуры

Функция ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса) Экспорт
	
	КодОшибки    = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "КодОшибки");
	КодСостояния = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "КодСостояния");
	
	ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "ОписаниеОшибки");
	
	ТекстВходящегоСообщенияJSON = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "ОтветТранспортногоМодуля");
	Если Не ЗначениеЗаполнено(ТекстВходящегоСообщенияJSON) Тогда
		ТекстВходящегоСообщенияJSON = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "ТекстВходящегоСообщенияJSON", "");
	КонецЕсли;
	
	ЧастиТекстаОшибки = Новый Массив;
	ЧастиТекстаОшибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При выполнении запроса %1 возникла ошибка.'"), URLЗапроса));
	
	Если ЗначениеЗаполнено(КодОшибки) Тогда
		ЧастиТекстаОшибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Код состояния HTTP: %1.'"), КодОшибки));
	ИначеЕсли ЗначениеЗаполнено(КодСостояния) Тогда
		ЧастиТекстаОшибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Код состояния HTTP: %1.'"), КодСостояния));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ЧастиТекстаОшибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Текст ошибки: %1.'"), ОписаниеОшибки));
	ИначеЕсли ЗначениеЗаполнено(ТекстВходящегоСообщенияJSON) Тогда
		ЧастиТекстаОшибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Текст ошибки: %1.'"), ПредставлениеОшибкиИзJSON(ТекстВходящегоСообщенияJSON)));
	Иначе
		ЧастиТекстаОшибки.Добавить(НСтр("ru = 'Текст ошибки: Неизвестная ошибка.'"));
	КонецЕсли;
	
	ТекстОшибки = СтрСоединить(ЧастиТекстаОшибки, Символы.ПС);
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПредставлениеОшибкиИзJSON(ТекстВходящегоСообщенияJSON)
	
	ДанныеJSON = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(ТекстВходящегоСообщенияJSON, Ложь);
	
	Если ДанныеJSON <> Неопределено
		И ТипЗнч(ДанныеJSON) = Тип("Структура")
		И ДанныеJSON.Свойство("globalErrors")
		И ТипЗнч(ДанныеJSON.globalErrors) = Тип("Массив") Тогда
		
		ТекстыОшибок = Новый Массив;
		Для Каждого СтрокаОшибки Из ДанныеJSON.globalErrors Цикл
			
			Если Не (ТипЗнч(СтрокаОшибки) = Тип("Строка") Или ТипЗнч(СтрокаОшибки) = Тип("Структура")) Тогда
				Возврат ТекстВходящегоСообщенияJSON;
			КонецЕсли;
			
			Если ТипЗнч(СтрокаОшибки) = Тип("Строка") И ЗначениеЗаполнено(СтрокаОшибки) Тогда
				ТекстыОшибок.Добавить(СтрокаОшибки);
			ИначеЕсли ТипЗнч(СтрокаОшибки) = Тип("Структура") Тогда
				
				ТекстОшибки = Неопределено;
				КодОшибки   = Неопределено;
				СтрокаОшибки.Свойство("error",     ТекстОшибки);
				СтрокаОшибки.Свойство("errorCode", КодОшибки);
				ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", КодОшибки, ТекстОшибки));
				Если ЗначениеЗаполнено(КодОшибки) Или ЗначениеЗаполнено(ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(ПредставлениеОшибки);
				Иначе
					Возврат ТекстВходящегоСообщенияJSON;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеJSON.Свойство("fieldErrors") И ТипЗнч(ДанныеJSON.fieldErrors) = Тип("Массив") Тогда
			
			Для Каждого СтрокаОшибкиПоля Из ДанныеJSON.fieldErrors Цикл
				
				ИмяПоля     = Неопределено;
				ТекстОшибки = Неопределено;
				СтрокаОшибкиПоля.Свойство("fieldName",  ИмяПоля);
				СтрокаОшибкиПоля.Свойство("fieldError", ТекстОшибки);
				
				ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", ИмяПоля, ТекстОшибки));
				Если ЗначениеЗаполнено(ИмяПоля) Или ЗначениеЗаполнено(ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(ПредставлениеОшибки);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	ИначеЕсли ДанныеJSON <> Неопределено
		И ТипЗнч(ДанныеJSON) = Тип("Массив") Тогда
		
		ТекстыОшибок = Новый Массив;
		Для Каждого СтрокаОшибки Из ДанныеJSON Цикл
			
			Если Не ТипЗнч(СтрокаОшибки) = Тип("Структура")
				Или Не СтрокаОшибки.Свойство("cisInfo")
				Или Не СтрокаОшибки.Свойство("errorMessage") Тогда
				Возврат ТекстВходящегоСообщенияJSON;
			КонецЕсли;
			
			ТекстыОшибок.Добавить(СтрокаОшибки.errorMessage);
			
		КонецЦикла;
		
		Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	Иначе
		Возврат ТекстВходящегоСообщенияJSON;
	КонецЕсли;
	
КонецФункции

// Статус кода маркировки по структуре данных ГИС МТ - признаков продажи, нанесения, возможности реализации.
// 
// Параметры:
//  СтруктураКода - Структура - Структура признаков:
//  	* Продано - Булево
//  	* ВозможностьРеализации - Булево
//  	* Нанесен - Булево
//  	* Валидность - Булево
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - Статус кода маркировки по данным ГИС МТ.
Функция СтатусКодаМаркировкиПоДаннымГИСМТ(Знач СтруктураКода)
	
	Если СтруктураКода.Продано Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота");
	ИначеЕсли СтруктураКода.ВозможностьРеализации Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот");
	ИначеЕсли Не СтруктураКода.ВозможностьРеализации
		И СтруктураКода.Нанесен Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен");
	ИначеЕсли Не СтруктураКода.Нанесен
		И СтруктураКода.Валидность Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Неопределен");
	КонецЕсли;
	
КонецФункции


Функция ОперацииПриРаботеСКодамиМаркировки() Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("Продажа", НСтр("ru = 'Продажа'"));
	СтруктураВозврата.Вставить("Возврат", НСтр("ru = 'Возврат'"));
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
