
#Область ОписаниеПеременных

// Ускоряющие переменные
&НаСервере
Перем МетаданныеИсточника; // Метаданные текущей табличной части (МетаданныеОбъектТабличнаяЧасть).

// Служебные переменные
&НаСервере
Перем МенеджерыОбъектовМетаданных; // Структура Менеджеров объектов метаданных.

&НаКлиенте
Перем КешМенеджеровПоТипу; // Соответствие, для кэширования информации о соответствии типа менеджеру.

// Ускоряющие переменные для настроек выгрузки.
&НаКлиенте
Перем СоответствиеТиповИПредставленийDBF; // Соответствие типов и представлений.

&НаКлиенте
Перем СписокСоответствийТранслитерации; // Список соответствий транслитерации.

&НаКлиенте
Перем КаталогЗагружаемогоФайла; // Каталог загружаемого файла.

&НаКлиенте
Перем ПолныйПутьКЗагружаемомуФайлу; // Полный путь к файлу.

&НаКлиенте
Перем ИндексТипаЗагружаемогоФайла; // Индекс типа загружаемого файла.

&НаКлиенте
Перем ИзмененаРучнаяНумерацияКолонок;

&НаКлиенте
Перем РазвернутТабличныйДокумент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ЗаполнитьСписокВариантовИспользования();
	
	// Установим ускоряющую переменную модуля
	МетаданныеИсточника = ПолучитьМетаданныеИсточника();
	Если НЕ МетаданныеИсточника=Неопределено Тогда
		АдресХранилищаМетаданныеИсточника = ПоместитьВоВременноеХранилище(МетаданныеИсточника.ПолноеИмя(), УникальныйИдентификатор);
	Иначе
		АдресХранилищаМетаданныеИсточника = "";
	КонецЕсли;
	
	// Форма открыта для сохранения настроек, заполним реквизиты объекта из параметров
	ФормаОткрытаДляСохранения = Ложь;
	Если ЗначениеЗаполнено(Параметры.ВариантИспользованияНастройки) Тогда
		Объект.ВариантИспользованияНастройки = Параметры.ВариантИспользованияНастройки;
		ФормаОткрытаДляСохранения = Истина;
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(Параметры.НастройкиЗагрузкиВыгрузки) Тогда
			Настройки = Параметры.НастройкиЗагрузкиВыгрузки.Получить();
		ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Настройки = ПолучитьНастройкуИзХранилища(Объект.Ссылка);
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Описание = "";
		Пока ИнформацияОбОшибке.Причина<>Неопределено Цикл
			ИнформацияОбОшибке = ИнформацияОбОшибке.Причина; // Пропускаем первую строку с текстом модуля
			Описание  = Описание+Описание+ИнформацияОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Ошибка получения настроек: %1'"), Описание);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	Если Настройки = Неопределено Тогда
		
		// Для загрузки
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДопПараметровСправочникаНастроек(, ТаблицаДополнительныхПараметров);
		
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.УстановитьФорматДатыСрокаГодностиСерийПоУмолчанию(ЭтотОбъект);

		ПерваяСтрокаДанныхТабличногоДокумента = 1;
		ДействиеСЗагружаемымФайлом = 2;
		
		// Для выгрузки
		Кодировка = "DOS";
		ФорматВыходногоФайла = "DBF";
		
		// Если это новый элемент, то значения отбора попадают в поля, отследим последовательность
		// т.к. может случится ситуация, когда установлена табличная часть, но не установлен объект.
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) 
				И НЕ ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
				Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.ПустаяСсылка();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ИмяПрикладногоОбъекта) И НЕ ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
				ИмяПрикладногоОбъекта = "";
				ПредставлениеПрикладногоОбъекта = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) И НЕ ЗначениеЗаполнено(Объект.ИмяПрикладногоОбъекта) Тогда
				ИмяТабличнойЧасти = "";
				ПредставлениеТабличнойЧасти = "";
			КонецЕсли;
			
			// Установим вариант использования в соответствии с группой которой настройка принадлежит
			// при интерактивном добавлении элемента справочника (без отбора, при отборе )
			Если НЕ ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
				ДанныйОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента"));
				Если ДанныйОбъект.ПринадлежитЭлементу(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекВыгрузки) Тогда
					Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных;
				Иначе
					Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Общее
		// При создании нового элемента с установленным отбором (например при добавление с использованием формы мастера)
		// заполняются только скрытые поля необходимо заполнить и представления
		УстановитьИсточник(НЕ ЗначениеЗаполнено(Объект.Ссылка));
	Иначе
		Если Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
			// Заполним список реквизитов ТЧ
			ЗаполнитьНастройкиИзТабличногоДокумента(Настройки);
		ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
			ЗаполнитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки);
		КонецЕсли;
		Если ФормаОткрытаДляСохранения И РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
			Если Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
				Если Объект.ТипПрикладногоОбъекта <> Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
					Объект.Родитель = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекЗагрузки;
				КонецЕсли;
			Иначе
				Если Объект.ТипПрикладногоОбъекта <> Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
					Объект.Родитель = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекВыгрузки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	
	УправлениеДиалогом();
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Инициализация();
	
	ИнициализацияСписковИСоответствий();
	
	// Заполними рабочие списки значений, выполняем "перед открытием" для того, чтобы
	// позиционировать текущие значения, показать представления
	ЗаполнитьСписокВариантовИспользования();
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	ЗаполнитьСписокПрикладныхОбъектов();
	ЗаполнитьСписокТабличныхЧастей();
	
	ОбновитьНомераСтрокВыгружаемыхРеквизитов();
	
	// В веб-клиенте редактирование справочника запрещено
	#Если ВебКлиент Тогда
		ТолькоПросмотр = Истина;
		// Вкладка загрузки
		Элементы.ПерваяСтрокаДанныхТабличногоДокумента.ТолькоПросмотр = Истина;
		Элементы.КоличествоНеОбрабатываемыхСтрок.ТолькоПросмотр = Истина;
		Элементы.Табуляция.ТолькоПросмотр = Истина;
		Элементы.КодировкаЗагрузка.ТолькоПросмотр = Истина;
		Элементы.флПоискПоПрайсуПоставщика.ТолькоПросмотр = Истина;
		Элементы.ЗапретОбновленияСуществующихЭлементов.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитов.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитов.КоманднаяПанель.ТолькоПросмотр = Истина;
		Для Каждого Элемент Из Элементы.ТаблицаЗагружаемыхРеквизитов.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			Элемент.Доступность = Ложь;
		КонецЦикла;
		Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Ложь;
		Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Доступность = Ложь;
		Элементы.ПерваяСтрокаДанныхШапки.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапки.КоманднаяПанель.ТолькоПросмотр = Истина;
		Для Каждого Элемент Из Элементы.ТаблицаЗагружаемыхРеквизитовШапки.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			Элемент.Доступность = Ложь;
		КонецЦикла;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = Ложь;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Доступность = Ложь;
		Элементы.ДействиеСЗагружаемымФайлом.ТолькоПросмотр = Истина;
		Элементы.ИспользоватьВнешнийМодульПреобразованияФайла.ТолькоПросмотр = Истина;
		Элементы.КаталогАрхиваЗагруженныхФайлов.ТолькоПросмотр = Истина;
		Элементы.ОбработкаПреобразования.ТолькоПросмотр = Истина;
		// Вкладка выгрузки
		Элементы.ФорматФайла.ТолькоПросмотр = Истина;
		Элементы.КодировкаВыгрузка.ТолькоПросмотр = Истина;
		Элементы.ВыгружаемыеРеквизиты.ТолькоПросмотр = Истина;
		Элементы.ВыгружаемыеРеквизитыСобытия.Доступность = Ложь;
	#КонецЕсли
	
	ОбновитьОтображениеДанных();
	ОтображениеТабличногоДокумента = Ложь;
	ИзмененаРучнаяНумерацияКолонок = Ложь;
	РазвернутТабличныйДокумент = Ложь;
	УстановитьВидимостьТабличныйДокумент();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписьюНаСервере" формы
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Для выгрузки проверим уникальность представления полей
	Если Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		
		СоответствиеНеУникальныхПолейДБФ = Новый Соответствие();
		
		Для Каждого ПолеВыгрузки Из ВыгружаемыеРеквизиты Цикл
			
			// Если Поле ДБФ уже присутствует в соответствии, значит все варианты неуникальности уже были рассмотрены
			Если НЕ СоответствиеНеУникальныхПолейДБФ.Получить(ПолеВыгрузки.ПолеДБФ)=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НайденыСовпадения = Ложь;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'В строках №№ %1'"), ПолеВыгрузки.НомерСтроки);
			
			// Сравним с остальными строками построчно
			Для Каждого ПолеДляСравнения Из ВыгружаемыеРеквизиты Цикл
				
				// Пропустим туже самую строку
				Если ПолеВыгрузки.НомерСтроки=ПолеДляСравнения.НомерСтроки Тогда
					Продолжить;
				КонецЕсли;
				
				// Нашли совпадение полей ДБФ
				Если ПолеВыгрузки.ПолеДБФ=ПолеДляСравнения.ПолеДБФ Тогда
					
					// Проверим были ли уже совпадения по такому полю ДБФ
					НеУникальныеСтроки = СоответствиеНеУникальныхПолейДБФ.Получить(ПолеВыгрузки.ПолеДБФ);
					
					Если НеУникальныеСтроки=Неопределено Тогда
						Отказ = Истина;
						НайденыСовпадения = Истина;
						МассивСтрок = Новый Массив();
						МассивСтрок.Добавить(ПолеВыгрузки.НомерСтроки);
						МассивСтрок.Добавить(ПолеДляСравнения.НомерСтроки);
						СоответствиеНеУникальныхПолейДБФ.Вставить(ПолеВыгрузки.ПолеДБФ, МассивСтрок);
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1, %2'"), ТекстСообщения, ПолеДляСравнения.НомерСтроки);
					Иначе // Совпадения были, значит проверим номера строк, которые уже были проверены
						ИндексПолеВыгрузки     = НеУникальныеСтроки.Найти(ПолеВыгрузки.НомерСтроки);
						ИндексПолеДляСравнения = НеУникальныеСтроки.Найти(ПолеДляСравнения.НомерСтроки);
						Если ИндексПолеВыгрузки=Неопределено ИЛИ ИндексПолеДляСравнения=Неопределено Тогда
							Отказ = Истина;
							НайденыСовпадения = Истина;
							Если ИндексПолеВыгрузки=Неопределено Тогда
								НеУникальныеСтроки.Добавить(ПолеВыгрузки.НомерСтроки);
							КонецЕсли;
							Если ИндексПолеДляСравнения=Неопределено Тогда
								НеУникальныеСтроки.Добавить(ПолеДляСравнения.НомерСтроки);
							КонецЕсли;
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1, %2'"), ТекстСообщения, ПолеДляСравнения.НомерСтроки);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Если были найдены совпадения, то сообщим о них пользователю
			Если НайденыСовпадения Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 совпадают поля DBF'"), ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,"ВыгружаемыеРеквизиты");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана первая строка данных табличного документа",,,"ПерваяСтрокаДанныхТабличногоДокумента");
			Отказ = Истина;
		КонецЕсли;
		
		Если ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество()<>0 И ПерваяСтрокаДанныхШапки = 0 Тогда
			ТекстСообщения = "Не указана строка для загрузки данных шапки документа!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,"ПерваяСтрокаДанныхШапки");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		СохранитьНастройкиВХранилище(ТекущийОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "Нажатия" гиперссылки "тТабличныйДокумент"
//
&НаКлиенте
Процедура тТабличныйДокументНажатие(Элемент)
	
	УстановитьВидимостьТабличныйДокумент();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

// Процедура - обработчик события "При активизации области" табличного документа
//
&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если ЗначениеЗаполнено(НомерКолонки) Тогда
		РасставитьПометкиНаКнопках(НомерКолонки);
	КонецЕсли;
    ПодсветитьВыбраннуюКолонку(Неопределено);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ФайлДляИнтерактивнойНастройки"
//
&НаКлиенте
Процедура ФайлДляИнтерактивнойНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДляИнтерактивнойНастройки;
	ДиалогВыбораФайла.Заголовок = "Выбрать источник данных";
	ДиалогВыбораФайла.Фильтр = "Все форматы (*.dbf;*.xls;*.xlsx;*.txt;*.mxl;*.mdb;*.sst;*.mmo;*.xml)|*.dbf;*.xls;*.xlsx;*.txt;*.mxl;*.mdb;*.sst;*.mmo;*.xml|dBase III (*.dbf)|*.dbf|Лист Excel (*.xls)|*.xls|Лист Excel 2007 (*.xlsx)|*.xlsx|Бинарная рабочая книга Excel (*.xlsb)|*.xlsb|Лист Excel с поддержкой макросов (*.xlsm)|*.xlsm|Текстовый документ (*.txt)|*.txt|Табличный документ (*.mxl)|*.mxl|Microsoft Access(*.mdb)|*.mdb|Формат sst (*.sst)|*.sst|Формат mmo (*.mmo)|*.mmo|Формат xml (*.xml)|*.xml|Формат OpenOffice (*.ods)|*.ods|";
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДляИнтерактивнойНастройки = ДиалогВыбораФайла.ПолноеИмяФайла;

	Если ЗначениеЗаполнено(ФайлДляИнтерактивнойНастройки) Тогда
		ФайлДляИнтерактивнойНастройкиПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ФайлДляИнтерактивнойНастройки"
//
&НаКлиенте
Процедура ФайлДляИнтерактивнойНастройкиПриИзменении(Элемент)
	// Загрузка данных из файла
	ФайлНаДиске = Новый Файл(ФайлДляИнтерактивнойНастройки);
	Если НЕ ФайлНаДиске.Существует() ИЛИ ФайлНаДиске.ЭтоКаталог() Тогда
		ПоказатьПредупреждение(, "Файл данных не существует",,"Ошибка");
		Возврат;
	КонецЕсли;
	Если ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(ОбработкаПреобразования) Тогда
		ПоказатьПредупреждение(, "В настройке загрузки указано, что файл преобразовывается в табличный документ внешней обработкой, но обработка не указана!",,"Ошибка");
		Возврат;
	КонецЕсли;
	
	НачатьПомещениеФайлов(Новый ОписаниеОповещения("ФайлДляИнтерактивнойНастройкиПомещениеФайловЗавершение", ЭтотОбъект, Новый Структура("ФайлНаДиске", ФайлНаДиске)),,ФайлДляИнтерактивнойНастройки, Ложь, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ФайлДляИнтерактивнойНастройкиПомещениеФайловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВоВременномХранилище = Результат[0].Хранение;
	ФайлНаДиске = ДополнительныеПараметры.ФайлНаДиске;
	
	Если ИспользоватьВнешнийМодульПреобразованияФайла И ЗначениеЗаполнено(ОбработкаПреобразования) Тогда
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьТабличныйДокументИзXMLСервер(ФайлДляИнтерактивнойНастройки, ОбработкаПреобразования, ТабличныйДокумент, АдресВоВременномХранилище);
	Иначе
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПрочитатьТабличныйДокумент(ТабличныйДокумент, ФайлНаДиске.Расширение, ФайлНаДиске.ИмяБезРасширения, АдресВоВременномХранилище, Табуляция, Кодировка);
	КонецЕсли;
	РазвернутТабличныйДокумент = Истина;
	ТаблицаЗагружаемыхРеквизитовПриАктивизацииСтроки(Элементы.ТаблицаЗагружаемыхРеквизитов);
	ТаблицаЗагружаемыхРеквизитовШапкиПриАктивизацииСтроки(Неопределено);

КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "Наименование"
//
&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.Наименование = СформироватьНаименование();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИмяПрикладногоОбъекта"
//
&НаКлиенте
Процедура ИмяПрикладногоОбъектаПриИзменении(Элемент)
	
	// Отдадим уже готовое представление
	СписокДокументов = Элемент.СписокВыбора;
	ЭлементСписка = СписокДокументов.НайтиПоЗначению(Объект.ИмяПрикладногоОбъекта);
	Если ЭлементСписка<>Неопределено Тогда
		Объект.ПредставлениеПрикладногоОбъекта = ЭлементСписка.Представление;
	Иначе
		Объект.ПредставлениеПрикладногоОбъекта = Объект.ИмяПрикладногоОбъекта;
	КонецЕсли;
	
	ИмяТабличнойЧасти = "";
	
	ЗаполнитьСписокТабличныхЧастей();
	
	// Выберем первую доступную ТЧ
	СписокВыбора = Элементы.ИмяТабличнойЧасти.СписокВыбора;
	Если СписокВыбора.Количество()>0 И НЕ ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Объект.ИмяТабличнойЧасти = СписокВыбора[0].Значение;
		Объект.ПредставлениеТабличнойЧасти = СписокВыбора[0].Представление;
	КонецЕсли;
	
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИмяТабличнойЧасти"
//
&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	СписокТабличныхЧастей = Элемент.СписокВыбора;
	ЭлементСписка = СписокТабличныхЧастей.НайтиПоЗначению(Объект.ИмяТабличнойЧасти);
	Если ЭлементСписка <> Неопределено Тогда
		Объект.ПредставлениеТабличнойЧасти = ЭлементСписка.Представление;
	Иначе
		Объект.ПредставлениеТабличнойЧасти = Объект.ИмяТабличнойЧасти;
	КонецЕсли;
	
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТипПрикладногоОбъекта"
//
&НаКлиенте
Процедура ТипПрикладногоОбъектаПриИзменении(Элемент)
	
	Объект.ИмяПрикладногоОбъекта = "";
	
	Объект.ИмяТабличнойЧасти = "";
	
	ЗаполнитьСписокПрикладныхОбъектов();
	
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "Очистка" поля "КодировкаВыгрузка"
//
&НаКлиенте
Процедура КодировкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кодировка = "";
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ДействиеСЗагружаемымФайлом"
//
&НаКлиенте
Процедура ДействиеСЗагружаемымФайломПриИзменении(Элемент)
	
	УправлениеДиалогом();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "КаталогАрхиваЗагруженныхФайлов"
//
&НаКлиенте
Процедура КаталогАрхиваЗагруженныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Обработка выбора каталога хранения архива сохраняемых файлов
	СтандартнаяОбработка   = Ложь;
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.ПолноеИмяФайла = "";
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	
	// Определим, какой каталог выбираем
	ДиалогОткрытияКаталога.Заголовок = "Выберите каталог архива загружаемых файлов";
	ДиалогОткрытияКаталога.Каталог   = КаталогАрхиваЗагруженныхФайлов;
	
	// Предоставим выбор пользователю
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		КаталогАрхиваЗагруженныхФайлов = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИспользоватьВнешнийМодульПреобразованияФайла"
//
&НаКлиенте
Процедура ИспользоватьВнешнийМодульПреобразованияФайлаПриИзменении(Элемент)
	
	НастроитьДоступностьПоляОбработки();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ВариантИспользованияНастройки"
//
&НаКлиенте
Процедура ВариантИспользованияНастройкиПриИзменении(Элемент)
	
	Объект.ТипПрикладногоОбъекта = ПредопределенноеЗначение("Перечисление.ор_ТипыПрикладныхОбъектов.ПустаяСсылка");
	
	Объект.ИмяПрикладногоОбъекта = "";
	
	Объект.ИмяТабличнойЧасти = "";
	
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриСменеСтраницы" группы "ГруппаСтраницыНастройкиЗагрузки"
//
&НаКлиенте
Процедура ГруппаСтраницыНастройкиЗагрузкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЗаполнитьМассивКнопок();
	
	Если НЕ Элементы.ГруппаТабличныйДокумент.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	Иначе
		ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	КонецЕсли;
	
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьДополнительныеРеквизитыИСведенияПриИзменении(Элемент)
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыИСведенияТолькоОбщиеПриИзменении(Элемент)
	Если ДополнительныеРеквизитыИСведенияТолькоОбщие Тогда
		ДополнительныеРеквизитыПоКатегорииНоменклатуры.Очистить();
	КонецЕсли;
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПоКатегорииНоменклатурыПриИзменении(Элемент)
	УстановитьИсточник();
	
	УправлениеДиалогом();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаЗагружаемыхРеквизитов

// Процедура - обработчик события "ПередНачаломИзменения"  табличного поля "ТаблицаЗагружаемыхРеквизитов"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитов.Индекс(Элемент.ТекущиеДанные);
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элемент.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		СписокВыбора = ЗаполнитьСпискиВыбора(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
	КонецЕсли;
	
    Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры // ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения()

// Процедура - обработчик события "ПриАктивизацииСтроки"  табличного поля "ТаблицаЗагружаемыхРеквизитов"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПриАктивизацииСтроки(Элемент)
	
	// Проверка необходима для корректной работы при принудительном обновлении формы
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Иначе
		Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
	КонецЕсли;
	
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовВыражение"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовРежимПоиска"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СтандартнаяОбработка = ВозможностьУстановкиРежима;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТаблицаЗагружаемыхРеквизитовНомерКолонки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовНомерКолонкиПриИзменении(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовРежимЗагрузки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЗначениеПоУмолчанию = Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТекДанные.ДоступноеОписаниеТипов.Типы());
		ВыбранныйТип = Ждать СписокТипов.ВыбратьЭлементАсинх(НСтр("ru = 'Выбор типа данных'"));
		
		Если ВыбранныйТип <> Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ВыбранныйТип.Значение);
			ОписаниеВыбранныйТип = Новый ОписаниеТипов(МассивТипов);
			ТекДанные.ЗначениеПоУмолчанию = ОписаниеВыбранныйТип.ПривестиЗначение(ТекДанные.ЗначениеПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекДанные.ИмяРеквизита = "Родитель" Тогда
		
		ФормаВыбора = ПолучитьФормуВыбораОбъектаМетаданных(ТипЗнч(ТекДанные.ЗначениеПоУмолчанию));
		Если ФормаВыбора <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ОткрытьФорму(ФормаВыбора, ПараметрыФормы, Элемент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные.ЗначениеПоУмолчанию = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		
		ДанныеВыбораРодителя = ПолучитьДанныеВыбораРодителя(ТипЗнч(ТекДанные.ЗначениеПоУмолчанию), ПараметрыПолученияДанных, СтандартнаяОбработка);
		Если Не СтандартнаяОбработка Тогда
			ДанныеВыбора = ДанныеВыбораРодителя;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРодителя(Тип, ПараметрыПолученияДанных, СтандартнаяОбработка = Истина)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Не ОбъектМетаданных.Иерархический
		Или ОбъектМетаданных.ВидИерархии <> Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(ПараметрыПолученияДанных.СтрокаПоиска) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Таблица
		|ГДЕ
		|	Таблица.ЭтоГруппа");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура", ОбъектМетаданных.Имя);
		Выборка = Запрос.Выполнить().Выбрать();
		ДанныеВыбора = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ЭтоГруппа", Истина);
		
		ПараметрыПолученияДанных.Отбор = ПараметрыОтбора;
		ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		
		ДанныеВыбора = Справочники[ОбъектМетаданных.Имя].ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаЗагружаемыхРеквизитовШапки

// Процедура - обработчик события "ПриАктивизацииСтроки"  табличного поля "ТаблицаЗагружаемыхРеквизитовШапки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиПриАктивизацииСтроки(Элемент)
	
	// Проверка необходима для корректной работы при принудительном обновлении формы
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиТабличнойЧасти Тогда
		Возврат;
	КонецЕсли;
	
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "ПередНачаломИзменения"  табличного поля "ТаблицаЗагружаемыхРеквизитовШапки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиПередНачаломИзменения(Элемент, Отказ)
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитовШапки.Индекс(Элемент.ТекущиеДанные);
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элемент.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоТипу" Тогда
		СписокВыбора = ЗаполнитьСпискиВыбораШапка(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовШапкиРежимЗагрузки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонкиПриИзменении(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовШапкиВыражение"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовШапкиВыражениеНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовШапкиРежимПоиска"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СтандартнаяОбработка = ВозможностьУстановкиРежима;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЗначениеПоУмолчанию = Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТекДанные.ДоступноеОписаниеТипов.Типы());
		ВыбранныйТип = Ждать СписокТипов.ВыбратьЭлементАсинх(НСтр("ru = 'Выбор типа данных'"));
		
		Если ВыбранныйТип <> Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ВыбранныйТип.Значение);
			ОписаниеВыбранныйТип = Новый ОписаниеТипов(МассивТипов);
			ТекДанные.ЗначениеПоУмолчанию = ОписаниеВыбранныйТип.ПривестиЗначение(ТекДанные.ЗначениеПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекДанные <> Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные.ЗначениеПоУмолчанию = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ВыгружаемыеРеквизиты

// Процедура - обработчик события "ПриНачалеРедактирования" таблицы "ВыгружаемыеРеквизиты"
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НоваяСтрока Тогда
		ТекущиеДанные.ТипПоля = "Поле объекта";
		ТекущиеДанные.НомерСтроки = ВыгружаемыеРеквизиты.Индекс(ТекущиеДанные)+1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружаемыеРеквизитыПриИзменении(Элемент)
	
	ОбновитьНомераСтрокВыгружаемыхРеквизитов();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ВыгружаемыеРеквизитыТипПоля".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыТипПоляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПоля = "Выражение" Тогда
		
		ТекущиеДанные.Представление = "Произвольное выражение";
		ТекущиеДанные.Данные        = "Результат = Неопределено;";
		ТекущиеДанные.Тип = "";
		ТекущиеДанные.Длина = 0;
		ТекущиеДанные.Точность = 0;
		ТекущиеДанные.ПолеДБФ = "";
		
	Иначе
		
		ТекущиеДанные.Представление = "";
		ТекущиеДанные.Данные = "";
		ТекущиеДанные.Тип = "";
		ТекущиеДанные.Длина = 0;
		ТекущиеДанные.Точность = 0;
		ТекущиеДанные.ПолеДБФ = "";
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ВыгружаемыеРеквизитыПредставление".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПоля = "Поле объекта" Тогда
		
		СтруктураПараметров = Новый Структура("Представление,НачальныйПутьКДанным,АдресХранилищаМетаданныеИсточника,ТипПрикладногоОбъекта", ТекущиеДанные.Представление, ТекущиеДанные.Данные, АдресХранилищаМетаданныеИсточника, Объект.ТипПрикладногоОбъекта);
		Если Объект.ТипПрикладногоОбъекта = ПредопределенноеЗначение("Перечисление.ор_ТипыПрикладныхОбъектов.Обработка") Тогда
			СтруктураПараметров.Вставить("ИмяТабличнойЧасти", Объект.ИмяТабличнойЧасти);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ВыборПоля", СтруктураПараметров, Элемент,,,, Новый ОписаниеОповещения("ВыгружаемыеРеквизитыПредставлениеНачалоВыбораОткрытьФормуЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли ТекущиеДанные.ТипПоля = "Выражение" Тогда
		
		СтруктураПараметров = Новый Структура("Представление,Выражение", ТекущиеДанные.Представление, ТекущиеДанные.Данные);
		ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыраженияВыгрузка", СтруктураПараметров, Элемент,,,, Новый ОписаниеОповещения("ВыгружаемыеРеквизитыПредставлениеНачалоВыбораОткрытьФормуЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		ПоказатьПредупреждение(, "Не указан тип поля!");
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля "ВыгружаемыеРеквизитыПолеДБФ".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыПолеДБФОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Текст, Истина, "_") Тогда
		ТекстСообщения = НСтр("ru= 'Наименование поля DBF должно содержать только латинские буквы и знаки подчеркивания ""_""!'");
		ИндексСтроки = ВыгружаемыеРеквизиты.Индекс(Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВыгружаемыеРеквизиты["+Формат(ИндексСтроки, "ЧГ=0")+"].ПолеДБФ");
	КонецЕсли;
	
	КодСимволаПервойБуквы = КодСимвола(Лев(Текст, 1));
	
	ЭтоЛатинскаяБуква = НЕ ((КодСимволаПервойБуквы < 65) Или (КодСимволаПервойБуквы > 90 И КодСимволаПервойБуквы < 97) Или (КодСимволаПервойБуквы > 122));
	Если НЕ ЭтоЛатинскаяБуква Тогда
		ТекстСообщения = НСтр("ru= 'Наименование поля DBF должно начинаться с латинской буквы!'");
		ИндексСтроки = ВыгружаемыеРеквизиты.Индекс(Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВыгружаемыеРеквизиты["+Формат(ИндексСтроки, "ЧГ=0")+"].ПолеДБФ");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ПодключаемыеКнопкиНажатие"
//
&НаКлиенте
Процедура ПодключаемыеКнопкиНажатие(Команда)
	
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитовШапки;
		ЭтоСтраницаШапки = Истина;
	Иначе
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитов;
		ЭтоСтраницаШапки = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТек Из ТекущаяТаблица Цикл
		Если Команда.Имя = "ПодключаемаяКнопка_"+СтрокаТек.ИмяРеквизита Тогда
			Если Элементы[Команда.Имя].Пометка Тогда
				СтрокаТек.НомерКолонки = 0;
			Иначе
				СтрокаТек.НомерКолонки = НомерКолонки;
				Если Не СтрокаТек.Пометка Тогда
					СтрокаТек.Пометка = Истина;
				КонецЕсли;
				Если НЕ РучнаяНумерацияКолонокТабличногоДокумента И НЕ ЭтоСтраницаШапки Тогда
					РучнаяНумерацияКолонокТабличногоДокумента = Истина;
					УправлениеДиалогом();
				ИначеЕсли НЕ РучнаяНумерацияКолонокТабличногоДокументаДляШапки И ЭтоСтраницаШапки Тогда
					РучнаяНумерацияКолонокТабличногоДокументаДляШапки = Истина;
					УправлениеДиалогом();
				КонецЕсли;
			КонецЕсли;
			Модифицированность = Истина;
			РасставитьПометкиНаКнопках(НомерКолонки);
			РазобратьсяСОформлениемСтрок();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажки"
//
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажки"
//
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик команды "Перечитать"
//
&НаКлиенте
Процедура Перечитать(Команда)
	
	ЗаполнитьНастройкиКолонок();
	Модифицированность = Истина;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитов;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "События"
//
&НаКлиенте
Процедура События(Команда)
	
	ПараметрыФормы = Новый Структура("ПередЗаписьюОбъекта,ПриЗаписиОбъекта,ПослеДобавленияСтроки,ПередВыгрузкойОбъекта,ВариантИспользованияНастройки",ПередЗаписьюОбъекта,ПриЗаписиОбъекта,ПослеДобавленияСтроки,ПередВыгрузкойОбъекта, Объект.ВариантИспользованияНастройки);
	ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияСобытий",ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("СобытияОткрытьФормуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Заголовок = "ru = 'Загрузить настройки из файла'";
		ДиалогВыбораФайла.Фильтр    = "Файлы настроек (*.mxlz;*.mxla)|*.mxlz;*.mxla|Файлы настроек загрузки(*.mxlz)|*.mxlz|Файлы настроек выгрузки(*.mxla)|*.mxla|Все файлы (*.*)|*.*|";
		
		Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
			Возврат;
		КонецЕсли;
		
		Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Расширение = Нрег(Файл.Расширение);
		
		// Засунем файл во временное хранилище и перекинем на сервер
		
		НачатьПомещениеФайлов(Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершениеПомещенияФайлов", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, Расширение", ДиалогВыбораФайла, Расширение)),,ДиалогВыбораФайла.ПолноеИмяФайла,Ложь, Новый УникальныйИдентификатор);
		
	#Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Функциональность не поддерживается в веб-клиенте.'"));
	#КонецЕсли

КонецПроцедуры

// Процедура сохраняет настройки в файл
//
&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
			ТекстВопроса = НСтр("ru = 'Перед сохранением в файл элемент должен быть записан.
			                          |Записать?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьНастройкиВФайлВопросЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
		
		ЗаписьНастроекВФайл();
		
	#Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Функциональность не поддерживается в веб-клиенте.'"));
	#КонецЕсли
	
КонецПроцедуры

// Процедура - обработчик команды "ПеренумероватьКолонки"
//
&НаКлиенте
Процедура ПеренумероватьКолонки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитов;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "РучнаяНумерацияКолонокТабличногоДокумента"
//
&НаКлиенте
Процедура РучнаяНумерацияКолонокТабличногоДокумента(Команда)
	
	УстановитьРучнаяНумерацияКолонок();
	Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность                 = РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость                            = РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = РучнаяНумерацияКолонокТабличногоДокумента;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	
КонецПроцедуры

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуАптекаХолд".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуАптекаХолд(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаАптекаХолд");
КонецПроцедуры // -- отраслевое

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуГенезис".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуГенезис(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаГенезис");
КонецПроцедуры  // --  Отраслевое

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуКатрен".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуКатрен(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаКатрен");
КонецПроцедуры // -- Отраслевое

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуМорон".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуМорон(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаМорон");
КонецПроцедуры  // -- Отраслевое

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуПротек".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуПротек(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаПротек");
КонецПроцедуры // -- Отраслевое 

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуСиа".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуСиа(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаСиа");
КонецПроцедуры // -- Отраслевое 

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуЗагрузкаФальсификатовMDB".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуЗагрузкаФальсификатовMDB(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаЗагрузкаФальсификатовMDB");
КонецПроцедуры // -- Отраслевое

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуЗагрузкаФальсификатовDBF".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуЗагрузкаФальсификатовDBF(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаЗагрузкаФальсификатовDBF");
КонецПроцедуры  // -- Отраслевое 

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуЗагрузкаЦенЖНВЛС".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуЗагрузкаЦенЖНВЛС(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаЗагрузкаЦенЖНВЛС");
КонецПроцедуры // -- Отраслевое 

// Отраслевое -- Процедура - обработчик команды "ЗагрузитьНастройкуЗагрузкаЦенЖНВЛСНедействующие".
//
&НаКлиенте
Процедура ЗагрузитьНастройкуЗагрузкаЦенЖНВЛСНедействующие(Команда)
	ЗагрузитьНастройкуИзПоставки("НастройкаЗагрузкаЦенЖНВЛСНедействующие");
КонецПроцедуры // -- Отраслевое

// Процедура - обработчик команды "УстановитьКолонку"
//
&НаКлиенте
Процедура УстановитьКолонку(Команда)
	
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ТекСтрока = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
		ЭтоСтраницаШапки = Истина;
	Иначе
		ТекСтрока = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
		ЭтоСтраницаШапки = Ложь;
	КонецЕсли;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.НомерКолонки = НомерКолонки Тогда
		Возврат;
	ИначеЕсли ТекСтрока.НомерКолонки<>0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьКолонкуВопросЗавершение", ЭтотОбъект, Новый Структура("НомерКолонки, ТекСтрока, ЭтоСтраницаШапки", НомерКолонки, ТекСтрока, ЭтоСтраницаШапки)),
		"Для текущего реквизита """+СокрЛП(ТекСтрока.ПредставлениеРеквизита)+""" уже установлен номер колонки "+ТекСтрока.НомерКолонки+". Изменить его на номер "+НомерКолонки+"?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОбработкаКолонки(НомерКолонки, ТекСтрока, ЭтоСтраницаШапки);
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажкиНастройкиШапки"
//
&НаКлиенте
Процедура СнятьФлажкиНастройкиШапки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитовШапки);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажкиНастройкиШапки"
//
&НаКлиенте
Процедура УстановитьФлажкиНастройкиШапки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитовШапки);
	
КонецПроцедуры

// Процедура - обработчик команды "ПеречитатьНастройкиШапки"
//
&НаКлиенте
Процедура ПеречитатьНастройкиШапки(Команда)
	
	ЗаполнитьНастройкиКолонокШапки();
	Модифицированность = Истина;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитовШапки;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "РучнаяНумерацияКолонокНастройкиШапки"
//
&НаКлиенте
Процедура РучнаяНумерацияКолонокНастройкиШапки(Команда)
	
	УстановитьРучнаяНумерацияКолонокНастройкиШапки();
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость                          = РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка    = РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	
КонецПроцедуры

// Процедура - обработчик команды "ПеренумероватьКолонкиНастройкиШапки"
//
&НаКлиенте
Процедура ПеренумероватьКолонкиНастройкиШапки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитовШапки;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура установки условного оформления строк таблицы
//
&НаКлиенте
Процедура РазобратьсяСОформлениемСтрок()
	
	Если ТабличныйДокумент.ТекущаяОбласть <> Неопределено Тогда
		НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	КонецЕсли;
	
	Если ЭтотОбъект.ТекущийЭлемент <> Элементы.ТабличныйДокумент
		ИЛИ ТабличныйДокумент.ТекущаяОбласть = Неопределено Тогда
		НомерКолонки = 0;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
			СтрокаТаблицы.ПодсвечиватьСтроку = ?(НомерКолонки = 0, Ложь, НомерКолонки = СтрокаТаблицы.НомерКолонки);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицаЗагружаемыхРеквизитов Цикл
			СтрокаТаблицы.ПодсвечиватьСтроку = ?(НомерКолонки = 0, Ложь, НомерКолонки = СтрокаТаблицы.НомерКолонки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, устанавливает видимость табличного документа
//
&НаКлиенте
Процедура УстановитьВидимостьТабличныйДокумент()
	Если ОтображениеТабличногоДокумента Тогда
		Элементы.тТабличныйДокумент.Заголовок="Свернуть табличный документ";
		Элементы.ГруппаТабличныйДокумент.Видимость = Истина;
		Элементы.ФайлДляИнтерактивнойНастройки.Доступность = Истина;
	Иначе
		Элементы.тТабличныйДокумент.Заголовок="Развернуть табличный документ";
		Элементы.ГруппаТабличныйДокумент.Видимость = Ложь;
		Элементы.ФайлДляИнтерактивнойНастройки.Доступность = Ложь;
	КонецЕсли; 
	ОтображениеТабличногоДокумента = НЕ ОтображениеТабличногоДокумента;
	РазвернутТабличныйДокумент = Истина;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	Иначе
		ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	КонецЕсли;
	
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура заполнения контекстного меню табличного документа
//
&НаСервере
Процедура ЗаполнитьМассивКнопок()
	
	МассивКнопокДляУдаления = Новый Массив;
	Для Каждого СуществующаяКнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		МассивКнопокДляУдаления.Добавить(СуществующаяКнопка);
	КонецЦикла;
	
	Для Каждого Кнопка Из МассивКнопокДляУдаления Цикл
		НайденнаяКоманда = Команды.Найти(Кнопка.Имя);
		Если НайденнаяКоманда <> Неопределено Тогда
			Команды.Удалить(НайденнаяКоманда);
		КонецЕсли;
		Если Элементы.Найти(Кнопка.Имя) <> Неопределено Тогда
			Элементы.Удалить(Кнопка);
		КонецЕсли;
	КонецЦикла;
	
	ИмяДействия = "ПодключаемыеКнопкиНажатие";
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитовШапки;
		ЭтоСтраницаШапки = Истина;
	Иначе
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитов;
		ЭтоСтраницаШапки = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТекущаяТаблица Цикл
		Если НЕ ЭтоСтраницаШапки И СтрокаТЧ.ЭтоДополнительныйРеквизит Тогда
			Продолжить;
		КонецЕсли;
		ИмяКнопки = "ПодключаемаяКнопка_"+СокрЛП(СтрокаТЧ.ИмяРеквизита);
		Команда = Команды.Найти(ИмяКнопки);
		
		Если Команда = Неопределено Тогда
			Команда = Команды.Добавить(ИмяКнопки);
		КонецЕсли;
		
		Кнопка = Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"), Элементы.ТабличныйДокументКонтекстноеМеню);
		Команда.Действие = ИмяДействия;
		Кнопка.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), СтрокаТЧ.ПредставлениеРеквизита);
		Кнопка.ИмяКоманды = ИмяКнопки;
	КонецЦикла;

КонецПроцедуры

// Процедура расстановки пометок на кнопках контекстного меню табличного документа
//
&НаСервере
Процедура РасставитьПометкиНаКнопках(НомерКолонки)
	
	Если ОтображениеТабличногоДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПомеченныхКолонок = Новый Массив;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		СтрокиТЧ = ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("НомерКолонки", НомерКолонки));
	Иначе
		СтрокиТЧ = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("НомерКолонки", НомерКолонки));
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		ИменаПомеченныхКолонок.Добавить("ПодключаемаяКнопка_"+СокрЛП(СтрокаТЧ.ИмяРеквизита));
	КонецЦикла;
	
	Для Каждого Кнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		Кнопка.Пометка = ИменаПомеченныхКолонок.Найти(Кнопка.Имя)<>Неопределено;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выделения цветом нужной колонки табличного документа
//
&НаКлиенте
Процедура ПодсветитьВыбраннуюКолонку(ТекТаблицаФормы)
	
	Если НЕ Элементы.ГруппаТабличныйДокумент.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекТаблицаФормы = Неопределено И (ИзмененаРучнаяНумерацияКолонок ИЛИ РазвернутТабличныйДокумент) Тогда
		РазвернутТабличныйДокумент = Ложь;
		ИзмененаРучнаяНумерацияКолонок = Ложь;
		Возврат;
	КонецЕсли;
	
	ТипЛинииРамки 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1, 0);

	ЦветРамки = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаКнопки");
	
	ТекОбласть 				= ТабличныйДокумент.Область(1,1,ТабличныйДокумент.ВысотаТаблицы,ТабличныйДокумент.ШиринаТаблицы);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаПоля");

	Если ТекТаблицаФормы = Неопределено Тогда
		// Позиционировались на колонке
		НомерКолонкиПодсветки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Иначе
		ТекСтрока 		= ТекТаблицаФормы.ТекущиеДанные;
		Если ТекСтрока = Неопределено ИЛИ ТекСтрока.НомерКолонки = 0 Тогда
			Возврат;
		КонецЕсли;
		НомерКолонкиПодсветки = ТекСтрока.НомерКолонки;
	КонецЕсли;
	
	ТекОбласть = ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, ТабличныйДокумент.ВысотаТаблицы, НомерКолонкиПодсветки);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаШапкиОтчета");
	
	Если ТекТаблицаФормы<>Неопределено Тогда
		ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, 1, НомерКолонкиПодсветки);
	КонецЕсли;
	ТабличныйДокумент.ОтображатьСетку = Истина;
	
КонецПроцедуры

// Процедура формирует наименование объекта
//
// Возвращаемое значение:
//    Строка - Наименование
//
&НаКлиенте
Функция СформироватьНаименование()
	
	// Формируем наименование в зависимости от заполненных реквизитов
	Если ПустаяСтрока(Объект.ПредставлениеПрикладногоОбъекта) Тогда
		Возврат "";
	КонецЕсли;
	
	НовоеНаименование = Объект.ПредставлениеПрикладногоОбъекта;
	
	Если НЕ ПустаяСтрока(Объект.ПредставлениеТабличнойЧасти) И НЕ Объект.ТипПрикладногоОбъекта=ПредопределенноеЗначение("Перечисление.ор_ТипыПрикладныхОбъектов.Справочник") Тогда
		Возврат НовоеНаименование+" ("+Объект.ПредставлениеТабличнойЧасти+")";
	КонецЕсли;
	
	// Вернем результат
	Возврат НовоеНаименование;
	
КонецФункции // СформироватьНаименование()

// Процедура перенумеровки строк выгружаемых реквизитов
//
&НаКлиенте
Процедура ОбновитьНомераСтрокВыгружаемыхРеквизитов()
	
	Для Каждого Строка Из ВыгружаемыеРеквизиты Цикл
		
		Строка.НомерСтроки = ВыгружаемыеРеквизиты.Индекс(Строка)+1;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает транслитерированный текст
//
// Параметры:
//  Текст  - Строка	- Исходный текст
//
// Возвращаемое значение:
//  Строка - Транслитерированный текст
//
&НаКлиенте
Функция Транслитерация(Текст)
	
	// Поле КоличествоУпаковок ТЧ документов будем обрабатывать отдельно
	Если Текст = "Количество упаковок" Тогда
		Возврат "Kol_upakov";
	КонецЕсли;
	
	// Заполняем список соответствий
	РезультирующийТекст = "";
	ДлинаТекста = СтрДлина(Текст);
	Для Сч = 1 По ДлинаТекста Цикл
		
		Символ = Сред(Текст,Сч,1);
		КодСимвола = КодСимвола(Символ);
		
		Латинская = (КодСимвола>=КодСимвола("A") И КодСимвола<=КодСимвола("Z")) ИЛИ (КодСимвола>=КодСимвола("a") И КодСимвола<=КодСимвола("z"));
		
		Если НЕ Латинская Тогда
			РусскаяЗаглавная = (КодСимвола>=КодСимвола("А") И КодСимвола<=КодСимвола("Я")) ИЛИ Символ = "Ё";
			Соответствие = СписокСоответствийТранслитерации.НайтиПоЗначению(Нрег(Символ));
			Если Соответствие = Неопределено Тогда
				Символ = "";
			Иначе
				Символ = Соответствие.Представление;
				Если РусскаяЗаглавная Тогда
					ПервыйСимвол = Сред(Символ,1,1);
					Символ = Врег(ПервыйСимвол)+Сред(Символ,2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		РезультирующийТекст = РезультирующийТекст + Символ;
		
	КонецЦикла;
	
	Пока Истина Цикл
		Если Лев(РезультирующийТекст, 1)="_" Тогда
			РезультирующийТекст = Сред(РезультирующийТекст, 2);
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультирующийТекст;
	
КонецФункции

// Процедура настройки доступности поля обработки
//
&НаСервере
Процедура НастроитьДоступностьПоляОбработки()
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") Тогда
		Элементы.ИспользоватьВнешнийМодульПреобразованияФайла.Видимость = Истина;
		Элементы.ОбработкаПреобразования.Видимость = Истина;
		Если ИспользоватьВнешнийМодульПреобразованияФайла Тогда
			Элементы.ОбработкаПреобразования.Доступность = Истина;
			Элементы.ОбработкаПреобразования.АвтоОтметкаНезаполненного = Истина;
		Иначе
			Элементы.ОбработкаПреобразования.Доступность = Ложь;
			Элементы.ОбработкаПреобразования.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ИспользоватьВнешнийМодульПреобразованияФайла.Видимость = Ложь;
		Элементы.ОбработкаПреобразования.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

// Управляет доступностью/видимостью элементов диалога
//
&НаСервере
Процедура УправлениеДиалогом()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	ДоступностьЭлементаФормы = ЗначениеЗаполнено(Объект.ИмяПрикладногоОбъекта) И (Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ);
	Элементы.ИмяТабличнойЧасти.Доступность = ДоступностьЭлементаФормы;
	Элементы.ИмяТабличнойЧасти.АвтоОтметкаНезаполненного = ДоступностьЭлементаФормы;
	Элементы.ИмяТабличнойЧасти.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) И (Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ);
	
	ДоступностьЭлементаФормы = ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта);
	Элементы.ИмяПрикладногоОбъекта.Доступность = ДоступностьЭлементаФормы;
	
	ДоступностьЭлементаФормы = ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки);
	Элементы.ТипПрикладногоОбъекта.Доступность = ДоступностьЭлементаФормы;
	
	НастройкаДоступна = МетаданныеИсточника <> Неопределено;
	
	Если Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Ложь;
		Элементы.ГруппаНастройкиВыгрузки.Видимость = Истина;
		Элементы.ГруппаНастройкиВыгрузки.Доступность = НастройкаДоступна;
		
		Если НастройкаДоступна Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиВыгрузки;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаГлавное;
		КонецЕсли;
		
		Элементы.ГруппаЗагрузкаДопРеквизитов.Видимость	  = Ложь;

	ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		
		Элементы.ГруппаНастройкиВыгрузки.Видимость = Ложь;
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Истина;
		Элементы.ГруппаНастройкиЗагрузки.Доступность = НастройкаДоступна; 
		
		Если ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) И Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
			Элементы.ГруппаСтраницаНастройкиШапки.Видимость = Истина;
			Элементы.ГруппаСтраницыНастройкиЗагрузки.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
			
			Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
			Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость                          = РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
			Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка    = РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
			
		Иначе
			Элементы.ГруппаСтраницаНастройкиШапки.Видимость = Ложь;
			Элементы.ГруппаСтраницыНастройкиЗагрузки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		КонецЕсли;
		
		Если НастройкаДоступна Тогда
			Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность                 = РучнаяНумерацияКолонокТабличногоДокумента;
			Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость                            = РучнаяНумерацияКолонокТабличногоДокумента;
			Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = РучнаяНумерацияКолонокТабличногоДокумента;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиЗагрузки;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаГлавное;
		КонецЕсли;
		
		Элементы.ТаблицаЗагружаемыхРеквизитовПолеПоиска.Видимость         = Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПолеПоиска.Видимость    = Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
		
		Элементы.ЗапретСозданияНовыхЭлементов. Видимость         = Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
		Элементы.ЗапретОбновленияСуществующихЭлементов.Видимость = Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
		Элементы.флПоискПоПрайсуПоставщика.Видимость	         = Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ;
		Элементы.ТаблицаЗагружаемыхРеквизитовДополнительныеПараметрыЗагрузки.Доступность = (Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ) ИЛИ (Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник И Объект.ИмяПрикладногоОбъекта = "Номенклатура");
		Элементы.ТаблицаЗагружаемыхРеквизитовРежимПоиска.Видимость         = НЕ (Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРежимПоиска.Видимость    = НЕ (Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
		
		ЭтоЗагрузкаВСправочникНоменклатура = Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник И Объект.ИмяПрикладногоОбъекта = "Номенклатура";
		
		ЭтоЗагрузкаВНоменклатуру 	= МетаданныеИсточника<>Неопределено И Метаданные.Справочники.Найти(МетаданныеИсточника.Имя)<>Неопределено И МетаданныеИсточника.Имя = "Номенклатура";
		ЭтоЗагрузкаХарактеристик 	= МетаданныеИсточника<>Неопределено И Метаданные.Справочники.Найти(МетаданныеИсточника.Имя)<>Неопределено И МетаданныеИсточника.Имя = "ХарактеристикиНоменклатуры";
		
		Элементы.ГруппаЗагрузкаДопРеквизитов.Видимость	  = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И (ЭтоЗагрузкаВНоменклатуру ИЛИ ЭтоЗагрузкаХарактеристик);
		Элементы.ГруппаОтборРеквизитов.Видимость		  = ЗагружатьДополнительныеРеквизитыИСведения;
		
		Элементы.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Доступность = НЕ ДополнительныеРеквизитыИСведенияТолькоОбщие;
		
	Иначе
		
		Элементы.ГруппаНастройкиВыгрузки.Видимость = Ложь;
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.КаталогАрхиваЗагруженныхФайлов.Доступность = ДействиеСЗагружаемымФайлом = 0;
	Элементы.КаталогАрхиваЗагруженныхФайлов.АвтоОтметкаНезаполненного = ДействиеСЗагружаемымФайлом = 0;
	// + ОР РежимВыбораИзСписка
	Элементы.ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу.КнопкаВыбора = Истина;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу.КнопкаВыбора = Истина;
	Элементы.ВариантИспользованияНастройки.КнопкаВыбора = Истина;
	Элементы.ТипПрикладногоОбъекта.КнопкаВыбора = Истина;
	// - ОР РежимВыбораИзСписка
	НастроитьДоступностьПоляОбработки();
	
КонецПроцедуры // УправлениеДиалогом()

// Функция определить возможность установки режима поиска для текущих данных
//
&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

// Функция определить возможность установки режима загрузки для текущих данных
//
&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

// Первоначальное заполнение КЕШей и рабочих переменных при открытии формы
//
&НаСервере
Процедура Инициализация()
	
	// Инициализируем вспомогательные переменные
	МенеджерыОбъектовМетаданных = Новый Структура("Справочники, Перечисления, Документы, ПланыВидовХарактеристик, ПланыСчетов, ПланыВидовРасчета, БизнесПроцессы, Задачи",Справочники,Перечисления,Документы,ПланыВидовХарактеристик,ПланыСчетов,ПланыВидовРасчета,БизнесПроцессы,Задачи);
	АдресХранилищаМенеджерыОбъектовМетаданных = ПоместитьВоВременноеХранилище(МенеджерыОбъектовМетаданных, УникальныйИдентификатор);
	
	КешМенеджеровПоТипу = Новый Соответствие;
	
	// Заполним кэш для ускорения интерактивной работы
	Картинка = БиблиотекаКартинок.СправочникОбъект; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхСправочник Из Метаданные.Справочники  Цикл
		// Условие для справочника "Календари" убрать, если Розница укажет корректное представление данного объекта.
		Если ОбъектМетаданныхСправочник.Имя = "Календари" Тогда
			СписокСправочниковКЕШ.Добавить(ОбъектМетаданныхСправочник.Имя, "Календари",, Картинка);
		Иначе
			СписокСправочниковКЕШ.Добавить(ОбъектМетаданныхСправочник.Имя, ОбъектМетаданныхСправочник.Представление(),, Картинка);
		КонецЕсли;
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.ДокументОбъект; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхДокумент Из Метаданные.Документы Цикл
		Если ОбъектМетаданныхДокумент.ТабличныеЧасти.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		СписокДокументовКЕШ.Добавить(ОбъектМетаданныхДокумент.Имя,ОбъектМетаданныхДокумент.Представление(),,Картинка);
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.Обработка; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхОбработка Из Метаданные.Обработки Цикл
		Если ОбъектМетаданныхОбработка.ТабличныеЧасти.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		СписокОбработокКЕШ.Добавить(ОбъектМетаданныхОбработка.Имя,ОбъектМетаданныхОбработка.Представление(),,Картинка);
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.РегистрСведений; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхРегистр Из Метаданные.РегистрыСведений Цикл
		Если ОбъектМетаданныхРегистр.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору
			Или ОбъектМетаданныхРегистр = Метаданные.РегистрыСведений.СопутствующиеТовары Тогда
			Продолжить;
		КонецЕсли;
		СписокРегистровСведенийКЕШ.Добавить(ОбъектМетаданныхРегистр.Имя,ОбъектМетаданныхРегистр.Представление(),,Картинка);
	КонецЦикла;
	
	// Заполним списки выбора для настроек выгрузки
	СписокВыбора = Элементы.ВыгружаемыеРеквизиты.ПодчиненныеЭлементы.ВыгружаемыеРеквизитыТипПоля.СписокВыбора;
	СписокВыбора.Добавить("Поле объекта");
	СписокВыбора.Добавить("Выражение");
	
	Элементы.ФорматФайла.СписокВыбора.Добавить("DBF");
	ФорматФайла = Элементы.ФорматФайла.СписокВыбора[0].Значение;
	
КонецПроцедуры

// Первоначальное заполнение рабочих переменных при открытии формы
//
&НаКлиенте
Процедура ИнициализацияСписковИСоответствий()
	
	СоответствиеТиповИПредставленийDBF = Новый Соответствие;
	СоответствиеТиповИПредставленийDBF.Вставить("S", "Строка");
	СоответствиеТиповИПредставленийDBF.Вставить("N", "Число");
	СоответствиеТиповИПредставленийDBF.Вставить("L", "Булево");
	СоответствиеТиповИПредставленийDBF.Вставить("D", "Дата");
	СписокВыбора = Элементы.ВыгружаемыеРеквизиты.ПодчиненныеЭлементы.ВыгружаемыеРеквизитыТип.СписокВыбора;
	Для Каждого КлючИЗначение Из СоответствиеТиповИПредставленийDBF Цикл
		СписокВыбора.Добавить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	СписокСоответствийТранслитерации = Новый СписокЗначений;
	СписокСоответствийТранслитерации.Добавить("й","iy");
	СписокСоответствийТранслитерации.Добавить("ц","ts");
	СписокСоответствийТранслитерации.Добавить("у","u");
	СписокСоответствийТранслитерации.Добавить("к","k");
	СписокСоответствийТранслитерации.Добавить("е","e");
	СписокСоответствийТранслитерации.Добавить("н","n");
	СписокСоответствийТранслитерации.Добавить("г","g");
	СписокСоответствийТранслитерации.Добавить("ш","sh");
	СписокСоответствийТранслитерации.Добавить("щ","shch");
	СписокСоответствийТранслитерации.Добавить("з","z");
	СписокСоответствийТранслитерации.Добавить("х","h");
	СписокСоответствийТранслитерации.Добавить("ъ","");
	СписокСоответствийТранслитерации.Добавить("ф","f");
	СписокСоответствийТранслитерации.Добавить("ы","y");
	СписокСоответствийТранслитерации.Добавить("в","v");
	СписокСоответствийТранслитерации.Добавить("а","a");
	СписокСоответствийТранслитерации.Добавить("п","p");
	СписокСоответствийТранслитерации.Добавить("р","r");
	СписокСоответствийТранслитерации.Добавить("о","o");
	СписокСоответствийТранслитерации.Добавить("л","l");
	СписокСоответствийТранслитерации.Добавить("д","d");
	СписокСоответствийТранслитерации.Добавить("ж","zh");
	СписокСоответствийТранслитерации.Добавить("э","e");
	СписокСоответствийТранслитерации.Добавить("я","ya");
	СписокСоответствийТранслитерации.Добавить("ч","ch");
	СписокСоответствийТранслитерации.Добавить("с","s");
	СписокСоответствийТранслитерации.Добавить("м","m");
	СписокСоответствийТранслитерации.Добавить("и","i");
	СписокСоответствийТранслитерации.Добавить("т","t");
	СписокСоответствийТранслитерации.Добавить("ь","");
	СписокСоответствийТранслитерации.Добавить("б","b");
	СписокСоответствийТранслитерации.Добавить("ю","you");
	СписокСоответствийТранслитерации.Добавить("ё","ye");
	СписокСоответствийТранслитерации.Добавить(" ","_");
	
КонецПроцедуры

// Процедура выполняет установку реквизитов, связанных с источником данных
//
&НаСервере
Процедура УстановитьИсточник(ЗаполнитьПредставления = Ложь)
	
	// Установим ускоряющую переменную модуля
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(ЗаполнитьПредставления);
	Если МетаданныеИсточника = Неопределено Тогда
		АдресХранилищаМетаданныеИсточника = "";
	Иначе
		АдресХранилищаМетаданныеИсточника = ПоместитьВоВременноеХранилище(МетаданныеИсточника.ПолноеИмя(), УникальныйИдентификатор);
	Конецесли;
	
	// Заполним список реквизитов ТЧ
	Если Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		ЗаполнитьНастройкиКолонок();
		ЗаполнитьНастройкиКолонокШапки();
	ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		ЗаполнитьНастройкиКолонокВыгрузки();
	КонецЕсли;
	
КонецПроцедуры // УстановитьИсточник()

// Функция возвращает метаданные источника данных
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   ОбъектМетаданныхТабличнаяЧасть	- Объект метаданных
//
&НаСервере
Функция ПолучитьМетаданныеИсточника(ЗаполнитьПредставления = Ложь)
	
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		ОбъектМетаданныхСправочник = Метаданные.Справочники.Найти(Объект.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхСправочник<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				Объект.ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхСправочник.Представление();
			КонецЕсли;
			Возврат ОбъектМетаданныхСправочник;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		ОбъектМетаданныхДокумент = Метаданные.Документы.Найти(Объект.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхДокумент<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				Объект.ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхДокумент.Представление();
			КонецЕсли;
			ОбъектМетаданныхТабличнаяЧасть = ОбъектМетаданныхДокумент.ТабличныеЧасти.Найти(Объект.ИмяТабличнойЧасти);
			Если ОбъектМетаданныхТабличнаяЧасть<>Неопределено Тогда
				Если ЗаполнитьПредставления Тогда
					Объект.ПредставлениеТабличнойЧасти = ОбъектМетаданныхТабличнаяЧасть.Представление();
				КонецЕсли;
				Возврат ОбъектМетаданныхТабличнаяЧасть;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка Тогда
		ОбъектМетаданныхОбработка = Метаданные.Обработки.Найти(Объект.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхОбработка<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				Объект.ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхОбработка.Представление();
			КонецЕсли;
			Возврат ОбъектМетаданныхОбработка;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
		ОбъектМетаданныхРегистр = Метаданные.РегистрыСведений.Найти(Объект.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхРегистр<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				Объект.ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхРегистр.Представление();
			КонецЕсли;
			Возврат ОбъектМетаданныхРегистр;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьМетаданныеИсточника()

// Функция возвращает метаданные источника данных из временного хранилища
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   ОбъектМетаданныхТабличнаяЧасть	- Объект метаданных
//
&НаСервере
Функция ПолучитьМетаданныеИсточникаИзВременногоХранилища()
	
	Если ЗначениеЗаполнено(АдресХранилищаМетаданныеИсточника) И МетаданныеИсточника = Неопределено Тогда
		МетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(ПолучитьИзВременногоХранилища(АдресХранилищаМетаданныеИсточника));
	КонецЕсли;
	
	Возврат МетаданныеИсточника;
	
КонецФункции

// Процедура изменения настройки ручной нумерации колонок
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонок()
	
	РучнаяНумерацияКолонокТабличногоДокумента = НЕ РучнаяНумерацияКолонокТабличногоДокумента;
	
КонецПроцедуры

// Процедура изменения настройки ручной нумерации колонок настроек загрузки шапки документа
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонокНастройкиШапки()
	
	РучнаяНумерацияКолонокТабличногоДокументаДляШапки = НЕ РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	
КонецПроцедуры

#Область НастройкиВыгрузки

// Процедура создает новый табличный документ на основании данных формы (выгрузка)
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//  ТабличныйДокумент - Настройки собранные в табличный документ для хранения в реквизите "НастройкиЗагрузкиВыгрузки"
//  Неопределено      - Возвращается если не указанны все необходимые данные 
//
&НаСервере
Функция ЗаполнитьТабличныйДокументИзНастроекВыгрузки()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Макет = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетСохраненияНастроекВыгрузки");
	
	ОбластьШапки  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		ТипОбъекта = "табличная часть документа";
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		ТипОбъекта = "справочник";
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка Тогда
		ТипОбъекта = "табличная часть обработки";
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
		ТипОбъекта = "регистр сведений";
	КонецЕсли;
	
	ОбластьШапки.Параметры.ТипОбъекта  = ТипОбъекта;
	ОбластьШапки.Параметры.Объект      = МетаданныеИсточника.ПолноеИмя();
	ОбластьШапки.Параметры.ФорматФайла = ФорматФайла;
	ОбластьШапки.Параметры.Кодировка   = Кодировка;
	ОбластьШапки.Параметры.ПередВыгрузкойОбъекта = ПередВыгрузкойОбъекта;
	ОбластьШапки.Параметры.ПослеДобавленияСтроки = ПослеДобавленияСтроки;
	ДокументРезультат.Вывести(ОбластьШапки);
	
	Для Каждого Строка Из ВыгружаемыеРеквизиты Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Строка, "ТипПоля,Представление,ПолеДБФ,Тип,Данные");
		ОбластьСтроки.Параметры.Длина       = Формат(Строка.Длина,"ЧН=0; ЧГ=0");
		ОбластьСтроки.Параметры.Точность    = Формат(Строка.Точность,"ЧН=0; ЧГ=0");
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции // ЗаполнитьТабличныйДокументИзНастроекВыгрузки()

// Процедура заполняет настройки формы на основании табличного документа (выгрузка)
//
// Параметры:
//  Настройки - ТабличныйДокумент - Табличный документ
//
// Возвращаемое значение:
//  Булево - признак успешности выполнения операции
//
&НаСервере
Функция ЗаполнитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента"));
	
	СтруктураНастроек = ОбработкаОбъект.ПолучитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки);
	Если СтруктураНастроек=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мТипПрикладногоОбъекта = СтруктураНастроек.ТипПрикладногоОбъекта;
	мМетаданныеИсточника   = СтруктураНастроек.МетаданныеИсточника;
	мФорматФайла           = СтруктураНастроек.ФорматФайла;
	мКодировка             = СтруктураНастроек.Кодировка;
	мВыгружаемыеРеквизиты  = СтруктураНастроек.ВыгружаемыеРеквизиты;
	мПередВыгрузкойОбъекта = СтруктураНастроек.ПередВыгрузкойОбъекта;
	мПослеДобавленияСтроки = СтруктураНастроек.ПослеДобавленияСтроки;
	
	// Принимаем файл как корректный, переписываем значения реквизитов значениями из промежуточных переменных
	Если Объект.ВариантИспользованияНастройки <> Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Если ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Вариант использования настройки изменен на %1'"), Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных;
	КонецЕсли;
	
	Если Объект.ТипПрикладногоОбъекта <> мТипПрикладногоОбъекта Тогда
		Если ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Тип объекта изменен на %1'"), мТипПрикладногоОбъекта);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		Объект.ТипПрикладногоОбъекта = мТипПрикладногоОбъекта;
	КонецЕсли;
	
	Если МетаданныеИсточника<>мМетаданныеИсточника Тогда
		
		Если МетаданныеИсточника<>Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Объект и/или табличная часть изменена %1 -> %2'"), МетаданныеИсточника.ПолноеИмя(), мМетаданныеИсточника.ПолноеИмя());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		// Заполним служебную переменную
		МетаданныеИсточника = мМетаданныеИсточника;
		
		// Заполним реквизиты справочника настроек
		Если Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
			Объект.ИмяПрикладногоОбъекта           = мМетаданныеИсточника.Родитель().Имя;
			Объект.ИмяТабличнойЧасти               = мМетаданныеИсточника.Имя;
			Объект.ПредставлениеПрикладногоОбъекта = мМетаданныеИсточника.Родитель().Представление();
			Объект.ПредставлениеТабличнойЧасти     = мМетаданныеИсточника.Представление();
		ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
			Объект.ИмяПрикладногоОбъекта           = мМетаданныеИсточника.Имя;
			Объект.ИмяТабличнойЧасти               = "";
			Объект.ПредставлениеПрикладногоОбъекта = мМетаданныеИсточника.Представление();
			Объект.ПредставлениеТабличнойЧасти     = "";
		КонецЕсли;
		
	КонецЕсли;
	
	// Перезаполним списки выбора элементов форм
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	ЗаполнитьСписокПрикладныхОбъектов();
	ЗаполнитьСписокТабличныхЧастей();
	
	// Заполним реквизиты формы	
	ФорматФайла = мФорматФайла;
	Кодировка   = мКодировка;
	
	ПередВыгрузкойОбъекта = мПередВыгрузкойОбъекта;
	ПослеДобавленияСтроки = мПослеДобавленияСтроки;
	
	// Заполним табличную часть выгружаемых реквизитов
	ЗаполнитьНастройкиКолонокВыгрузки(мВыгружаемыеРеквизиты);
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьНастройкиИзТабличногоДокумента()

// Заполняет список выгружаемых реквизитов
//
// Параметры:
//  ИсходныеДанныеТабличнойЧасти - ТаблицаЗначений - Таблица значений содержащая настройки выгрузки в текстовом виде
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокВыгрузки(ИсходныеДанныеТабличнойЧасти=Неопределено)
	
	ВыгружаемыеРеквизиты.Очистить();
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсходныеДанныеТабличнойЧасти = Неопределено Тогда
		// По умолчанию таблица пуста
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ИсходныеДанныеТабличнойЧасти Цикл
		СтрокаНастройки = ВыгружаемыеРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки,Строка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокВыгрузки()

#КонецОбласти

#Область НастройкиЗагрузки

// Отраслевое -- Процедура осуществляет загрузку настроек из поставки по переданному имени макета
//
&НаКлиенте
Процедура ЗагрузитьНастройкуИзПоставки(ИмяМакета)
	
	#Если ВебКлиент Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Функциональность не поддерживается в веб-клиенте.'"));
		
	#Иначе
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Текущая настройка будет заменена.%1Продолжить?'"), Символы.ПС);
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьНастройкуИзПоставкиВопросЗавершение", ЭтотОбъект, Новый Структура("ИмяМакета", ИмяМакета)), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.ОК, НСтр("ru= 'Настройка поставки'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкуИзПоставкиВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНастройкуИзПоставкиСервер(ДополнительныеПараметры.ИмяМакета);
	
	УправлениеДиалогом();

КонецПроцедуры  // -- Отраслевое 

// Отраслевое -- Процедура осуществляет загрузку настроек из поставки по переданному имени макета на сервере
//
&НаСервере
Процедура ЗагрузитьНастройкуИзПоставкиСервер(ИмяМакета)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ЗаполнитьНастройкиИзТабличногоДокумента(ОбработкаОбъект.ПолучитьМакет(ИмяМакета)) Тогда
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // -- Отраслевое --

// Процедура заполняет настройки формы на основании табличного документа 
//
// Параметры:
//  Настройки - ТабличныйДокумент - Табличный документ
//
// Возвращаемое значение:
//  Булево - признак успешности выполнения операции
//
&НаСервере
Функция ЗаполнитьНастройкиИзТабличногоДокумента(Настройки)
	
	Если ТипЗнч(Настройки)<>Тип("ТабличныйДокумент") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст);
		
		ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область("R2C5").Текст);
		Если (ТекстВосстановленногоРежимаЗагрузки<>"в табличную часть" И ТекстВосстановленногоРежимаЗагрузки<>"в справочник") И ТекстВосстановленногоРежимаЗагрузки<>"Х" И ТекстВосстановленногоРежимаЗагрузки<>"в регистр сведений" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Файл не содержит настройки загрузки данных'"));
			Возврат Ложь;
		КонецЕсли;

		ВерсияОбъектовМетаданных = СокрЛП(Настройки.Область("R31C5").Текст);
		
		фМетаданныеИсточникаИмя = Настройки.Область("R3C5").Текст;
		фМетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(фМетаданныеИсточникаИмя);
		
		ТекстСообщения = "";
		
		Если фМетаданныеИсточника = Неопределено Тогда
			фМетаданныеИсточника = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПреобразоватьЗагружаемоеМетаданное(фМетаданныеИсточникаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
			Если фМетаданныеИсточника = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка определения метаданных'"));
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		СтруктураФлагов = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьПараметрыПоВерсииОбработкиДляСправочникаНастроек(ВерсияОбработки, Настройки);
		ТекущаяСтрока = СтруктураФлагов.ТекущаяСтрока;
		
		// Структура реквизитов табличной части
		СтруктураУмолчаний = Новый Структура;

		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
		Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
			СтруктураУмолчанияРеквизита = Новый Структура;
			СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
			СтруктураУмолчанияРеквизита.Вставить("Пометка",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
			СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
			
			Типы = Новый Массив;
			ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст;
			
			Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
				
				КС = Неопределено;КЧ = Неопределено;КД = Неопределено;
				МассивЧастейТипа = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
				Если МассивЧастейТипа.Количество() = 0 Тогда
					Продолжить;
				ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
					Тип = ?(Метаданные.НайтиПоПолномуИмени(МассивЧастейТипа[0]) <> Неопределено, Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка.")), Неопределено);
					Если Тип = Неопределено Тогда
						Продолжить;
					КонецЕсли;
				ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
					Тип = Тип("Строка");
					Если МассивЧастейТипа.Количество() = 2 Тогда
						КС = Новый КвалификаторыСтроки(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
					ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
						КС = Новый КвалификаторыСтроки(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
					Иначе
						КС = Новый КвалификаторыСтроки;
					КонецЕсли;
				ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
					Тип = Тип("Число");
					КЧ = Новый КвалификаторыЧисла(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
				ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
					Тип = Тип("Булево");
				ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
					Тип = Тип("Дата");
					КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
				ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
					Тип = Тип("Дата");
					КД = Новый КвалификаторыДаты(ЧастиДаты.Время);
				ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
					Тип = Тип("Дата");
					КД = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
				Иначе
					Продолжить;
				КонецЕсли;
				Типы.Добавить(Тип);
			КонецЦикла;
			ОписаниеТипов = Новый ОписаниеТипов(Типы, КЧ, КС, КД);
			СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
			
			РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст;
			
			СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
			СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст);
			ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст;
			НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбласти + "C13").Текст;
			ЭтоДополнительныйРеквизит = ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C14").Текст);
			ЭтоСведение				  = ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C16").Текст);
			СсылкаРеквизита 		  = Настройки.Область(ТекущаяСтрокаОбласти + "C15").Текст;
			СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
			СтруктураУмолчанияРеквизита.Вставить("СсылкаРеквизита",?(ПустаяСтрока(СсылкаРеквизита), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(СсылкаРеквизита)));
			СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
			СтруктураУмолчанияРеквизита.Вставить("ЭтоДополнительныйРеквизит",ЭтоДополнительныйРеквизит);
			СтруктураУмолчанияРеквизита.Вставить("ЭтоСведение",ЭтоСведение);
			Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
				СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
			Иначе
				СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
				
				СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбласти + "C9").Текст;
				СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
				
				СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбласти + "C10").Текст;
				СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
				
				СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбласти + "C11").Текст));
			КонецЕсли;
			СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст), "По равному значению",Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст));
			
			// проверим загруженный реквизит
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЗагружаемыйРеквизит(СтруктураУмолчанияРеквизита, фМетаданныеИсточникаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
			
			// Добавим в структуру реквизитов структуру реквизита
			// После проверки имя реквизита могло измениться
			ИмяРеквизита = СтруктураУмолчанияРеквизита.ИмяРеквизита;
			СтруктураУмолчаний.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
			
			ТекущаяСтрока = ТекущаяСтрока + 1;
			ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
		КонецЦикла;
		
		фПередЗаписьюОбъекта = Настройки.Область("R" + Формат(ТекущаяСтрока + 2, "ЧГ=") + "C3").Текст;
		фПриЗаписиОбъекта    = Настройки.Область("R" + Формат(ТекущаяСтрока + 3, "ЧГ=") + "C3").Текст;
		фПослеДобавленияСтроки = Настройки.Область("R" + Формат(ТекущаяСтрока + 4, "ЧГ=") + "C3").Текст;
		
		// Структура реквизитов шапки
		СтруктураУмолчанийШапки = Новый Структура;
		
		ТекущаяСтрокаШапка = СтруктураФлагов.ТекущаяСтрокаШапка;
		Если ТекущаяСтрокаШапка<>0 Тогда
			ТекущаяСтрокаШапка = ТекущаяСтрока+5;
			ТекущаяСтрокаОбластиШапкиДокумента = "R" + Формат(ТекущаяСтрокаШапка, "ЧГ=");
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C2").Текст;
			Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
				СтруктураУмолчанияРеквизита = Новый Структура;
				СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
				СтруктураУмолчанияРеквизита.Вставить("Пометка",Не ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C1").Текст));
				СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C3").Текст));
				
				Типы = Новый Массив;
				ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C4").Текст;
				
				Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
					
					кс = Неопределено;кч = Неопределено;кд = Неопределено;
					МассивЧастейТипа = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
					Если МассивЧастейТипа.Количество() = 0 Тогда
						Продолжить;
					ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
						Тип = ?(Метаданные.НайтиПоПолномуИмени(МассивЧастейТипа[0]) <> Неопределено, Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка.")), Неопределено);
						Если Тип = Неопределено Тогда
							Продолжить;
						КонецЕсли;
					ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
						Тип = Тип("Строка");
						Если МассивЧастейТипа.Количество() = 2 Тогда
							кс = Новый КвалификаторыСтроки(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
						ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
							кс = Новый КвалификаторыСтроки(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
						Иначе
							кс = Новый КвалификаторыСтроки;
						КонецЕсли;
					ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
						Тип = Тип("Число");
						кч = Новый КвалификаторыЧисла(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
					ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
						Тип = Тип("Булево");
					ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.Дата);
					ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
					ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
					Иначе
						Продолжить;
					КонецЕсли;
					Типы.Добавить(Тип);
				КонецЦикла;
				ОписаниеТипов = Новый ОписаниеТипов(Типы, кч, кс, кд);
				СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
				
				РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C5").Текст;
				
				СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
				СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C6").Текст);
				ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C7").Текст;
				НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C13").Текст;
				
				СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
				СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
				
				Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
					СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C8").Текст);
				Иначе
					СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C8").Текст);
					
					СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C9").Текст;
					СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
					
					СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C10").Текст;
					СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
					
					СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C11").Текст));
				КонецЕсли;
				СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C12").Текст), "По равному значению",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C12").Текст));
				
				// проверим загруженный реквизит
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЗагружаемыйРеквизит(СтруктураУмолчанияРеквизита, фМетаданныеИсточникаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
				
				// Добавим в стркутуру реквизитов шапки структуру реквизита
				// После проверки имя реквизита могло измениться
				ИмяРеквизита = СтруктураУмолчанияРеквизита.ИмяРеквизита;
				СтруктураУмолчанийШапки.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
				
				ТекущаяСтрокаШапка = ТекущаяСтрокаШапка + 1;
				ТекущаяСтрокаОбластиШапкиДокумента = "R" + Формат(ТекущаяСтрокаШапка, "ЧГ=");
				ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C2").Текст;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	// Принимаем файл как корректный, переписываем значения реквизитов значениями из промежуточных переменных
	Если Объект.ВариантИспользованияНастройки<>Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Если ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Вариант использования настройки изменен на %1'"), Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных;
	КонецЕсли;
	
	// Проверим, есть ли полученные реквизиты в метаданных объекта
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ВыполнитьПроверкуПолученныхРеквизитовИзНастройки(фМетаданныеИсточника, СтруктураУмолчаний, СтруктураУмолчанийШапки, ТекстСообщения);
	
	Если ТекстСообщения <> "" И НЕ Модифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		ТекстНачало = "В связи с изменением структуры метаданных конфигурации были актуализированы следующие настройки загрузки:";
		ТекстКонец = "Проверьте корректность настроек и сохраните их!";
		ТекстСообщения = ТекстНачало + Символы.ПС + ТекстСообщения + Символы.ПС + ТекстКонец;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если МетаданныеИсточника<>фМетаданныеИсточника Тогда
		Если МетаданныеИсточника<>Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Объект и/или табличная часть изменена %1 -> %2'"), МетаданныеИсточника.ПолноеИмя(), фМетаданныеИсточника.ПолноеИмя());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		// Заполним служебную переменную
		МетаданныеИсточника = фМетаданныеИсточника;
		Если МетаданныеИсточника = Неопределено Тогда
			АдресХранилищаМетаданныеИсточника = "";
		Иначе
			АдресХранилищаМетаданныеИсточника = ПоместитьВоВременноеХранилище(МетаданныеИсточника.ПолноеИмя(), УникальныйИдентификатор);
		КонецЕсли;
		
		// Заполним реквизиты справочника настроек
		Если Метаданные.РегистрыСведений.Содержит(фМетаданныеИсточника) Тогда
			// это регистр сведений
			Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений;
			Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Имя;
			Объект.ИмяТабличнойЧасти               = "";
			Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Представление();
			Объект.ПредставлениеТабличнойЧасти     = "";
		ИначеЕсли Метаданные.Справочники.Содержит(фМетаданныеИсточника) Тогда
			// это справочник
			Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
			Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Имя;
			Объект.ИмяТабличнойЧасти               = "";
			Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Представление();
			Объект.ПредставлениеТабличнойЧасти     = "";
		Иначе
			// это ТЧ, только надо разобраться, чья
			Если Метаданные.Документы.Содержит(фМетаданныеИсточника.Родитель()) Тогда
				Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.Документ;
			ИначеЕсли Метаданные.Справочники.Содержит(фМетаданныеИсточника.Родитель()) Тогда
				Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
			ИначеЕсли Метаданные.Обработки.Содержит(фМетаданныеИсточника.Родитель()) Тогда
				Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка;
			КонецЕсли;
			Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Родитель().Имя;
			Объект.ИмяТабличнойЧасти               = фМетаданныеИсточника.Имя;
			Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Родитель().Представление();
			Объект.ПредставлениеТабличнойЧасти     = фМетаданныеИсточника.Представление();
		КонецЕсли;
	КонецЕсли;
	
	// Перезаполним списки выбора элементов форм
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	ЗаполнитьСписокПрикладныхОбъектов();
	ЗаполнитьСписокТабличныхЧастей();
	
	// Заполним реквизиты формы
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,		СтруктураФлагов); 
	Если ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ор_ЗначениеНеЗаполнено(СтруктураФлагов.ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек) Тогда
		ДополнительныеРеквизитыПоКатегорииНоменклатуры.Очистить();
	Иначе
		ДополнительныеРеквизитыПоКатегорииНоменклатуры = СтруктураФлагов.ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек.Скопировать();
	КонецЕсли;
	
	// Отдельно заполним флаг, он реквизит объекта
	Объект.ЗапретСозданияНовыхЭлементов = СтруктураФлагов.НеСоздаватьНовыхЭлементов;
	
	Попытка
		ОбработкаПреобразования = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураФлагов.ИдентификаторОбработкиЗагрузкиИзXML));
	Исключение
	КонецПопытки;
	
	НастройкиПараметров = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьСоответствиеПараметровИзФлагов(ВерсияОбработки, СтруктураФлагов, Настройки);
	// Возьмем в попытку, потому что отработает только для аптеки, для остальных решений доп. параметров нет
	Попытка
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДопПараметровСправочникаНастроек(НастройкиПараметров, ТаблицаДополнительныхПараметров);
	Исключение
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДопПараметровСправочникаНастроек(НастройкиПараметров, Неопределено);
	КонецПопытки;
	
	ПередЗаписьюОбъекта   = фПередЗаписьюОбъекта;
	ПриЗаписиОбъекта      = фПриЗаписиОбъекта;
	ПослеДобавленияСтроки = фПослеДобавленияСтроки;
	
	// Заполним список реквизитов ТЧ
	ЗаполнитьНастройкиКолонок(СтруктураУмолчаний);
	ЗаполнитьНастройкиКолонокШапки(СтруктураУмолчанийШапки);
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьНастройкиИзТабличногоДокумента()

// Процедура создает новый табличный документ на основании данных формы
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//  ТабличныйДокумент - Настройки собранные в табличный документ для хранения в реквизите "НастройкиЗагрузкиВыгрузки"
//  Неопределено      - Возвращается если не указанны все необходимые данные 
//
&НаСервере
Функция ЗаполнитьТабличныйДокументИзНастроек()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МетаданныеИсточникаИзСправочника", МетаданныеИсточника);
	Если Метаданные.Справочники.Содержит(МетаданныеИсточника) Тогда
		РежимЗагрузки                             = 0;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		РежимЗагрузки                             = 2;
	Иначе
		РежимЗагрузки                             = 1;	
	КонецЕсли;
	СтруктураПараметров.Вставить("РежимЗагрузки", 								РежимЗагрузки);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 					Объект.ЗапретСозданияНовыхЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 					Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом", 					ДействиеСЗагружаемымФайлом);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов", 				КаталогАрхиваЗагруженныхФайлов);
	СтруктураПараметров.Вставить("Табуляция", 									Табуляция);
	СтруктураПараметров.Вставить("Кодировка", 									Кодировка);
	СтруктураПараметров.Вставить("ИмяТаблицы", 									ИмяТаблицы);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы", 			ЗапретОбновленияСуществующихЭлементов);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", ИспользоватьВнешнийМодульПреобразованияФайла);
	СтруктураПараметров.Вставить("ОбработкаПреобразования", 					ОбработкаПреобразования);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 						ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 							ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 						ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	ЗагружатьДополнительныеРеквизитыИСведения);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	ДополнительныеРеквизитыИСведенияТолькоОбщие);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",	ДополнительныеРеквизитыПоКатегорииНоменклатуры);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок", 		КоличествоНеОбрабатываемыхСтрок);

	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьСтруктуруПараметровЗаполнитьТабличныйДокументИзНастроек(СтруктураПараметров, ЭтотОбъект);
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройки(СтруктураПараметров);
	

КонецФункции // ЗаполнитьТабличныйДокументИзНастроек()

// Заполняет список вариантами использование, и добавляет соответствующие картинки
//
&НаСервере
Процедура ЗаполнитьСписокВариантовИспользования()
	
	Список = Элементы.ВариантИспользованияНастройки.СписокВыбора;
	Список.Очистить();
	Список.Добавить(Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных);
	Список.Добавить(Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных);
	
КонецПроцедуры

// Заполняет список доступных типов прикладных объектов
//
&НаСервере
Процедура ЗаполнитьСписокТиповПрикладногоОбъекта()
	
	Список = Элементы.ТипПрикладногоОбъекта.СписокВыбора;
	Список.Очистить();
	
	Если Объект.ВариантИспользованияНастройки=Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Список.Добавить(Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
		Список.Добавить(Перечисления.ор_ТипыПрикладныхОбъектов.Документ);
		Список.Добавить(Перечисления.ор_ТипыПрикладныхОбъектов.Обработка);
	ИначеЕсли Объект.ВариантИспользованияНастройки=Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Список.Добавить(Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
		Список.Добавить(Перечисления.ор_ТипыПрикладныхОбъектов.Документ);
		Список.Добавить(Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список доступных документов и справочников
//
&НаСервере
Процедура ЗаполнитьСписокПрикладныхОбъектов()
	
	Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Очистить();
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		// Используем поэлементное добавление, т.к. при открытии сохраненного
		// элемента справочника элемент управления не позиционируется
		Для Каждого СтрокаСписка Из СписокСправочниковКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		Для Каждого СтрокаСписка Из СписокДокументовКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка Тогда
		Для Каждого СтрокаСписка Из СписокОбработокКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
		Для Каждого СтрокаСписка Из СписокРегистровСведенийКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	КонецЕсли;
	Элементы.ИмяПрикладногоОбъекта.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
КонецПроцедуры

// Заполняет список доступных табличных частей документов
//
&НаСервере
Процедура ЗаполнитьСписокТабличныхЧастей()
	
	СписокТабличныхЧастей = Элементы.ИмяТабличнойЧасти.СписокВыбора;
	СписокТабличныхЧастей.Очистить();
	
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		ОбъектМетаданных = Метаданные.Документы.Найти(Объект.ИмяПрикладногоОбъекта);
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка Тогда
		ОбъектМетаданных = Метаданные.Обработки.Найти(Объект.ИмяПрикладногоОбъекта);
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		ОбъектМетаданных = Метаданные.Справочники.Найти(Объект.ИмяПрикладногоОбъекта);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ОбъектМетаданных<>Неопределено Тогда
		Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.Табличныечасти Цикл
			СписокТабличныхЧастей.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Представление());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбора(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитов[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбораШапка(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитовШапки[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиИскатьПо" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитовШапки);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоТипу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитовШапки);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Функция получает настройку из хранилища
//
&НаСервере
Функция ПолучитьНастройкуИзХранилища(НастройкиСсылка)
	
	ОбъектНастройка = НастройкиСсылка.ПолучитьОбъект();
	
	Настройки = ОбъектНастройка.НастройкиЗагрузкиВыгрузки.Получить();
	
	Возврат Настройки;
	
КонецФункции

// Функция получения строки фильтра для диалога выбора файла
//
&НаСервере
Функция ПолучитьСтрокуФильтраДляДиалогаВыбораФайла()
	
	Фильтр = "";
	Если Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Фильтр = "Файлы настроек загрузки(*.mxlz)|*.mxlz|Все файлы (*.*)|*.*|";
	ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Фильтр = "Файлы настроек выгрузки(*.mxla)|*.mxla|Все файлы (*.*)|*.*|";
	КонецЕсли;
	
	Возврат Фильтр;
	
КонецФункции

// Функция получает настройки из хранилища
//
&НаСервере
Функция ПолучитьНастройкиИзХранилища()
	
	Попытка
		НастройкаОбъект = Объект.Ссылка.ПолучитьОбъект();
	Исключение
		НастройкаОбъект = Неопределено;
	КонецПопытки;
	
	Если НастройкаОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройки = НастройкаОбъект.НастройкиЗагрузкиВыгрузки.Получить();
	
	Возврат Настройки;
	
КонецФункции

// Функция выполняет загрузку настроек из файла
//
&НаСервере
Функция ВыполнитьЗагрузкуНастроек(Расширение, ПолноеИмяФайлаНастройки, АдресВоВременномХранилище)
	
	Настройки = Новый ТабличныйДокумент;
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUASettings.mxlz";
	ДанныеФайла.Записать(ВременныйФайл);
	
	Попытка
		Настройки.Прочитать(ВременныйФайл);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ИнформацияОбОшибке.Причина.Описание);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если Расширение=".mxlz" Тогда
		Расширение = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных;
	ИначеЕсли Расширение=".mxla" Тогда
		Расширение = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных;
	Иначе
		// ОписаниеТипов = Новый ОписаниеТипов("ПеречислениеСсылка.ор_ВариантыИспользованияНастройки");
		// Если НЕ ВвестиЗначение(Расширение,"Вариант использования",ОписаниеТипов) Тогда
		// 	Возврат Ложь;
		// КонецЕсли;
	КонецЕсли;
	
	ЗагруженоУспешно = Ложь;
	Если Расширение = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		ЗагруженоУспешно = ЗаполнитьНастройкиИзТабличногоДокумента(Настройки);
	ИначеЕсли Расширение = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		ЗагруженоУспешно = ЗаполнитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки);
	КонецЕсли;
	
	Возврат ЗагруженоУспешно;
	
КонецФункции

// Процедура сохраняет настройки в хранилище
//
// Параметры
//  <ТекущийОбъект>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СохранитьНастройкиВХранилище(ТекущийОбъект, Отказ=Ложь)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		// не заполнены все реквизиты определяющие метаданные
		Возврат;
	КонецЕсли;
	
	// Проверка настройки загрузки
	Если ТекущийОбъект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		
		Если ДействиеСЗагружаемымФайлом<>0 Тогда
			КаталогАрхиваЗагруженныхФайлов = "";
		КонецЕсли;
		
		Если ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(ОбработкаПреобразования) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не указана обработка преобразования файла в табличный документ!'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ДействиеСЗагружаемымФайлом = 0 И НЕ ЗначениеЗаполнено(КаталогАрхиваЗагруженныхФайлов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не указан каталог архива загруженных файлов!'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ТекущийОбъект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(ЗаполнитьТабличныйДокументИзНастроек());
		
	// Проверка настройки выгрузки
	ИначеЕсли ТекущийОбъект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		
		Если ВыгружаемыеРеквизиты.Количество()=0  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не указаны реквизиты для выгрузки'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ВыгружаемыеРеквизиты Цикл
			ТекстОшибки = "";
			Если ПустаяСтрока(Строка.ТипПоля) Тогда
				ТекстОшибки = ТекстОшибки+", Тип поля";
			КонецЕсли;
			Если ПустаяСтрока(Строка.Представление) Тогда
				ТекстОшибки = ТекстОшибки+", Поле объекта / выражение";
			КонецЕсли;
			Если ПустаяСтрока(Строка.ПолеДБФ) Тогда
				ТекстОшибки = ТекстОшибки+", Поле DBF";
			КонецЕсли;
			Если ПустаяСтрока(Строка.Тип) Тогда
				ТекстОшибки = ТекстОшибки+", Тип";
			ИначеЕсли (Строка.Тип = "S" ИЛИ Строка.Тип = "N") И Строка.Длина=0 Тогда
				ТекстОшибки = ТекстОшибки+", Длина";
			КонецЕсли;
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Строка %1 не заполнена колонка: %2'"), Строка(ВыгружаемыеРеквизиты.Индекс(Строка)+1), Сред(ТекстОшибки,3));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		ТекущийОбъект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(ЗаполнитьТабличныйДокументИзНастроекВыгрузки());
		
	КонецЕсли;
	
КонецПроцедуры // СохранитьНастройкиВХранилище()

#Область ТаблицаЗагружаемыхРеквизитов

// Заполняет настройки колонок по умолчанию для справочника
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокСправочника()
	
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(Тип("Булево"));
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника.ДлинаКода > 0 Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Код";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Код";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		Если МетаданныеИсточника.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаКода));
		Иначе
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(МетаданныеИсточника.ДлинаКода));
		КонецЕсли;
		
	КонецЕсли;
	
	Если МетаданныеИсточника.ДлинаНаименования > 0 Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Наименование";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаНаименования));
		
	КонецЕсли;
	
	ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита           = "ПометкаУдаления";
	ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Пометка удаления";
	ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
	ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(МассивБулево);
	
	Если МетаданныеИсточника.Владельцы.Количество() > 0 Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Владелец";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Владелец";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		СтрокаОписанияТипов = "";
			
		Для Каждого ТекВладелец Из МетаданныеИсточника.Владельцы Цикл
			СтрокаОписанияТипов = ?(ПустаяСтрока(СтрокаОписанияТипов),"",СтрокаОписанияТипов + ", ") + ТекВладелец.ПолноеИмя();
		КонецЦикла;
			
		СтрокаОписанияТипов = СтрЗаменить(СтрокаОписанияТипов,".","Ссылка.");
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(СтрокаОписанияТипов);
		
		
	КонецЕсли;
	
	Если МетаданныеИсточника.Иерархический Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Родитель";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Родитель";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(СтрЗаменить(МетаданныеИсточника.ПолноеИмя(),".","Ссылка."));
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "ЭтоГруппа";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Это группа";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(МассивБулево);
	КонецЕсли;
	
	ЕстьОтраслевойПроизводитель = Ложь;
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		Если Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы
			// Пропустим вывод ненужного реквизита "УдалитьСтавкаНДС".
			// После удаления данного реквизита в Номенклатуре нужно убрать это условие.
			ИЛИ НРег(Реквизит.Имя) = НРег("УдалитьСтавкаНДС") Тогда
			Продолжить;
		КонецЕсли;
		Если НРег(Реквизит.Имя) = НРег("ор_Производитель") Тогда
			ЕстьОтраслевойПроизводитель = Истина;
		КонецЕсли;
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = НЕ Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	// ++ Аптека
	Если ЕстьОтраслевойПроизводитель Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИмяРеквизита", "Производитель");
		МассивСтрок = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
			ТаблицаЗагружаемыхРеквизитов.Удалить(ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	// -- Аптека
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДополнитьДополнительныеРеквизитыВТаблицуРеквизитов(МетаданныеИсточника, ТаблицаЗагружаемыхРеквизитов, ДополнительныеРеквизитыПоКатегорииНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведения, ДополнительныеРеквизитыИСведенияТолькоОбщие);
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		ЗагружаемыйРеквизит.ОписаниеТипов = ЗагружаемыйРеквизит.ДоступноеОписаниеТипов;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
				
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
				
			Иначе
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
				
			КонецЕсли;
			 
			
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
	КонецЦикла;
	
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокСправочника()

// Заполняет настройки колонок по умолчанию для табличной части
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокТабличнойЧасти()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		Для Каждого Реквизит Из МетаданныеИсточника.Измерения Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
		КонецЦикла;
		Для Каждого Реквизит Из МетаданныеИсточника.Ресурсы Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		// В заказе покупателя у номенклатуры составной тип СправочникСсылка.Номенклатура, Строка
		// В следствие чего режим загрузки не отрабатывает
		// Установим для такого случая тип СправочникСсылка.Номенклатура
		Если Реквизит.Тип.СодержитТип(Тип("СправочникСсылка.Номенклатура"))
			И Реквизит.Тип.СодержитТип(Тип("Строка")) Тогда
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
			ЗагружаемыйРеквизит.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		Иначе
			ЗагружаемыйРеквизит.ОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
			Иначе
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
			КонецЕсли;
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
		ЗагружаемыйРеквизит.РежимПоиска = "По равному значению";
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокТабличнойЧасти()

// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  СтруктураУмолчаний - Структура - Структура настройки колонок по умолчанию
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонок(СтруктураУмолчаний=Неопределено)
	
	ТаблицаЗагружаемыхРеквизитов.Очистить();
	ТаблицаЗагружаемыхРеквизитовШапки.Очистить();
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним оформление из основной формы документа по табличному полю
	Оформление = Неопределено;
	Если НЕ ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
		Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений;
			
		ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеИсточника.Родитель()) Тогда
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
			
		ИначеЕсли Метаданные.Обработки.Содержит(МетаданныеИсточника.Родитель()) Тогда
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка;
			
		Иначе
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ;
		КонецЕсли;
	КонецЕсли;
		
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		МетаданныеРодителяИсточника = МетаданныеИсточника;
		ЗаполнитьНастройкиКолонокТабличнойЧасти();
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеИсточника) Тогда
		МетаданныеРодителяИсточника = МетаданныеИсточника;
		ЗаполнитьНастройкиКолонокСправочника();
	Иначе
		МетаданныеРодителяИсточника = МетаданныеИсточника.Родитель();
		ЗаполнитьНастройкиКолонокТабличнойЧасти();
	КонецЕсли;
	
	// Перенесем настройки видимости и порядок колонок
	Если Оформление <> Неопределено Тогда
		// Если есть табличное поле, настроенное в основной форме объекта, 
		НомерКолонкиОформления = 0;
		НомерКолонки = 1;
		Для Каждого Колонка Из Оформление.Колонки Цикл
			
			ЗагружаемыйРеквизит = Объект.ТаблицаЗагружаемыхРеквизитов.Найти(Колонка.ДанныеФлажка,"ИмяРеквизита");
			Если ЗагружаемыйРеквизит<>Неопределено Тогда
				Индекс = Объект.ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления  Тогда
					
					ЗагружаемыйРеквизит.ШиринаКолонки = 3;
					Объект.ТаблицаЗагружаемыхРеквизитов.Сдвинуть(ЗагружаемыйРеквизит, НомерКолонкиОформления - Индекс);
					
					Если Колонка.Видимость Тогда
						ЗагружаемыйРеквизит.Пометка = Колонка.Видимость;
						ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
						НомерКолонки = НомерКолонки + 1;
					КонецЕсли;
					
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
			
			ЗагружаемыйРеквизит = Объект.ТаблицаЗагружаемыхРеквизитов.Найти(Колонка.Данные,"ИмяРеквизита");
			Если ЗагружаемыйРеквизит<>Неопределено Тогда
				Индекс = Объект.ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗагружаемыйРеквизит.ШиринаКолонки = Колонка.Ширина;
					Объект.ТаблицаЗагружаемыхРеквизитов.Сдвинуть(ЗагружаемыйРеквизит, НомерКолонкиОформления - Индекс);
					Если Колонка.Видимость Тогда
						ЗагружаемыйРеквизит.Пометка = Колонка.Видимость;
						ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
						НомерКолонки = НомерКолонки + 1;
					КонецЕсли;
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли СтруктураУмолчаний <> Неопределено Тогда
		
		НомерКолонкиОформления = 0;
		Для Каждого КлючИЗначение Из СтруктураУмолчаний Цикл
			Колонка = КлючИЗначение.Значение;
			
			ЗагружаемыйРеквизит = Неопределено;
			ОтборСтрок = Новый Структура("ИмяРеквизита",Колонка.ИмяРеквизита);
			СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
			Если СтрокиТаблицы.Количество() > 0 Тогда
				ЗагружаемыйРеквизит = СтрокиТаблицы[0];
			КонецЕсли;
			
			Если НЕ ЗагружаемыйРеквизит = Неопределено Тогда
				Индекс = ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗаполнитьЗначенияСвойств(ЗагружаемыйРеквизит, Колонка);
					
					ТаблицаЗагружаемыхРеквизитов.Сдвинуть(Индекс, НомерКолонкиОформления - Индекс);
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		НомерКолонки = 1;
		Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
			ЗагружаемыйРеквизит.Пометка      = Истина;
			ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонок()

// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  СтруктураУмолчаний - Структура - Структура настройки колонок по умолчанию
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокШапки(СтруктураУмолчаний=Неопределено)
	
	ТаблицаЗагружаемыхРеквизитовШапки.Очистить();
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним оформление из основной формы документа по табличному полю
	Оформление = Неопределено;
	Если НЕ ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
		Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений;
			
		ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеИсточника.Родитель()) Тогда
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
			
		ИначеЕсли Метаданные.Обработки.Содержит(МетаданныеИсточника.Родитель()) Тогда
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка;
			
		Иначе
			ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ;
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Документы.Содержит(МетаданныеИсточника.Родитель()) Тогда
		МетаданныеРодителяИсточника = МетаданныеИсточника.Родитель();
		ЗаполнитьНастройкиШапки();
	КонецЕсли;
	
	// Перенесем настройки видимости и порядок колонок
	Если СтруктураУмолчаний <> Неопределено Тогда
		
		НомерКолонкиОформления = 0;
		Для Каждого КлючИЗначение Из СтруктураУмолчаний Цикл
			Колонка = КлючИЗначение.Значение;
			// ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Найти(Колонка.ИмяРеквизита,"ИмяРеквизита");
			
			ЗагружаемыйРеквизит = Неопределено;
			ОтборСтрок = Новый Структура("ИмяРеквизита",Колонка.ИмяРеквизита);
			СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(ОтборСтрок);
			Если СтрокиТаблицы.Количество() > 0 Тогда
				ЗагружаемыйРеквизит = СтрокиТаблицы[0];
			КонецЕсли;
			
			Если НЕ ЗагружаемыйРеквизит = Неопределено Тогда
				Индекс = ТаблицаЗагружаемыхРеквизитовШапки.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗаполнитьЗначенияСвойств(ЗагружаемыйРеквизит, Колонка);
					
					ТаблицаЗагружаемыхРеквизитовШапки.Сдвинуть(Индекс, НомерКолонкиОформления - Индекс);
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		НомерКолонки = 1;
		Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
			ЗагружаемыйРеквизит.Пометка      = Истина;
			ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокШапки()

&НаСервере
// Заполняет настройки шапки по умолчанию
Процедура ЗаполнитьНастройкиШапки()
	
	Если НЕ Метаданные.Документы.Содержит(МетаданныеИсточника.Родитель()) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеРодителя = МетаданныеИсточника.Родитель();
	Для Каждого Реквизит Из МетаданныеРодителя.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитовШапки.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
		ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитовШапки);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитовШапки);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
			Иначе
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
			КонецЕсли;
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
		ЗагружаемыйРеквизит.РежимПоиска = "По равному значению";
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиШапки()

#КонецОбласти

#КонецОбласти

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВыгружаемыеРеквизитыПредставлениеНачалоВыбораОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПоля = "Поле объекта" Тогда
		
		ТекущиеДанные.Данные        = Результат.ПолныйПутьКДанным;
		ТекущиеДанные.Представление = Результат.Представление;
		ТекущиеДанные.ПолеДБФ = Транслитерация(Результат.ПредставлениеВерхнегоУровня);
		
		МассивТипов = Результат.ОписаниеТипов.Типы();
		Если МассивТипов.Количество() = 1 Тогда
			Тип = МассивТипов[0];
			ОписаниеТипов = Результат.ОписаниеТипов;
			// Ссылочные типы выгружаем строкой
			Если Тип = Тип("Строка") Тогда
				ТекущиеДанные.Тип      = "S";
				ТекущиеДанные.Длина    = ?(ОписаниеТипов.КвалификаторыСтроки.Длина>0,ОписаниеТипов.КвалификаторыСтроки.Длина,255);
				ТекущиеДанные.Точность = 0;
				
			ИначеЕсли Тип = Тип("Число") Тогда
				ТекущиеДанные.Тип      = "N";
				ТекущиеДанные.Длина    = ОписаниеТипов.КвалификаторыЧисла.Разрядность;
				ТекущиеДанные.Точность = ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти;
				
			ИначеЕсли Тип = Тип("Булево") Тогда
				ТекущиеДанные.Тип      = "L";
				ТекущиеДанные.Длина    = 0;
				ТекущиеДанные.Точность = 0;
				
			ИначеЕсли Тип = Тип("Дата") Тогда
				ТекущиеДанные.Тип      = "D";
				ТекущиеДанные.Длина    = 0;
				ТекущиеДанные.Точность = 0;
				
			Иначе
				ТекущиеДанные.Тип      = "S";
				ТекущиеДанные.Длина    = 255;
				ТекущиеДанные.Точность = 0;
			КонецЕсли;
			
		Иначе
			// Все остальное выгружаем строкой
			ТекущиеДанные.Тип      = "S";
			ТекущиеДанные.Длина    = 255;
			ТекущиеДанные.Точность = 0;
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.ТипПоля = "Выражение" Тогда
		
		ТекущиеДанные.Представление = Результат.Представление;
		ТекущиеДанные.Данные        = Результат.Выражение;
		
		Если ПустаяСтрока(ТекущиеДанные.ПолеДБФ) Тогда
			ТекущиеДанные.ПолеДБФ = Транслитерация(ТекущиеДанные.Представление);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиВыражениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СобытияОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого РезультирующееЗначение Из Результат Цикл
		ЭтотОбъект[РезультирующееЗначение.Ключ] = РезультирующееЗначение.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыЗагрузки(Команда)
	Рез = Неопределено;
	ДопПараметры = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.УстановитьДополнительныеПараметрыЗагрузки(ЭтотОбъект,,Рез);
	ОткрытьФорму(
		ДопПараметры.ФормаИмя,
		ДопПараметры.ПараметрыФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("УстановитьДополнительныеПараметрыЗагрузкиОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДополнительныеПараметрыЗагрузкиОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ШКЯвляетсяПолемПоискаНоменклатуры = Результат.ШКЯвляетсяПолемПоискаНоменклатуры;
	ЭтотОбъект.СоздаватьОбщиеХарактеристики      = Результат.СоздаватьОбщиеХарактеристики;
	
	ЭтотОбъект.ВсегдаФормироватьНовыеСерии     		= Результат.ВсегдаФормироватьНовыеСерии;
	ЭтотОбъект.СоздаватьПроизводителя          		= Результат.СоздаватьПроизводителя;
	ЭтотОбъект.ФорматДатыСрокаГодности         		= Результат.ФорматДатыСрокаГодности;
	ЭтотОбъект.НеФормироватьДопНомерСерии      		= Результат.НеФормироватьДопНомерСерии;
	ЭтотОбъект.ЗагружатьШК      				 	= Результат.ЗагружатьШК;
	ЭтотОбъект.СоздаватьСтрануПроисхождения 		= Результат.СоздаватьСтрануПроисхождения;
	ЭтотОбъект.ЗагружатьGTINДляСерии 				= Результат.ЗагружатьGTINДляСерии;
	
	ЗагрузитьДопТаблицу(Результат) 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДопТаблицу(Рез)
	Если Рез<>Неопределено Тогда
		ТаблицаДополнительныхПараметров.Загрузить(Рез.ТаблицаДополнительныхПараметров.Выгрузить());
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершениеПомещенияФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВоВременномХранилище = Результат[0].Хранение;
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Расширение = ДополнительныеПараметры.Расширение;
	
	
	ЗагруженоУспешно = ВыполнитьЗагрузкуНастроек(Расширение, ДиалогВыбораФайла.ПолноеИмяФайла, АдресВоВременномХранилище);
	
	Если ЗагруженоУспешно Тогда
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
	УправлениеДиалогом();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайлВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Записать();
	Исключение
		Возврат;
	КонецПопытки;
	
	ЗаписьНастроекВФайл();

КонецПроцедуры

&НаКлиенте
Процедура ЗаписьНастроекВФайл()
	
	Настройки = ПолучитьНастройкиИзХранилища();
	Если Настройки = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Невозможно сохранить в файл. Не заполнены данные настроек.'"));
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Сохранить настройки в файл'");
	
	ДиалогВыбораФайла.Фильтр = ПолучитьСтрокуФильтраДляДиалогаВыбораФайла();
	
	ДиалогВыбораФайла.ПолноеИмяФайла = Объект.Наименование;
	
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонкуВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаКолонки(ДополнительныеПараметры.НомерКолонки, ДополнительныеПараметры.ТекСтрока, 
	ДополнительныеПараметры.ЭтоСтраницаШапки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКолонки(НомерКолонки,ТекСтрока,ЭтоСтраницаШапки)
	
	ТекСтрока.НомерКолонки = НомерКолонки;
	ТекСтрока.Пометка = Истина;
	
	Если Не РучнаяНумерацияКолонокТабличногоДокумента И НЕ ЭтоСтраницаШапки Тогда
		РучнаяНумерацияКолонокТабличногоДокумента = Истина;
		УправлениеДиалогом();
	ИначеЕсли Не РучнаяНумерацияКолонокТабличногоДокументаДляШапки И ЭтоСтраницаШапки Тогда
		РучнаяНумерацияКолонокТабличногоДокументаДляШапки = Истина;
		УправлениеДиалогом();
	КонецЕсли;
	Модифицированность = Истина;
	РасставитьПометкиНаКнопках(НомерКолонки);

КонецПроцедуры

&НаСервере
Функция ПолучитьФормуВыбораОбъектаМетаданных(Тип)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбъектМетаданных.Иерархический
		И ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			Возврат ОбъектМетаданных.ПолноеИмя() + ".ФормаВыбораГруппы";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
