


// Фоновая операция по фиксации результатов проверки и подбора в документе, 
// 
// Параметры:
// 	Параметры - Структура - содержит следующие значения:
// 	   * СоздаватьАктОРасхождениях    - Булево - признак необходимости создания акта о расхождениях.
// 	   * ПроверяемыйДокумент          - ДокументСсылка - документ, для которого выполнялась проверка и подбор.
// 	   * ДеревоМаркированнойПродукции - ДеревоЗначений - содержит результаты проверки и подбора с иерархией упаковок.
// 	   * ДанныеПроверкиИПодбора       - ХранилищеЗначения      - содержит слепок состояния проверки и подбора, если предусмотрено его хранение по окончании результатов проверки.
// 	   * ПроверкаНеПоДокументу        - Булево - признак того, что проверка и подбор была вызвана из произвольной формы.
// 	   * СохранятьОписаниеGTIN        - Булево - Сохранять описание GTIN, EAN, коэффициенты групповых упаковок.
// 	   * ПодобраннаяМаркируемаяПродукция - ТаблицаЗначений - содержит информацию о подобранной продукции сгруппированную до 
// 	       номенклатуры, характеристики, серии.
// 	   * ПараметрыСканирования        - см. ШтрихкодированиеИСКлиент.ПараметрыСканирования.
// 	АдресРезультата - Строка - адрес временного хранилища, в которое будут помещены результаты выполнения
&Вместо ("ЗафиксироватьРезультатПроверкиИПодбора")
Процедура м_ЗафиксироватьРезультатПроверкиИПодбора(Параметры, АдресРезультата) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"Обработка.ПроверкаИПодборПродукцииИСМП.МодульМенеджера.ЗафиксироватьРезультатПроверкиИПодбора");
	
	ЗаполнитьСпецификуСрокиГодности = ТипЗнч(Параметры.ПроверяемыйДокумент) = Тип("ДокументСсылка.МаркировкаТоваровИСМП")
		И ИнтеграцияИСМПКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(Параметры.ВидМаркируемойПродукции);
	Если ЗаполнитьСпецификуСрокиГодности Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПроверяемыйДокумент, "Операция, ОперацияНанесения");
		ОперацииМаркировки = ИнтеграцияИСМПСлужебныйКлиентСервер.ОперацииМаркировки(Реквизиты.Операция);
		ЗаполнитьСпецификуСрокиГодности =
			ОперацииМаркировки.ЭтоОперацияНанесения
			Или ЗначениеЗаполнено(Реквизиты.ОперацияНанесения)
			Или (Параметры.ВидМаркируемойПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
				И ОперацииМаркировки.ТребуетсяЗаполнениеИдентификаторовПримененияВЕТИС);
	КонецЕсли;
	
	ПараметрыСканирования = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ПараметрыСканирования);
	// Количество для мультитоварных наборов и монотоварных наборов с отдельной номенклатурой требуется рассчитать заново
	ПараметрыСканирования.СозданиеНаборов = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		ПараметрыОкончанияПроверки = ПроверкаИПодборПродукцииИСМП.ПараметрыОкончанияПроверки();
		ПараметрыОкончанияПроверки.ВидПродукцииИС            = Параметры.ВидМаркируемойПродукции;
		ПараметрыОкончанияПроверки.СоздаватьАктОРасхождениях = Параметры.СоздаватьАктОРасхождениях;
		ПараметрыОкончанияПроверки.ПроверяемыйДокумент       = Параметры.ПроверяемыйДокумент;
		
		ДеревоМаркированнойПродукции = Параметры.ДеревоМаркированнойПродукции.Скопировать();
		ДеревоМаркированнойПродукции.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
		ПроверкаИПодборПродукцииИСМП.УдалитьПустыеУпаковкиДерева(ДеревоМаркированнойПродукции);
		
		///#
		Для каждого СтрокаДерева Из ДеревоМаркированнойПродукции.Строки Цикл
		    Если ЗначениеЗаполнено(СтрокаДерева.Характеристика) Тогда
			    Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",СтрокаДерева.Номенклатура);
			Отбор.Вставить("GTIN",СтрокаДерева.GTIN);
			
			МС = Параметры.ПодобраннаяМаркируемаяПродукция.НайтиСтроки(Отбор);
			Если МС.Количество()>0 Тогда
			
				СтрокаДерева.Характеристика = МС[0].Характеристика;
			
			КонецЕсли;
		КонецЦикла;
		/////////////////////////////////////////////////////
	
		ТаблицаШтрихкодовВерхнегоУровня        = ПроверкаИПодборПродукцииИСМП.ПустаяТаблицаШтрихкодовВерхнегоУровня();
		ТаблицаШтрихкодовОбщая                 = ПроверкаИПодборПродукцииИСМП.ПустаяТаблицаШтрихкодовВерхнегоУровня();
		ТаблицаПодобраннойПровереннойПродукции = ПроверкаИПодборПродукцииИСМП.ПустаяТаблицаПодобраннойПровереннойПродукции();
		
		Если ЗаполнитьСпецификуСрокиГодности Тогда
			ДополнитьКолонкамиМолочнойПродукции(ТаблицаШтрихкодовВерхнегоУровня);
			ДополнитьКолонкамиМолочнойПродукции(ТаблицаШтрихкодовОбщая);
			ДополнитьКолонкамиМолочнойПродукции(ТаблицаПодобраннойПровереннойПродукции);
		КонецЕсли;
		
		Если ПараметрыСканирования.ТребуетсяЧастичноеВыбытие
			И ИнтеграцияИСМПКлиентСерверПовтИсп.ПоддерживаетсяЧастичноеВыбытие(
				Параметры.ВидМаркируемойПродукции,
				ПараметрыСканирования.ВидОперацииИСМП) Тогда
				ПроверкаИПодборПродукцииИСМП.ДополнитьТаблицуШтрихкодовКолонкамиЧастичногоВыбытия(ТаблицаШтрихкодовВерхнегоУровня);
				ПроверкаИПодборПродукцииИСМП.ДополнитьТаблицуШтрихкодовКолонкамиЧастичногоВыбытия(ТаблицаШтрихкодовОбщая);
		КонецЕсли;
		
		// Количество для мультитоварных наборов и монотоварных наборов с отдельной номенклатурой требуется рассчитать заново
		СтрокиДереваНаборов = Новый Массив;
		Если ДеревоМаркированнойПродукции.Колонки.Найти("КоличествоПоДаннымИБ") = Неопределено Тогда
			ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПоДаннымИБ", Новый ОписаниеТипов("Число"));
		КонецЕсли;
		Если ДеревоМаркированнойПродукции.Колонки.Найти("КоличествоПотребительскихУпаковокПоДаннымИБ") = Неопределено Тогда
			ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПотребительскихУпаковокПоДаннымИБ", Новый ОписаниеТипов("Число"));
		КонецЕсли;
		ПроверкаИПодборПродукцииИСМП.ЗаполнитьРекурсивноКоличествоПоДаннымИБПоКолонкеКоличество(ДеревоМаркированнойПродукции.Строки, СтрокиДереваНаборов);
		Если СтрокиДереваНаборов.Количество() Тогда
			ШтрихкодированиеИСМПСлужебный.НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ДеревоМаркированнойПродукции, ПараметрыСканирования);
			ДеревоМаркированнойПродукции.Колонки.Добавить("СтрокаДерева");
			ДеревоМаркированнойПродукции.Колонки.Добавить("ОбработанСОшибками", Новый ОписаниеТипов("Булево"));
			ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(СтрокиДереваНаборов, ПараметрыСканирования);
			Для Каждого СтрокаДерева Из СтрокиДереваНаборов Цикл
				СтрокаДерева.КоличествоПоДаннымИБ = СтрокаДерева.Количество;
			КонецЦикла;
			ШтрихкодированиеИСМПСлужебный.НормализоватьДанныеДереваУпаковок(ДеревоМаркированнойПродукции, ПараметрыСканирования);
		КонецЕсли;
		
		ПараметрыСозданияШтрихкодов = Справочники.ШтрихкодыУпаковокТоваров.ПараметрыСозданияШтриходовУпаковокПоДеревуМаркируемойПродукции(
			ДеревоМаркированнойПродукции, Параметры.ПараметрыСканирования);
		Если СтрокиДереваНаборов.Количество() Тогда
			ПараметрыСозданияШтрихкодов.ИмяКолонкиКоличествоПотребительскихУпаковок = "КоличествоПотребительскихУпаковок";
		КонецЕсли;
		ПараметрыСозданияШтрихкодов.ВидПродукции = Параметры.ВидМаркируемойПродукции;
		Справочники.ШтрихкодыУпаковокТоваров.РезультатСозданияШтрихкодовУпаковокПоДеревуМаркируемойПродукции(
			ДеревоМаркированнойПродукции, ТаблицаШтрихкодовВерхнегоУровня,
			ПараметрыСозданияШтрихкодов);
		
		Если ЗаполнитьСпецификуСрокиГодности Тогда
			ТаблицаШтрихкодовВерхнегоУровня.Очистить();
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификой(ДеревоМаркированнойПродукции.Строки, ТаблицаШтрихкодовВерхнегоУровня);
		КонецЕсли;
		
		ТаблицаШтрихкодовОбщаяПоДаннымДерева(ДеревоМаркированнойПродукции, ТаблицаШтрихкодовОбщая, ЗаполнитьСпецификуСрокиГодности);
		
		РегистрыСведений.ПулКодовМаркировкиСУЗ.ОтразитьАгрегациюКодовМаркировкиВПуле(ДеревоМаркированнойПродукции);
		
		Если Параметры.РежимИсправленияОшибокПослеПередачиКодов Тогда
			
			ШтрихкодыУпаковокОбработанСОшибкойВГИСМТ = ПроверкаИПодборПродукцииИСМП.КодыМаркировкиДляПовторнойОтправки(ДеревоМаркированнойПродукции);
			
			ДанныеЗаписи = Новый Структура;
			ДанныеЗаписи.Вставить("ДокументОснование", Параметры.ПроверяемыйДокумент);
			ДанныеЗаписи.Вставить("Сообщение",         ИнтеграцияИСМПСлужебный.СтроковоеПредставлениеПустогоУникальногоИдентификатора());
			ДанныеЗаписи.Вставить("ДанныеСообщения",   Новый ХранилищеЗначения(ШтрихкодыУпаковокОбработанСОшибкойВГИСМТ));
			
			РегистрыСведений.ПакетыКодовМаркировкиИСМП.ВыполнитьЗаписьВРегистр(ДанныеЗаписи); 
			
		КонецЕсли;
		
		ПараметрыОкончанияПроверки.ТаблицаШтрихкодовВерхнегоУровня = ТаблицаШтрихкодовВерхнегоУровня;
		ПараметрыОкончанияПроверки.ТаблицаШтрихкодовОбщая          = ТаблицаШтрихкодовОбщая;
		
		ЕстьРасхождения = Ложь;
		
		Для Каждого СтрокаДерева Из Параметры.ПодобраннаяМаркируемаяПродукция Цикл
			
			НоваяСтрока = ТаблицаПодобраннойПровереннойПродукции.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
			
			Если ЗаполнитьСпецификуСрокиГодности Тогда
				НоваяСтрока.СрокГодности = СтрокаДерева.ГоденДо;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Характеристика) Тогда
				НоваяСтрока.Характеристика = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры"); 
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.Серия = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры"); 
			КонецЕсли;
			
			Если НоваяСтрока.Количество <> НоваяСтрока.КоличествоПодобрано Тогда
				ЕстьРасхождения = Истина;
			КонецЕсли;
			
			Если Не СтрокаДерева.ПроизвольнаяЕдиницаУчета Тогда
				НоваяСтрока.КоличествоПотребительскихУпаковок = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыОкончанияПроверки.ТаблицаПодобраннойПровереннойПродукции = ТаблицаПодобраннойПровереннойПродукции;
		
		Если Не Параметры.ПроверкаНеПоДокументу Тогда
			
			Если Параметры.СоздаватьАктОРасхождениях Тогда
				
				ПараметрыОкончанияПроверки.ТаблицаРасхожденийШтриховыхКодов = ТаблицаРасхожденийУпаковокПоРезультатамПроверкиИПодбора(Параметры);
				
				Если Параметры.Свойство("ДанныеКлючаСессииИСМП") Тогда
					ПараметрыСеанса.ДанныеКлючаСессииИСМП = Параметры.ДанныеКлючаСессииИСМП;
				КонецЕсли;
				
				ЗапрашиватьДанныеСервисаИСМП = ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП;
				ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП = Ложь;
				ПараметрыСканирования.СопоставлятьНоменклатуру     = Ложь;
				
				РезультатПоискаПоДаннымДокумента = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
					ТаблицаШтрихкодовВерхнегоУровня.ВыгрузитьКолонку("ШтрихкодУпаковки"),
					ПараметрыСканирования);
				ДеревоУпаковокПоДаннымДокумента = РезультатПоискаПоДаннымДокумента.ДеревоУпаковок;
				
				// Заполнение по данным УПД
				ДанныеШтрихкодовСписок = Новый Массив;
				ДанныеНоменклатурыПоДаннымУПД = ШтрихкодированиеИСМПСлужебный.ДанныеМаркируемойНоменклатурыПоДаннымУПД(Параметры.ПроверяемыйДокумент);
				
				ДляУпаковокТребоватьПодключениеИСМП = Истина;
				Если Параметры.ВозможностьЗагрузкиДанныхБезПодключенияМОТП = Истина Тогда
					ДляУпаковокТребоватьПодключениеИСМП = Ложь;
				КонецЕсли;
				
				Для Каждого КлючИЗначение Из ДанныеНоменклатурыПоДаннымУПД Цикл
					Штрихкод = КлючИЗначение.Ключ;
					Если ЗначениеЗаполнено(Штрихкод) Тогда
						ДанныеШтрихкодовСписок.Добавить(Новый Структура("Штрихкод, Количество", Штрихкод, 1));
					КонецЕсли;
				КонецЦикла;
				
				ПараметрыСканирования.ДопустимыеВидыПродукции = ИнтеграцияИСКлиентСервер.ВидыПродукцииИСМП(Истина);
				// Восстановление настроек параметров сканирования.
				ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП = ЗапрашиватьДанныеСервисаИСМП;
				
				ПараметрыСканирования.ВыполняетсяЗагрузкаДанныхВФормуПроверкиИПодбораИСМП = Истина;
				ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева       = Ложь; // Для нормализации вложенных штрихкодов
				
				РезультатПолученияДереваИСМП = ШтрихкодированиеИСМПСлужебный.ВложенныеШтрихкоды(
					ДанныеШтрихкодовСписок, ПараметрыСканирования, ДляУпаковокТребоватьПодключениеИСМП);
				
				Если РезультатПолученияДереваИСМП.ЕстьОшибки Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Ошибка при создании Акта о расхождениях.
						           |%1'"),
						РезультатПолученияДереваИСМП.ТекстОшибки);
					Если РезультатПолученияДереваИСМП.ТребуетсяОбновлениеКлючаСессии
						И Не ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП Тогда
						ТекстОшибки = СтрШаблон(
							НСтр("ru = '%1
							           |Включите опцию ""Запрашивать данные сервиса ГИС МТ""
							           |в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
							           |в разделе ""Настройки сканирования кодов маркировки"".'"),
							ТекстОшибки);
					КонецЕсли;
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				
				ДеревоУпаковокПоДаннымИСМП = РезультатПолученияДереваИСМП.ВложенныеШтрихкоды.ДеревоУпаковок;
				
				ШтрихкодыБрак = ШтрихкодированиеИС.ЗначенияНедопустимыхШтрихкодовИзДереваМаркируемойПродукции(
					ДеревоМаркированнойПродукции);
				
				ПараметрыСверки = СверкаКодовМаркировкиИСМП.ИнициализироватьПараметрыСверки();
				ПараметрыСверки.СохраненнаяДетализацияСтруктурыХранения = Параметры.ДетализацияСтруктурыХранения;
				
				ТаблицыТОРГ2 = СверкаКодовМаркировкиИСМП.ТаблицыРасхожденийПоДаннымЭДО(
					ДеревоУпаковокПоДаннымДокумента,
					ДеревоУпаковокПоДаннымИСМП,
					ШтрихкодыБрак,
					ПараметрыСверки);
				
				ДанныеПроверкиИПодбора = Параметры.ДанныеПроверкиИПодбора.Получить();
				ДанныеПроверкиИПодбора.Вставить("ТаблицыТОРГ2", ТаблицыТОРГ2);
				Параметры.ДанныеПроверкиИПодбора = Новый ХранилищеЗначения(ДанныеПроверкиИПодбора);
				
				ПараметрыОкончанияПроверки.ШтрихкодыУпаковокПланЭДО = ТаблицыТОРГ2.ШтрихкодыУпаковокПланЭДО;
				ПараметрыОкончанияПроверки.ШтрихкодыУпаковокФактЭДО = ТаблицыТОРГ2.ШтрихкодыУпаковокФактЭДО;
				
			КонецЕсли;
			
			Если Параметры.СохранятьОписаниеGTIN Тогда
				
				ТаблицаОписанияGTIN                            = ПроверкаИПодборПродукцииИСМП.ПустаяТаблицаОписанияGTIN();
				ПараметрыОкончанияПроверки.ТаблицаОписанияGTIN = ТаблицаОписанияGTIN;
				
				ПроверкаИПодборПродукцииИСМП.ЗаполнитьТаблицуОписанияGTINПоДеревуУпаковок(
					ТаблицаОписанияGTIN,
					Параметры.ДеревоМаркированнойПродукции);
				
			КонецЕсли;
			
			ПараметрыОкончанияПроверки.ДеревоМаркированнойПродукции = ДеревоМаркированнойПродукции;
			
			ПроверкаИПодборПродукцииИСМП.ЗафиксироватьРезультатПроверкиИПодбора(ПараметрыОкончанияПроверки);
			
			Если Параметры.СоздаватьАктОРасхождениях
				И ЗначениеЗаполнено(ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях) Тогда
				
				РегистрыСведений.СтатусыПроверкиИПодбораДокументовИСМП.ОтразитьЗавершениеПроверкиДокумента(
					ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях,
					Параметры.ВидМаркируемойПродукции,
					Параметры.ДанныеПроверкиИПодбора);
				
				РегистрыСведений.СтатусыПроверкиИПодбораДокументовИСМП.ОтразитьЗавершениеПроверкиДокумента(
					Параметры.ПроверяемыйДокумент,
					Параметры.ВидМаркируемойПродукции,
					Неопределено,
					Перечисления.ТребуемоеДействиеДокументЭДО.Подтвердить);
				
			Иначе
				
				Если ЕстьРасхождения Тогда
					ТребуемоеДействие = Перечисления.ТребуемоеДействиеДокументЭДО.Отклонить;
				Иначе
					ТребуемоеДействие = Перечисления.ТребуемоеДействиеДокументЭДО.Подтвердить;
				КонецЕсли;
				
				РегистрыСведений.СтатусыПроверкиИПодбораДокументовИСМП.ОтразитьЗавершениеПроверкиДокумента(
					Параметры.ПроверяемыйДокумент,
					Параметры.ВидМаркируемойПродукции,
					Параметры.ДанныеПроверкиИПодбора,
					ТребуемоеДействие);
				
			КонецЕсли;
			
			Если ТипЗнч(Параметры.ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриемкаТоваровИСМП") Тогда
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Назначение",      Перечисления.НазначениеСообщенийИСМП.ИСМП);
				ДополнительныеПараметры.Вставить("СтатусОбработки", Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается);
				ДополнительныеПараметры.Вставить("ВидПродукции",    Параметры.ВидМаркируемойПродукции);
				ДополнительныеПараметры.Вставить("ОтражениеРезультатовПроверки", Истина);
				
				МетаданныеДокумента = Параметры.ПроверяемыйДокумент.Метаданные();
				
				МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеДокумента.ПолноеИмя());
				МенеджерДокумента.ОбновитьСтатусПослеПолученияДанных(
					Параметры.ПроверяемыйДокумент, Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента, ДополнительныеПараметры);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаголовокСообщения    = НСтр("ru = 'Произошла ошибка при сохранении результатов проверки:'");
		Информация            = ИнформацияОбОшибке();
		СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
		
		ТекстыСообщенияЖР = Новый Массив;
		ТекстыСообщенияЖР.Добавить(ЗаголовокСообщения);
		ТекстыСообщенияЖР.Добавить(Символы.ПС);
		ТекстыСообщенияЖР.Добавить(ПодробноеПредставлениеОшибки(Информация));
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ТекстыСообщенияЖР.Добавить(Символы.ПС);
				ТекстыСообщенияЖР.Добавить(Сообщение.Текст);
			КонецЦикла;
		КонецЕсли;
		
		ИнтеграцияИСМПСлужебный.ЗаписатьОшибкуВЖурналРегистрации(
			СтрСоединить(ТекстыСообщенияЖР),
			Метаданные.Обработки.ПроверкаИПодборПродукцииИС);
		
		ТекстыСообщения = Новый Массив;
		ТекстыСообщения.Добавить(ЗаголовокСообщения);
		ТекстыСообщения.Добавить(Символы.ПС);
		ТекстыСообщения.Добавить(КраткоеПредставлениеОшибки(Информация));
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ТекстыСообщения.Добавить(Символы.ПС);
				ТекстыСообщения.Добавить(Сообщение.Текст);
			КонецЦикла;
		Иначе
			ТекстыСообщения.Добавить(Символы.ПС);
			ТекстыСообщения.Добавить(НСтр("ru = 'Подробности см. в журнале регистрации.'"));
		КонецЕсли;
		
		ВызватьИсключение СтрСоединить(ТекстыСообщения);
		
	КонецПопытки;
	
	КоличествоДанных = ИнтеграцияИС.КоличествоСтрокДереваЗначений(ДеревоМаркированнойПродукции);
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоДанных);
	
	РезультатПроверки = Новый Структура();
	
	Если Параметры.ПроверкаНеПоДокументу Тогда
		РезультатПроверки.Вставить("ТаблицаШтрихкодовВерхнегоУровня", ТаблицаШтрихкодовВерхнегоУровня);
		РезультатПроверки.Вставить("ТаблицаПодобраннойПровереннойПродукции", ТаблицаПодобраннойПровереннойПродукции);
	Иначе
		РезультатПроверки.Вставить("СозданныйАктОРасхождениях", ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатПроверки, АдресРезультата);
	
КонецПроцедуры

