

&После("ОбработкаПроведения")
Процедура эв_ОбработкаПроведения(Отказ, РежимПроведения)
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
    Если Не ТаблицыДляДвижений.Свойство("Таблицаэв_КошелекПервостольника") Тогда
        Возврат;
    КонецЕсли;
    
    ПроведениеДокументовУНФ.ОтразитьДвижения("эв_КошелекПервостольника", ТаблицыДляДвижений, Движения, Отказ);
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    Если Движения.эв_КошелекПервостольника.Записывать Тогда
        Движения.эв_КошелекПервостольника.Записать();
        Движения.эв_КошелекПервостольника.Записывать = Ложь;
    КонецЕсли;
    
КонецПроцедуры