
#Область ПрограммныйИнтерфейс

// Вызывается при загрузке уведомления об отгрузке.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОПриемкеМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОбОтгрузке(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект);
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект, "СоставТранспортныхУпаковок");
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке уведомления об отгрузке в РФ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОВвозеЛПвРФМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОбОтгрузкеВРФ(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке уведомления о приемке.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОбОтгрузкеМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОПриемке(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	
	Если Объект.Операция = Перечисления.ОперацииПриемкиМДЛП.ВозвратОтПокупателя Тогда
		ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект);
		ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект, "СоставТранспортныхУпаковок");
	Иначе
		ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект,, Истина);
		ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект, "СоставТранспортныхУпаковок", Истина);
	КонецЕсли
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке уведомления о перемещении.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОПеремещенииМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОПеремещении(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	
	// Уведомление о перемещении загрузится только как приходный ордер
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект,, Истина);
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект, "СоставТранспортныхУпаковок", Истина);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке уведомления о выбытии проведенного через РВ или ККТ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОРозничнойПродажеМДЛП,
//           ДокументОбъект.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП,
//           ДокументОбъект.УведомлениеОВыдачеВОтделенияМДЛП,
//           ДокументОбъект.УведомлениеОВыбытииМДЛП
//     - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОВыбытии(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке уведомления о завершении окончательной упаковки переданного через РЭ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОЗавершенииЭтапаУпаковкиМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОЗавершенииОкончательнойУпаковки(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке данных о составе упаковки.
//
// Параметры:
//  Объект - ДокументОбъект.ЗапросСоставаУпаковкиМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеДанныхОСоставеУпаковки(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке данных о выводе.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОРозничнойПродажеМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеУведомленияОРозничнойПродаже(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке данных о ввозе лекарственных препаратов в РФ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОРозничнойПродажеМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеУведомленияОВвозеЛПвРФ(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке данных об упаковке лекарственного препарата
// и нанесении средств идентификации за пределами территории РФ (информация с СКЗКМ).
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеУведомленияОбУпаковкеЛПиНанесенииСредствИдентификацииЗаПределамиРФ(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке данных о смене собственника в зоне таможенного контроля.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеУведомленияОСменеСобственникаВЗТК(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке данных об эмиссии КМ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОбЭмиссииКММДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеУведомленияОбЭмиссииКМ(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке уведомления владельца об оприходовании.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОбОтгрузкеМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияВладельцаОбОприходовании(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьКоличествоУпаковок(Объект);
	ор_ИнтеграцияМДЛП.ПриЗагрузкеУведомленияЗаполнитьНоменклатуруХарактеристику(Объект,, Истина);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается при загрузке уведомления владельца об оприходовании.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОбОтгрузкеМДЛП
//         - ДокументОбъект.УведомлениеОбОтгрузкеВРФМДЛП
//         - ДокументОбъект.УведомлениеОСменеСобственникаВЗТКМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияВладельцаОВвозеЛПвРФБезПодтверждения(Объект) Экспорт
	
	
	
КонецПроцедуры

// Выполняет действия при изменении GTIN, номера серии, годен до.
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормы - Документ, в которой произошло событие,
//  ТекущаяСтрока - СтрокаТабличнойЧасти - строка таблицы товаров,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииПараметровНоменклатуры(Объект, ТекущаяСтрока, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Ссылка")
		И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ИнвентаризацияПотребительскихУпаковокМДЛП") Тогда
		ор_ИнтеграцияМДЛП.ЗаполнитьНоменклатуруХарактеристикуПоGTIN(Объект, ТекущаяСтрока);
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Упаковка")
			И Не ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
			ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитыНоменклатуры(ТекущаяСтрока);
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ТекущаяСтрока.Номенклатура = ор_ИнтеграцияМДЛП.НайтиНоменклатруПоGTIN(ТекущаяСтрока.GTIN);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Упаковка")
				И Не ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
				ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитыНоменклатуры(ТекущаяСтрока);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении количества в таблице Товары.
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормы - Документ, в которой произошло событие,
//  ТекущаяСтрока - СтрокаТабличнойЧасти - строка таблицы товаров,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииКоличества(Объект, ТекущаяСтрока, ПараметрыЗаполнения) Экспорт
	
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Выполняет действия при изменении цены в таблице Товары.
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормы - Документ, в которой произошло событие,
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка таблицы товаров,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииЦены(Объект, ТекущаяСтрока, ПараметрыЗаполнения) Экспорт
	
	
	
КонецПроцедуры

// Заполняет реквизит "Серия" в товарной табличной части
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормыКоллекция
//  ИмяТабличнойЧасти - Строка - Товарная табличная часть документа;
//  СтрокиКОбработке - Массив - Массив строк табличной части;
//  ПараметрыУказанияСерий - Структура - Параметры указания серий, формируется в модулях менеджеров документов.
//  Результат - Структура - см. ИнтеграцияМДЛП.ПустойРезультатЗаполненияСерий(),
//                          нужно заполнить информацию об ошибках и результате операции.
//
Процедура ЗаполнитьСгенерироватьСерии(Объект, ИмяТабличнойЧасти, СтрокиКОбработке = Неопределено, ПараметрыУказанияСерий = Неопределено, Результат) Экспорт
	
	
	
КонецПроцедуры

// Проверяет использование нескольких организаций в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Несколько организаций используются.
//
Функция ИспользоватьНесколькоОрганизаций() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	// -ор интеграция МДЛП
	Возврат Истина;
	
КонецФункции

// Проверяет использование мест деятельности организаций в информационной базе.
// 
// Возвращаемое значение:
//  Булево - места деятельности используются.
//
Функция ИспользоватьМестаДеятельности() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций();
	// -ор интеграция МДЛП
	Возврат Истина;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет использование мест деятельности контрагентов в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Места деятельности используются.
//
Функция ИспользоватьМестаДеятельностиКонтрагентов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Проверяет использование характеристик номенклатуры в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Характеристики используются.
//
Функция ИспользоватьХарактеристикиНоменклатуры() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	// -ор интеграция МДЛП
	Возврат Истина;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет использование серий номенклатуры в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Серии используются.
//
Функция ИспользоватьСерииНоменклатуры() Экспорт
	
	// +ор интеграция МДЛП
	Возврат Ложь;
	// -ор интеграция МДЛП
	
	Возврат Ложь;
	
КонецФункции

// Проверяет использование упаковок номенклатуры в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Упаковки используются.
//
Функция ИспользоватьУпаковкиНоменклатуры() Экспорт
	
	// +ор интеграция МДЛП
	Возврат Истина;
	//Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	// -ор интеграция МДЛП
	
	Возврат Ложь;
	
КонецФункции

// Позволяет определить получение валюты регламентированного учета.
//
// Возвращаемое значение:
//  СправочникСсылка.Валюты - Валюта регламентированного учета.
//
Функция ВалютаРегламентированногоУчета() Экспорт
	
	Возврат "RUR";
	
КонецФункции

// Возвращает структуру, содержащую Страну, Регистрационный номер, наименование, признак физического лица, ИНН и КПП.
//
// Параметры:
//  Контрагент - ОпределяемыйТип.КонтрагентГИСМ - Контрагент.
//
// Возвращаемое значение:
//   Структура - со свойствами:
//     Страна  - Строка - Страна регистрации контрагента.
//     РегистрационныйНомер  - Строка - Регистрационный номер контрагента.
//     Наименование  - Строка - Наименование контрагента.
//     НаименованиеПолное  - Строка - Полное наименование контрагента.
//     ЭтоФизическоеЛицо  - Булево - Признак физического лица.
//     ИНН  - Строка - ИНН контрагента.
//     КПП  - Строка - КПП контрагента.
//     ЮридическийАдрес - Строка - Юридический адрес контрагента.
//
Функция РеквизитыКонтрагента(Контрагент) Экспорт
	
	// +ор интеграция МДЛП
	Реквизиты = Новый Структура("Страна, РегистрационныйНомер, Наименование, НаименованиеПолное, ЭтоФизическоеЛицо, ИТИН, ИНН, КПП, ЮридическийАдрес");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮрФизЛицо,
	|	Контрагенты.СтранаРегистрации КАК СтранаРегистрации,
	|	Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформация.Представление, """") КАК ЮридическийАдрес
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО Контрагенты.Ссылка = КонтрагентыКонтактнаяИнформация.Ссылка
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &ТипКИ)
	|			И (КонтрагентыКонтактнаяИнформация.Вид = &ВидКИ)
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Запрос.УстановитьПараметр("ТипКИ" , Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидКИ" , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Реквизиты;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Реквизиты.ЭтоФизическоеЛицо    = Выборка.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		Реквизиты.ИНН                  = Выборка.ИНН;
		Реквизиты.КПП                  = Выборка.КПП;
		Реквизиты.РегистрационныйНомер = Выборка.РегистрационныйНомер;
		Реквизиты.Наименование         = Выборка.Наименование;
		Реквизиты.Страна               = Выборка.СтранаРегистрации;
		Реквизиты.ЮридическийАдрес     = Выборка.ЮридическийАдрес;
		
	КонецЕсли;
	
	Возврат Реквизиты;
	// -ор интеграция МДЛП
	
	Реквизиты = Новый Структура("Страна, РегистрационныйНомер, Наименование, НаименованиеПолное, ЭтоФизическоеЛицо, ИНН, КПП, ЮридическийАдрес");
	
	Возврат Реквизиты;
	
КонецФункции

// В функции нужно определить описание типов объектов прикладного решения.
// На пример:
//	ТипОрганизация = Новый ОписаниеТипов("СправочникСсылка.Организации");
//	Типы = Новый Массив;
//	Типы.Добавить(Тип("СправочникСсылка.Склады"));
//	Типы.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
//	ТипОбъектМестаДеятельностиОрганизации = Новый ОписаниеТипов(Типы);
//	ТипКонтрагент = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
//
// Параметры:
//  ТипОрганизация - ОписаниеТипов - описание типа для собственной организации,
//  ТипОбъектМестаДеятельностиОрганизации - ОписаниеТипа - описание типа для собственного объекта места деятельности,
//  ТипКонтрагент - ОписаниеТипа - описание типа для сторонней организации,
//  ТипОбъектМестаДеятельностиКонтрагента - ОписаниеТипа - описание типа для стороннего объекта места деятельности.
//
//
Процедура ОписаниеТиповОрганизацииКонтрагентаОбъектаМестаДеятельности(
		ТипОрганизация = Неопределено,
		ТипОбъектМестаДеятельностиОрганизации = Неопределено,
		ТипКонтрагент = Неопределено,
		ТипОбъектМестаДеятельностиКонтрагента = Неопределено) Экспорт
	
	// +ор интеграция МДЛП
	ТипОрганизация                        = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипОбъектМестаДеятельностиОрганизации = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	ТипКонтрагент                         = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ТипОбъектМестаДеятельностиКонтрагента = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо настроить подключаемое оборудование,
//  ПрефиксыЭлементовФормы - Строка - строка имен табличных частей, разделенных запятыми,
//                                    в которых нужно настроить видимость команд.
//
Процедура НастроитьПодключаемоеОборудование(Форма, ПрефиксыЭлементовФормы = "Товары") Экспорт
	
	// +ор интеграция МДЛП
	МенеджерОборудованияРМК.НастроитьПодключаемоеОборудование(Форма, ПрефиксыЭлементовФормы);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Получить количество возможных документов-оснований для сопоставления с документом-уведомлением.
//
// Параметры:
//  Объект - ДокументОбъект.Уведомление - документ для которого подбираются документ-основание.
// 
// Возвращаемое значение:
//  Число - количество документов.
//
Функция ПолучитьКоличествоВозможныхОснованийДляУведомления(Объект) Экспорт
	
	// +ор интеграция МДЛП
	ПолучитьКоличествоВозможных = Ложь;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
		ПолучитьКоличествоВозможных = Истина;
	КонецЕсли;
	
	Если НЕ ПолучитьКоличествоВозможных Тогда
		Возврат 0;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НомерДокумента"                  , Объект.НомерДокумента);
	СтруктураПараметров.Вставить("ДатаДокумента"                   , Объект.ДатаДокумента);
	СтруктураПараметров.Вставить("Операция"                        , Объект.Операция);
	СтруктураПараметров.Вставить("ОрганизацияМДЛП"                 , Объект.Организация);
	СтруктураПараметров.Вставить("МестоДеятельностиОрганизацииМДЛП", Объект.МестоДеятельности);
	СтруктураПараметров.Вставить("КонтрагентМДЛП"                  , Объект.Грузоотправитель);
	СтруктураПараметров.Вставить("МестоДеятельностиКонтрагентаМДЛП", Объект.МестоДеятельностиГрузоотправителя);
	СтруктураПараметров.Вставить("ТипДоговора"                     , Объект.ТипДоговора);
	СтруктураПараметров.Вставить("ТипОперации"                     , Объект.ТипОперации);
	
	СписокУведомлений = ор_ИнтеграцияМДЛП.ПолучитьТаблицуВыбораОснований(СтруктураПараметров);
	
	Если СписокУведомлений = Неопределено Тогда
		Возврат 0;
	Иначе
		Возврат СписокУведомлений.Количество();
	КонецЕсли;
	// -ор интеграция МДЛП
	
	КоличествоДокументов = 0;
	
	Возврат КоличествоДокументов;
	
КонецФункции

// Нужно реализовать проверку наличия расхождений между Уведомлением и Основанием.
//
// Параметры:
//  Уведомление - ДокументСсылка.Уведомление - проверяемое уведомление,
//  Основание - ДокументСсылка - проверяемое основание уведомления.
//
// Возвращаемое значение:
//  Булево - Истина, если есть расхождения, иначе - Ложь.
//
Функция ЕстьРасхожденияМеждуУведомлениемИОснованием(Уведомление, Основание) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Нужно заполнить список возможных уведомлений для связи с основанием.
//
// Параметры:
//  МетаданныеУведомления - ОбъектМетаданных - метаданные уведомления, возможные значения которого надо получить;
//  Основание - Ссылка - основание уведомления, для которого подбираются уведомления.
//
// Возвращаемое значение:
//  Массив - список подходящих уведомлений.
//
Функция ВозможныеУведомленияПоОснованию(МетаданныеУведомления, Основание) Экспорт
	
	ВозможныеУведомления = Новый Массив;
	
	// +ор интеграция МДЛП
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеЗапасов") ТОгда
		
		СписокВыбораДляСвязыванияПеремещенияТоваров = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораДляСвязыванияПеремещенияТоваров(Основание);
		
		Для Каждого Строка Из СписокВыбораДляСвязыванияПеремещенияТоваров Цикл
			ВозможныеУведомления.Добавить(Строка.Значение);
		КонецЦикла;
		
	Иначе
		
		СтруктураВозврата = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораУведомленний(Основание);
		
		Если СтруктураВозврата <> Неопределено Тогда
			Для Каждого Строка Из СтруктураВозврата.ТаблицаУведомлений Цикл
				
				Если НЕ Строка.УжеСопоставлен Тогда
					ВозможныеУведомления.Добавить(Строка.Ссылка);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
	Возврат ВозможныеУведомления;
	
КонецФункции

// Можно переопределить необходимость добавления команды создания уведомления для учетного документа.
//
// Параметры:
//  МетаданныеУведомления - ОбъектМетаданных - Метаданные документа.
//  Основание             - Ссылка - основание уведомления, для которого подбираются уведомления.
// 
// Возвращаемое значение:
//   Булево - команда создания уведомления не будет/будет добавлена (Ложь/Истина)
//
Функция НужноСоздатьУведомленияПоОснованию(МетаданныеУведомления, Основание) Экспорт
	
	// +ор интеграция МДЛП
	Если МетаданныеУведомления = Метаданные.Документы.УведомлениеВладельцаОбОприходованииМДЛП Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяСоздание = Ложь;
	ТипОбъектОснование = ТипЗнч(Основание);
	
	Если ТипОбъектОснование = ТИП("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
		Если ор_ИнтеграцияМДЛП.ИспользуетсяОрдернаяСхемаПриемкиОтгрузки(Основание) Тогда
			ТребуетсяСоздание = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.РасходнаяНакладная") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
		Если ор_ИнтеграцияМДЛП.ИспользуетсяОрдернаяСхемаПриемкиОтгрузки(Основание) Тогда
			ТребуетсяСоздание = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.СписаниеЗапасов") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.ОприходованиеЗапасов") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.ор_ИзготовлениеЛекарственныхФорм") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.КомплектацияЗапасов") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.ЧекККМ") Тогда
		
		ТребуетсяСоздание = Истина;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		СтруктураОтправитель = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиница, Истина);
		СтруктураПолучатель  = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.Организация, Основание.СтруктурнаяЕдиницаПолучатель , Истина);
		
		Если СтруктураОтправитель.Идентификатор = СтруктураПолучатель.Идентификатор Тогда
			ТребуетсяСоздание = Ложь;
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураОтправитель.Организация) Тогда
			ТребуетсяСоздание = СтруктураОтправитель.ВестиУчетВЭтойИБ;
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.ПриходныйОрдер")
		И ТипЗнч(Основание.ДокументОснование) = ТИП("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		СтруктураОтправитель = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.ДокументОснование.Организация, Основание.ДокументОснование.СтруктурнаяЕдиница, Истина);
		СтруктураПолучатель  = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.ДокументОснование.Организация, Основание.ДокументОснование.СтруктурнаяЕдиницаПолучатель , Истина);
		
		Если СтруктураОтправитель.Идентификатор = СтруктураПолучатель.Идентификатор Тогда
			ТребуетсяСоздание = Ложь;
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураОтправитель.Организация) Тогда
			ТребуетсяСоздание = СтруктураОтправитель.ВестиУчетВЭтойИБ;
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.ПриходныйОрдер") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.ДокументОснование.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.РасходныйОрдер")
		И ТипЗнч(Основание.ДокументОснование) = ТИП("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		СтруктураОтправитель = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.ДокументОснование.Организация, Основание.ДокументОснование.СтруктурнаяЕдиница, Истина);
		СтруктураПолучатель  = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.ДокументОснование.Организация, Основание.ДокументОснование.СтруктурнаяЕдиницаПолучатель , Истина);
		
		Если СтруктураОтправитель.Идентификатор = СтруктураПолучатель.Идентификатор Тогда
			ТребуетсяСоздание = Ложь;
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураОтправитель.Организация) Тогда
			ТребуетсяСоздание = СтруктураОтправитель.ВестиУчетВЭтойИБ;
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъектОснование = ТИП("ДокументСсылка.РасходныйОрдер") Тогда
		
		СтруктураОрганизации = ор_ИнтеграцияМДЛП.ПолучитьОрганизациюИМестоДеятельностиМДЛП(Основание.ДокументОснование.Организация, Основание.СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(СтруктураОрганизации.Организация) Тогда
			ТребуетсяСоздание = СтруктураОрганизации.ВестиУчетВЭтойИБ;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТребуетсяСоздание;
	// -ор интеграция МДЛП
	
КонецФункции

// Можно установить возможность отключения требования создания уведомления на основании учетного документа.
//
// Параметры:
//  Основание             - Ссылка - основание уведомления, для которого подбираются уведомления.
//
// Возвращаемое значение:
//   Булево - будет добавлена команда отключения требования создания уведомления на основании учетного документа.
//
Функция МожноОтключитьТребованиеСозданияРаспоряженияНаОформление(Основание) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Можно переопределить использование действия ЗапроситеИнформациюОбУпаковках в документе.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - ссылка на документа, в котором используется действие ЗапроситеИнформациюОбУпаковках.
//  НастройкиПоУмолчанию - Соответствие - настройки использования действия ЗапроситеИнформациюОбУпаковках в документах.
//   * Ключ - Строка - полное имя документа, такое же, как возвращает метод Ссылка.Метаданные().ПолноеИмя().
//   * Значение - Булево - признак использования действия ЗапроситеИнформациюОбУпаковках для документа по умолчанию.
//
// Возвращаемое значение:
//  Булево - признак использования действия ЗапроситеИнформациюОбУпаковках в документе.
//           Истина - в статусе документа, среди дальнейших действий, первым необходимым действием будет ЗапроситеИнформациюОбУпаковках.
//
Функция ИспользоватьДействиеЗапросаИнформацииОбУпаковках(ДокументСсылка, НастройкиПоУмолчанию) Экспорт
	
КонецФункции

#Область ОбработчикиСобытийДокументов

// Вызывается при вводе документа на основании, при выполнении метода Заполнить или при интерактивном вводе нового.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - заполняемый документ,
//  ДанныеЗаполнения - Произвольный - значение, которое используется как основание для заполнения,
//  ТекстЗаполнения - Строка, Неопределено - текст, используемый для заполнения документа,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	// +ор интеграция МДЛП
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	ор_ИнтеграцияМДЛП.ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Вызывается расширением формы в случае необходимости проверки заполнения реквизитов
// при записи или при проведении документа в форме, а также при выполнении метода ПроверитьЗаполнение.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проверяемый документ,
//  Отказ - Булево - признак отказа от проведения документа,
//  ПроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых будет выполнена проверка заполнения,
//  НепроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых не будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты) Экспорт
	
	// +ор интеграция МДЛП
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ИнвентаризационнаяОписьМДЛП") Тогда
		Возврат;
	КонецЕсли;
	
	КонтролироватьЗаполнениеТоваровВУведомлениях = ор_ИнтеграцияМДЛП.ПолучитьПризнакКонтролироватьЗаполнениеТоваровВУведомлениях();
	
	Если КонтролироватьЗаполнениеТоваровВУведомлениях Тогда
		ор_ИнтеграцияМДЛП.ПроверитьЗаполнениеНоменклатуры(ДокументОбъект,НепроверяемыеРеквизиты,Отказ);
	Иначе
		
		НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
		НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
		
	КонецЕсли;
	
	ор_ИнтеграцияМДЛП.ПроверитьЗаполнениеХарактеристик(ДокументОбъект,НепроверяемыеРеквизиты,Отказ);
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОПриемкеМДЛП")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОтгрузкеМДЛП")
		ИЛИ (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОПеремещенииМДЛП")
		И ДокументОбъект.Операция = Перечисления.ОперацииПеремещенияМДЛП.ПриходныйОрдер
		И ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ) Тогда
		
		Если КонтролироватьЗаполнениеТоваровВУведомлениях Тогда
			ор_ИнтеграцияМДЛП.ПроверитьЗаполнениеНоменклатурыТранспортнойУпаковки(ДокументОбъект,НепроверяемыеРеквизиты,Отказ);
		Иначе
			
			НепроверяемыеРеквизиты.Добавить("СоставТранспортныхУпаковок.Номенклатура");
			НепроверяемыеРеквизиты.Добавить("СоставТранспортныхУпаковок.Характеристика");
			
		КонецЕсли;
		
		ор_ИнтеграцияМДЛП.ПроверитьЗаполнениеХарактеристик(ДокументОбъект,НепроверяемыеРеквизиты,Отказ, Новый Структура("ИмяТЧ", "СоставТранспортныхУпаковок"));
		
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОПриемкеМДЛП")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОприходованииМДЛП")
		ИЛИ (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОПеремещенииМДЛП")
		И ДокументОбъект.Операция = Перечисления.ОперацииПеремещенияМДЛП.ПриходныйОрдер
		И ДокументОбъект.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ) Тогда
		
		ДанныеGTIN = Новый Соответствие;
		Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.GTIN) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
				ПолученныйGTIN = ДанныеGTIN[СтрокаТабличнойЧасти.GTIN];
				Если ПолученныйGTIN = Неопределено Тогда
					ДанныеGTIN.Вставить(СтрокаТабличнойЧасти.GTIN, Новый Структура("Номенклатура", СтрокаТабличнойЧасти.Номенклатура));
				ИначеЕсли ПолученныйGTIN.Номенклатура <> СтрокаТабличнойЧасти.Номенклатура Тогда
					ТекстСообщения = НСтр("ru = 'В списке товаров есть строки с одним и тем же GTIN %GTIN% для разной номенклатуры.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "", СтрокаТабличнойЧасти.GTIN);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект.СоставТранспортныхУпаковок Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.GTIN) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
				ПолученныйGTIN = ДанныеGTIN[СтрокаТабличнойЧасти.GTIN];
				Если ПолученныйGTIN = Неопределено Тогда
					ДанныеGTIN.Вставить(СтрокаТабличнойЧасти.GTIN, Новый Структура("Номенклатура", СтрокаТабличнойЧасти.Номенклатура));
				ИначеЕсли ПолученныйGTIN.Номенклатура <> СтрокаТабличнойЧасти.Номенклатура Тогда
					ТекстСообщения = НСтр("ru = 'В списке состава транспортных упаковок есть строки с одним и тем же GTIN %GTIN% для разной номенклатуры.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "", СтрокаТабличнойЧасти.GTIN);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Возникает перед выполнением записи документа. Вызывается после начала транзакции записи, но до начала записи документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ,
//  Отказ - Булево - признак отказа от записи,
//  РежимЗаписи - РежимЗаписиДокумента - текущий режим записи документа,
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения документа.
//
Процедура ПередЗаписью(ДокументОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// +ор интеграция МДЛП
	Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) И ЗначениеЗаполнено(ДокументОбъект.Ссылка.Основание) Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОснованиеПередЗаписью", ДокументОбъект.Ссылка.Основание);
	КонецЕсли;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Возникает при проведении документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ,
//  Отказ - Булево - признак отказа от проведения документа,
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения документа.
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартной обработки проведения документа.
//
Процедура ОбработкаПроведения(ДокументОбъект, Отказ, РежимПроведения, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Возникает при отмене проведения документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ,
//  Отказ - Булево - признак отказа отмены проведения документа,
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартной обработки отмены проведения документа.
//
Процедура ОбработкаУдаленияПроведения(ДокументОбъект, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Процедура вызывается при изменении статуса обработки документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - ссылка на документ,
//  ПредыдущийСтатус - ПеречислениеСсылка.СтатусыОбработки* - предыдущий статус обработки,
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбработки* - новый статус обработки.
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус) Экспорт
	
	
	
КонецПроцедуры

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОЗавершенииЭтапаОкончательнойУпаковки(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - ссылка на документ,
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОЗавершенииЭтапаОкончательнойУпаковки(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// см. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтбореОбразцов(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтбореОбразцов(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыпускеГотовойПродукции(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыпускеГотовойПродукции(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыпускеГотовойПродукцииЗаПределамиРФ(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыпускеГотовойПродукцииЗаПределамиРФ(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОРозничныхПродажах(ДокументОснование) Экспорт
	
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("Проведен");
	ЗапрашиваемыеРеквизиты.Вставить("Дата");
	ЗапрашиваемыеРеквизиты.Вставить("Номер");
	ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
	//ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
	ЗапрашиваемыеРеквизиты.Вставить("Организация");
	ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
	ЗапрашиваемыеРеквизиты.Вставить("Статус");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
	
	ЗаписьТребуется = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
	
	Если НЕ(ЗначенияРеквизитов.Статус = Перечисления.СтатусыЧековККМ.Пробит) Тогда
		ЗаписьТребуется = Ложь;
	КонецЕсли;
	
	Если ор_ИнтеграцияМДЛП.ПолучитьПризнакПередачиДанныхМаркировкиЧерезОФД(ДокументОснование) Тогда
		ЗаписьТребуется = Ложь;
	КонецЕсли;
	
	ИнтеграцияМДЛП.РассчитатьСтатусОформления(
		Метаданные.Документы.УведомлениеОРозничнойПродажеМДЛП,
		ДокументОснование,
		ЗначенияРеквизитов,
		ЗаписьТребуется);
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОРозничныхПродажах(ДокументОснование) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОРозничнойПродажеМДЛП КАК ТаблицаДокументы
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ПО
	|		Статусы.Документ = ТаблицаДокументы.Ссылка
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ (ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|		И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1                      КАК План,
	|	0                      КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		#ДокументНомераУпаковок КАК ТаблицаУпаковок
	|	ПО
	|		ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка
	|		И ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОРозничнойПродажеМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОРозничнойПродажеМДЛП.Товары КАК ОформленныеТовары
	|	ПО
	|		ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка
	|		И ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеТовары.Ссылка
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План)   КАК План,
	|	СУММА(ТоварыКОформлению.Факт)   КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары", ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПриемке(ДокументОснование) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	ЗаказПоставщикуСсылка = Неопределено;
	ЭтоДокументОрдера = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			ДокументОснованиеСсылка = РеквизитыДокумента.ДокументОснование;
			
		ИначеЕсли ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			Поступление = ор_ИнтеграцияМДЛП.ПолучитьПоступлениеТоваровПоЗаказуПоставщику(РеквизитыДокумента.ДокументОснование);
			
			Если Поступление = Неопределено Тогда
				Возврат;
			Иначе
				ДокументОснованиеСсылка = Поступление;
				ЗаказПоставщикуСсылка = РеквизитыДокумента.ДокументОснование;
			КонецЕсли;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		ДокументОснованиессылка = ДокументОснование;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснованиессылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "ДатаВходящегоДокумента");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "НомерВходящегоДокумента");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		Если НЕ ЗначениеЗаполнено(ЗначенияРеквизитов.ИспользоватьОрдернуюСхему) Тогда
			
			ЕстьМаркируемаяПродукция = Ложь;
			
		ИначеЕсли ЗначенияРеквизитов.ИспользоватьОрдернуюСхему Тогда
			
			Если НЕ ЭтоДокументОрдера Тогда
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА ПриходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.ПриходныйОрдер КАК ПриходныйОрдер
			|ГДЕ
			|	ПриходныйОрдер.ДокументОснование = &ДокументОснование
			|	ИЛИ ПриходныйОрдер.ДокументОснование = &ЗаказПоставщикуСсылка";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			Запрос.УстановитьПараметр("ЗаказПоставщикуСсылка", ЗаказПоставщикуСсылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукция = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукция = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		Иначе
			
			ЕстьМаркируемыеТовары = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &Ссылка
			|	И Товары.ор_СтатусЗаполненияУпаковок <> 0";
			Запрос.УстановитьПараметр("Ссылка", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемыеТовары = Ложь;
			Иначе
				ЕстьМаркируемыеТовары = Истина;
			КонецЕсли;
			
			ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция ИЛИ ЕстьМаркируемыеТовары;
			
		КонецЕсли;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОПриемкеМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПриемке(ДокументОснование) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка КАК Ссылка,
	|	Статусы.Статус КАК Статус
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП КАК ТаблицаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1 КАК План,
	|	0 КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ДокументНомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ,
	|	1,
	|	0
	|ИЗ
	|	Документ.ПриходныйОрдер.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдер.ор_НомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	Документ.ПриходныйОрдер.ор_ТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТранспортныеУпаковки.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	ВЫБОР
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
	|						ТОГДА 0
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.Товары КАК ОформленныеТовары
	|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
	|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	ВЫБОР
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
	|						ТОГДА 0
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План) КАК План,
	|	СУММА(ТоварыКОформлению.Факт) КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт > 0
	|			И Т.План > 0) КАК ЕстьОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт >= 0
	|			И Т.План > Т.Факт) КАК ЕстьНеОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План = Т.Факт) КАК ЕстьПолностьюОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План < Т.Факт) КАК ЕстьОшибкиОформления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВвозеЛПвРФ(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВвозеЛПвРФ(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВвозеЛПвРФБезИмпортера(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВвозеЛПвРФБезИмпортера(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтгрузке(ДокументОснование) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	ЭтоДокументОрдера = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ДокументОснованиессылка = ДокументОснование;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		Если ЗначенияРеквизитов.ИспользоватьОрдернуюСхему Тогда
			
			Если НЕ ЭтоДокументОрдера Тогда
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА РасходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.РасходныйОрдер КАК РасходныйОрдер
			|ГДЕ
			|	РасходныйОрдер.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукция = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукция = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		Иначе
			ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
		КонецЕсли;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОбОтгрузкеМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтгрузке(ДокументОснование) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка КАК Ссылка,
	|	Статусы.Статус КАК Статус
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОбОтгрузкеМДЛП КАК ТаблицаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1 КАК План,
	|	0 КАК Факт,
	|	0 КАК Актуализирован
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ДокументНомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0,
	|	0
	|ИЗ
	|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ,
	|	1,
	|	0,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.ор_ТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТранспортныеУпаковки.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	ВЫБОР
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
	|						ТОГДА 0
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках)
	|			ТОГДА 1
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.УведомлениеОбОтгрузкеМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтгрузкеМДЛП.Товары КАК ОформленныеТовары
	|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
	|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	ВЫБОР
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
	|						ТОГДА 0
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках)
	|			ТОГДА 1
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.УведомлениеОбОтгрузкеМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План) КАК План,
	|	СУММА(ТоварыКОформлению.Факт) КАК Факт,
	|	СУММА(ТоварыКОформлению.Актуализирован) КАК Актуализирован
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт > 0
	|			И Т.План > 0) КАК ЕстьОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт >= 0
	|			И Т.План > Т.Факт) КАК ЕстьНеОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План = Т.Факт) КАК ЕстьПолностьюОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			(Т.План < Т.Факт
	|				ИЛИ Т.Факт = 0
	|					И Т.Актуализирован > 0)) КАК ЕстьОшибкиОформления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтгрузкеВРФ(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтгрузкеВРФ(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПеремещении(ДокументОснование) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	ЭтоДокументОрдера = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		ДокументОснованиессылка = ДокументОснование;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснованиессылка) = ТИП("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный", "Автор");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		ЕстьМаркируемаяПродукцияОрдера = Ложь;
		
		Если ЗначенияРеквизитов.ИспользоватьОрдернуюСхему И ЭтоДокументОрдера Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА РасходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.РасходныйОрдер КАК РасходныйОрдер
			|ГДЕ
			|	РасходныйОрдер.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукцияОрдера = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукцияОрдера = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаписьТребуется = ЕстьМаркируемаяПродукцияОрдера ИЛИ ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОПеремещенииМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЗаписьТребуется);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - Ссылка - основание уведомления, для которого формируется запрос статуса.
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями.
//
Функция ЗапросСтатусаОформленияУведомленияОПеремещении(ДокументОснование) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОПеремещенииМДЛП КАК ТаблицаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ(ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|				И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1 КАК План,
	|	0 КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ДокументНомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ,
	|	1,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.ор_ТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТранспортныеУпаковки.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОПеремещенииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПеремещенииМДЛП.Товары КАК ОформленныеТовары
	|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
	|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОПеремещенииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
	|ГДЕ
	|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План) КАК План,
	|	СУММА(ТоварыКОформлению.Факт) КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт > 0
	|			И Т.План > 0) КАК ЕстьОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт >= 0
	|			И Т.План > Т.Факт) КАК ЕстьНеОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План = Т.Факт) КАК ЕстьПолностьюОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План < Т.Факт) КАК ЕстьОшибкиОформления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПеремещенииГЛО(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПеремещенииГЛО(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПеремещенииМеждуЗТК(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПеремещенииМеждуЗТК(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтпускеПоЛьготномуРецепту(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтпускеПоЛьготномуРецепту(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыдачеВОтделения(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыдачеВОтделения(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПередачеНаУничтожение(ДокументОснование) Экспорт
	
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("Проведен");
	ЗапрашиваемыеРеквизиты.Вставить("Дата");
	ЗапрашиваемыеРеквизиты.Вставить("Номер");
	ЗапрашиваемыеРеквизиты.Вставить("Ответственный", "Автор");
	ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
	ЗапрашиваемыеРеквизиты.Вставить("Организация");
	ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
	
	ИнтеграцияМДЛП.РассчитатьСтатусОформления(
		Метаданные.Документы.УведомлениеОПередачеНаУничтожениеМДЛП,
		ДокументОснование,
		ЗначенияРеквизитов,
		ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция);
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПередачеНаУничтожение(ДокументОснование) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОПередачеНаУничтожениеМДЛП КАК ТаблицаДокументы
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ПО
	|		Статусы.Документ = ТаблицаДокументы.Ссылка
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ (ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|		И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1                        КАК План,
	|	0                        КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		#ДокументНомераУпаковок КАК ТаблицаУпаковок
	|	ПО
	|		ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка
	|		И ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	1                           КАК План,
	|	0                           КАК Факт
	|ИЗ
	|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОПередачеНаУничтожениеМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОПередачеНаУничтожениеМДЛП.Товары КАК ОформленныеТовары
	|	ПО
	|		ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка
	|		И ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОПередачеНаУничтожениеМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка
	|ГДЕ
	|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План)   КАК План,
	|	СУММА(ТоварыКОформлению.Факт)   КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОФактеУничтожения(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОФактеУничтожения(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыбытии(ДокументОснование) Экспорт
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ор_ИзготовлениеЛекарственныхФорм") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОВыбытииМДЛП,
			ДокументОснование,
			ЗначенияРеквизитов,
			ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция);
		
	Иначе
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный", "Автор");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОВыбытииМДЛП,
			ДокументОснование,
			ЗначенияРеквизитов,
			ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыбытии(ДокументОснование) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОВыбытииМДЛП КАК ТаблицаДокументы
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ПО
	|		Статусы.Документ = ТаблицаДокументы.Ссылка
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ (ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|		И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1                        КАК План,
	|	0                        КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		#ДокументНомераУпаковок КАК ТаблицаУпаковок
	|	ПО
	|		ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка
	|		И ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0";
	
	Если ДокументОснование.Метаданные().ПолноеИмя() = "Документ.СписаниеТоваров" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
		|	1                           КАК План,
		|	0                           КАК Факт
		|ИЗ
		|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
		|ГДЕ
		|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОВыбытииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОВыбытииМДЛП.Товары КАК ОформленныеТовары
	|	ПО
	|		ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка
	|		И ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОВыбытииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка
	|ГДЕ
	|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План)   КАК План,
	|	СУММА(ТоварыКОформлению.Факт)   КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПовторномВводеВОборот(ДокументОснование) Экспорт
	
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("Проведен");
	ЗапрашиваемыеРеквизиты.Вставить("Дата");
	ЗапрашиваемыеРеквизиты.Вставить("Номер");
	ЗапрашиваемыеРеквизиты.Вставить("Ответственный", "Автор");
	ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
	ЗапрашиваемыеРеквизиты.Вставить("Организация");
	ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
	
	ИнтеграцияМДЛП.РассчитатьСтатусОформления(
		Метаданные.Документы.УведомлениеОПовторномВводеВОборотМДЛП,
		ДокументОснование,
		ЗначенияРеквизитов,
		ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция);
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПовторномВводеВОборот(ДокументОснование) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОПовторномВводеВОборотМДЛП КАК ТаблицаДокументы
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ПО
	|		Статусы.Документ = ТаблицаДокументы.Ссылка
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ (ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|		И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1                        КАК План,
	|	0                        КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		#ДокументНомераУпаковок КАК ТаблицаУпаковок
	|	ПО
	|		ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка
	|		И ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОПовторномВводеВОборотМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОПовторномВводеВОборотМДЛП.Товары КАК ОформленныеТовары
	|	ПО
	|		ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка
	|		И ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеТовары.Ссылка
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План)   КАК План,
	|	СУММА(ТоварыКОформлению.Факт)   КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары", ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбАгрегированииИТрансформацииУпаковок(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбАгрегированииИТрансформацииУпаковок(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВводеВОборот(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВводеВОборот(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОСменеСобственникаВЗТК(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОСменеСобственникаВЗТК(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПриемкеНовымСобственникомЛПвЗТК(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПриемкеНовымСобственникомЛПвЗТК(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОРезультатахТаможенногоОформления(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОРезультатахТаможенногоОформления(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПриемкеНаСкладИмпортера(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПриемкеНаСкладИмпортера(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПередачеКМТаможенномуСкладу(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПередачеКМТаможенномуСкладу(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбЭмиссииКМ(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбЭмиссииКМ(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОприходовании(ДокументОснование) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	ЗаказПоставщикуСсылка = Неопределено;
	ЭтоДокументОрдера = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			ДокументОснованиеСсылка = РеквизитыДокумента.ДокументОснование;
			
		ИначеЕсли ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			Поступление = ор_ИнтеграцияМДЛП.ПолучитьПоступлениеТоваровПоЗаказуПоставщику(РеквизитыДокумента.ДокументОснование);
			
			Если Поступление = Неопределено Тогда
				Возврат;
			Иначе
				ДокументОснованиеСсылка = Поступление;
				ЗаказПоставщикуСсылка = РеквизитыДокумента.ДокументОснование;
			КонецЕсли;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если (ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная"))
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОприходованиеЗапасов")
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		ДокументОснованиессылка = ДокументОснование;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснованиессылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "ДатаВходящегоДокумента");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "НомерВходящегоДокумента");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		Если НЕ ЗначениеЗаполнено(ЗначенияРеквизитов.ИспользоватьОрдернуюСхему) Тогда
			
			ЕстьМаркируемаяПродукция = Ложь;
			
		ИначеЕсли ЗначенияРеквизитов.ИспользоватьОрдернуюСхему Тогда
			
			Если НЕ ЭтоДокументОрдера Тогда
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА ПриходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.ПриходныйОрдер КАК ПриходныйОрдер
			|ГДЕ
			|	ПриходныйОрдер.ДокументОснование = &ДокументОснование
			|	ИЛИ ПриходныйОрдер.ДокументОснование = &ЗаказПоставщикуСсылка";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			Запрос.УстановитьПараметр("ЗаказПоставщикуСсылка", ЗаказПоставщикуСсылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукция = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукция = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		Иначе
			
			ЕстьМаркируемыеТовары = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &Ссылка
			|	И Товары.ор_СтатусЗаполненияУпаковок <> 0";
			Запрос.УстановитьПараметр("Ссылка", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемыеТовары = Ложь;
			Иначе
				ЕстьМаркируемыеТовары = Истина;
			КонецЕсли;
			
			ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция ИЛИ ЕстьМаркируемыеТовары;
			
		КонецЕсли;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОбОприходованииМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	ИначеЕсли ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		Если ЗначенияРеквизитов.ИспользоватьОрдернуюСхему Тогда
			
			Если НЕ ЭтоДокументОрдера Тогда
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА РасходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.РасходныйОрдер КАК РасходныйОрдер
			|ГДЕ
			|	РасходныйОрдер.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукция = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукция = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		Иначе
			ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
		КонецЕсли;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОбОприходованииМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	ИначеЕсли ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.ОприходованиеЗапасов") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "Номер");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОбОприходованииМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОприходовании(ДокументОснование) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП КАК ТаблицаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ(ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|				И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1 КАК План,
	|	0 КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ДокументНомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0";
	
	Если ДокументОснование.Метаданные().ПолноеИмя() <> "Документ.ОприходованиеЗапасов" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
		|	1,
		|	0
		|ИЗ
		|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
		|ГДЕ
		|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ,
	|	1,
	|	0
	|ИЗ
	|	Документ.ПриходныйОрдер.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдер.ор_НомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	Документ.ПриходныйОрдер.ор_ТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТранспортныеУпаковки.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.Товары КАК ОформленныеТовары
	|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
	|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОбОприходованииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
	|ГДЕ
	|	НЕ ОформленныеТранспортныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План) КАК План,
	|	СУММА(ТоварыКОформлению.Факт) КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт > 0
	|			И Т.План > 0) КАК ЕстьОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт >= 0
	|			И Т.План > Т.Факт) КАК ЕстьНеОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План = Т.Факт) КАК ЕстьПолностьюОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План < Т.Факт) КАК ЕстьОшибкиОформления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВвозеЛПвРФБезПодтверждения(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВвозеЛПвРФБезПодтверждения(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияВладельцаОбОприходовании(ДокументОснование) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	ЭтоДокументОрдера = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ДокументОснованиессылка = ДокументОснование;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		Если ЗначенияРеквизитов.ИспользоватьОрдернуюСхему Тогда
			
			Если НЕ ЭтоДокументОрдера Тогда
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА РасходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.РасходныйОрдер КАК РасходныйОрдер
			|ГДЕ
			|	РасходныйОрдер.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукция = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукция = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		Иначе
			ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
		КонецЕсли;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеВладельцаОбОприходованииМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияВладельцаОбОприходовании(ДокументОснование) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка КАК Ссылка,
	|	Статусы.Статус КАК Статус
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеВладельцаОбОприходованииМДЛП КАК ТаблицаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1 КАК План,
	|	0 КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ДокументНомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	#ДокументТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ,
	|	1,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТранспортныеУпаковки.НомерУпаковки,
	|	1,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.ор_ТранспортныеУпаковки КАК ТаблицаТранспортныеУпаковки
	|ГДЕ
	|	ТаблицаТранспортныеУпаковки.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТранспортныеУпаковки.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКИЗ,
	|	0,
	|	ВЫБОР
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
	|			ТОГДА 0
	|		КОГДА ОформленныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
	|						ТОГДА 0
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	Документ.УведомлениеВладельцаОбОприходованииМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеВладельцаОбОприходованииМДЛП.Товары КАК ОформленныеТовары
	|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
	|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТранспортныеУпаковки.НомерУпаковки,
	|	0,
	|	ВЫБОР
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем)
	|			ТОГДА 0
	|		КОГДА ОформленныеТранспортныеУпаковки.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОформленныеДокументы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто)
	|						ТОГДА 0
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	Документ.УведомлениеВладельцаОбОприходованииМДЛП.ТранспортныеУпаковки КАК ОформленныеТранспортныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТранспортныеУпаковки.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План) КАК План,
	|	СУММА(ТоварыКОформлению.Факт) КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт > 0
	|			И Т.План > 0) КАК ЕстьОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт >= 0
	|			И Т.План > Т.Факт) КАК ЕстьНеОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План = Т.Факт) КАК ЕстьПолностьюОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План < Т.Факт) КАК ЕстьОшибкиОформления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТранспортныеУпаковки", ДокументОснование.Метаданные().ПолноеИмя() + ".ор_ТранспортныеУпаковки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияВладельцаОВвозеЛПвРФБезПодтверждения(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияВладельцаОВвозеЛПвРФБезПодтверждения(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтпускеЛППоДокументамОтличнымОтЧека(ДокументОснование) Экспорт
	
	ДокументОснованиессылка = Неопределено;
	ЭтоДокументОрдера = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		ЭтоДокументОрдера = Истина;
		
		ЗапрашиваемыеРеквизитыДокумента = Новый Структура;
		ЗапрашиваемыеРеквизитыДокумента.Вставить("ДокументОснование");
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизитыДокумента);
		
		Если ТипЗнч(РеквизитыДокумента.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
			И ЗначениеЗаполнено(РеквизитыДокумента.ДокументОснование) Тогда
			
			ДокументОснованиессылка = РеквизитыДокумента.ДокументОснование;
			
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ДокументОснованиессылка = ДокументОснование;
		
	КонецЕсли;
	
	Если ДокументОснованиессылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснованиессылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("Проведен");
		ЗапрашиваемыеРеквизиты.Вставить("Дата", "Дата");
		ЗапрашиваемыеРеквизиты.Вставить("Номер", "Номер");
		ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
		ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
		ЗапрашиваемыеРеквизиты.Вставить("Организация");
		ЗапрашиваемыеРеквизиты.Вставить("ор_ЕстьМаркируемаяПродукция");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьОрдернуюСхему", "СтруктурнаяЕдиница.ОрдерныйСклад");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснованиессылка, ЗапрашиваемыеРеквизиты);
		
		Если ЗначенияРеквизитов.ИспользоватьОрдернуюСхему Тогда
			
			Если НЕ ЭтоДокументОрдера Тогда
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА РасходныйОрдер.ор_ЕстьМаркируемаяПродукция
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК ор_ЕстьМаркируемаяПродукция
			|ИЗ
			|	Документ.РасходныйОрдер КАК РасходныйОрдер
			|ГДЕ
			|	РасходныйОрдер.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснованиессылка);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				ЕстьМаркируемаяПродукция = Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЕстьМаркируемаяПродукция = Выборка.ор_ЕстьМаркируемаяПродукция > 0;
			КонецЕсли;
			
		Иначе
			ЕстьМаркируемаяПродукция = ЗначенияРеквизитов.ор_ЕстьМаркируемаяПродукция;
		КонецЕсли;
		
		ИнтеграцияМДЛП.РассчитатьСтатусОформления(
			Метаданные.Документы.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП,
			ДокументОснованиессылка,
			ЗначенияРеквизитов,
			ЕстьМаркируемаяПродукция);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтпускеЛППоДокументамОтличнымОтЧека(ДокументОснование) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка КАК Ссылка,
	|	Статусы.Статус КАК Статус
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП КАК ТаблицаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|		ПО (Статусы.Документ = ТаблицаДокументы.Ссылка)
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ КАК НомерУпаковки,
	|	1 КАК План,
	|	0 КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ДокументНомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУпаковок.НомерКИЗ,
	|	1,
	|	0
	|ИЗ
	|	Документ.РасходныйОрдер.Запасы КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдер.ор_НомераУпаковок КАК ТаблицаУпаковок
	|		ПО (ТаблицаУпаковок.Ссылка = ТаблицаТовары.Ссылка)
	|			И (ТаблицаУпаковок.ИдентификаторСтроки = ТаблицаТовары.ор_ИдентификаторСтроки)
	|ГДЕ
	|	ТаблицаТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ТаблицаТовары.ор_СтатусЗаполненияУпаковок <> 0
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.НомерКиЗ,
	|	0,
	|	1
	|ИЗ
	|	Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.НомераУпаковок КАК ОформленныеУпаковки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.Товары КАК ОформленныеТовары
	|		ПО (ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка)
	|			И (ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОформленныеДокументы КАК ОформленныеДокументы
	|		ПО (ОформленныеДокументы.Ссылка = ОформленныеТовары.Ссылка)
	|ГДЕ
	|	НЕ ОформленныеУпаковки.Отклонено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План) КАК План,
	|	СУММА(ТоварыКОформлению.Факт) КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт > 0
	|			И Т.План > 0) КАК ЕстьОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.Факт >= 0
	|			И Т.План > Т.Факт) КАК ЕстьНеОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План = Т.Факт) КАК ЕстьПолностьюОформленныеТовары,
	|	1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			Результат КАК Т
	|		ГДЕ
	|			Т.План < Т.Факт) КАК ЕстьОшибкиОформления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя() + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументНомераУпаковок"      , ДокументОснование.Метаданные().ПолноеИмя() + ".ор_НомераУпаковок");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияИнвентаризационнойОписиМДЛП(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияИнвентаризационнойОписиМДЛП(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияИнвентаризацииПотребительскихУпаковокМДЛП(ДокументОснование) Экспорт
	
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("Проведен");
	ЗапрашиваемыеРеквизиты.Вставить("Дата");
	ЗапрашиваемыеРеквизиты.Вставить("Номер");
	ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "СтруктурнаяЕдиница");
	ЗапрашиваемыеРеквизиты.Вставить("Организация");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ИнвентаризацияЗапасов.Запасы КАК Запасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Запасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО Запасы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	Запасы.Ссылка = &Ссылка
	|	И СпрХарактеристикиНоменклатуры.ор_МаркируемыйТовар
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрНоменклатура.КатегорияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.КатегорияНоменклатуры КАК КатегорияНоменклатуры
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|		ПО втТовары.КатегорияНоменклатуры = КатегорииНоменклатуры.Ссылка
	|ГДЕ
	|	КатегорииНоменклатуры.ор_УчетМаркируемыхТоваров";
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	Результат = Запрос.Выполнить();
	
	ЕстьМаркируемаяПродукция = НЕ Результат.Пустой();
	
	ИнтеграцияМДЛП.РассчитатьСтатусОформления(
		Метаданные.Документы.ИнвентаризацияПотребительскихУпаковокМДЛП,
		ДокументОснование,
		ЗначенияРеквизитов,
		ЕстьМаркируемаяПродукция)
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияИнвентаризацииПотребительскихУпаковокМДЛП(ДокументОснование) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.ИнвентаризацияПотребительскихУпаковокМДЛП КАК ТаблицаДокументы
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ПО
	|		Статусы.Документ = ТаблицаДокументы.Ссылка
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|	И НЕ (ТаблицаДокументы.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ)
	|		И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Закрыто))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	1                        КАК План,
	|	0                        КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	#ДокументТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеУпаковки.Основание,
	|	0,
	|	1
	|ИЗ
	|	Документ.ИнвентаризацияПотребительскихУпаковокМДЛП КАК ОформленныеУпаковки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ОформленныеДокументы КАК ОформленныеДокументы
	|	ПО
	|		ОформленныеДокументы.Ссылка = ОформленныеУпаковки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.Ссылка КАК Ссылка,
	|	СУММА(ТоварыКОформлению.План)   КАК План,
	|	СУММА(ТоварыКОформлению.Факт)   КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДокументТовары"              , ДокументОснование.Метаданные().ПолноеИмя());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтсутствииЛПНаБалансе(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание уведомления.
//
// Возвращаемое значение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтсутствииЛПНаБалансе(ДокументОснование) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПанельМаркировкиМДЛП

// Позволяет переопределить стандартный механизм заполнения документов, выводимых в панели маркировки.
//
// Параметры:
//  ТаблицаДокументы     - ТаблицаЗначений - 
//  СтандартнаяОбработка - Булево - если установить Ложь, то стандартное заполнение пропускается.
//
Процедура ПередЗаполнениемДокументовПанелиМаркировкиМДЛП(ТаблицаДокументы, СтандартнаяОбработка) Экспорт
	
	// +ор интеграция МДЛП
	СтандартнаяОбработка = Ложь;
	
	ТипыДокументов = Метаданные.ОпределяемыеТипы.ДокументИнформированияМДЛП.Тип.Типы();
	
	ТипыДокументовРазрешенные = Новый Массив;
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОбАгрегированииИТрансформацииУпаковокМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОбОтгрузкеМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОВыбытииМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОВыдачеВОтделенияМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОПередачеНаУничтожениеМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОПеремещенииМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОПовторномВводеВОборотМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОПриемкеМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОРозничнойПродажеМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОФактеУничтоженияМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеОбОприходованииМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.УведомлениеВладельцаОбОприходованииМДЛП");
	
	ТипыДокументовРазрешенные.Добавить("Документ.ИнвентаризационнаяОписьМДЛП");
	ТипыДокументовРазрешенные.Добавить("Документ.ИнвентаризацияПотребительскихУпаковокМДЛП");
	
	Для Каждого Тип Из ТипыДокументов Цикл
		
		МетаданныеДокумента = Метаданные.НайтиПоТипу(Тип);
		ПолноеИмяДокумента = МетаданныеДокумента.ПолноеИмя();
		
		Если ТипыДокументовРазрешенные.Найти(ПолноеИмяДокумента) <> Неопределено Тогда
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяДокумента);
			Менеджер.ПриЗаполненииДокументовПанелиМаркировкиМДЛП(ТаблицаДокументы);
		КонецЕсли;
		
	КонецЦикла;
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОЗавершенииЭтапаОкончательнойУпаковкиТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтбореОбразцовТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыпускеГотовойПродукцииТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтгрузкеТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОбОтгрузкеМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтгрузкеВРФТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПриемкеТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОПриемкеМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВвозеЛПвРФТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВвозеЛПвРФБезИмпортераТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОРозничныхПродажахТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОРозничнойПродажеМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПеремещенииТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОПеремещенииМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПеремещенииГЛОТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПеремещенииМеждуЗТКТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтпускеПоЛьготномуРецептуТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыдачеВОтделенияТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПередачеНаУничтожениеТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОПередачеНаУничтожениеМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОФактеУничтоженияТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыбытииТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОВыбытииМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПовторномВводеВОборотТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОПовторномВводеВОборотМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбАгрегированииИТрансформацииУпаковокТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВводеВОборотТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОСменеСобственникаВЗТКТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПриемкеНовымСобственникомЛПвЗТКТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОРезультатахТаможенногоОформленияТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПриемкеНаСкладИмпортераТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПередачеКМТаможенномуСкладуТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбЭмиссииКМТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОприходованииТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОбОприходованииМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВвозеЛПвРФБезПодтвержденияМДЛПТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеВладельцаОбОприходованииТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаТекстЗапросаОформите() Экспорт
	
	// +ор интеграция МДЛП
	Возврат ор_ИнтеграцияМДЛП.УведомлениеОбщийТекстЗапросаОформите(Метаданные.Документы.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП);
	// -ор интеграция МДЛП
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ИнвентаризационнаяОписьМДЛПТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ИнвентаризацияПотребительскихУпаковокМДЛПТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтсутствииЛПНаБалансеТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции


// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеВладельцаОбОприходованииТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеВладельцаОВвозеЛПвРФБезПодтвержденияТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбАгрегированииИТрансформацииУпаковокТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОприходованииТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОтбореОбразцовТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОтгрузкеВРФТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОтгрузкеТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОтпускеПоЛьготномуРецептуТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбЭмиссииКМТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВводеВОборотТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВвозеЛПвРФБезИмпортераТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВвозеЛПвРФБезПодтвержденияТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВвозеЛПвРФТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВыбытииТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВыдачеВОтделенияТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОВыпускеГотовойПродукцииТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОЗавершенииЭтапаОкончательнойУпаковкиТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПередачеКМТаможенномуСкладуТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПередачеНаУничтожениеТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПеремещенииГЛОТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПеремещенииТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПеремещенииМеждуЗТКТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПовторномВводеВОборотТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПриемкеТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПриемкеНаСкладИмпортераТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОПриемкеНовымСобственникомЛПвЗТКТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОРезультатахТаможенногоОформленияТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОРозничныхПродажахТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОСменеСобственникаВЗТКТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОФактеУничтоженияТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УдалитьЗапросСоставаУпаковкиТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция ИнвентаризационнаяОписьТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция ИнвентаризацияПотребительскихУпаковокТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

// Переопределяет текст запроса динамического списка СписокКОформлению панели маркировки для документов требующих оформления.
// Выборка результата запроса должна содержать поля аналогичные исходному тексту запроса.
// Исходный текст запроса см. в функции Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов.
//
// Возвращаемое значение:
//  Строка - Текст запроса. Если возвращается Неопределено, тогда будет использован исходный текст запроса.
//
Функция УведомлениеОбОтсутствииЛПНаБалансеТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	
	
КонецФункции

#КонецОбласти

#Область Отчеты

// См. ПротоколОбменаМДЛП.НастроитьВариантыОтчета
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	
	
КонецПроцедуры

// См. ПротоколОбменаМДЛП.ОпределитьНастройкиФормы
Процедура ОпределитьНастройкиФормы(Отчет, Форма, КлючВарианта, Настройки) Экспорт
	
	
	
КонецПроцедуры

// См. ПротоколОбменаМДЛП.ПриКомпоновкеРезультата
Процедура ПриКомпоновкеРезультата(Отчет, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Устанавливает настройки печати объектов.
// Вызывается из модулей менеджеров объектов, из процедуры ПриОпределенииНастроекПечати.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - Полное имя объекта для которого устанавливаются настройки печати.
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура УстановитьНастройкиПечатиОбъекта(Знач ПолноеИмяОбъекта, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Заполняет список команд печати.
// Вызывается из модулей менеджеров объектов, из процедуры ДобавитьКомандыПечати.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - Полное имя объекта для которого заполняются команды печати.
//  КомандыПечати    - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(Знач ПолноеИмяОбъекта, КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Сформировать печатные формы объектов.
// Вызывается из модулей менеджеров объектов, из процедуры Печать.
//
// Параметры:
//  ПолноеИмяОбъекта      - Строка           - Полное имя объекта печати.
//  МассивОбъектов        - Массив           - Массив ссылок на объекты которые нужно распечатать.
//  ПараметрыПечати       - Структура        - Структура дополнительных параметров печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений  - Сформированные табличные документы.
//  ОбъектыПечати         - Строка           - Имена макетов, перечисленные через запятую.
//  ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(Знач ПолноеИмяОбъекта, МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
КонецПроцедуры

// Добавляет сведения для отправки по электронной почте.
// Вызывается из модулей менеджеров объектов, из процедуры ПриОпределенииПолучателей.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - Полное имя объекта печати.
//  ПараметрыОтправки - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода.ПараметрыОтправки
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//
Процедура ПриОпределенииПолучателей(Знач ПолноеИмяОбъекта, ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ОписаниеТиповОрганизацииКонтрагентаОбъектаМестаДеятельности.
//
// В функции нужно определить значения по умолчанию, которые будут подставляться в
// реквизиты не сопоставленных элементов справочника.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентМДЛП - значение по умолчанию для собственной организации,
//  МестоДеятельности - ОпределяемыйТип.ОбъектМестаДеятельностиМДЛП - значение по умолчанию
//                                                                    для собственного объекта места деятельности,
//  Контрагент - ОпределяемыйТип.ОрганизацияКонтрагентМДЛП - значение по умолчанию для сторонней организации,
//  МестоДеятельностиКонтрагента - ОпределяемыйТип.ОбъектМестаДеятельностиМДЛП - значение по умолчанию
//                                                                               для стороннего объекта места деятельности.
//
Процедура ЗначенияПоУмолчаниюНеСопоставленныхОбъектов(
		Организация = Неопределено,
		МестоДеятельности = Неопределено,
		Контрагент = Неопределено,
		МестоДеятельностиКонтрагента = Неопределено) Экспорт
	
	// +ор интеграция МДЛП
	Организация                   = Справочники.Организации.ПустаяСсылка();
	Контрагент                    = Справочники.Контрагенты.ПустаяСсылка();
	МестоДеятельности             = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	МестоДеятельностиКонтрагента  = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	// -ор интеграция МДЛП
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти