#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем МассивОбязательныхКолонокФайлаЗагрузки Экспорт; // Хранит массив с обязательными колонками файла загрузки
Перем МассивКолонокФайлаВыгрузки Экспорт; // Хранит массив с колонками файла выгрузки

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииДляЗагрузкиДанных

// Функция получения пустой таблицы нужного формата
//
Функция ПолучитьПустуюТаблицуЗагрузки() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Пометка");
	// переберем обязательные колонки
	Для Каждого ОбязательнаяКолонка Из МассивОбязательныхКолонокФайлаЗагрузки Цикл
		Таблица.Колонки.Добавить(ОбязательнаяКолонка.Ключ);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Функция получения списка колонок, которые содержит загружаемый файл
//
Функция ПолучитьСписокКолонокФайла(Файл, Разделитель)
	
	МассивКолонок = Новый Массив();
	
	// заголовок у нас в первой строке
	ЗаголовокФайла = Файл.ПрочитатьСтроку();
	Если ЗаголовокФайла = Неопределено Тогда
		мСообщитьОбОшибке("Загружаемый файл не содержит данных.");
		Возврат МассивКолонок;
	КонецЕсли;
	
	// Разберем заголовок и посмотрим, что там за колонки в файле
	МассивКолонок = РазложитьСтрокуФайлаВМассивПодстрок(ЗаголовокФайла, Разделитель);
	
	Возврат МассивКолонок;
	
КонецФункции

// Функция проверки наличия в файле обязательных колонок для загрузки
//
Функция ПроверитьОбязательныеКолонкиДляЗагрузки(МассивКолонок)
	
	ОтсутствующиеКолонки = "";
	
	// заполним соответствие, чтобы имена колонок можно было без учета регистра искать
	КолонкиФайлаВРег = Новый Соответствие;
	Для Каждого Колонка Из МассивКолонок Цикл
		КолонкиФайлаВРег.Вставить(ВРег(Колонка), Колонка);
	КонецЦикла;
	
	ЗаполняемоеСоответствиеКолонок = Новый Соответствие;
	Для Каждого ИмяОбязательнойКолонки Из МассивОбязательныхКолонокФайлаЗагрузки Цикл
		
		ЗначениеСоответствия = КолонкиФайлаВРег.Получить(ИмяОбязательнойКолонки.Ключ);
		Если ЗначениеСоответствия = Неопределено И ИмяОбязательнойКолонки.Ключ<>"MNFID" Тогда
			ОтсутствующиеКолонки = ОтсутствующиеКолонки + ", " + ИмяОбязательнойКолонки.Ключ;
		Иначе
			ЗаполняемоеСоответствиеКолонок.Вставить(ИмяОбязательнойКолонки.Ключ, ЗначениеСоответствия);
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если Не ПустаяСтрока(ОтсутствующиеКолонки) Тогда
		мСообщитьОбОшибке("Ошибка формата файла. Отсутствуют обязательные колонки: "+ОтсутствующиеКолонки);
		Возврат Ложь;
	Иначе
		МассивОбязательныхКолонокФайлаЗагрузки = ЗаполняемоеСоответствиеКолонок;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Функция считывания файла и преобразования данных в таблицы
//
Функция ЗагрузитьДанныеМониторингаЦенВТаблицу(ИмяФайлаДляЗагрузки, ТаблицаЗагрузки, АдресХранилищаФайла) Экспорт
	ТаблицаЗагрузки = ПолучитьПустуюТаблицуЗагрузки().Скопировать();
	// проверим, указали вообще файл или нет
	Если ПустаяСтрока(ИмяФайлаДляЗагрузки) Тогда
		мСообщитьОбОшибке("Не указан файл для загрузки данных о мониторинге цен!");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(АдресХранилищаФайла) Тогда
		мСообщитьОбОшибке("Файл не найден!");
		Возврат Ложь;
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилищаФайла);
	
	Если ДвоичныеДанные = Неопределено Тогда
		мСообщитьОбОшибке("Файл был удален!");
		Возврат Ложь;
	КонецЕсли;
	ВременныйКаталог = КаталогВременныхФайлов();
	ПутьКфайлу = ВременныйКаталог + "server.cvs";
	ДвоичныеДанные.Записать(ПутьКфайлу);
	
	// попытаемся прочитать файл
	Попытка
		НоменклатураПоставщика = Новый ЧтениеТекста(ПутьКфайлу);
	Исключение
		мСообщитьОбОшибке("Неизвестный формат файла!");
		Возврат Ложь;
	КонецПопытки;
	
	РазделительКолонок = ";";
	
	// Разберемся какие колонки есть в файле
	КолонкиВФайле = ПолучитьСписокКолонокФайла(НоменклатураПоставщика, РазделительКолонок);
	Если КолонкиВФайле.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим наличие обязательных колонок в файле
	Если НЕ ПроверитьОбязательныеКолонкиДляЗагрузки(КолонкиВФайле) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НомерСтроки = 0;
	СтрокаДанныхФайла = НоменклатураПоставщика.ПрочитатьСтроку();
	
	Пока СтрокаДанныхФайла<>Неопределено Цикл
		
		НомерСтроки = НомерСтроки + 1;
		// Состояние("Обрабатывается строка файла: "+НомерСтроки);
		МассивДанныхФайла = РазложитьСтрокуФайлаВМассивПодстрок(СтрокаДанныхФайла);
		
		// Добавляем строку в таблицу
		НоваяСтрокаТаблицы = ТаблицаЗагрузки.Добавить();
		НоваяСтрокаТаблицы.Пометка = Истина;
		
		Для Каждого ОбязательнаяКолонка Из МассивОбязательныхКолонокФайлаЗагрузки Цикл
			
			ИндексКолонкиВФайле = КолонкиВФайле.Найти(ОбязательнаяКолонка.Значение);
			Попытка
				НоваяСтрокаТаблицы[ОбязательнаяКолонка.Ключ] = МассивДанныхФайла[ИндексКолонкиВФайле];
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
		СтрокаДанныхФайла = НоменклатураПоставщика.ПрочитатьСтроку();
		
	КонецЦикла;
	
	НоменклатураПоставщика.Закрыть();
	
	Возврат Истина;
	
КонецФункции

// Функция загрузки данных из таблицы в регистр
//
Функция ЗагрузитьДанные(Знач Таблица, ЗагружатьСНулевойЦеной = Ложь) Экспорт
	
	КоличествоЭлементов = Таблица.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	
	ДатаЗагрузки = ТекущаяДатаСеанса();
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		
		Если Не СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтроки = Таблица.Индекс(СтрокаТаблицы)+1;
		
		// С нулевой ценой не загружаем
		Если Не ЗагружатьСНулевойЦеной И (СтрокаТаблицы.MAXMNFPRICE = Неопределено ИЛИ СтрокаТаблицы.MAXMNFPRICE = 0) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			НаборЗаписейРегистра = РегистрыСведений.ор_ПрайсЛистыПоставщиков.СоздатьНаборЗаписей();
			НаборЗаписейРегистра.Отбор.ПрайсЛист.Установить(ПрайсЛист);
			АртикулТовараИзТаблицы = СокрЛП(Строка(СтрокаТаблицы.DRUGID))+"/"+СокрЛП(Строка(СтрокаТаблицы.PACKNX))+"/"+СокрЛП(Строка(СтрокаТаблицы.MNFNM))+"/"+СокрЛП(Строка(СтрокаТаблицы.PCKNM));
			ШКТовараИзТаблицы = СокрЛП(СтрокаТаблицы.EAN);
			НаборЗаписейРегистра.Отбор.ШтрихКод.Установить(ШКТовараИзТаблицы);
			НаборЗаписейРегистра.Отбор.Артикул.Установить(АртикулТовараИзТаблицы);
			НаборЗаписейРегистра.Прочитать();
			НаименованиеТовара = СокрЛП(СтрокаТаблицы.TRADENMR)+", "+СокрЛП(СтрокаТаблицы.DOSAGER)+", "+СокрЛП(СтрокаТаблицы.MNFNM)+", "+СокрЛП(СтрокаТаблицы.PACK);
			
			// такой записи нет, надо добавить
			Если НаборЗаписейРегистра.Количество()=0 Тогда
				НоваяЗапись = НаборЗаписейРегистра.Добавить();
				НоваяЗапись.ПрайсЛист      = ПрайсЛист;
				НоваяЗапись.ШтрихКод       = ШКТовараИзТаблицы;
				НоваяЗапись.Артикул        = АртикулТовараИзТаблицы;
				НоваяЗапись.Цена           = СтрокаТаблицы.MAXMNFPRICE;
				НоваяЗапись.Наименование   = НаименованиеТовара;
				НоваяЗапись.Контрагент     = Контрагент;
				НоваяЗапись.ДатаЗагрузки   = ДатаЗагрузки;
			Иначе
				// обновим существующие записи
				Для Каждого Запись ИЗ НаборЗаписейРегистра Цикл
					Запись.Цена           = СтрокаТаблицы.MAXMNFPRICE;
					Запись.Наименование   = НаименованиеТовара;
					Запись.Контрагент     = Контрагент;
					Запись.ДатаЗагрузки   = ДатаЗагрузки;
				КонецЦикла;
			КонецЕсли;
			
			НаборЗаписейРегистра.Записать();
			
		Исключение
			
			ОписаниеОшибки = ОписаниеОшибки();
			мСообщитьОбОшибке("В процессе загрузки данных возникли ошибки: "+Символы.ПС+ОписаниеОшибки);
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДлячСопоставленияДанных

// Функция заполнения таблицы для сопоставления данных
//
Функция ЗаполнитьТаблицуСопоставления() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентов.Номенклатура КАК Номенклатура,
	|	ПрайсЛистыКонтрагентов.Артикул КАК АртикулПоставщика,
	|	ПрайсЛистыКонтрагентов.Единица КАК ЕдиницаИзмерения,
	|	ПрайсЛистыКонтрагентов.ШтрихКод КАК Штрихкод,
	|	ПрайсЛистыКонтрагентов.Наименование КАК НоменклатураПоставщика,
	|	ЛОЖЬ КАК Пометка,
	|	ПрайсЛистыКонтрагентов.Номенклатура.ор_КодРосздравнадзора КАК КодРосздравнадзора,
	|	ПрайсЛистыКонтрагентов.Номенклатура.ор_Производитель КАК Производитель,
	|	ПрайсЛистыКонтрагентов.ПрайсЛист КАК ПрайсЛист,
	|	ЛОЖЬ КАК ПодсветитьНеУникальные
	|ИЗ
	|	РегистрСведений.ор_ПрайсЛистыПоставщиков КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	// добавим недостающие колонки
	Таблица.Колонки.Добавить("УникальныйИД",    Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ИДЛС",            Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ИДПроизводителя", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ИДУпаковщика",    Новый ОписаниеТипов("Число"));
	
	// Для каждой строки разберем артикул на нужные составляющие
	НомерСтроки = 0;
	КоличествоСтрок = Таблица.Количество();
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		НомерСтроки = НомерСтроки + 1;

		// обновим индикатор, если он есть
		МассивДанных = РазобратьАртикулПоставщика(СтрокаТаблицы.АртикулПоставщика);
		СтрокаТаблицы.УникальныйИД 		= МассивДанных[0];
		СтрокаТаблицы.ИДЛС 				= МассивДанных[1];
		СтрокаТаблицы.ИДПроизводителя 	= МассивДанных[2];
		СтрокаТаблицы.ИДУпаковщика 		= МассивДанных[3];
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Процедура автоматического сопоставления данных
// Сопоставляет данные с уже в базе штрих-кодами и РДЛС.
// Так же производится проверка на не уникальные записи.
//
// Параметры:
//  Таблица				 - ТаблицаЗначений	 - Таблица сопоставлений.
//  НайденыНеУникальные	 - Булевое	 - Значение будет заменено на истину 
//                                     при обнаружении не уникальных строк.
//  ИндексыДублей -  Массив - Если передан массив, в него будут добавлены
//                            структуры хранящие индексы и номенклатуру дублей.
//                            Структура имеет поля:
//                                Номенклатура - Дублирующаяся номенклатура;
//                                Индексы - Массив индексов для дублирующейся номенклатуры.
//
Процедура ВыполнитьСопоставлениеДанных(Таблица, НайденыНеУникальные, ИндексыДублей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.Пометка КАК Пометка,
	|	Таблица.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Таблица.ШтрихКод КАК ШтрихКод,
	|	Таблица.АртикулПоставщика КАК АртикулПоставщика,
	|	Таблица.ИДЛС КАК ИДЛС,
	|	Таблица.ПодсветитьНеУникальные КАК ПодсветитьНеУникальные
	|ПОМЕСТИТЬ Номенклатуры
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Пометка = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатуры.ШтрихКод КАК ШтрихКод,
	|	СУММА(1) КАК КоличествоШК
	|ПОМЕСТИТЬ КоличествоНеУникальныхШК
	|ИЗ
	|	Номенклатуры КАК Номенклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатуры.ШтрихКод
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатуры.ИДЛС КАК ИДЛС,
	|	СУММА(1) КАК КоличествоИДЛС
	|ПОМЕСТИТЬ КоличествоНеУникальныхИДРЛС
	|ИЗ
	|	Номенклатуры КАК Номенклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатуры.ИДЛС
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатуры.Пометка КАК Пометка,
	|	Номенклатуры.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Номенклатуры.ШтрихКод КАК ШтрихКод,
	|	Номенклатуры.АртикулПоставщика КАК АртикулПоставщика,
	|	Номенклатуры.ИДЛС КАК ИДЛС,
	|	ВЫБОР
	|		КОГДА КоличествоНеУникальныхШК.ШтрихКод ЕСТЬ NULL
	|				И КоличествоНеУникальныхИДРЛС.ИДЛС ЕСТЬ NULL
	|			ТОГДА Номенклатуры.ПодсветитьНеУникальные
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПодсветитьНеУникальные
	|ПОМЕСТИТЬ НоменклатурыСПроверкойУникальности
	|ИЗ
	|	Номенклатуры КАК Номенклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоНеУникальныхШК КАК КоличествоНеУникальныхШК
	|		ПО Номенклатуры.ШтрихКод = КоличествоНеУникальныхШК.ШтрихКод
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоНеУникальныхИДРЛС КАК КоличествоНеУникальныхИДРЛС
	|		ПО Номенклатуры.ИДЛС = КоличествоНеУникальныхИДРЛС.ИДЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатуры.Пометка КАК Пометка,
	|	Номенклатуры.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Номенклатуры.ШтрихКод КАК ШтрихКод,
	|	Номенклатуры.АртикулПоставщика КАК АртикулПоставщика,
	|	Номенклатуры.ИДЛС КАК ИДЛС,
	|	МАКСИМУМ(ЕСТЬNULL(ШтрихКоды.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК НоменклатураПоШК,
	|	Номенклатуры.ПодсветитьНеУникальные КАК ПодсветитьНеУникальные
	|ПОМЕСТИТЬ НоменклатурыПоШК
	|ИЗ
	|	НоменклатурыСПроверкойУникальности КАК Номенклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
	|		ПО Номенклатуры.ШтрихКод = ШтрихКоды.Штрихкод
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатуры.Пометка,
	|	Номенклатуры.НоменклатураПоставщика,
	|	Номенклатуры.ШтрихКод,
	|	Номенклатуры.АртикулПоставщика,
	|	Номенклатуры.ИДЛС,
	|	Номенклатуры.ПодсветитьНеУникальные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатурыПоШК.Пометка КАК Пометка,
	|	НоменклатурыПоШК.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	НоменклатурыПоШК.ШтрихКод КАК ШтрихКод,
	|	НоменклатурыПоШК.АртикулПоставщика КАК АртикулПоставщика,
	|	НоменклатурыПоШК.ИДЛС КАК ИДЛС,
	|	НоменклатурыПоШК.НоменклатураПоШК КАК НоменклатураПоШК,
	|	МАКСИМУМ(ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК НоменклатураПоАртикулу,
	|	НоменклатурыПоШК.ПодсветитьНеУникальные КАК ПодсветитьНеУникальные
	|ПОМЕСТИТЬ ТаблицаВозможноСПустойНоменклатурой
	|ИЗ
	|	НоменклатурыПоШК КАК НоменклатурыПоШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО НоменклатурыПоШК.ИДЛС = Номенклатура.ор_КодРосздравнадзора
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатурыПоШК.Пометка,
	|	НоменклатурыПоШК.НоменклатураПоставщика,
	|	НоменклатурыПоШК.ШтрихКод,
	|	НоменклатурыПоШК.АртикулПоставщика,
	|	НоменклатурыПоШК.ИДЛС,
	|	НоменклатурыПоШК.НоменклатураПоШК,
	|	НоменклатурыПоШК.ПодсветитьНеУникальные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозможноСПустойНоменклатурой.Пометка КАК Пометка,
	|	ТаблицаВозможноСПустойНоменклатурой.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ТаблицаВозможноСПустойНоменклатурой.ШтрихКод КАК ШтрихКод,
	|	ТаблицаВозможноСПустойНоменклатурой.АртикулПоставщика КАК АртикулПоставщика,
	|	ТаблицаВозможноСПустойНоменклатурой.ИДЛС КАК ИДЛС,
	|	ТаблицаВозможноСПустойНоменклатурой.НоменклатураПоШК КАК НоменклатураПоШК,
	|	ТаблицаВозможноСПустойНоменклатурой.НоменклатураПоАртикулу КАК НоменклатураПоАртикулу,
	|	ТаблицаВозможноСПустойНоменклатурой.ПодсветитьНеУникальные КАК ПодсветитьНеУникальные
	|ИЗ
	|	ТаблицаВозможноСПустойНоменклатурой КАК ТаблицаВозможноСПустойНоменклатурой
	|ГДЕ
	|	НЕ(ТаблицаВозможноСПустойНоменклатурой.НоменклатураПоШК = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ТаблицаВозможноСПустойНоменклатурой.НоменклатураПоАртикулу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))";

	Запрос.УстановитьПараметр("Таблица", Таблица);
	НоменклатурыПодбора = Запрос.Выполнить().Выгрузить();
	
	// Перенесем данные в нашу таблицу.
	Для Каждого СтрокаНоменклатур Из НоменклатурыПодбора Цикл
		
		
		
		СтруктураОтбора = Новый Структура("Пометка, НоменклатураПоставщика, ШтрихКод, АртикулПоставщика", Истина, СтрокаНоменклатур.НоменклатураПоставщика, СтрокаНоменклатур.ШтрихКод, СтрокаНоменклатур.АртикулПоставщика);
		МассивНайденныхСтрок = Таблица.НайтиСтроки(СтруктураОтбора);
		ПодставляемаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
		ПодставляемаяЕдиница = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(СтрокаНоменклатур.НоменклатураПоШК) Тогда
			ПодставляемаяНоменклатура = СтрокаНоменклатур.НоменклатураПоШК;
		Иначе
			ПодставляемаяНоменклатура = СтрокаНоменклатур.НоменклатураПоАртикулу;
		КонецЕсли;
		
		ПодставляемаяЕдиница = ПодставляемаяНоменклатура.ЕдиницаИзмерения;
		
		ДанныеТекущихДублей = Неопределено;
		Для Каждого СтрокаМассива Из МассивНайденныхСтрок Цикл
			
			СтрокаМассива.Номенклатура            = ПодставляемаяНоменклатура;
			СтрокаМассива.ЕдиницаИзмерения        = ПодставляемаяЕдиница;
			СтрокаМассива.КодРосздравнадзора      = ПодставляемаяНоменклатура.ор_КодРосздравнадзора;
			СтрокаМассива.Производитель           = ПодставляемаяНоменклатура.ор_Производитель;
			СтрокаМассива.ПодсветитьНеУникальные  = СтрокаНоменклатур.ПодсветитьНеУникальные;
			
			Если СтрокаНоменклатур.ПодсветитьНеУникальные Тогда
				Если ДанныеТекущихДублей = Неопределено Тогда
					ДанныеТекущихДублей = Новый Структура("Номенклатура, Индексы", ПодставляемаяНоменклатура, Новый Массив);
				КонецЕсли;

				ИндексСтроки = Таблица.Индекс(СтрокаМассива);
				ДанныеТекущихДублей.Индексы.Добавить(ИндексСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Если ДанныеТекущихДублей <> Неопределено Тогда
			НайденыНеУникальные = Истина;
		    ИндексыДублей.Добавить(ДанныеТекущихДублей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция проверки корректности сопоставления данных
// Сопоставление происходит с учётом данных записанных в регистре прайс-листов.
// При отсутствии дублирующих значений номенклатуры, изменённые данные вносятся в регистр прайс-листов.
//
// Параметры:
//  Таблица		 - 	ТаблицаЗначений - Таблица сопоставлений
//  ИндексыДублей -  Массив - Если передан массив, в него будут добавлены
//                            структуры хранящие индексы и номенклатуру дублей.
//                            Структура имеет поля:
//                                Номенклатура - Дублирующаяся номенклатура;
//                                Индексы - Массив индексов для дублирующейся номенклатуры.
// 
// Возвращаемое значение:
//  Булево       -  Успех записи
Функция ЗаписатьСопоставления(Таблица, ИндексыДублей=Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.Пометка КАК Пометка,
	|	Таблица.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Таблица.ШтрихКод КАК ШтрихКод,
	|	Таблица.АртикулПоставщика КАК АртикулПоставщика,
	|	Таблица.Номенклатура КАК НоменклатураТаблицы,
	|	Таблица.ЕдиницаИзмерения КАК ЕдиницаТаблицы,
	|	1 КАК СтрокаТаблицы
	|ПОМЕСТИТЬ ТаблицаСопоставления
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Пометка = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентов.Номенклатура КАК Номенклатура,
	|	ПрайсЛистыКонтрагентов.Артикул КАК Артикул,
	|	ПрайсЛистыКонтрагентов.ШтрихКод КАК ШтрихКод,
	|	ПрайсЛистыКонтрагентов.Наименование КАК Наименование
	|ПОМЕСТИТЬ ПрайсЛист
	|ИЗ
	|	РегистрСведений.ор_ПрайсЛистыПоставщиков КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСопоставления.НоменклатураТаблицы КАК НоменклатураТаблицы,
	|	ТаблицаСопоставления.ЕдиницаТаблицы КАК ЕдиницаТаблицы,
	|	ПрайсЛист.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаСопоставления.СтрокаТаблицы, 0) КАК СтрокаТаблицы,
	|	ПрайсЛист.Артикул КАК Артикул,
	|	ПрайсЛист.ШтрихКод КАК ШтрихКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСопоставления.СтрокаТаблицы, 0) = 1
	|			ТОГДА ТаблицаСопоставления.НоменклатураТаблицы
	|		ИНАЧЕ ПрайсЛист.Номенклатура
	|	КОНЕЦ КАК ИтоговаяНоменклатура,
	|	ПрайсЛист.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТаблицаСоВсемиДанными
	|ИЗ
	|	ПрайсЛист КАК ПрайсЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСопоставления КАК ТаблицаСопоставления
	|		ПО ПрайсЛист.Артикул = ТаблицаСопоставления.АртикулПоставщика
	|			И ПрайсЛист.ШтрихКод = ТаблицаСопоставления.ШтрихКод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоВсемиДанными.ИтоговаяНоменклатура КАК Номенклатура,
	|	ТаблицаСоВсемиДанными.СтрокаТаблицы КАК СтрокаТаблицы,
	|	ТаблицаСоВсемиДанными.ШтрихКод КАК ШтрихКод,
	|	ТаблицаСоВсемиДанными.Артикул КАК Артикул,
	|	1 КАК КоличествоНоменклатуры
	|ИЗ
	|	ТаблицаСоВсемиДанными КАК ТаблицаСоВсемиДанными
	|ГДЕ
	|	ТаблицаСоВсемиДанными.ИтоговаяНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСоВсемиДанными.ИтоговаяНоменклатура,
	|	ТаблицаСоВсемиДанными.СтрокаТаблицы,
	|	ТаблицаСоВсемиДанными.ШтрихКод,
	|	ТаблицаСоВсемиДанными.Артикул
	|ИТОГИ
	|	СУММА(КоличествоНоменклатуры)
	|ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоВсемиДанными.ИтоговаяНоменклатура КАК Номенклатура,
	|	ТаблицаСоВсемиДанными.ШтрихКод КАК ШтрихКод,
	|	ТаблицаСоВсемиДанными.Артикул КАК Артикул,
	|	ЕСТЬNULL(ТаблицаСоВсемиДанными.ЕдиницаТаблицы, ТаблицаСоВсемиДанными.ИтоговаяНоменклатура.ЕдиницаИзмерения) КАК Единица,
	|	ТаблицаСоВсемиДанными.Наименование КАК Наименование,
	|	&ПрайсЛист КАК ПрайсЛист,
	|	&Контрагент КАК Контрагент
	|ИЗ
	|	ТаблицаСоВсемиДанными КАК ТаблицаСоВсемиДанными
	|ГДЕ
	|	ТаблицаСоВсемиДанными.СтрокаТаблицы <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПрайсЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСоВсемиДанными";
				   
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаПерезаписываемыхДанных = РезультатыЗапроса[4].Выгрузить();
	
	ПовторяющиесяНоменклатуры = РезультатыЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
	
	ИмеютсяДубли = Ложь;
	
	Пока ПовторяющиесяНоменклатуры.Следующий() Цикл
		
		Если ПовторяющиесяНоменклатуры.КоличествоНоменклатуры = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ИндексыДублей) <> Тип("Массив") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Выборка = ПовторяющиесяНоменклатуры.Выбрать();
		
		ДанныеДублей = Новый Структура("Номенклатура, Индексы",
											ПовторяющиесяНоменклатуры.Номенклатура, Новый Массив());
		Пока Выборка.Следующий() Цикл
			ПараметрыОтбора = Новый Структура("Номенклатура, АртикулПоставщика, ШтрихКод",
									Выборка.Номенклатура, Выборка.Артикул, Выборка.ШтрихКод); 
			СтрокиНоменклатуры = Таблица.НайтиСтроки(ПараметрыОтбора);
										
			Для Каждого Строка Из СтрокиНоменклатуры Цикл
				ИндексСтроки = Таблица.Индекс(Строка);
				ДанныеДублей.Индексы.Добавить(ИндексСтроки);	
			КонецЦикла;
							
		КонецЦикла;
					
		ИндексыДублей.Добавить(ДанныеДублей);
		
		ИмеютсяДубли = Истина;
	КонецЦикла;
		
	Если ИмеютсяДубли Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// перезапишем только строки, отмеченные в таблице
	Для Каждого СтрокаПерезаписываемых Из ТаблицаПерезаписываемыхДанных Цикл
		
		НаборЗаписейРегистра = РегистрыСведений.ор_ПрайсЛистыПоставщиков.СоздатьНаборЗаписей();
		НаборЗаписейРегистра.Отбор.ПрайсЛист.Установить(ПрайсЛист);
		НаборЗаписейРегистра.Отбор.Штрихкод.Установить(СтрокаПерезаписываемых.ШтрихКод);
		НаборЗаписейРегистра.Отбор.Артикул.Установить(СтрокаПерезаписываемых.Артикул);
		НаборЗаписейРегистра.Прочитать();
		
		Если НаборЗаписейРегистра.Количество()<>0 Тогда
		    НаборЗаписейРегистра[0].Номенклатура = СтрокаПерезаписываемых.Номенклатура;
		    НаборЗаписейРегистра[0].Единица = СтрокаПерезаписываемых.Единица;
			НаборЗаписейРегистра.Записать();
			Попытка
				Если Не СтрокаПерезаписываемых.Номенклатура.ор_ЗарегистрированВСистемеМониторингаЦен Тогда
					НоменклатураОбъект = СтрокаПерезаписываемых.Номенклатура.ПолучитьОбъект();
				 	НоменклатураОбъект.ор_ЗарегистрированВСистемеМониторингаЦен = Истина;
					НоменклатураОбъект.Записать();
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляВыгрузкиДанных

// Процедура заполнения таблицы выгрузки по остаткам
//
Процедура ЗаполнитьТаблицуВыгрузкиПоОстаткам(Таблица, Знач КонецПериода, Знач СписокСтруктурныхЕдиниц) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СписокСтруктурныхЕдиниц.Значение КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ втСтруктурныеЕдиницы
	|ИЗ
	|	&СписокСтруктурныхЕдиниц КАК СписокСтруктурныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыМинимальныхЦенСтруктурныхЕдиниц.ВидМинимальныхЦен КАК ВидМинимальныхЦен,
	|	втСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВидыМинимальныхЦенСкладов
	|ИЗ
	|	РегистрСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц КАК ВидыМинимальныхЦенСтруктурныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтруктурныеЕдиницы КАК втСтруктурныеЕдиницы
	|		ПО ВидыМинимальныхЦенСтруктурныхЕдиниц.СтруктурнаяЕдиница = втСтруктурныеЕдиницы.СтруктурнаяЕдиница
	|ГДЕ
	|	&МинимальныеЦеныИспользуются
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыМинимальныхЦенСтруктурныхЕдиниц.ВидМинимальныхЦен,
	|	ВидыМинимальныхЦенСтруктурныхЕдиниц.СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц КАК ВидыМинимальныхЦенСтруктурныхЕдиниц
	|ГДЕ
	|	ВидыМинимальныхЦенСтруктурныхЕдиниц.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И &МинимальныеЦеныИспользуются
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.Ссылка В
	|			(ВЫБРАТЬ
	|				ТорговыеОбъекты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|			ИЗ
	|				втСтруктурныеЕдиницы КАК ТорговыеОбъекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ор_ПрайсЛистыКонтрагентов.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НоменклатураПрайсЛистов
	|ИЗ
	|	РегистрСведений.ор_ПрайсЛистыПоставщиков КАК ор_ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ор_ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|	И ор_ПрайсЛистыКонтрагентов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ОстаткиТоваровНаСкладах
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&КонецПериода,
	|			СтруктурнаяЕдиница В
	|					(ВЫБРАТЬ
	|						Склады.Склад КАК Склад
	|					ИЗ
	|						ТаблицаСклады КАК Склады)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						НоменклатураПрайсЛистов.Номенклатура КАК Номенклатура
	|					ИЗ
	|						НоменклатураПрайсЛистов КАК НоменклатураПрайсЛистов)) КАК ЗапасыНаСкладахОстатки
	|ГДЕ
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровНаСкладахИВидыЦен.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровНаСкладахИВидыЦен.Характеристика КАК Характеристика,
	|	ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	МАКСИМУМ(ОстаткиТоваровНаСкладахИВидыЦен.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница.РозничныйВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА &ОсновнойВидЦенПродажи
	|		ИНАЧЕ ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница.РозничныйВидЦен
	|	КОНЕЦ КАК ВидЦен,
	|	ЕСТЬNULL(ВидыМинимальныхЦенСкладов.ВидМинимальныхЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидМинимальнойЦены
	|ПОМЕСТИТЬ втТоварыСВидомЦены
	|ИЗ
	|	ОстаткиТоваровНаСкладах КАК ОстаткиТоваровНаСкладахИВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыМинимальныхЦенСкладов КАК ВидыМинимальныхЦенСкладов
	|		ПО (ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница = ВидыМинимальныхЦенСкладов.СтруктурнаяЕдиница
	|				ИЛИ ВидыМинимальныхЦенСкладов.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровНаСкладахИВидыЦен.Номенклатура,
	|	ОстаткиТоваровНаСкладахИВидыЦен.Характеристика,
	|	ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница.РозничныйВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА &ОсновнойВидЦенПродажи
	|		ИНАЧЕ ОстаткиТоваровНаСкладахИВидыЦен.СтруктурнаяЕдиница.РозничныйВидЦен
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВидыМинимальныхЦенСкладов.ВидМинимальныхЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен
	|ПОМЕСТИТЬ втЦеныНоменклатурыПоВидуЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Актуальность
	|				И (Номенклатура, Характеристика, ВидЦен) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						втТоварыСВидомЦены.Номенклатура,
	|						втТоварыСВидомЦены.Характеристика,
	|						втТоварыСВидомЦены.ВидЦен
	|					ИЗ
	|						втТоварыСВидомЦены)) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен
	|ПОМЕСТИТЬ втЦеныНоменклатурыПоВидуМинимальнойЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Актуальность
	|				И (Номенклатура, Характеристика, ВидЦен) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						втТоварыСВидомЦены.Номенклатура,
	|						втТоварыСВидомЦены.Характеристика,
	|						втТоварыСВидомЦены.ВидМинимальнойЦены
	|					ИЗ
	|						втТоварыСВидомЦены
	|					ГДЕ
	|						втТоварыСВидомЦены.ВидМинимальнойЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварыСВидомЦены.Номенклатура КАК Номенклатура,
	|	втТоварыСВидомЦены.Характеристика КАК Характеристика,
	|	втТоварыСВидомЦены.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	втТоварыСВидомЦены.КоличествоОстаток КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА втЦеныНоменклатурыПоВидуМинимальнойЦены.Цена ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(втЦеныНоменклатурыПоВидуЦен.Цена, 0)
	|		ИНАЧЕ втЦеныНоменклатурыПоВидуМинимальнойЦены.Цена
	|	КОНЕЦ КАК ЦенаРозничная
	|ПОМЕСТИТЬ ОстаткиТоваровНаСкладахИЦены
	|ИЗ
	|	втТоварыСВидомЦены КАК втТоварыСВидомЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатурыПоВидуЦен КАК втЦеныНоменклатурыПоВидуЦен
	|		ПО втТоварыСВидомЦены.Номенклатура = втЦеныНоменклатурыПоВидуЦен.Номенклатура
	|			И втТоварыСВидомЦены.Характеристика = втЦеныНоменклатурыПоВидуЦен.Характеристика
	|			И втТоварыСВидомЦены.ВидЦен = втЦеныНоменклатурыПоВидуЦен.ВидЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатурыПоВидуМинимальнойЦены КАК втЦеныНоменклатурыПоВидуМинимальнойЦены
	|		ПО втТоварыСВидомЦены.Номенклатура = втЦеныНоменклатурыПоВидуМинимальнойЦены.Номенклатура
	|			И втТоварыСВидомЦены.Характеристика = втЦеныНоменклатурыПоВидуМинимальнойЦены.Характеристика
	|			И втТоварыСВидомЦены.ВидМинимальнойЦены = втЦеныНоменклатурыПоВидуМинимальнойЦены.ВидЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.Ссылка КАК ДокументПоступления,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	ПриходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.Цена КАК ЦенаЗакупочная,
	|	ПриходнаяНакладнаяЗапасы.ор_ЦенаПроизводителя КАК ЦенаПроизводителя,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Поставщик,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТабличныеЧастиПоступлений
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	НЕ ПриходнаяНакладнаяЗапасы.Ссылка.ПометкаУдаления
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница В
	|			(ВЫБРАТЬ
	|				Склады.Склад КАК Склад
	|			ИЗ
	|				ТаблицаСклады КАК Склады)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровНаСкладахИЦены.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровНаСкладахИЦены.Характеристика КАК Характеристика,
	|	ОстаткиТоваровНаСкладахИЦены.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиТоваровНаСкладахИЦены.ЦенаРозничная КАК ЦенаРозничная,
	|	ОстаткиТоваровНаСкладахИЦены.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.ДокументПоступления, ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)) КАК ДокументПоступления,
	|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.ЦенаЗакупочная, 0) КАК ЦенаЗакупочная,
	|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.ЦенаПроизводителя, 0) КАК ЦенаПроизводителя,
	|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Поставщик,
	|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ СоединенныеОстаткиИПоступления
	|ИЗ
	|	ОстаткиТоваровНаСкладахИЦены КАК ОстаткиТоваровНаСкладахИЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабличныеЧастиПоступлений КАК ПриходнаяНакладнаяЗапасы
	|		ПО ОстаткиТоваровНаСкладахИЦены.Номенклатура = ПриходнаяНакладнаяЗапасы.Номенклатура
	|			И ОстаткиТоваровНаСкладахИЦены.Характеристика = ПриходнаяНакладнаяЗапасы.Характеристика
	|			И ОстаткиТоваровНаСкладахИЦены.СтруктурнаяЕдиница = ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремножениеНаКоэффициент.Номенклатура КАК Номенклатура,
	|	ПеремножениеНаКоэффициент.Характеристика КАК Характеристика,
	|	ПеремножениеНаКоэффициент.КоличествоОстаток КАК КоличествоОстаток,
	|	ПеремножениеНаКоэффициент.ЦенаРозничная КАК ЦенаРозничная,
	|	ПеремножениеНаКоэффициент.ДокументПоступления КАК ДокументПоступления,
	|	ПеремножениеНаКоэффициент.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПеремножениеНаКоэффициент.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремножениеНаКоэффициент.ЦенаЗакупочная / ПеремножениеНаКоэффициент.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ПеремножениеНаКоэффициент.ЦенаЗакупочная
	|	КОНЕЦ КАК ЦенаЗакупочная,
	|	ПеремножениеНаКоэффициент.ЦенаПроизводителя КАК ЦенаПроизводителя,
	|	ПеремножениеНаКоэффициент.Поставщик КАК Поставщик,
	|	ПеремножениеНаКоэффициент.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремножениеНаКоэффициент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ СоединенныеОстаткиИПоступленияКоэффициент
	|ИЗ
	|	СоединенныеОстаткиИПоступления КАК ПеремножениеНаКоэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоединенныеОстаткиИПоступленияКоэффициент.Номенклатура КАК Номенклатура,
	|	СоединенныеОстаткиИПоступленияКоэффициент.Характеристика КАК Характеристика,
	|	СоединенныеОстаткиИПоступленияКоэффициент.КоличествоОстаток КАК КоличествоОстаток,
	|	СоединенныеОстаткиИПоступленияКоэффициент.ДокументПоступления КАК ДокументПоступления,
	|	СоединенныеОстаткиИПоступленияКоэффициент.Количество КАК Количество,
	|	СоединенныеОстаткиИПоступленияКоэффициент.ЦенаРозничная КАК ЦенаРозничная,
	|	СоединенныеОстаткиИПоступленияКоэффициент.ЦенаЗакупочная КАК ЦенаЗакупочная,
	|	СоединенныеОстаткиИПоступленияКоэффициент.ЦенаПроизводителя КАК ЦенаПроизводителя,
	|	СоединенныеОстаткиИПоступленияКоэффициент.Поставщик КАК Поставщик,
	|	СоединенныеОстаткиИПоступленияКоэффициент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	СоединенныеОстаткиИПоступленияКоэффициент КАК СоединенныеОстаткиИПоступленияКоэффициент
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоединенныеОстаткиИПоступленияКоэффициент.ДокументПоступления.Дата УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(КоличествоОстаток),
	|	МАКСИМУМ(ДокументПоступления),
	|	СУММА(Количество),
	|	МАКСИМУМ(ЦенаРозничная),
	|	СУММА(ЦенаЗакупочная),
	|	СУММА(ЦенаПроизводителя),
	|	МАКСИМУМ(Поставщик)
	|ПО
	|	СтруктурнаяЕдиница,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоединенныеОстаткиИПоступления.Номенклатура КАК Номенклатура,
	|	СоединенныеОстаткиИПоступления.Характеристика КАК Характеристика,
	|	СУММА(СоединенныеОстаткиИПоступления.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(СоединенныеОстаткиИПоступления.Количество) КАК Количество
	|ПОМЕСТИТЬ СгруппированныеДляВычисления
	|ИЗ
	|	СоединенныеОстаткиИПоступления КАК СоединенныеОстаткиИПоступления
	|
	|СГРУППИРОВАТЬ ПО
	|	СоединенныеОстаткиИПоступления.Номенклатура,
	|	СоединенныеОстаткиИПоступления.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СгруппированныеДляВычисления.Номенклатура КАК Номенклатура,
	|	СгруппированныеДляВычисления.Характеристика КАК Характеристика
	|ИЗ
	|	СгруппированныеДляВычисления КАК СгруппированныеДляВычисления
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СгруппированныеДляВычисления.КоличествоОстаток - СгруппированныеДляВычисления.Количество > 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СписокСтруктурныхЕдиниц",     СписокСтруктурныхЕдиниц);
	Запрос.УстановитьПараметр("ПрайсЛист",                   ПрайсЛист);
	Запрос.УстановитьПараметр("МинимальныеЦеныИспользуются", ЦенообразованиеСерверПовтИсп.МинимальныеЦеныИспользуются());
	
	ОсновнойВидЦенПродажи = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойВидЦенПродажи");
	Запрос.УстановитьПараметр("ОсновнойВидЦенПродажи", ОсновнойВидЦенПродажи);
	
	// Установим конец периода, если он не заполнен в шапке.
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода =  ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Будем рассматривать следующие периоды по поступлениям: пол года(-6), год(-12), два(-24), четыре(-48), восемь(-96).
	// Установим начальное уменьшение периода, за который будем рассматривать поступления, равный - пол года (-6 месяцев).
	ШагПериода = -6;
	
	НачалоПериода =  ДобавитьМесяц(КонецПериода, ШагПериода);
	
	// Т.к. лекарственные средства хранятся максимум 7 лет, 
	// установим максимальный период рассмотрения товаров по поступлениям равный 8 лет.
	НачалоПериодаМаксимальное = ДобавитьМесяц(КонецПериода, - 96);
	
	КонецПериода = КонецДня(КонецПериода);
	
	Запрос.УстановитьПараметр("Дата",          КонецПериода); // Для розничного запроса цен.
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	// Контроль первого шага.
	ПервыйШаг = Истина;
	
	// Переменная контролирующая выполнение перерасчёта.
	ВыполнитьПерерасчет = Истина;
	Пока ВыполнитьПерерасчет Цикл
		
		Результат = Запрос.ВыполнитьПакет();
		
		// Индекс изменяется из-за варьируемого количества подзапросов в розничном запросе цен.
		МаксимальныйИндексПакета = Результат.Количество() - 1;
		
		// Если не нашли необходимых поступлений за 8 лет, остановим поиск.
		Если НачалоПериодаМаксимальное = НачалоПериода Тогда
			Прервать;
		КонецЕсли;
		
		Если Результат[МаксимальныйИндексПакета].Пустой() Тогда
			// Если все необходимые поступления найдены, тогда прерываем цикл.
			Прервать;
		Иначе
			// Если поступления не найдены, увеличим период и выполним перерасчёт.
			Если ПервыйШаг Тогда
				// На первом шаге дополнительного увеличеия шага периода не надо,
				// т.к. увеличить нужно всего на пол года, а это и есть начальный шаг.
				ПервыйШаг = Ложь;
			Иначе
				ШагПериода = ШагПериода + ШагПериода;
			КонецЕсли;
			
			НачалоПериода = ДобавитьМесяц(НачалоПериода,ШагПериода);
			Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат[МаксимальныйИндексПакета-2].Пустой() Тогда
		Возврат;
	КонецЕсли;
		
	ВыборкаСтруктурнаяЕдиница = Результат[МаксимальныйИндексПакета-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СтруктурнаяЕдиница");
	Пока ВыборкаСтруктурнаяЕдиница.Следующий() Цикл
		
		ВыборкаНоменклатура = ВыборкаСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
		Пока ВыборкаНоменклатура.Следующий() Цикл
		
			ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Характеристика");
			Пока ВыборкаХарактеристика.Следующий() Цикл
					
				// Общее количество к списанию по характеристике.
				КоличествоСписатьПоХарактеристике = ВыборкаХарактеристика.КоличествоОстаток;
				
				ВыборкаДетальныеЗаписи = ВыборкаХарактеристика.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если КоличествоСписатьПоХарактеристике > 0 И ВыборкаДетальныеЗаписи.Количество > 0 Тогда
						НоваяСтрокаТаблицы = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, ВыборкаДетальныеЗаписи);
						НоваяСтрокаТаблицы.Количество = ?(КоличествоСписатьПоХарактеристике - ВыборкаДетальныеЗаписи.Количество >= 0,
															ВыборкаДетальныеЗаписи.Количество,КоличествоСписатьПоХарактеристике);
						КоличествоСписатьПоХарактеристике = КоличествоСписатьПоХарактеристике - ВыборкаДетальныеЗаписи.Количество;
					КонецЕсли;
					
				КонецЦикла;
				
				// Если в итоге не смогли всё списать добавляем оставшееся в ТЧ.
				Если КоличествоСписатьПоХарактеристике > 0 Тогда
					НоваяСтрокаТаблицы = Таблица.Добавить();
					НоваяСтрокаТаблицы.Номенклатура    = ВыборкаХарактеристика.Номенклатура;
					НоваяСтрокаТаблицы.Характеристика  = ВыборкаХарактеристика.Характеристика;
					НоваяСтрокаТаблицы.ЦенаРозничная   = ВыборкаХарактеристика.ЦенаРозничная;
					НоваяСтрокаТаблицы.Количество      = КоличествоСписатьПоХарактеристике;
				КонецЕсли;
			
			КонецЦикла
		
		КонецЦикла;
	
	КонецЦикла;
	
	Если Таблица.Количество() > 0 Тогда
		// Дополнительно отсортируем таблицу, делаем это не в изначальном запросе, 
		// так как изначальный запрос может запускаться 5 раз, а здесь он выполниться один.
		ЗапросНаОстатки  = Новый Запрос;
		ЗапросНаОстатки.Текст = "ВЫБРАТЬ
		|	ВременнаяТаблицаДляСортировки.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаДляСортировки.Характеристика КАК Характеристика,
		|	ВременнаяТаблицаДляСортировки.Количество КАК Количество,
		|	ВременнаяТаблицаДляСортировки.ЦенаПроизводителя КАК ЦенаПроизводителя,
		|	ВременнаяТаблицаДляСортировки.ЦенаЗакупочная КАК ЦенаЗакупочная,
		|	ВременнаяТаблицаДляСортировки.ЦенаРозничная КАК ЦенаРозничная,
		|	ВременнаяТаблицаДляСортировки.ДокументПоступления КАК ДокументПоступления,
		|	ВременнаяТаблицаДляСортировки.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВременнаяТаблицаДляСортировки
		|ИЗ
		|	&ТаблицаДляСортировки КАК ВременнаяТаблицаДляСортировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДляСортировки.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаДляСортировки.Характеристика КАК Характеристика,
		|	ВременнаяТаблицаДляСортировки.Количество КАК Количество,
		|	ВременнаяТаблицаДляСортировки.ЦенаПроизводителя КАК ЦенаПроизводителя,
		|	ВременнаяТаблицаДляСортировки.ЦенаЗакупочная КАК ЦенаЗакупочная,
		|	ВременнаяТаблицаДляСортировки.ЦенаРозничная КАК ЦенаРозничная,
		|	ВременнаяТаблицаДляСортировки.ДокументПоступления КАК ДокументПоступления,
		|	ВременнаяТаблицаДляСортировки.Поставщик КАК Поставщик
		|ИЗ
		|	ВременнаяТаблицаДляСортировки КАК ВременнаяТаблицаДляСортировки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВременнаяТаблицаДляСортировки.Номенклатура.Наименование,
		|	ВременнаяТаблицаДляСортировки.Характеристика.Наименование,
		|	ВременнаяТаблицаДляСортировки.ДокументПоступления.Дата УБЫВ";
		
		ЗапросНаОстатки.УстановитьПараметр("ТаблицаДляСортировки", Таблица);
		Таблица = ЗапросНаОстатки.Выполнить().Выгрузить();
	КонецЕсли;
	
КонецПроцедуры

// Функция выгрузки данных в файл
//
Функция ВыгрузитьДанные(Таблица, ДатаВыгрузки) Экспорт
	
	// Установим дату, если пользователь не указал её.
	Если Не ЗначениеЗаполнено(ДатаВыгрузки) Тогда
		ДатаВыгрузки =  ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Количество КАК Количество,
	|	Таблица.ЦенаПроизводителя КАК ЦенаПроизводителя,
	|	Таблица.ЦенаЗакупочная КАК ЦенаЗакупочная,
	|	Таблица.ЦенаРозничная КАК ЦенаРозничная,
	|	Таблица.Поставщик КАК Поставщик,
	|	Таблица.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ Номенклатуры
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентов.Номенклатура КАК Номенклатура,
	|	ПрайсЛистыКонтрагентов.Артикул КАК Артикул,
	|	ПрайсЛистыКонтрагентов.Цена КАК Цена
	|ПОМЕСТИТЬ Прайс
	|ИЗ
	|	РегистрСведений.ор_ПрайсЛистыПоставщиков КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|	И ПрайсЛистыКонтрагентов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатуры.Номенклатура КАК Номенклатура,
	|	Номенклатуры.Характеристика КАК Характеристика,
	|	СУММА(Номенклатуры.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА Номенклатуры.ЦенаПроизводителя = 0
	|			ТОГДА ЕСТЬNULL(Прайс.Цена, 0)
	|		ИНАЧЕ Номенклатуры.ЦенаПроизводителя
	|	КОНЕЦ КАК ЦенаПроизводителя,
	|	Номенклатуры.ЦенаЗакупочная КАК ЦенаЗакупочная,
	|	Номенклатуры.ЦенаРозничная КАК ЦенаРозничная,
	|	Номенклатуры.Поставщик КАК Поставщик,
	|	Номенклатуры.ДокументПоступления КАК ДокументПоступления,
	|	ЕСТЬNULL(Прайс.Артикул, """") КАК Артикул
	|ПОМЕСТИТЬ НоменклатурыСгрупированныеСПоступлением
	|ИЗ
	|	Номенклатуры КАК Номенклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Прайс КАК Прайс
	|		ПО Номенклатуры.Номенклатура = Прайс.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатуры.Поставщик,
	|	Номенклатуры.ЦенаПроизводителя,
	|	Номенклатуры.Номенклатура,
	|	Номенклатуры.ЦенаЗакупочная,
	|	Номенклатуры.Характеристика,
	|	ВЫБОР
	|		КОГДА Номенклатуры.ЦенаПроизводителя = 0
	|			ТОГДА ЕСТЬNULL(Прайс.Цена, 0)
	|		ИНАЧЕ Номенклатуры.ЦенаПроизводителя
	|	КОНЕЦ,
	|	Номенклатуры.ЦенаРозничная,
	|	Номенклатуры.ДокументПоступления,
	|	ЕСТЬNULL(Прайс.Артикул, """")
	|;
	|
	// Таблица строк по каждому поступлению для проверок.
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатурыСгрупированныеСПоступлением.Номенклатура КАК Номенклатура,
	|	НоменклатурыСгрупированныеСПоступлением.Характеристика КАК Характеристика,
	|	НоменклатурыСгрупированныеСПоступлением.Количество КАК Количество,
	|	НоменклатурыСгрупированныеСПоступлением.ЦенаПроизводителя КАК ЦенаПроизводителя,
	|	НоменклатурыСгрупированныеСПоступлением.ЦенаЗакупочная КАК ЦенаЗакупочная,
	|	НоменклатурыСгрупированныеСПоступлением.ЦенаРозничная КАК ЦенаРозничная,
	|	НоменклатурыСгрупированныеСПоступлением.Поставщик КАК Поставщик,
	|	НоменклатурыСгрупированныеСПоступлением.ДокументПоступления КАК ДокументПоступления,
	|	НоменклатурыСгрупированныеСПоступлением.Артикул КАК Артикул
	|ИЗ
	|	НоменклатурыСгрупированныеСПоступлением КАК НоменклатурыСгрупированныеСПоступлением
	|;
	|
	// Итоговая таблица для выгрузки в файл.
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицыДляВыгрузки.Номенклатура КАК Номенклатура,
	|	ТаблицыДляВыгрузки.Характеристика КАК Характеристика,
	|	СУММА(ТаблицыДляВыгрузки.Количество) КАК Количество,
	|	ТаблицыДляВыгрузки.ЦенаПроизводителя КАК ЦенаПроизводителя,
	|	ТаблицыДляВыгрузки.ЦенаЗакупочная КАК ЦенаЗакупочная,
	|	ТаблицыДляВыгрузки.ЦенаРозничная КАК ЦенаРозничная,
	|	ТаблицыДляВыгрузки.Поставщик КАК Поставщик,
	|	ТаблицыДляВыгрузки.Артикул КАК Артикул
	|ИЗ
	|	НоменклатурыСгрупированныеСПоступлением КАК ТаблицыДляВыгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицыДляВыгрузки.Номенклатура,
	|	ТаблицыДляВыгрузки.Характеристика,
	|	ТаблицыДляВыгрузки.ЦенаПроизводителя,
	|	ТаблицыДляВыгрузки.ЦенаЗакупочная,
	|	ТаблицыДляВыгрузки.ЦенаРозничная,
	|	ТаблицыДляВыгрузки.Поставщик,
	|	ТаблицыДляВыгрузки.Артикул";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("Таблица",   Таблица);
	
	Выборка = Запрос.ВыполнитьПакет();
	ВыборкаСПоступлениями  = Выборка[3].Выгрузить();
	ВыборкаСгруппированная = Выборка[4].Выгрузить();
	
	ЕстьОшибкиЗаполнения = Ложь;
	ТекстСообщенияКритичныеОшибки = "";
	
	НомерСтроки = 0;
	
	// Произведем проверку по не группированным строкам, что указать пользователю
	// где и что не заполнено.
	Для Каждого СтрокаПроверки Из ВыборкаСПоступлениями Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.Номенклатура) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнена номенклатура!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].Номенклатура");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.Характеристика) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнена характеристика!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].Характеристика");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.Количество) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнено количество!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].Количество");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.ЦенаПроизводителя) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнена цена производителя!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].ЦенаПроизводителя");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.ЦенаЗакупочная) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнена цена закупочная!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].ЦенаЗакупочная");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.ЦенаРозничная) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнена цена розничная!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].ЦенаРозничная");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.Поставщик) Тогда
			мСообщитьОбОшибке("В строке № "+НомерСтроки+" не заполнен поставщик!",,,"ТаблицаВыгрузки["+Строка(НомерСтроки - 1)+"].Поставщик");
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
		Если ЕстьОшибкиЗаполнения Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПроверки.Артикул) Тогда
			// ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке №"+НомерСтроки+" для номенклатуры """+Выборка.Номенклатура+""" нет данных о товаре поставщика. Строка не выгружена в файл",, "ТаблицаВыгрузки["+Строка(НомерСтроки-1)+"].Номенклатура");
			мСообщитьОбОшибке("В строке №"+НомерСтроки+" для номенклатуры """+СтрокаПроверки.Номенклатура+""" нет данных о товаре поставщика. Строка не выгружена в файл",Ложь,,"ТаблицаВыгрузки["+Строка(НомерСтроки-1)+"].Номенклатура");
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСтрокВыгрузки = Новый Массив;
	
	Если ЕстьОшибкиЗаполнения Тогда
		Возврат МассивСтрокВыгрузки;
	КонецЕсли;
	
	СтрокаЗаголовка = ПолучитьСтрокуИзМассива(МассивКолонокФайлаВыгрузки, ";");
	МассивСтрокВыгрузки.Добавить(СтрокаЗаголовка);
	
	// Обойдем сгруппированные строки выборки и запишем в файл.
	Для Каждого СтрокаВыгрузки Из ВыборкаСгруппированная Цикл
		
		Артикул = СтрокаВыгрузки.Артикул;
		ДанныеАртикула = РазобратьАртикулПоставщика(Артикул);
		
		МассивДанныхСтрокиВыгрузки = Новый Массив;
		// ВАЖНО: элементы в массив добавляются строго в том порядке, в котором был сформирован заголовок, чтобы не было путаницы!!!
		
		// "DrugId"	- Число 		- Уникальный идентификатор ЛС в системе мониторинга цен
		МассивДанныхСтрокиВыгрузки.Добавить(ДанныеАртикула[0]);
		
		// "VendorID" - Число			- Код поставщика для системы мониторинга цен (из карточки контрагента поступления берется)
		МассивДанныхСтрокиВыгрузки.Добавить(СтрокаВыгрузки.Поставщик.ор_КодПоставщикаВСистемеМониторингаЦен);
		
		// "Segment"	- Число 		- Сегмент (1 - амбулаторный, 2 - госпитальный). У нас всегда 1
		МассивДанныхСтрокиВыгрузки.Добавить(1);
		
		// "Year"	- Число(4,0)	- Год даты поступления
		МассивДанныхСтрокиВыгрузки.Добавить(Формат(Год(ДатаВыгрузки), "ЧГ=0"));
		
		// "Month"	- Число(1-12)	- Месяц даты поступления
		МассивДанныхСтрокиВыгрузки.Добавить(Месяц(ДатаВыгрузки));
		
		// "Series"	- Строка		- Серийный номер выгружаемой серии номенклатуры
		МассивДанныхСтрокиВыгрузки.Добавить(?(Не ЗначениеЗаполнено(СтрокаВыгрузки.Характеристика.ор_СерияПроизводителя),"-", СтрокаВыгрузки.Характеристика.ор_СерияПроизводителя));
		
		// "TotDrugQn" - Число			- Количество закупленных упаковок номенклатуры в единице измерения прайс-листа
		МассивДанныхСтрокиВыгрузки.Добавить(Формат(СтрокаВыгрузки.Количество, "ЧДЦ=2; ЧРД=.; ЧН="));
		
		// "Funds"	- Число			- Средства на закупку (сумма поступления из документа с НДС). Для амбулаторного сегмента всегда 0.00. 
		МассивДанныхСтрокиВыгрузки.Добавить(Формат(0,"ЧЦ=3; ЧДЦ=2; ЧРД=.; ЧН="));
		
		// "MnfPrice" - Число			- Цена производителя или импортера в рублях (в валюте регламентированного учета)
		МассивДанныхСтрокиВыгрузки.Добавить(Формат(СтрокаВыгрузки.ЦенаПроизводителя,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН="));
		
		// "PrcPrice" - Число         - Закупочная цена одной упаковки с НДС в единицах измерения прайса в рублях.
		МассивДанныхСтрокиВыгрузки.Добавить(Формат(СтрокаВыгрузки.ЦенаЗакупочная,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН="));
		
		// "RtlPrice" - Число			- Розничная цена одной упаковки в единицах измерения прайса в рублях
		МассивДанныхСтрокиВыгрузки.Добавить(Формат(СтрокаВыгрузки.ЦенаРозничная,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН="));
		
		// "Remark"	- Строка        - Примечание
		МассивДанныхСтрокиВыгрузки.Добавить("");
		
		// "SrcOrg"	- Число         - Идентификатор организации, предоставившей сведения о цене
		МассивДанныхСтрокиВыгрузки.Добавить("");
		
		СтрокаЗаписи = ПолучитьСтрокуИзМассива(МассивДанныхСтрокиВыгрузки, ";", Истина);
		МассивСтрокВыгрузки.Добавить(СтрокаЗаписи);
	
	КонецЦикла;
	
	Возврат МассивСтрокВыгрузки;
	
КонецФункции

#КонецОбласти

// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина". 
// В случае работы на клиенте или на сервере выводит в окно сообщений,
// в случае внешнего соединения вызывает исключение.
//
// Параметры:
//  ТекстСообщения - Строка	- Текст сообщения.
//  Отказ          - Булево	- Признак отказа (необязательный).
//  Заголовок      - Строка	- Заголовок (необязательный).
//
Процедура мСообщитьОбОшибке(ТекстСообщения, ВызыватьИсключение = Истина, Заголовок = "", Поле = "") Экспорт

	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	Если ОкончаниеСлужебногоСообщения > 0 И НачалоСлужебногоСообщения > 0 Тогда
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
		                 Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
	КонецЕсли;
	
	
	#Если ВнешнееСоединение Тогда
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
			Заголовок = "";
		КонецЕсли;
		
		Если ВызыватьИсключение Тогда
			ВызватьИсключение (ТекстСообщения);
		КонецЕсли;
		
	#Иначе
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), Заголовок);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Заголовок);
			
			Заголовок = "";
		КонецЕсли;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле);
		
	#КонецЕсли
	
КонецПроцедуры // СообщитьОбОшибке()

// Процедура получения строки из значений массива
//
Функция ПолучитьСтрокуИзМассива(МассивЗначений, Разделитель, НужноУбратьПробелВНулевомЭлементе = Ложь)
	Строка = "";
	СчитаноЭлементов = 0;
	// Необходимо для DrugID и VendorID убирать дописываемые пробелы от 1С. Пример, было - ххх ххх; стало - хххххх
	Для Каждого ЗначениеМассива Из МассивЗначений Цикл
		Если НужноУбратьПробелВНулевомЭлементе И СчитаноЭлементов < 2 Тогда
			Строка = Строка+СтрЗаменить(Строка(ЗначениеМассива),Символы.НПП,"")+Разделитель;
			СчитаноЭлементов = СчитаноЭлементов + 1;
		Иначе
			Строка = Строка+ЗначениеМассива+Разделитель;
		КонецЕсли;
	КонецЦикла;
	Строка = Лев(Строка, СтрДлина(Строка)-1);
	Возврат Строка;
КонецФункции
	
// Функция проверки корректности заполнения реквизитов
//
Функция ПроверитьКорректностьЗаполнения() Экспорт
	
	ТекстСообщения 	= "";
	Поле 			= "";
	ЕстьОшибки 		= Ложь;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		мСообщитьОбОшибке("Не указан контрагент!",,,"Контрагент");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрайсЛист) Тогда
		мСообщитьОбОшибке("Не указан прайс-лист контрагента!",,,"ПрайсЛист");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(ПрайсЛист) И ПрайсЛист.Владелец<>Контрагент Тогда
		мСообщитьОбОшибке("Прайс-лист """+ПрайсЛист+""" не является прайс-листом контрагента """+Контрагент+"""!",,,"ПрайсЛист");
		Поле = "ПрайсЛист";
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрайсЛист) И НЕ ПрайсЛист.ПрайсЛистДляМониторингаЦен Тогда
		мСообщитьОбОшибке("Прайс-лист """+ПрайсЛист+""" не является прайс-листом для мониторинга цен!",,,"ПрайсЛист");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

// Функция получения подстроки из файла с учетом кавычек
//
Функция ПолучитьПодстрокуДоРазделителяСУчетомКовычек(Знач Стр, Разделитель)
	
	ПозицияРазделителя = Найти(Стр, Разделитель);
	Если ПозицияРазделителя = 0 Тогда
		Возврат Стр;
	КонецЕсли;
	
	ПозицияОткрывающейКавычки = Найти(Стр, """");
	Если ПозицияОткрывающейКавычки = 0 Или ПозицияОткрывающейКавычки > ПозицияРазделителя Тогда
		
		ПодстрокаДоРазделителя = Лев(Стр, ПозицияРазделителя - 1);
		
	Иначе
		
		ПодстрокаДоРазделителя = Лев(Стр, ПозицияОткрывающейКавычки);
		Стр = Сред(Стр, ПозицияОткрывающейКавычки + 1);
		
		ПозицияЗакрывающейКавычки = Найти(Стр, """");
		
		ПодстрокаДоРазделителя = ПодстрокаДоРазделителя + Лев(Стр, ПозицияЗакрывающейКавычки);
		Стр = Сред(Стр, ПозицияЗакрывающейКавычки + 1);
		
		ПодстрокаДоРазделителя = ПодстрокаДоРазделителя + ПолучитьПодстрокуДоРазделителяСУчетомКовычек(Стр, Разделитель);
		
	КонецЕсли;
		
	Возврат ПодстрокаДоРазделителя;
	
КонецФункции 

// Функция получения строки без кавычек
//
Функция ПолучитьСтрокуБезКовычек(Стр)
	
	Результат = СокрЛП(Стр);
	
	Если Не ПустаяСтрока(Результат) Тогда
		
		Если Лев(Результат, 1) = """" И Прав(Результат, 1) = """" Тогда
			Результат = Сред(Результат, 2, СтрДлина(Результат) - 2);
			Результат = СокрЛП(Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;		
	
КонецФункции

// Функция разбора строки в массив подстрок, отделенных заданным разделителем
//
Функция РазложитьСтрокуФайлаВМассивПодстрок(Знач Стр, Разделитель = ";") Экспорт
	
	МассивСтрок = Новый Массив();
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Пока Не ПустаяСтрока(Стр) Цикл
		
		ПодстрокаДоРазделителя = ПолучитьПодстрокуДоРазделителяСУчетомКовычек(Стр, Разделитель);
		МассивСтрок.Добавить(ПолучитьСтрокуБезКовычек(ПодстрокаДоРазделителя));
		
		Если Стр = ПодстрокаДоРазделителя Тогда
			Возврат МассивСтрок;
		КонецЕсли;
		
		ПозицияРазделителя = СтрДлина(ПодстрокаДоРазделителя) + 1;
		Стр = Сред(Стр, ПозицияРазделителя + ДлинаРазделителя);
		
	КонецЦикла;
	
	МассивСтрок.Добавить(ПолучитьСтрокуБезКовычек(Стр));
		
	Возврат МассивСтрок;
	
КонецФункции

// Функция раскладывает артикул на 4 части
//
Функция РазобратьАртикулПоставщика(Знач Артикул) Экспорт
	МассивВозвращаемыхДанных = Новый Массив(4);
	
	// заполним массив первоначальными данными
	Для Сч = 0 по 3 Цикл
		МассивВозвращаемыхДанных[Сч] = 0;
	КонецЦикла;	
	
	Артикул = СокрЛП(Артикул);
	
	Для Сч = 0 по 3 Цикл
		ПозицияСлеша = Найти(Артикул, "/");
		Если ПозицияСлеша<>0 Тогда
			СтрокаДанных = Лев(Артикул, ПозицияСлеша-1);
			Артикул = Прав(Артикул, СтрДлина(Артикул)-ПозицияСлеша);
			Попытка
				МассивВозвращаемыхДанных[Сч] = Число(СтрокаДанных);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВозвращаемыхДанных;
	
КонецФункции

#КонецОбласти

#Область Инициализация

МассивОбязательныхКолонокФайлаЗагрузки = Новый Соответствие;
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("DRUGID");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("PACKNX");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("MNFID");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("PCKNM");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("TRADENMR");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("DOSAGER");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("MNFNM");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("PACK");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("MAXMNFPRICE");
МассивОбязательныхКолонокФайлаЗагрузки.Вставить("EAN");


МассивКолонокФайлаВыгрузки = Новый Массив;
МассивКолонокФайлаВыгрузки.Добавить("DrugId");    // Число 		- Уникальный идентификатор ЛС в системе мониторинга цен
МассивКолонокФайлаВыгрузки.Добавить("VendorID");  // Число			- Код поставщика для системы мониторинга цен (из карточки контрагента поступления берется)
МассивКолонокФайлаВыгрузки.Добавить("Segment");   // Число 		- Сегмент (1 - амбулаторный, 2 - госпитальный). У нас всегда 1
МассивКолонокФайлаВыгрузки.Добавить("Year");      // Число(4,0)	- Год даты поступления
МассивКолонокФайлаВыгрузки.Добавить("Month");     // Число(1-12)	- Месяц даты поступления
МассивКолонокФайлаВыгрузки.Добавить("Series");    // Строка		- Серийный номер выгружаемой серии номенклатуры
МассивКолонокФайлаВыгрузки.Добавить("TotDrugQn"); // Число			- Количество закупленных упаковок номенклатуры в единице измерения прайс-листа
												  // 				  В нашем случае всегда базовое количество, потому как в прайсе хранится базовая единица измерения
МассивКолонокФайлаВыгрузки.Добавить("Funds");     // Число			- Средства на закупку (сумма поступления из документа с НДС). Для амбулаторного сегмента всегда 0.00. 
МассивКолонокФайлаВыгрузки.Добавить("MnfPrice");  // Число			- Цена производителя или импортера в рублях (в валюте регламентированного учета)
МассивКолонокФайлаВыгрузки.Добавить("PrcPrice");  // Число         - Закупочная цена одной упаковки с НДС в единицах измерения прайса в рублях. 
МассивКолонокФайлаВыгрузки.Добавить("RtlPrice");  // Число			- Розничная цена одной упаковки в единицах измерения прайса в рублях
МассивКолонокФайлаВыгрузки.Добавить("Remark");    // Строка        - Примечание
МассивКолонокФайлаВыгрузки.Добавить("SrcOrg");    // Число         - Идентификатор организации, предоставившей сведения о цене

#КонецОбласти

#КонецЕсли
