#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЭлементКлассификатора(ПараметрыДанных) Экспорт
	
	РезультатВозврат = Новый Структура;
	РезультатВозврат.Вставить("ВсеЭлементы", Новый Соответствие);
	РезультатВозврат.Вставить("КоличествоНовыхЭлементов", 0);
	РезультатВозврат.Вставить("КоличествоОбновленныхЭлементов", 0);
	РезультатВозврат.Вставить("МассивНовыхЭлементов", Новый Массив);
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ТаблицаЗначений"           , Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ПоискПоНаименованию"       , Истина);
	ПараметрыПолучения.Вставить("ПоискПоНаименованиюПодобно", Ложь);
	ПараметрыПолучения.Вставить("Дерево"                    , Новый ДеревоЗначений);
	ПараметрыПолучения.Вставить("ОбновлятьСуществующие"     , Ложь);
	
	ПараметрыПолучения.Вставить("ПоискПоНаименованиюИКоду", Ложь);
	ПараметрыПолучения.Вставить("ПоискПоКоду"             , Ложь);
	
	Если ПараметрыДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыДанных);
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Количество() = 0 Тогда
		Возврат РезультатВозврат;
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти("КодМКБ10") <> Неопределено Тогда
		ПараметрыПолучения.ПоискПоНаименованиюИКоду = ЗначениеЗаполнено(ПараметрыПолучения.ТаблицаЗначений[0]["КодМКБ10"]);
		ПараметрыПолучения.ПоискПоНаименованию      = Ложь;
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти("КлассМКБ10") = Неопределено Тогда
		ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить("КлассМКБ10", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(30)));
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти("КодМКБ10") = Неопределено Тогда
		ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить("КодМКБ10", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.Наименование КАК Наименование,
	|	Таблица.КодМКБ10 КАК КодМКБ10
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Наименование КАК Наименование,
	|	ЕСТЬNULL(Спр.Ссылка, ЗНАЧЕНИЕ(Справочник.ор_КлассификаторМКБ10.ПустаяСсылка)) КАК Ссылка,
	|	Таб.КодМКБ10 КАК КодМКБ10
	|ИЗ
	|	Таб КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_КлассификаторМКБ10 КАК Спр
	|		ПО (&ПоискПоНаименованиюИКоду
	|					И Таб.Наименование = Спр.Наименование
	|					И Таб.КодМКБ10 = Спр.Код
	|				ИЛИ &ПоискПоНаименованию
	|					И Таб.Наименование = Спр.Наименование
	|				ИЛИ &ПоискПоНаименованиюПодобно
	|					И Спр.Наименование ПОДОБНО ""%"" + Таб.Наименование + ""%"")");
	Запрос.УстановитьПараметр("Таблица"                   , ПараметрыПолучения.ТаблицаЗначений);
	Запрос.УстановитьПараметр("ПоискПоНаименованию"       , ПараметрыПолучения.ПоискПоНаименованию);
	Запрос.УстановитьПараметр("ПоискПоНаименованиюПодобно", ПараметрыПолучения.ПоискПоНаименованиюПодобно);
	Запрос.УстановитьПараметр("ПоискПоКоду"               , ПараметрыПолучения.ПоискПоКоду);
	Запрос.УстановитьПараметр("ПоискПоНаименованиюИКоду"  , ПараметрыПолучения.ПоискПоНаименованиюИКоду);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответсвиеЭлементов = Новый Соответствие;
	НайденыВсеЭлементы = Истина;
	Пока Выборка.Следующий() Цикл
		Если ПараметрыПолучения.ПоискПоНаименованиюИКоду ИЛИ ПараметрыПолучения.ПоискПоКоду Тогда
			СоответсвиеЭлементов.Вставить(Выборка.КодМКБ10, Выборка.Ссылка);
		Иначе
			СоответсвиеЭлементов.Вставить(Выборка.Наименование, Выборка.Ссылка);
		КонецЕсли;
		
		Если Выборка.Ссылка.Пустая() Тогда
			НайденыВсеЭлементы = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
	
	ОбновлятьСуществующие = ПараметрыПолучения.ОбновлятьСуществующие;
	Если НайденыВсеЭлементы И НЕ ОбновлятьСуществующие Тогда
		Возврат РезультатВозврат;
	КонецЕсли;
	
	// Формирование структуры реквизитов справочника.
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Наименование");
	СтруктураДанных.Вставить("Родитель");
	СтруктураДанных.Вставить("КодМКБ10");
	
	Для Каждого Реквизит Из Метаданные.Справочники.ор_КлассификаторМКБ10.Реквизиты Цикл
		СтруктураДанных.Вставить(Реквизит.Имя);
		
		Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти(Реквизит.Имя) = Неопределено Тогда
			ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущийЭлемент Из РезультатВозврат.ВсеЭлементы Цикл
		
		СправочникСсылка = ТекущийЭлемент.Значение;
		Если НЕ СправочникСсылка.Пустая() И НЕ ОбновлятьСуществующие Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыПолучения.ПоискПоНаименованиюИКоду ИЛИ ПараметрыПолучения.ПоискПоКоду Тогда
			СтруктураПоиска = Новый Структура("КодМКБ10", ТекущийЭлемент.Ключ);
		Иначе
			СтруктураПоиска = Новый Структура("Наименование", ТекущийЭлемент.Ключ);
		КонецЕсли;
		
		НайденныеСтроки = ПараметрыПолучения.Дерево.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
		Иначе
			НайденныеСтроки = ПараметрыПолучения.ТаблицаЗначений.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если СправочникСсылка.Пустая() Тогда
			СсылкаСправочника = СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие,
				РезультатВозврат
			);
			РезультатВозврат.ВсеЭлементы.Вставить(ТекущийЭлемент.Ключ, СсылкаСправочника);
			
			РезультатВозврат.МассивНовыхЭлементов.Добавить(СсылкаСправочника);
		Иначе
			СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие,
				РезультатВозврат);
			РезультатВозврат.КоличествоОбновленныхЭлементов = РезультатВозврат.КоличествоОбновленныхЭлементов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатВозврат.КоличествоНовыхЭлементов = РезультатВозврат.МассивНовыхЭлементов.Количество();
	
	Возврат РезультатВозврат;
	
КонецФункции

Функция СоздатьЭлементСлужебный(Данные, СправочникСсылка, ОбновлятьСуществующие, РезультатВозврат)
	
	Если СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.ор_КлассификаторМКБ10.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект, Данные);
	Если Данные.Свойство("КодМКБ10") Тогда
		СправочникОбъект.Код = Данные.КодМКБ10;
	КонецЕсли;
	
	Если Данные.Родитель <> Неопределено Тогда
		Если Данные.Свойство("КодМКБ10") И Не ПустаяСтрока(Данные.КодМКБ10) Тогда
			СправочникОбъект.Родитель = Справочники.ор_КлассификаторМКБ10.НайтиПоКоду(Данные.Родитель.КодМКБ10);
			ТекущийКлючРодителя = Данные.Родитель.КодМКБ10;
		Иначе
			СправочникОбъект.Родитель = Справочники.ор_КлассификаторМКБ10.НайтиПоНаименованию(Данные.Родитель.Наименование);
			ТекущийКлючРодителя = Данные.Родитель.Наименование;
		КонецЕсли;
		
		ПустаяСсылка = СправочникОбъект.Родитель.Пустая();
		Если ПустаяСсылка ИЛИ ОбновлятьСуществующие Тогда
			СтруктураРодитель = Новый Структура;
			Для Каждого СвойствоСтруктуры Из Данные Цикл
				СтруктураРодитель.Вставить(СвойствоСтруктуры.Ключ);
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(СтруктураРодитель, Данные.Родитель);
			
			СправочникОбъект.Родитель = СоздатьЭлементСлужебный(
				СтруктураРодитель,
				СправочникОбъект.Родитель,
				ОбновлятьСуществующие,
				РезультатВозврат
			);
			Если ПустаяСсылка Тогда
				
				РезультатВозврат.ВсеЭлементы.Вставить(ТекущийКлючРодителя, СправочникОбъект.Родитель);
				РезультатВозврат.МассивНовыхЭлементов.Добавить(СправочникОбъект.Родитель);
			Иначе
				РезультатВозврат.КоличествоОбновленныхЭлементов = РезультатВозврат.КоличествоОбновленныхЭлементов + 1;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		СправочникОбъект.Родитель = Справочники.ор_КлассификаторМКБ10.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		СправочникОбъект.Записать();
		_Возврат = СправочникОбъект.Ссылка;
	Исключение
		_Возврат = Справочники.ор_КлассификаторМКБ10.ПустаяСсылка();
	КонецПопытки;
	
	Возврат _Возврат;
	
КонецФункции

#КонецОбласти

#КонецЕсли