#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИдентификаторТипаЗаданийНаВыгрузку(ТипЗадания) Экспорт
	
	ИмяЗначения = ОбщегоНазначения.ИмяЗначенияПеречисления(ТипЗадания);
	Возврат ТипЗадания.Метаданные().ЗначенияПеречисления[ИмяЗначения].Комментарий;
	
КонецФункции

Функция ТипЗаданияНаВыгрузкуПоИдентификатору(ИдентификаторЗадания) Экспорт
	
	ТипЗадания = ПустаяСсылка();
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ТипЗадания);
	
	Для Каждого МетаданныеТипаЗадания Из ТипЗадания.Метаданные().ЗначенияПеречисления Цикл
		Если ВРег(МетаданныеТипаЗадания.Комментарий) = ВРег(ИдентификаторЗадания) Тогда
			ТипЗадания = Менеджер[МетаданныеТипаЗадания.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипЗадания;
	
КонецФункции

#КонецОбласти

#КонецЕсли