
//Процедура ПриЗаписи(Отказ, Замещение)
//	
//	Если НЕ Отказ Тогда
//		
//		// Регим бонусы при записи в РИБ
//		Магазины = ЭтотОбъект.ВыгрузитьКолонку("Магазин");
//		
//		Узлы = ПланыОбмена.ПоМагазину.Выбрать();
//		Пока Узлы.Следующий() Цикл   
//			
//			УзелОбмена = Узлы.Ссылка;
//			
//			Если УзелОбмена = ПланыОбмена.ПоМагазину.ЭтотУзел() Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Для каждого М Из Узлы.Магазины Цикл
//				Если НЕ Магазины.Найти(М.Магазин) = Неопределено Тогда  
//					
//					Набор = эв_ПолучитьНаборСФильтромПоМагазину(ЭтотОбъект, М.Магазин);
//					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Набор); 
//					
//					Прервать;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЦикла; 
//		
//	КонецЕсли;   
//		
//		
//КонецПроцедуры

//Функция эв_ПолучитьНаборСФильтромПоМагазину(ОбъектБазы, Магазин)
//	
//	Имя = ОбъектБазы.Метаданные().Имя;
//	
//	Набор = РегистрыСведений[Имя].СоздатьНаборЗаписей();
//	
//	Для каждого СтрОтбор Из ОбъектБазы.Отбор Цикл
//		Набор.Отбор[СтрОтбор.Имя].Установить(СтрОтбор.Значение);
//	КонецЦикла;

//	Для каждого Зап Из ОбъектБазы Цикл
//		Если Зап.Магазин = Магазин Тогда
//			НовЗап = Набор.Добавить();
//			ЗаполнитьЗначенияСвойств(НовЗап,Зап);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат Набор;

//КонецФункции
