

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьВидимостьШаблонаХарактеристики();
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНоменклатурыПриИзменении(Элемент)

	Запись.ШаблонКраткогоНаименованияНоменклатуры    = Неопределено;
	Запись.ШаблонНаименованияХарактеристики          = Неопределено;
	Запись.ШаблонПолногоНаименованияНоменклатуры     = Неопределено;
	Запись.ШаблонНаименованияХарактеристикиДляПечати = Неопределено;
	
	ИзменитьВидимостьШаблонаХарактеристики();
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПравилаИменованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Запись[ДополнительныеПараметры.ИмяЭлемента] = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьВидимостьШаблонаХарактеристики();
	Элементы.ШаблонНаименованияХарактеристики.Видимость = Запись.КатегорияНоменклатуры.ИспользоватьХарактеристики;
КонецПроцедуры

&НаКлиенте
Процедура ПравилоИменованияСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Запись.КатегорияНоменклатуры) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Категория номеклатуры должен быть указан.'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметровОповещения = Новый Структура;
	СтруктураПараметровОповещения.Вставить("ИмяЭлемента", Элемент.Имя);
	
	Оповещение = Новый ОписаниеОповещения("СозданиеПравилаИменованияЗавершение", ЭтотОбъект, СтруктураПараметровОповещения);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КатегорияНоменклатуры",Запись.КатегорияНоменклатуры);
	ПараметрыОткрытия.Вставить("ВидНаименования", ВидНаименованияШаблонаНаименований(Элемент.Имя));
	ПараметрыОткрытия.Свойство("ДляХарактеристики", ЭтоШаблонНаименованияХарактеристики(Элемент.Имя));
	
	ОткрытьФорму(
		"Справочник.ШаблоныНаименований.Форма.ФормаЭлемента",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоШаблонНаименованияХарактеристики(ИмяЭлемента)
	Возврат СтрНайти(НРег(ИмяЭлемента), "характеристики") > 0;
КонецФункции

&НаКлиенте
Функция ВидНаименованияШаблонаНаименований(ИмяЭлемента)
	
	ВидНаименования = ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.НоменклатураРабочее");
	Если ИмяЭлемента = "ШаблонНаименованияХарактеристики" Тогда
		ВидНаименования = ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.ХарактеристикаРабочее");
	ИначеЕсли ИмяЭлемента = "ШаблонНаименованияХарактеристикиДляПечати" Тогда
		ВидНаименования = ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.ХарактеристикаДляПечати");
	ИначеЕсли ИмяЭлемента = "ШаблонПолногоНаименованияНоменклатуры" Тогда
		ВидНаименования = ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.НоменклатураДляПечати");
	КонецЕсли;
	
	Возврат ВидНаименования;
	
КонецФункции

#КонецОбласти


