
#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиРазрешительногоРежима

// Возвращает сохраненные настройки разрешительного режима.
//
// Возвращаемое значение:
//  Результат - Структура - См. РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежимаПоУмолчанию().
//
Функция НастройкиРазрешительногоРежима() Экспорт
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.НастройкиРазрешительногоРежима();
	
КонецФункции

// Возвращает настройку времени блокировки CDN-площадок при их некорретных ответах,
// при работе с разрешительным режимом.
//
// Возвращаемое значение:
//  Число - время блокировки CDN-площадок, в минутах.
//
Функция ВремяБлокировкиCDNПлощадки() Экспорт
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.НастройкиРазрешительногоРежима().ВремяБлокировкиCDNПлощадок;
	
КонецФункции

// Возвращает настройку времени ожидания ответа от ГИС МТ при пробитии чека,
// при работе с разрешительным режимом.
//
// Возвращаемое значение:
//  Число - время ожидания ответа от CDN-площадок при пробитии чека, в секундах.
//
Функция ВремяОтветаCDNПлощадокПриПробитииЧека() Экспорт
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.НастройкиРазрешительногоРежима().ВремяОтветаCDNПлощадокПриПробитииЧека;
	
КонецФункции

// Возвращает настройку частоты актуализации и загрузки CDN-площадок
// для обращения к розничному методу продажи ГИС МТ.
//
// Возвращаемое значение:
//  Число - частота обновления, в часах.
//
Функция ЧастотаОбновленияCDNПлощадок() Экспорт
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.НастройкиРазрешительногоРежима().ЧастотаОбновленияCDNПлощадок;
	
КонецФункции

// Возвращает настройку времени действия идентификатора разрешительного режима при
// розничной продаже, после истечение времени идентификатор требуется обновить и переполучить.
//
// Возвращаемое значение:
//  Число - срок действия идентификатора, в секундах.
//
Функция СрокДействияИдентификатораНаПродажуРазрешительногоРежима() Экспорт
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.НастройкиРазрешительногоРежима().СрокДействияИдентификатораРазрешительногоРежима;
	
КонецФункции

// Возвращает настройку времени действия аварийного режима при розничных продажах.
// Запросы разрешительного режима не выполняются, их результаты не контролируются.
//
// Возвращаемое значение:
//  Дата - универсальная дата.
//
Функция АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата() Экспорт
	
	Возврат РазрешительныйРежимМДЛПВызовСервера.НастройкиРазрешительногоРежима().АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата;
	
КонецФункции

#КонецОбласти // НастройкиРазрешительногоРежима

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
