
#Область ПрограммныйИнтерфейс

#Область ПроверкаКодаМаркировки

// Возвращает параметры, необходимые для выполнения проверки КМ на форме объекта.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта, к которому подключен механизма проверки КМ.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - параметры, необходимые для выполнения проверки КМ на форме объекта.
//   См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере(), а также:
//   Форма                      - ФормаКлиентскогоПриложения - форма объекта, к которому подключен механизма проверки КМ.
//   ОповещениеОЗавершении      - ОписаниеОповещения - обработчик, в который будет возвращен результат проверки КМ.
//
Функция ПараметрыПроверкиКМ(Форма) Экспорт
	
	ВозвращаемоеЗначение = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере();
	
	ВозвращаемоеЗначение.Вставить("Форма"                , Форма);
	ВозвращаемоеЗначение.Вставить("ОповещениеОЗавершении", Неопределено);
	
	Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		ВозвращаемоеЗначение.УникальныйИдентификатор = Форма.УникальныйИдентификатор;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает структуру элемента проверки КМ.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - описание элемента проверки КМ.
//   См. РазрешительныйРежимМДЛПКлиентСервер.НовыйЭлементДанныхДляПроверкиНаКлиентеНаСервере(), а также:
//
Функция НовыйЭлементДанныхДляПроверки() Экспорт
	
	Возврат РазрешительныйРежимМДЛПКлиентСервер.НовыйЭлементДанныхДляПроверкиНаКлиентеНаСервере();
	
КонецФункции

// Запускает выполнение проверки КМ.
// Результат будет возвращен в процедуру, указанную в параметре ПараметрыПроверкиКМ.ОповещениеОЗавершении.
// Результат выполнения процедуры см. НовыйРезультатПроверкиКМ().
//
// Параметры:
//  Параметры - Структура - см. ПараметрыПроверкиКМ.
//
Процедура НачатьПроверкуКМ(ПараметрыПроверкиКМ) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	РазрешительныйРежимМДЛПКлиентПереопределяемый.НачатьПроверкуКМ(ПараметрыПроверкиКМ, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Если Не ЗначениеЗаполнено(ПараметрыПроверкиКМ.ДанныеДляПроверки) Тогда
			ВыполнитьОбработкуОповещения(ПараметрыПроверкиКМ.ОповещениеОЗавершении);
			Возврат;
		КонецЕсли;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗакончитьПроверкуКМ", ЭтотОбъект, ПараметрыПроверкиКМ);
		
		ПараметрыВыполненияПроверки = ПодготовкитьПараметрыВыполненияПроверкиКМ(ПараметрыПроверкиКМ, ОповещениеОЗавершении);
		
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		
	КонецЕсли;
	
КонецПроцедуры


// Возвращает описание результата проверки КМ.
//
// Возвращаемое значение:
//  ЕстьОшибки     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//  ТекстОшибки    - Строка - текст критических ошибок выполнения проверки КМ.
//  ДанныеПроверки - Соответствие - коллекция результатов проверки кодов маркировки.
//   * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМ и НовыйЭлементДанныхДляПроверки).
//   * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию НовыйРезультатЭлементаПроверкиКМ).
//
Функция НовыйРезультатПроверкиКМ()
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки"    , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"   , "");
	ВозвращаемоеЗначение.Вставить("ДанныеПроверки", Новый Соответствие);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата проверки конкретного кода маркировки.
//
// Возвращаемое значение:
//  ПолныйКодМаркировки - Строка - полный код маркировки в формате Base64.
//  КонтрольВыполнен    - Булево - признак того, что по КМ был выполнен контроль.
//  КонтрольПройден     - Булево - признак того, что КМ прошел проверку.
//  РезультатПроверкиКМ - ФиксированнаяСтруктура - результат проверки конкретного кода маркировки
//                                            (см. РазрешительныйРежимМДЛПКлиентСервер.НовыйРезультатЭлементаПроверкиКМНаКлиентеНаСервере()).
//
Функция НовыйРезультатЭлементаПроверкиКМ()
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки", "");
	ВозвращаемоеЗначение.Вставить("РезультатПроверкиКМ", Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ПроверкаКодаМаркировки

#Область МетодыИнтерфейсаРазрешительногоРежима

// Параметры запроса данных методов интерфейса разрешительного режима.
//
// Возвращаемое значение:
//  Структура - Параметры запроса данных:
//   * Параметры               - Неопределено, Структура - Параметры запроса.
//   * Организация             - Неопределено, СправочникСсылка.Организации - Организация.
//   * ОповещениеОЗавершении   - Неопределено, ОписаниеОповещения - Точка возврата после выполенения метода.
//   * УникальныйИдентификатор - Неопределено, УникальныйИдентификатор - уникальный идентификатор формы.
//   * ВыполнениеНаКлиенте     - Булево - Истина, если выполняется запуск процедуры на клиенте.
//
Функция ПараметрыЗапросаДанных() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Параметры",               Неопределено);
	ВозвращаемоеЗначение.Вставить("Организация",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ОповещениеОЗавершении",   Неопределено);
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор", Неопределено);
	ВозвращаемоеЗначение.Вставить("ВыполнениеНаКлиенте",     Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область CDNПлощадки

// Обновляет список CDN-площадок и время их отклика.
// Результат выполнения операции будет передан в ОписаниеОповещения в переданном параметре.
//
// Параметры:
//  ПараметрыЗапроса - см. ПараметрыЗапросаДанных.
//
Процедура АктуализацияСпискаCDNПлощадок(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                  = РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                           = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                   = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок;
	ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи = Истина;
	ПараметрыОбработки.УникальныйИдентификатор          = ПараметрыЗапроса.УникальныйИдентификатор;
	ПараметрыОбработки.ВыполнениеВФоне                  = Истина;
	
	РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

#КонецОбласти // CDNПлощадки

#Область ЛокальныйМодульЧЗ

// Выполняет операцию инициализации локальной конфигурации Локального модуля "Честный знак".
//
// Параметры:
//  ПараметрыЗапроса - см. ПараметрыЗапросаДанных.
//
Процедура ИнициализироватьКонфигурациюЛМЧЗ(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                  = РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                           = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                   = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ;
	ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи = Истина;
	ПараметрыОбработки.УникальныйИдентификатор          = ПараметрыЗапроса.УникальныйИдентификатор;
	ПараметрыОбработки.ВыполнениеВФоне                  = Истина;
	
	РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Выполняет операцию обновления статуса конфигурации Локального модуля "Честный знак".
//
// Параметры:
//  ПараметрыЗапроса - см. ПараметрыЗапросаДанных.
//
Процедура ОбновитьСтатусЛокальнойКонфигурацииЛМЧЗ(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                     = РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                              = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                      = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ;
	ПараметрыОбработки.НеТребуетсяАвторизацияПоКлючуСессии = Истина;
	ПараметрыОбработки.УникальныйИдентификатор             = ПараметрыЗапроса.УникальныйИдентификатор;
	ПараметрыОбработки.ВыполнениеВФоне                     = Истина;
	
	РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Выполняет операцию изменения пароля администрирования конфигурации Локального модуля "Честный знак".
//
// Параметры:
//  ПараметрыЗапроса - см. ПараметрыЗапросаДанных.
//
Процедура ИзменитьПарольДоступаКЛокальнойКонфигурацииЛМЧЗ(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                     = РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                              = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                      = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ;
	ПараметрыОбработки.НеТребуетсяАвторизацияПоКлючуСессии = Истина;
	ПараметрыОбработки.УникальныйИдентификатор             = ПараметрыЗапроса.УникальныйИдентификатор;
	ПараметрыОбработки.ВыполнениеВФоне                     = Истина;
	
	РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

#КонецОбласти // ЛокальныйМодульЧЗ

#Область ТСПИоТ

// Получает данные подключения ТС ПИоТ по адресу подключения.
//
// Параметры:
//  ПараметрыЗапроса - см. ПараметрыЗапросаДанных.
//
Процедура ПолучитьДанныеНастройкиТСПИоТ(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                     = РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                              = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                      = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ;
	ПараметрыОбработки.НеТребуетсяАвторизацияПоКлючуСессии = Истина;
	ПараметрыОбработки.УникальныйИдентификатор             = ПараметрыЗапроса.УникальныйИдентификатор;
	ПараметрыОбработки.ВыполнениеВФоне                     = Истина;
	
	РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

#КонецОбласти // ТСПИоТ

#Область Авторизация

// Выполняет операцию получения розничного токена в ГИС МТ.
//
// Параметры:
//  ПараметрыЗапроса - см. ПараметрыЗапросаДанных.
//
Процедура АвторизацияГИСМТРозничныйТокен(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                  = РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                           = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                   = ДоступныеМетодыИнтерфейса.ПолучениеРозничногоТокена;
	ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи = Истина;
	ПараметрыОбработки.ОрганизацияПоСертификатам        = Не ЗначениеЗаполнено(ПараметрыЗапроса.Организация);
	
	РазрешительныйРежимМаршрутизаторМДЛПСлужебныйКлиент.ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Запросить новый ключ сессии для авторизации в ГИС МТ.
//
// Параметры:
//  ПараметрыЗапроса        - (См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессии).
//  ОповещениеПриЗавершении - ОписаниеОповещения - Описание оповещения после получения результата. 
//
Процедура ЗапроситьКлючСессии(ПараметрыЗапроса, ОповещениеПриЗавершении = Неопределено) Экспорт
	
	РезультатЗапроса = РазрешительныйРежимМДЛПВызовСервера.ЗапроситьПараметрыАвторизации(ПараметрыЗапроса);
	
	ПараметрыАвторизации = РезультатЗапроса.ПараметрыАвторизации;
	
	Если ПараметрыАвторизации = Неопределено Тогда
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ВозвращаемоеЗначение = Новый Соответствие;
			ВозвращаемоеЗначение.Вставить(ПараметрыЗапроса.Организация, РезультатЗапроса.ТекстОшибки);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ВозвращаемоеЗначение);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗапроса.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Авторизация в %1 для %2'"),
		ПараметрыЗапроса.ПредставлениеСервиса,
		ПараметрыЗапроса.Организация);
	
	Сообщения = Новый Массив;
	Сообщения.Добавить(РезультатПодписания(ПараметрыЗапроса, Описание, ПараметрыАвторизации));
	
	Контекст = Новый Структура;
	Контекст.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	
	ПослеПодписания = Новый ОписаниеОповещения("ПослеПодписания", ЭтотОбъект, Контекст);
	
	Подписать(Сообщения, ПараметрыЗапроса, ПослеПодписания);
	
КонецПроцедуры

#КонецОбласти // Авторизация

#КонецОбласти // МетодыИнтерфейсаРазрешительногоРежима

#Область ФиксацияПродажиВЛМЧЗ

// Параметры пробития чека для фиксации продажи в ЛМ ЧЗ.
//
// Возвращаемое значение:
//  Структура - Параметры пробития чека:
// * ККТ - Неопределено - ККТ, через которую осуществляется пробитие
// * Операция - Строка - см. ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ОперацииПриРаботеСКодамиМаркировки()
// * ДанныеКИ - Массив из см. ДанныеКодовИдентификации
//
Функция ПараметрыПробитияЧека() Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("ККТ",      Неопределено);
	СтруктураВозврата.Вставить("Операция", "");
	СтруктураВозврата.Вставить("ДанныеКИ", Новый Массив);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Структура описания кодов идентификации для фиксации продажи в ЛМ ЧЗ.
//
// Возвращаемое значение:
//  Структура - Данные кодов идентификации:
// * КодИдентификации             - Строка - нормализованный код идентификации
// * ДробноеКоличествоЧислитель   - Число - числитель
// * ДробноеКоличествоЗнаменатель - Число - знаменатель
// * Количество                   - Число - количество выбытия
//
Функция ДанныеКодовИдентификации() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("КодИдентификации",             "");
	СтруктураВозврата.Вставить("ДробноеКоличествоЧислитель",   0);
	СтруктураВозврата.Вставить("ДробноеКоличествоЗнаменатель", 0);
	СтруктураВозврата.Вставить("Количество",                   0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Зафиксировать факт продажи/возврата марок из списка в локальной базе Локального модуля Честный знак.
//
Процедура ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ПараметрыПробитияЧека) Экспорт
	
	ДанныеУстановленныхЛокальныхМодулей = РазрешительныйРежимМДЛПВызовСервера.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоККТ(ПараметрыПробитияЧека.ККТ);
	
	Если Не ДанныеУстановленныхЛокальныхМодулей.НастроеноПодключение Тогда
		// Если локальных модулей не установлено, то не фиксировать продажу/возврат.
		Возврат;
	КонецЕсли;
	
	МассивКИ = Новый Массив;
	
	Для Каждого СтрокаДанныхКИ Из ПараметрыПробитияЧека.ДанныеКИ Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанныхКИ.ДробноеКоличествоЧислитель)
			Или ЗначениеЗаполнено(СтрокаДанныхКИ.ДробноеКоличествоЗнаменатель)
			Или Не СтрокаДанныхКИ.Количество = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКИ.Добавить(СтрокаДанныхКИ.КодИдентификации);
		
	КонецЦикла;
	
	Если Не ДанныеУстановленныхЛокальныхМодулей.Настройки.ОбменНаСервере Тогда
		РазрешительныйРежимМДЛПКлиентСервер.ЗафиксироватьФактПродажиВозвратаКодовМаркировки(МассивКИ, ПараметрыПробитияЧека.Операция, ДанныеУстановленныхЛокальныхМодулей.Настройки);
	Иначе
		РазрешительныйРежимМДЛПВызовСервера.ЗафиксироватьФактПродажиВозвратаКодовМаркировки(МассивКИ, ПараметрыПробитияЧека.Операция, ДанныеУстановленныхЛокальныхМодулей.Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ФиксацияПродажиВЛМЧЗ

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаКодаМаркировки

Функция ВыполняемыеОперацииПроверкиКМ()
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ПроверкаКМНаВнутреннемТСПИоТ", "ПроверкаКМНаВнутреннемТСПИоТ");
	ВозвращаемоеЗначение.Вставить("ПроверкаКМНаСервере"         , "ПроверкаКМНаСервере");
	ВозвращаемоеЗначение.Вставить("ПроверкаКМНаКлиенте"         , "ПроверкаКМНаКлиенте");
	ВозвращаемоеЗначение.Вставить("ПолучениеТокенаГИСМТ"        , "ПолучениеТокенаГИСМТ");
	ВозвращаемоеЗначение.Вставить("ОбновлениеCDNПлощадок"       , "ОбновлениеCDNПлощадок");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПерваяВыполняемаяОперацияПроверкиКМПоУмолчанию()
	
	ВыполняемыеОперации = ВыполняемыеОперацииПроверкиКМ();
	
	Возврат ВыполняемыеОперации.ПроверкаКМНаВнутреннемТСПИоТ;
	
КонецФункции

Функция ПодготовкитьПараметрыВыполненияПроверкиКМ(ПараметрыПроверкиКМ, ОповещениеОЗавершении)
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	// Параметры итерации
	ПараметрыВыполненияПроверки.Вставить("Интервал"       , 0.1);
	ПараметрыВыполненияПроверки.Вставить("ТекущаяОперация", ПерваяВыполняемаяОперацияПроверкиКМПоУмолчанию());
	
	// Целевые клиентские параметры
	ПараметрыВыполненияПроверки.Вставить("Форма"                     , Неопределено);
	ПараметрыВыполненияПроверки.Вставить("ОповещениеОЗавершении"     , Неопределено);
	
	// Локальные параметры
	ПараметрыВыполненияПроверки.Вставить("РезультатыПроверкиКМОбработаны", Ложь);
	
	ДополнительныеПараметрыПодготовки = Новый Структура("ПропуститьПолучениеИсходногоКодаМаркировки", Истина);
	
	РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ, ДополнительныеПараметрыПодготовки);
	
	ПараметрыВыполненияПроверки.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	Возврат ПараметрыВыполненияПроверки;
	
КонецФункции

Процедура СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки)
	
	ПараметрыПриложения["ТекущееЗаданиеПроверкиКМРазрешительныйРежим"] = ПараметрыВыполненияПроверки;
	
	// Запуск ВыполнитьШагПроверкиКМ.
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьШагПроверкиКМРазрешительныйРежим", ПараметрыВыполненияПроверки.Интервал, Истина);
	
КонецПроцедуры

Процедура ВыполнитьШагПроверкиКМ() Экспорт
	
	ПараметрыВыполненияПроверки = ПараметрыПриложения["ТекущееЗаданиеПроверкиКМРазрешительныйРежим"];
	Если ПараметрыВыполненияПроверки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Если ПараметрыВыполненияПроверки.РезультатыПроверкиКМОбработаны // Крайний случай рекурентного выполнения
		 Или ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки // Критическая ошибка
		Тогда
			
			ПараметрыПриложения["ТекущееЗаданиеПроверкиКМРазрешительныйРежим"] = Неопределено; // Очистка параметров приложения обязательна.
			
			ВыполнитьОбработкуОповещения(ПараметрыВыполненияПроверки.ОповещениеОЗавершении, ПараметрыВыполненияПроверки.РезультатПроверки);
			Возврат;
			
		КонецЕсли;
		
		ВыполняемыеОперации = ВыполняемыеОперацииПроверкиКМ();
		Если ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаКМНаВнутреннемТСПИоТ Тогда
			
			ВыполнитьПроверкуКМНаВнутреннемТСПИоТ(ПараметрыВыполненияПроверки);
			
		ИначеЕсли ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаКМНаСервере Тогда
			
			ВыполнитьПроверкуКМНаСервере(ПараметрыВыполненияПроверки);
			
		ИначеЕсли ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаКМНаКлиенте Тогда
			
			ВыполнитьПроверкуКМНаКлиенте(ПараметрыВыполненияПроверки);
			
		ИначеЕсли ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПолучениеТокенаГИСМТ Тогда
			
			ВыполнитьПолучениеТокенаГИСМТ(ПараметрыВыполненияПроверки);
			
		ИначеЕсли ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ОбновлениеCDNПлощадок Тогда
			
			ВыполнитьОбновлениеCDNПлощадокГИСМТ(ПараметрыВыполненияПроверки);
			
		КонецЕсли;
		
	Исключение
		ПараметрыПриложения["ТекущееЗаданиеПроверкиКМРазрешительныйРежим"] = Неопределено; // Очистка параметров приложения обязательна.
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры


Процедура ВыполнитьПроверкуКМНаВнутреннемТСПИоТ(ПараметрыВыполненияПроверки)
	
	ВыполняемыеОперации = ВыполняемыеОперацииПроверкиКМ();
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаВнутреннемТСПИоТ Тогда
		ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаКМНаСервере;
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверкиКМНаТСПИоТ = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПроверкиКМНаТСПИоТ();
	ЗаполнитьЗначенияСвойств(ПараметрыПроверкиКМНаТСПИоТ, ПараметрыВыполненияПроверки);
	
	ВыполнитьПроверкуКМНаВнутреннемТСПИоТЗавершение = Новый ОписаниеОповещения(
		"ВыполнитьПроверкуКМНаВнутреннемТСПИоТЗавершение",
		ЭтотОбъект,
		ПараметрыВыполненияПроверки);
	
	ИнтеграцияТСПИоТМДЛПКлиент.НачатьПроверкуКМНаВнутреннемТСПИоТ(ПараметрыПроверкиКМНаТСПИоТ, ВыполнитьПроверкуКМНаВнутреннемТСПИоТЗавершение);
	
КонецПроцедуры

Процедура ВыполнитьПроверкуКМНаВнутреннемТСПИоТЗавершение(ТекущийРезультатПроверки, ПараметрыВыполненияПроверки) Экспорт
	
	Если РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж() Тогда
		СобытияФормРазрешительныйРежимМДЛПКлиент.ОповеститьОбИзмененииАварийногоРежима();
	КонецЕсли;
	
	// ТекущийРезультатПроверки нужно дополнить данными предыдущей актуальной проверки, в случае, если не все КМ коллекции проверяются повторно.
	// Повторная проверка может быть выполнена, если у части (или у всех) КМ результаты проверки стали неактуальными.
	ПредыдущиеДанныеПроверки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыполненияПроверки.РезультатПроверки, "ДанныеПроверки");
	Если ЗначениеЗаполнено(ПредыдущиеДанныеПроверки) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ТекущийРезультатПроверки.ДанныеПроверки, ПредыдущиеДанныеПроверки, Ложь);
	КонецЕсли;
	
	ПараметрыВыполненияПроверки.РезультатПроверки = ТекущийРезультатПроверки;
	
	ПараметрыВыполненияПроверки.РезультатыПроверкиКМОбработаны = Истина;
	СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
	
КонецПроцедуры


Процедура ВыполнитьПроверкуКМНаСервере(ПараметрыВыполненияПроверки)
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ
		И Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуОнлайн
		И Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле Тогда
		ПараметрыВыполненияПроверки.РезультатыПроверкиКМОбработаны = Истина;
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверкиКМНаСервере = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере();
	ЗаполнитьЗначенияСвойств(ПараметрыПроверкиКМНаСервере, ПараметрыВыполненияПроверки);
	
	ВыполнитьПроверкуКМНаСервереЗавершение = Новый ОписаниеОповещения(
		"ВыполнитьПроверкуКМНаСервереЗавершение",
		ЭтотОбъект,
		ПараметрыВыполненияПроверки);
	
	ДлительнаяОперация = РазрешительныйРежимМДЛПВызовСервера.НачатьПроверкуКМНаСервере(ПараметрыПроверкиКМНаСервере);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияПроверки.Форма);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ВыполнитьПроверкуКМНаСервереЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

Процедура ВыполнитьПроверкуКМНаСервереЗавершение(Результат, ПараметрыВыполненияПроверки) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		// Критическая ошибка.
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Истина;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = Результат.КраткоеПредставлениеОшибки;
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	Если РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж() Тогда
		СобытияФормРазрешительныйРежимМДЛПКлиент.ОповеститьОбИзмененииАварийногоРежима();
	КонецЕсли;
	
	ТекущийРезультатПроверки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	// ТекущийРезультатПроверки нужно дополнить данными предыдущей актуальной проверки, в случае, если не все КМ коллекции проверяются повторно.
	// Повторная проверка может быть выполнена, если у части (или у всех) КМ результаты проверки стали неактуальными.
	ПредыдущиеДанныеПроверки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыполненияПроверки.РезультатПроверки, "ДанныеПроверки");
	Если ЗначениеЗаполнено(ПредыдущиеДанныеПроверки) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ТекущийРезультатПроверки.ДанныеПроверки, ПредыдущиеДанныеПроверки, Ложь);
	КонецЕсли;
	
	ПараметрыВыполненияПроверки.РезультатПроверки = ТекущийРезультатПроверки;
	
	ВыполняемыеОперации = ВыполняемыеОперацииПроверкиКМ();
	
	Если ПараметрыВыполненияПроверки.РезультатПроверки.ТребуетсяОбновлениеКлючаСессии Тогда
		ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПолучениеТокенаГИСМТ;
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Ложь;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = "";
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыполненияПроверки.РезультатПроверки.ОтсутствуютCDNПлощадки Тогда
		ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ОбновлениеCDNПлощадок;
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Ложь;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = "";
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыполненияПроверки.РезультатПроверки.ТребуетсяПроверкаНаКлиенте Тогда
		ПараметрыВыполненияПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаКМНаКлиенте;
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Ложь;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = "";
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки Тогда
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполненияПроверки.РезультатыПроверкиКМОбработаны = Истина;
	СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
	
КонецПроцедуры


Асинх Процедура ВыполнитьПроверкуКМНаКлиенте(ПараметрыВыполненияПроверки)
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ
		И Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле Тогда
		ПараметрыВыполненияПроверки.РезультатыПроверкиКМОбработаны = Истина;
		СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ Тогда
		
		ПараметрыПроверкиКМНаКлиенте = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПроверкиКМНаТСПИоТ();
		ЗаполнитьЗначенияСвойств(ПараметрыПроверкиКМНаКлиенте, ПараметрыВыполненияПроверки);
		
		#Если ВебКлиент Тогда
			ТекущийРезультатПроверки = Ждать ИнтеграцияТСПИоТМДЛПВебКлиент.ПроверитьКМНаТСПИоТ(ПараметрыПроверкиКМНаКлиенте);
		#Иначе
			ТекущийРезультатПроверки = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверитьКМНаТСПИоТ(ПараметрыПроверкиКМНаКлиенте);
		#КонецЕсли
		
		Если РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж() Тогда
			СобытияФормРазрешительныйРежимМДЛПКлиент.ОповеститьОбИзмененииАварийногоРежима();
		КонецЕсли;
		
	ИначеЕсли ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле Тогда
		
		ПараметрыПроверкиКМНаКлиенте = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаЛокальномМодуле();
		ЗаполнитьЗначенияСвойств(ПараметрыПроверкиКМНаКлиенте, ПараметрыВыполненияПроверки);
		
		#Если ВебКлиент Тогда
			ТекущийРезультатПроверки = Ждать РазрешительныйРежимМДЛПВебКлиент.ПроверитьКМНаЛокальномМодуле(ПараметрыПроверкиКМНаКлиенте);
		#Иначе
			ТекущийРезультатПроверки = РазрешительныйРежимМДЛПКлиентСервер.ПроверитьКМНаЛокальномМодуле(ПараметрыПроверкиКМНаКлиенте);
		#КонецЕсли
		
	КонецЕсли;
	
	// ТекущийРезультатПроверки нужно дополнить данными предыдущей актуальной проверки, в случае, если не все КМ коллекции проверяются повторно.
	// Повторная проверка может быть выполнена, если у части (или у всех) КМ результаты проверки стали неактуальными.
	ПредыдущиеДанныеПроверки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыполненияПроверки.РезультатПроверки, "ДанныеПроверки");
	Если ЗначениеЗаполнено(ПредыдущиеДанныеПроверки) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ТекущийРезультатПроверки.ДанныеПроверки, ПредыдущиеДанныеПроверки, Ложь);
	КонецЕсли;
	
	ПараметрыВыполненияПроверки.РезультатПроверки = ТекущийРезультатПроверки;
	
	ПараметрыВыполненияПроверки.РезультатыПроверкиКМОбработаны = Истина;
	СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
	
КонецПроцедуры


Процедура ВыполнитьПолучениеТокенаГИСМТ(ПараметрыВыполненияПроверки)
	
	ВыполнитьПолучениеТокенаГИСМТЗавершение = Новый ОписаниеОповещения(
		"ВыполнитьПолучениеТокенаГИСМТЗавершение",
		ЭтотОбъект,
		ПараметрыВыполненияПроверки);
	
	ЗапроситьКлючСессии(
		РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница(ПараметрыВыполненияПроверки.Организация),
		ВыполнитьПолучениеТокенаГИСМТЗавершение);
	
КонецПроцедуры

Процедура ВыполнитьПолучениеТокенаГИСМТЗавершение(Результат, ПараметрыВыполненияПроверки) Экспорт
	
	ОтказОтАвторизации = Ложь;
	ОшибкаАвторизации  = Ложь;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		ОтказОтАвторизации = Истина;
	Иначе
		
		РезультатАвторизации = Результат[ПараметрыВыполненияПроверки.Организация];
		
		Если РезультатАвторизации = Неопределено Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = НСтр("ru = 'Произошла ошибка при авторизации в ГИС МТ.'");
		ИначеЕсли РезультатАвторизации <> Истина Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = СокрЛП(РезультатАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтказОтАвторизации Или ОшибкаАвторизации Тогда
		
		// Критическая ошибка.
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Истина;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = ТекстОшибки;
		
	КонецЕсли;
	
	ПараметрыВыполненияПроверки.ТекущаяОперация = ПерваяВыполняемаяОперацияПроверкиКМПоУмолчанию();
	СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
	
КонецПроцедуры


Процедура ВыполнитьОбновлениеCDNПлощадокГИСМТ(ПараметрыВыполненияПроверки)
	
	ВыполнитьОбновлениеCDNПлощадокГИСМТЗавершение = Новый ОписаниеОповещения("ВыполнитьОбновлениеCDNПлощадокГИСМТЗавершение", ЭтотОбъект, ПараметрыВыполненияПроверки);
	
	ПараметрыЗапроса                         = ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ВыполнитьОбновлениеCDNПлощадокГИСМТЗавершение;
	ПараметрыЗапроса.УникальныйИдентификатор = ПараметрыВыполненияПроверки.Форма.УникальныйИдентификатор;
	ПараметрыЗапроса.Организация             = ПараметрыВыполненияПроверки.Организация;
	ПараметрыЗапроса.Параметры               = Новый Структура("НеВыводитьОкноОжидания", Истина);
	
	АктуализацияСпискаCDNПлощадок(ПараметрыЗапроса);
	
КонецПроцедуры

Процедура ВыполнитьОбновлениеCDNПлощадокГИСМТЗавершение(Результат, ПараметрыВыполненияПроверки) Экспорт
	
	Если Результат = Неопределено Тогда
		
		// Критическая ошибка.
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Истина;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = НСтр("ru = 'Не удалось обновить CDN-площадки.'");
		
	ИначеЕсли Результат.ЕстьОшибки И ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		// Критическая ошибка.
		ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки  = Истина;
		ПараметрыВыполненияПроверки.РезультатПроверки.ТекстОшибки = Результат.ТекстОшибки;
		
	КонецЕсли;
	
	ПараметрыВыполненияПроверки.ТекущаяОперация = ПерваяВыполняемаяОперацияПроверкиКМПоУмолчанию();
	СледующийШагПроверкиКМ(ПараметрыВыполненияПроверки);
	
КонецПроцедуры


Процедура ЗакончитьПроверкуКМ(ТекущийРезультатПроверки, ПараметрыПроверкиКМ) Экспорт
	
	РезультатПроверки = НовыйРезультатПроверкиКМ();
	
	Если ЗначениеЗаполнено(ТекущийРезультатПроверки) Тогда
		
		РезультатПроверки.ЕстьОшибки  = ТекущийРезультатПроверки.ЕстьОшибки;
		РезультатПроверки.ТекстОшибки = ТекущийРезультатПроверки.ТекстОшибки;
		
		Для Каждого ЭлементДанных Из ПараметрыПроверкиКМ.ДанныеДляПроверки Цикл
			
			РезультатЭлементаПроверки = НовыйРезультатЭлементаПроверкиКМ();
			ЗаполнитьЗначенияСвойств(РезультатЭлементаПроверки, ЭлементДанных);
			
			ТекущийРезультатЭлементаПроверки = ТекущийРезультатПроверки.ДанныеПроверки[ЭлементДанных.ИдентификаторЭлемента];
			Если ЗначениеЗаполнено(ТекущийРезультатЭлементаПроверки) Тогда
				РезультатЭлементаПроверки.РезультатПроверкиКМ = Новый ФиксированнаяСтруктура(ТекущийРезультатЭлементаПроверки);
			КонецЕсли;
			
			РезультатПроверки.ДанныеПроверки.Вставить(ЭлементДанных.ИдентификаторЭлемента, РезультатЭлементаПроверки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыПроверкиКМ.ОповещениеОЗавершении, РезультатПроверки);
	
КонецПроцедуры

#КонецОбласти // ПроверкаКодаМаркировки

#Область Авторизация

// Возвращает структуру с результатом подписания.
//
// Параметры:
//  ПараметрыЗапроса     - (См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессии).
//  Описание             - Строка - Описание.
//  ПараметрыАвторизации - (См. РазрешительныйРежимМДЛП.ПараметрыАвторизации).
//
// Возвращаемое значение:
//  Структура - Описание:
// * ПараметрыЗапроса     - (См. ПараметрыЗапросаДанных).
// * Описание             - Строка - Описание.
// * ПараметрыАвторизации - (См. РазрешительныйРежимМДЛП.ЗапроситьПараметрыАвторизации).
// * СвойстваПодписи      - Структура, Неопределено - Свойства подписи.
//
Функция РезультатПодписания(ПараметрыЗапроса, Описание, ПараметрыАвторизации)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыЗапроса"    , ПараметрыЗапроса);
	ВозвращаемоеЗначение.Вставить("Описание"            , Описание);
	ВозвращаемоеЗначение.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	ВозвращаемоеЗначение.Вставить("СвойстваПодписи"     , Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура Подписать(Сообщения, ПараметрыЗапроса, ОповещениеПриЗавершении)
	
	КоличествоСообщений = Сообщения.Количество();
	Если КоличествоСообщений = 1 Тогда
		ЗаголовокДанных = НСтр("ru = 'Сообщение'");
	Иначе
		ЗаголовокДанных = НСтр("ru = 'Сообщения'");
	КонецЕсли;
	
	НаборДанныхДляПодписания = Новый Массив;
	Для Каждого Сообщение Из Сообщения Цикл
		
		// Для авторизации требуется прикрепленная подпись
		ПараметрыCMS = ЭлектроннаяПодписьКлиент.ПараметрыCMS();
		ПараметрыCMS.Открепленная = Ложь;
		
		Данные = Новый Структура;
		Данные.Вставить("Данные",       Сообщение.ПараметрыАвторизации.Данные);
		Данные.Вставить("Сообщение",    Сообщение);
		Данные.Вставить("ПараметрыCMS", ПараметрыCMS);
		
		ПодписатьПоказатьТекстСообщенияXML = Новый ОписаниеОповещения("ПодписатьПоказатьТекстСообщенияXML", ЭтотОбъект, Сообщение);
		
		ПредставлениеДанных = Новый Структура;
		ПредставлениеДанных.Вставить("Значение",      ПодписатьПоказатьТекстСообщенияXML);
		ПредставлениеДанных.Вставить("Представление", Сообщение.Описание);
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Данные",        Данные);
		СтруктураДанные.Вставить("Представление", ПредставлениеДанных);
		
		НаборДанныхДляПодписания.Добавить(СтруктураДанные);
		
	КонецЦикла;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция",            НСтр("ru = 'Обмен с ГИС МТ'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных",     ЗаголовокДанных);
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	
	ОписаниеДанных.Вставить("БезПодтверждения",    Истина);
	ОписаниеДанных.Вставить("ВыполнятьНаСервере",  Неопределено);
	ОписаниеДанных.Вставить("НаборДанных",         НаборДанныхДляПодписания);
	ОписаниеДанных.Вставить("ПредставлениеНабора", СтрШаблон(НСтр("ru = 'Показать (%1)'"), КоличествоСообщений));
	
	ДанныеДляОповещения = Новый Структура;
	ДанныеДляОповещения.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДанныеДляОповещения.Вставить("Сообщения",               Сообщения);
	
	ПодписатьЗавершение = Новый ОписаниеОповещения("ПодписатьЗавершение", ЭтотОбъект, ДанныеДляОповещения);
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, ЭтотОбъект, ПодписатьЗавершение);
	
КонецПроцедуры

Процедура ПослеПодписания(ПараметрыЗапросовПоОрганизациям, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыЗапросовПоОрганизациям = Неопределено Тогда
		
		Результат = Новый Соответствие();
		Результат.Вставить(ДополнительныеПараметры.ПараметрыЗапроса.Организация, Неопределено);
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Результат);
		
	Иначе
		
		Результат = РазрешительныйРежимМДЛПВызовСервера.ЗапроситьКлючиСессий(ПараметрыЗапросовПоОрганизациям);
		
		Если ДополнительныеПараметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Результат);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписатьПоказатьТекстСообщенияXML(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ПараметрыАвторизации") Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку(ДополнительныеПараметры.ПараметрыАвторизации.Данные);
		ТекстовыйДокумент.Показать(ДополнительныеПараметры.Описание);
	ИначеЕсли ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ПредставлениеСообщенияДляРасшифровки") Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку(ДополнительныеПараметры.ПредставлениеСообщенияДляРасшифровки);
		ТекстовыйДокумент.Показать(ДополнительныеПараметры.Описание);
	ИначеЕсли ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ТекстСообщенияJSON") Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку(ДополнительныеПараметры.ТекстСообщенияJSON);
		ТекстовыйДокумент.Показать(ДополнительныеПараметры.Описание);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Результат.Успех Тогда
		
		Сообщения = Новый Массив;
		
		Для Каждого ТекущийЭлементНабораДанных Из Результат.НаборДанных Цикл
			
			СвойстваПодписи = ТекущийЭлементНабораДанных.СвойстваПодписи;
			
			Сообщение = ТекущийЭлементНабораДанных.Данные.Сообщение;
			Сообщение.Вставить("СвойстваПодписи", СвойстваПодписи);
			Сообщение.Вставить("Сертификат"     , Результат.ВыбранныйСертификат.Ссылка);
			
			Сообщения.Добавить(Сообщение);
			
		КонецЦикла;
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Сообщения);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Авторизация

#КонецОбласти // СлужебныеПроцедурыИФункции
