
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ПрограмныйИнтерфейс

&НаКлиенте
Процедура ВопросСоздатьНовуюХарактеристикуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СоздатьНовуюСерию(ДополнительныеПараметры.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросРазныеНомераЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьТаблицы();
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		ОбновитьСостояниеКнопокСтраницы();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресВоВременномХранилище) Тогда
		ТекстСообщения = НСтр("ru='Предусмотрено открытие формы только из документов.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	АдресВоВременномХранилище = Параметры.АдресВоВременномХранилище;
	
	Параметры.Свойство("ОснованиеСсылка", ОснованиеСсылка);
	Параметры.Свойство("ЭтоВозврат"     , ЭтоВозврат);
	
	Если НЕ ЗначениеЗаполнено(ОснованиеСсылка) Тогда
		РежимНовогоДокумента = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры;
	Иначе
		РежимНовогоДокумента = Ложь;
		ЗаполнитьТаблицуУведомлений();
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления;
	КонецЕсли;
	
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьПараметрыВыбораНоменклатуры(ЭтотОбъект);
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект, Элементы.ТоварыХарактеристика.Имя);
	
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьПараметрыВыбораНоменклатуры(ЭтотОбъект, Элементы.СоставТранспортныхУпаковокНоменклатура.Имя);
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект, Элементы.СоставТранспортныхУпаковокХарактеристика.Имя, "Элементы.СоставТранспортныхУпаковок.ТекущиеДанные.Номенклатура");
	
	ИспользоватьХарактеристики = ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры();
	Элементы.ТоварыХарактеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.СоставТранспортныхУпаковокХарактеристика.Видимость = ИспользоватьХарактеристики;
	
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект, Элементы.Товары.Имя, "Товары.ХарактеристикиИспользуются");
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект, Элементы.СоставТранспортныхУпаковокХарактеристика.Имя, "СоставТранспортныхУпаковок.ХарактеристикиИспользуются");
	
	ОтображатьУведомленияПоДругимОтгрузкам = Ложь;
	Элементы.ФормаУведомленияПоДругимОтгрузкам.Пометка = ОтображатьУведомленияПоДругимОтгрузкам;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСостояниеКнопокСтраницы();
	УстановитьОтборПоДругимОтгрузкам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Уведомления.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Выбран = Не ТекущаяСтрока.Выбран;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиТовары

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.НомераУпаковок.ОтборСтрок,
			Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(ТекущаяСтрока.Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной номенклатуры не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	ТекущаяСтрока.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(ТекущаяСтрока.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено
		И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Характеристика)
		И ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя)
		И ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекущаяСтрока"       , ТекущаяСтрока);
		СтруктураПараметров.Вставить("Элемент"             , Элемент);
		СтруктураПараметров.Вставить("ДанныеВыбора"        , ДанныеВыбора);
		СтруктураПараметров.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
		
		Оповещение = Новый ОписаниеОповещения("ВопросСоздатьНовуюХарактеристикуЗавершение", ЭтотОбъект, СтруктураПараметров);
		
		НовоеНаименование = ор_ОбщегоНазначенияКлиентСервер.СформироватьНаименованиеСерии(ТекущаяСтрока.СерияПроизводителя, ТекущаяСтрока.СрокГодности);
		
		ТекстВопроса = НСтр("ru = 'Создать новую характеристику'") + " """ + НовоеНаименование + """?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТипЗнч(ОснованиеСсылка) <> Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если НЕ ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(ТекущаяСтрока.Характеристика) Тогда
			ТекстСообщения = НСтр("ru = 'Для выбранной характеристики не ведется учет маркируемых товаров.'");
			ПоказатьПредупреждение(,ТекстСообщения);
			ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя)
		И НЕ ПроверитьСериюПроизводителяХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.СерияПроизводителя) Тогда
		ТекстСообщения = НСтр("ru = 'Серия производителя выбранной характеристики не совпадает с номером серии уведомления.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности)
		И НЕ ПроверитьСрокГодностиХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.СрокГодности) Тогда
		ТекстСообщения = НСтр("ru = 'Срок годности выбранной характеристики не совпадает со сроком годности уведомления.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	ТекущаяСтрока.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(ТекущаяСтрока.Характеристика);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиНомераУпаковок

&НаКлиенте
Процедура НомераУпаковокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераУпаковокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиТранспортныеУпаковки

&НаКлиенте
Процедура ТранспортныеУпаковкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.СоставТранспортныхУпаковок.ОтборСтрок,
			Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиСоставТранспортныхУпаковок

&НаКлиенте
Процедура СоставТранспортныхУпаковокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТранспортныхУпаковокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТранспортныхУпаковокНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если НЕ ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(ТекущаяСтрока.Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной номенклатуры не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	ТекущаяСтрока.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(ТекущаяСтрока.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТранспортныхУпаковокХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено
		И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Характеристика)
		И ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя)
		И ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекущаяСтрока"       , ТекущаяСтрока);
		СтруктураПараметров.Вставить("Элемент"             , Элемент);
		СтруктураПараметров.Вставить("ДанныеВыбора"        , ДанныеВыбора);
		СтруктураПараметров.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);
		
		Оповещение = Новый ОписаниеОповещения("ВопросСоздатьНовуюХарактеристикуЗавершение", ЭтотОбъект, СтруктураПараметров);
		
		НовоеНаименование = ор_ОбщегоНазначенияКлиентСервер.СформироватьНаименованиеСерии(ТекущаяСтрока.СерияПроизводителя, ТекущаяСтрока.СрокГодности);
		
		ТекстВопроса = НСтр("ru = 'Создать новую характеристику'") + " """ + НовоеНаименование + """?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТранспортныхУпаковокХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если ТипЗнч(ОснованиеСсылка) <> Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если НЕ ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(ТекущаяСтрока.Характеристика) Тогда
			ТекстСообщения = НСтр("ru = 'Для выбранной характеристики не ведется учет маркируемых товаров.'");
			ПоказатьПредупреждение(,ТекстСообщения);
			ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя)
		И НЕ ПроверитьСериюПроизводителяХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.СерияПроизводителя) Тогда
		ТекстСообщения = НСтр("ru = 'Серия производителя выбранной характеристики не совпадает с номером серии уведомления.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности)
		И НЕ ПроверитьСрокГодностиХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.СрокГодности) Тогда
		ТекстСообщения = НСтр("ru = 'Срок годности выбранной характеристики не совпадает со сроком годности уведомления.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	ТекущаяСтрока.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(ТекущаяСтрока.Характеристика);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	СменитьСтраницу(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	СменитьСтраницу(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВвод(Команда)
	
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	СохранитьВводСервер(ЕстьОшибки);
	Если Не Модифицированность И НЕ ЕстьОшибки Тогда
		
		Для Каждого Строка Из СписокУведомлений Цикл
			Оповестить("ВыполненоСопоставлениеЗаполнениеМДЛП", Строка.Значение, Неопределено);
		КонецЦикла;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		СтруктураВозврата.Вставить("МодифицированностьВладельца", МодифицированностьВладельца);
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияПоДругимОтгрузкам(Команда)
	
	ОтображатьУведомленияПоДругимОтгрузкам = НЕ ОтображатьУведомленияПоДругимОтгрузкам;
	Элементы.ФормаУведомленияПоДругимОтгрузкам.Пометка = ОтображатьУведомленияПоДругимОтгрузкам;
	
	УстановитьОтборПоДругимОтгрузкам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СменитьСтраницу(Вперед)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Организация","ЭтотОбъект");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Контрагент"" не заполнено.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Контрагент","ЭтотОбъект");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Склад"" не заполнено.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"СтруктурнаяЕдиница","ЭтотОбъект");
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				ЗаполнитьТаблицуУведомлений();
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления;
			КонецЕсли;
			
		Иначе
			// нет перехода назад
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			Если ЕстьУведомленияБезПолученногоСостава() Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Есть уведомления по которым необходимо запросить информацию об упаковках. Сначала запросите информацию.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			ЕстьВыбранныеУведомления = Ложь;
			Для Каждого Строка Из Уведомления Цикл
				Если Строка.Выбран Тогда
					ЕстьВыбранныеУведомления = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ЕстьВыбранныеУведомления Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Не выбрано ни одного уведомления. Выберите минимум одно уведомление.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				
				ЭтоПервыйПрогон = Истина;
				ВыбранаяДата    = Неопределено;
				ВыбранныйНомера = Неопределено;
				
				Для Каждого Строка Из Уведомления Цикл
					Если Строка.Выбран Тогда
						
						Если ЭтоПервыйПрогон Тогда
							ВыбранаяДата    = Строка.ДатаДокумента;
							ВыбранныйНомера = Строка.НомерДокумента;
							ЭтоПервыйПрогон = Ложь;
							Продолжить;
						КонецЕсли;
						
						Если ВыбранаяДата <> Строка.ДатаДокумента
							ИЛИ ВыбранныйНомера <> Строка.НомерДокумента Тогда
							ЕстьОшибки = Истина;
							ТекстВопроса = НСтр("ru='У выбранных уведомлений различаются номер и дата отгрузки. Продолжить?'");
							ОписаниеОповещения = Новый ОписаниеОповещения("ВопросРазныеНомераЗавершение", ЭтотОбъект);
							ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				ЗаполнитьТаблицы();
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
			КонецЕсли;
			
		Иначе
			Если РежимНовогоДокумента Тогда
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры;
			Иначе
				// нет перехода назад
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			
			ПроверитьЗаполнениеТоваров(ЕстьОшибки);
			ПроверитьЗаполнениеТоваров(ЕстьОшибки, Истина);
			
			Если НЕ ЕстьОшибки Тогда
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтчет;
				ЗаполнитьСтраницуОтчета();
			КонецЕсли;
			
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления;
		КонецЕсли;
		
	Иначе
		
		Если Вперед Тогда
			// нет перехода вперед
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСостояниеКнопокСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеКнопокСтраницы(ОтчетОтмена = Ложь)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры Тогда
		
		Элементы.ФормаНазад.Доступность  = Ложь;
		Элементы.ФормаДалее.Доступность  = Истина;
		Элементы.ЗавершитьВвод.Видимость = Ложь;
		Элементы.ФормаУведомленияПоДругимОтгрузкам.Видимость = Ложь;
		
		ЭтаФорма.Заголовок = НСтр("ru='Ввод параметров подбора уведомлений'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина И РежимНовогоДокумента;
		Элементы.ФормаДалее.Доступность  = Истина;
		Элементы.ЗавершитьВвод.Видимость = Ложь;
		Элементы.ФормаУведомленияПоДругимОтгрузкам.Видимость = Истина;
		
		ЭтаФорма.Заголовок = НСтр("ru='Подбор уведомлений для заполнения'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ФормаДалее.Доступность  = Истина;
		Элементы.ЗавершитьВвод.Видимость = Ложь;
		Элементы.ФормаУведомленияПоДругимОтгрузкам.Видимость = Ложь;
		
		ЭтаФорма.Заголовок = НСтр("ru='Результат подбора'");
		
	Иначе
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ФормаДалее.Доступность  = Ложь;
		Элементы.ЗавершитьВвод.Видимость = Истина;
		Элементы.ФормаУведомленияПоДругимОтгрузкам.Видимость = Ложь;
		
		ЭтаФорма.Заголовок = НСтр("ru='Результат заполнения'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУведомлений()
	
	Уведомления.Очистить();
	
	Если ЗначениеЗаполнено(ОснованиеСсылка)
		И ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		СтруктураВыбора = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораУведомленний(ОснованиеСсылка);
		
		Если СтруктураВыбора = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из СтруктураВыбора.ТаблицаУведомлений Цикл
			Если ор_ИнтеграцияМДЛП.СтатусДоступенДляЗаполнения(Строка.Статус) Тогда
				НоваяСтрока = Уведомления.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли РежимНовогоДокумента Тогда
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Ссылка"            , ОснованиеСсылка);
		СтруктураПараметров.Вставить("Организация"       , Организация);
		СтруктураПараметров.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		СтруктураПараметров.Вставить("Контрагент"        , Контрагент);
		СтруктураПараметров.Вставить("НомерДокумента"    , НомерДокумента);
		СтруктураПараметров.Вставить("ДатаДокумента"     , ДатаДокумента);
		СтруктураПараметров.Вставить("ЭтоВозврат"        , ЭтоВозврат);
		
		ТаблицаУведомлений = ор_ИнтеграцияМДЛП.ПолучитьТаблицуВыбораУведомленийПриемки(СтруктураПараметров);
		
		Для Каждого Строка Из ТаблицаУведомлений Цикл
			Если ор_ИнтеграцияМДЛП.СтатусДоступенДляЗаполнения(Строка.Статус) Тогда
				НоваяСтрока = Уведомления.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицы()
	
	СписокУведомлений.Очистить();
	
	Для Каждого Строка Из Уведомления Цикл
		Если Строка.Выбран Тогда
			СписокУведомлений.Добавить(Строка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	СписокУведомленийОтвязать.Очистить();
	
	Для Каждого Строка Из Уведомления Цикл
		Если НЕ Строка.Выбран И Строка.УжеСопоставлен Тогда
			СписокУведомленийОтвязать.Добавить(Строка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Товары.Очистить();
	НомераУпаковок.Очистить();
	ТранспортныеУпаковки.Очистить();
	СоставТранспортныхУпаковок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Уведомление,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Характеристика.ор_МаркируемыйТовар КАК МаркируемыйТовар,
	|	Товары.Количество КАК Количество,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.GTIN КАК GTIN,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.НомерСерии КАК СерияПроизводителя,
	|	Товары.ГоденДо КАК СрокГодности
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&СписокУведомлений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераУпаковок.Ссылка КАК Уведомление,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	НомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.Товары КАК Товары
	|		ПО НомераУпаковок.ИдентификаторСтроки = Товары.ИдентификаторСтроки
	|			И НомераУпаковок.Ссылка = Товары.Ссылка
	|ГДЕ
	|	НомераУпаковок.Ссылка В(&СписокУведомлений)
	|	И НЕ Товары.ИдентификаторСтроки ЕСТЬ NULL
	|	И НомераУпаковок.СостояниеПодтверждения В(&СписокСостояний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.Ссылка КАК Уведомление,
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Цена КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка В(&СписокУведомлений)
	|	И ТранспортныеУпаковки.СостояниеПодтверждения В(&СписокСостояний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставТранспортныхУпаковок.Ссылка КАК Уведомление,
	|	СоставТранспортныхУпаковок.Номенклатура КАК Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика КАК Характеристика,
	|	СоставТранспортныхУпаковок.Характеристика.ор_МаркируемыйТовар КАК МаркируемыйТовар,
	|	СоставТранспортныхУпаковок.GTIN КАК GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии КАК СерияПроизводителя,
	|	СоставТранспортныхУпаковок.Цена КАК Цена,
	|	СоставТранспортныхУпаковок.СуммаНДС КАК СуммаНДС,
	|	СоставТранспортныхУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СоставТранспортныхУпаковок.Количество КАК Количество,
	|	СоставТранспортныхУпаковок.Сумма КАК Сумма,
	|	СоставТранспортныхУпаковок.ГоденДо КАК СрокГодности
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|ГДЕ
	|	СоставТранспортныхУпаковок.Ссылка В(&СписокУведомлений)";
	
	Запрос.УстановитьПараметр("СписокУведомлений", СписокУведомлений);
	Запрос.УстановитьПараметр("СписокСостояний", ор_ИнтеграцияМДЛП.ПолучитьСписокСостоянийПодтверждения());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаТоваров                    = Результат[0].Выгрузить();
	ТаблицаНомеров                    = Результат[1].Выгрузить();
	ТаблицаТранспортныеУпаковки       = Результат[2].Выгрузить();
	ТаблицаСоставТранспортныхУпаковок = Результат[3].Выгрузить();
	
	НомерСтроки = 1;
	Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки);
		СтрокиНомеров = ТаблицаНомеров.НайтиСтроки(ПараметрыОтбора);
		
		КоличествоСтрок = СтрокиНомеров.Количество();
		
		Для Каждого СтрокаНомера Из СтрокиНомеров Цикл
			НоваяСтрокаНомера = НомераУпаковок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНомера, СтрокаНомера);
		КонецЦикла;
		
		Если КоличествоСтрок > 0 Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
			НоваяСтрока.Количество = КоличествоСтрок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество / ор_ИнтеграцияМДЛП.ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				НоваяСтрока.Номенклатура = ор_ИнтеграцияМДЛП.НайтиНоменклатруПоGTIN(НоваяСтрока.GTIN);
			КонецЕсли;
			
			НоваяСтрока.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	НомерСтроки = 1;
	Для Каждого СтрокаТовары Из ТаблицаТранспортныеУпаковки Цикл
		
		НоваяСтрока = ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки);
		СтрокиНомеров = ТаблицаСоставТранспортныхУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого СтрокаНомера Из СтрокиНомеров Цикл
			НоваяСтрокаНомера = СоставТранспортныхУпаковок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНомера, СтрокаНомера);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрокаНомера.Номенклатура) Тогда
				НоваяСтрокаНомера.Номенклатура = ор_ИнтеграцияМДЛП.НайтиНоменклатруПоGTIN(НоваяСтрокаНомера.GTIN);
			КонецЕсли;
			
			НоваяСтрокаНомера.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	ГосударственныеИнформационныеСистемыПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, Товары);
	ГосударственныеИнформационныеСистемыПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, СоставТранспортныхУпаковок);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСерию(ТекущаяСтрока, ЗначениеШК = "")
	
	НоваяСерия = ор_ОбщегоНазначенияСервер.СоздатьСериюПоПараметрам(ТекущаяСтрока.Номенклатура,
		ТекущаяСтрока.СерияПроизводителя,
		ТекущаяСтрока.СрокГодности,
		Ложь,
		ЗначениеШК,
		Истина);
	
	ТекущаяСтрока.Характеристика = НоваяСерия;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеТоваров(ЕстьОшибки, ЭтоСостав = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НомерСтроки,
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика
	|ИЗ
	|	втТовары КАК втТовары
	|ГДЕ
	|	втТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	ИЛИ втТовары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|";
	
	Если ЭтоСостав Тогда
		Запрос.УстановитьПараметр("ТаблицаТоваров",  СоставТранспортныхУпаковок.Выгрузить(,"НомерСтроки,Номенклатура,Характеристика"));
		ИмяТаблицы = "СоставТранспортныхУпаковок";
		ИмяТаблицыПредставление = "Состав транспортных упаковок";
	Иначе
		Запрос.УстановитьПараметр("ТаблицаТоваров",  Товары.Выгрузить(,"НомерСтроки,Номенклатура,Характеристика"));
		ИмяТаблицы = "Товары";
		ИмяТаблицыПредставление = "Товары";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%Товар%"" в строке %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Товар%"        , "Номенклатура");
			ТекстСообщения = СтрЗаменить(ТекстСообщения , "%ТаблицаТовары%", ИмяТаблицыПредставление);
			ТекстСообщения = СтрЗаменить(ТекстСообщения , "%НомерСтроки%"  , Выборка.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТаблицы, Выборка.НомерСтроки, "Номенклатура");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"ЭтотОбъект", ЕстьОшибки);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.Характеристика) Тогда
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Товар%"        , "Характеристика");
			ТекстСообщения = СтрЗаменить(ТекстСообщения , "%ТаблицаТовары%", ИмяТаблицыПредставление);
			ТекстСообщения = СтрЗаменить(ТекстСообщения , "%НомерСтроки%"  , Выборка.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТаблицы, Выборка.НомерСтроки, "Характеристика");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"ЭтотОбъект", ЕстьОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВводСервер(ЕстьОшибки)
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиНомеров = НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки));
		
		Если СтрокиНомеров.Количество() > 0 И ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
			Результат = ЗаполнитьПризнакМаркируемгоТовара(СтрокаТовары.Характеристика);
			Если Результат Тогда
				СтрокаТовары.МаркируемыйТовар = Истина;
			Иначе
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из СоставТранспортныхУпаковок Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
			Результат = ЗаполнитьПризнакМаркируемгоТовара(СтрокаТовары.Характеристика);
			Если Результат Тогда
				СтрокаТовары.МаркируемыйТовар = Истина;
			Иначе
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьУведомления(ЕстьОшибки);
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Структурапараметров = Новый Структура;
	Структурапараметров.Вставить("ТаблицаТоваров"                    , Товары.Выгрузить());
	Структурапараметров.Вставить("ТаблицаНомеров"                    , НомераУпаковок.Выгрузить());
	Структурапараметров.Вставить("ТаблицаТранспортныхУпаковок"       , ТранспортныеУпаковки.Выгрузить());
	Структурапараметров.Вставить("ТаблицаСоставаТранспортныхУпаковок", СоставТранспортныхУпаковок.Выгрузить());
	
	ПоместитьВоВременноеХранилище(Структурапараметров, АдресВоВременномХранилище);
	
	Если Модифицированность Тогда
		МодифицированностьВладельца = Истина;
	КонецЕсли;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУведомления(ЕстьОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Для Каждого Строка Из СписокУведомлений Цикл
		
		НужнаЗапись = Ложь;
		
		УведомлениеСсылка = Строка.Значение;
		
		УведомлениеОбъект = УведомлениеСсылка.ПолучитьОбъект();
		
		Если УведомлениеОбъект.Основание <> ОснованиеСсылка Тогда
			УведомлениеОбъект.Основание = ОснованиеСсылка;
			НужнаЗапись = Истина;
		КонецЕсли;
		
		Для Каждого СтрокаТовара Из УведомлениеОбъект.Товары Цикл
			СтруктраПоиска = Новый Структура;
			СтруктраПоиска.Вставить("Уведомление"        , УведомлениеСсылка);
			СтруктраПоиска.Вставить("ИдентификаторСтроки", СтрокаТовара.ИдентификаторСтроки);
			НайденныеСтроки = Товары.НайтиСтроки(СтруктраПоиска);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				Если НЕ ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
					СтрокаТовара.Номенклатура = НайденнаяСтрока.Номенклатура;
					НужнаЗапись = Истина;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТовара.Характеристика) Тогда
					СтрокаТовара.Характеристика = НайденнаяСтрока.Характеристика;
					НужнаЗапись = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаУпаковки Из УведомлениеОбъект.СоставТранспортныхУпаковок Цикл
			СтруктраПоиска = Новый Структура;
			СтруктраПоиска.Вставить("Уведомление"        , УведомлениеСсылка);
			СтруктраПоиска.Вставить("ИдентификаторСтроки", СтрокаУпаковки.ИдентификаторСтроки);
			СтруктраПоиска.Вставить("GTIN"               , СтрокаУпаковки.GTIN);
			СтруктраПоиска.Вставить("СерияПроизводителя" , СтрокаУпаковки.НомерСерии);
			СтруктраПоиска.Вставить("СрокГодности"       , СтрокаУпаковки.ГоденДо);
			СтруктраПоиска.Вставить("Цена"               , СтрокаУпаковки.Цена);
			СтруктраПоиска.Вставить("СуммаНДС"           , СтрокаУпаковки.СуммаНДС);
			Найденныестроки = СоставТранспортныхУпаковок.НайтиСтроки(СтруктраПоиска);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				Если НЕ ЗначениеЗаполнено(СтрокаУпаковки.Номенклатура) Тогда
					СтрокаУпаковки.Номенклатура = НайденнаяСтрока.Номенклатура;
					НужнаЗапись = Истина;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаУпаковки.Характеристика) Тогда
					СтрокаУпаковки.Характеристика = НайденнаяСтрока.Характеристика;
					НужнаЗапись = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НужнаЗапись Тогда
			Попытка
				УведомлениеОбъект.Записать();
			Исключение
				ТекстСообщения = НСтр("ru='Не удалось перезаписать уведомление МДЛП: '") + Строка(УведомлениеСсылка);
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстСообщенияОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения + Символы.ПС + ТекстСообщенияОшибки);
				ЕстьОшибки = Истина;
				Прервать;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из СписокУведомленийОтвязать Цикл
		УведомлениеОбъект = Строка.Значение.ПолучитьОбъект();
		УведомлениеОбъект.Основание = Неопределено;
		Попытка
			УведомлениеОбъект.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось отвязать уведомление МДЛП: '") + Строка(Строка.Значение);
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщенияОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения + Символы.ПС + ТекстСообщенияОшибки);
			ЕстьОшибки = Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПризнакМаркируемгоТовара(Характеристика)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектХарактеристики = Характеристика.ПолучитьОбъект();
	ОбъектХарактеристики.ор_МаркируемыйТовар = Истина;
	
	Попытка
		ОбъектХарактеристики.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить признак маркируемого товара в характеристике :'") + Строка(Характеристика);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОбновитьПризнакМаркируемыйТовар(Характеристика)
	
	Возврат Характеристика.ор_МаркируемыйТовар;
	
КонецФункции

&НаСервере
Функция ПроверитьСериюПроизводителяХарактеристики(Характеристика, СерияПроизводителя)
	
	Если СерияПроизводителя = Характеристика.ор_СерияПроизводителя Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьСрокГодностиХарактеристики(Характеристика, СрокГодности)
	
	Если СрокГодности = Характеристика.ор_СрокГодности Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЕстьУведомленияБезПолученногоСостава()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомераУпаковок.НомерКИЗ КАК НомерУпаковки
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ПО Товары.Ссылка = НомераУпаковок.Ссылка
	|			И Товары.ИдентификаторСтроки = НомераУпаковок.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка В(&СписокУведомлений)
	|	И НомераУпаковок.СостояниеПолученияИнформации <> ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтверждено)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НомераУпаковок.НомерУпаковки
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка В(&СписокУведомлений)
	|	И НомераУпаковок.СостояниеПолученияИнформации <> ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.Подтверждено)";
	
	СписокУведомлений = Новый СписокЗначений;
	Для Каждого Строка Из Уведомления Цикл
		Если Строка.Выбран Тогда
			СписокУведомлений.Добавить(Строка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокУведомлений", СписокУведомлений);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтраницуОтчета()
	
	ЖирныйШрифт = Новый Шрифт(, 12, Истина, , , );
	ПростоШрифт = Новый Шрифт(, 12, Ложь  , , , );
	
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = 'После завершения будут произведены следующие операции:'"), ЖирныйШрифт));
	
	Если РежимНовогоДокумента Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- будет создан и открыт новый документ поступления.'"), ПростоШрифт));
	Иначе
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- в форме документа ""'") + Строка(ОснованиеСсылка) + НСтр("ru = '"" будут перезаполнены табличные части.'"), ПростоШрифт));
	КонецЕсли;
	
	Для Каждого Строка Из СписокУведомлений Цикл
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- в документе ""'") + Строка(Строка.Значение) + НСтр("ru = '"" будут заполнены недостающие данные (номенклатура и характеристика).'"), ПростоШрифт));
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки);
		СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиНомеров.Количество() > 0 Тогда
			
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- у характеристики ""'") + Строка(СтрокаТовары.Характеристика) + НСтр("ru = '"" будет установлен флаг ""Маркируемый товар"". '"), ПростоШрифт));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из СписокУведомленийОтвязать Цикл
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- документ ""'") + Строка(Строка.Значение) + НСтр("ru = '"" будет отвязан от документа ""'") + Строка(ОснованиеСсылка) + НСтр("ru = '"" .'"), ПростоШрифт));
	КонецЦикла;
	
	Отчет = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДругимОтгрузкам()
	
	Если Не ОтображатьУведомленияПоДругимОтгрузкам Тогда
		
		Для Каждого строка Из Уведомления Цикл
			Если Строка.Выбран И НЕ Строка.НомерИДатаСоответствует Тогда
				Строка.Выбран = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.Уведомления.ОтборСтрок,
			Новый Структура("НомерИДатаСоответствует", Истина));
		
	Иначе
		ИнтеграцияМДЛПКлиент.СнятьОтборСтрок(Элементы.Уведомления.ОтборСтрок, "НомерИДатаСоответствует");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
