#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_НастроитьПоискАссоциаций(Команда)
	
	ОткрытьФорму("РегистрСведений.СопутствующиеТовары.Форма.ор_НастройкаПоискаАссоциаций", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПоискАссоциаций(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ВыполнитьПоискАссоциацийВопросЗавершение", ЭтотОбъект),
		НСтр("ru = 'Поиск ассоциаций может занять несколько минут.
		|Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПоискАссоциацийВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Состояние(НСтр("ru = 'Выполняется поиск ассоциаций.'"),,НСтр("ru = 'Пожалуйста, дождитесь окончания поиска...'"));
		ор_СопутствующиеТоварыВызовСервера.ОбновитьДанныеОНоменклатуреПродаваемойСовместно();
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
