
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлДанныхБазовыеЛФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныхЛФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ФайлНаДискеБазовыеЛФ = Новый Файл(ФайлДанныхБазовыеЛФ);
	Если НЕ ФайлНаДискеБазовыеЛФ.Существует() ИЛИ ФайлНаДискеБазовыеЛФ.ЭтоКаталог() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл данных базовые ЛФ не существует'"),, НСтр("ru = 'Ошибка'"));
		Возврат;
	КонецЕсли;
	
	ФайлНаДискеЛФ = Новый Файл(ФайлДанныхЛФ);
	Если НЕ ФайлНаДискеЛФ.Существует() ИЛИ ФайлНаДискеЛФ.ЭтоКаталог() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл данных ЛФ не существует'"),, НСтр("ru = 'Ошибка'"));
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ФайлДанныхБазовые", ФайлДанныхБазовыеЛФ);
	Результат.Вставить("ФайлДанных", ФайлДанныхЛФ);
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриОткрытииЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	РасширениеРаботыСФайламиПодключено = Подключено;
	Если НЕ РасширениеРаботыСФайламиПодключено Тогда
		Элементы.ФайлДанныхБазовыеЛФ.Видимость = Ложь;
		Элементы.ФайлДанныхЛФ.Видимость = Ложь;
		Элементы.ПредупреждениеЗагрузка.Видимость = Истина;
	Иначе
		Элементы.ФайлДанныхБазовыеЛФ.Видимость = Истина;
		Элементы.ФайлДанныхЛФ.Видимость = Истина;
		Элементы.ПредупреждениеЗагрузка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ВыборФайлаБазовых) Экспорт
	
	Если Не Подключено Тогда
		
		ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами!'"));
		Возврат;
		
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'ВЫБРАТЬ источник данных'");
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Документ XML'") + " (*.xml)|*.xml";
	
	Если ВыборФайлаБазовых = Истина Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДанныхБазовыеЛФ;
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ФайлДанныхБазовыеЛФНачалоВыбораЗавершение",
			ЭтотОбъект,
			Новый Структура("Диалог", ДиалогВыбораФайла));
	Иначе
		ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДанныхЛФ;
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ФайлДанныхЛФНачалоВыбораЗавершение",
			ЭтотОбъект,
			Новый Структура("Диалог", ДиалогВыбораФайла));
	КонецЕсли;
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныхБазовыеЛФНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.Диалог;
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДанныхБазовыеЛФ = ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныхЛФНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.Диалог;
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДанныхЛФ = ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры

#КонецОбласти

