
#Область СлужебныеПроцедурыИФункции

// Возвращает структуру сокращений имен метаданных.
//
// Возвращаемое значение:
//  СокращенияИменМетаданных - Структура - Структура сокращений.
//
Функция СформироватьСтруктуруСокращенийИменМетаданных() Экспорт
	
	СокращенияИменМетаданных = Новый Структура();
	СокращенияИменМетаданных.Вставить("ПланОбмена", 			"ПО");
	СокращенияИменМетаданных.Вставить("ОбщаяФорма", 			"ОФ");
	СокращенияИменМетаданных.Вставить("Справочник", 			"Спр");
	СокращенияИменМетаданных.Вставить("Документ", 				"Док");
	СокращенияИменМетаданных.Вставить("Перечисление", 			"Пер");
	СокращенияИменМетаданных.Вставить("ЖурналДокументов", 		"ЖурДок");
	СокращенияИменМетаданных.Вставить("ПланВидовХарактеристик",	"ПВХ");
	СокращенияИменМетаданных.Вставить("РегистрСведений", 		"РС");
	СокращенияИменМетаданных.Вставить("РегистрНакопления", 		"РН");
	СокращенияИменМетаданных.Вставить("Обработка", 				"Обр");
	СокращенияИменМетаданных.Вставить("Отчет", 					"ОТ");
	
	Возврат СокращенияИменМетаданных;
	
КонецФункции

Функция СписокПроцедурОБ() Экспорт
	Возврат ор_ПрограммноеСозданиеЭлементовФормОБ.СформироватьСоответствияИспользуемыхПроцедур();
КонецФункции

Функция СписокПроцедурОР() Экспорт
	Возврат ор_ПрограммноеСозданиеЭлементовФормОР.СформироватьСоответствияИспользуемыхПроцедур();
КонецФункции

Функция СписокПроцедурОРМДЛП() Экспорт
	Возврат ор_ПрограммноеСозданиеЭлементовФормОРМДЛП.СформироватьСоответствияИспользуемыхПроцедур();
КонецФункции

#КонецОбласти
