
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрокаКоллекции Из Параметры.КоллекцияСтрок Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаКоллекции.Номенклатура) Тогда
			НоваяСтрока = ТаблицаСоответствий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
			НоваяСтрока.Загружать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	СоответствияПодобраны = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностьюГруппаПоискПоСловам();
	УправлениеДоступностьюГруппаЧисловыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СоответствияПодобраны Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Выполнить перенос соответствий?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользованиеКлючевогоСловаПриИзменении(Элемент)
	
	УправлениеДоступностьюГруппаПоискПоСловам();
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЧисловымЗначениямПриИзменении(Элемент)
	
	УправлениеДоступностьюГруппаЧисловыеЗначения();
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКлючевогоСловаПриИзменении(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбязательноеНаличиеКлючевогоСловаПриИзменении(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИЛИПриИзменении(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаТаблицыСоответствий = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	Если ТекущаяСтрокаТаблицыСоответствий = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаТаблицыСоответствий.Номенклатура = ТаблицаНоменклатуры.НайтиПоИдентификатору(ВыбраннаяСтрока).Номенклатура;
	СоответствияПодобраны = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	СоответствияПодобраны = Ложь;
	Закрыть(ТаблицаСоответствий);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоответствий Цикл
		СтрокаТаблицы.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоответствий Цикл
		СтрокаТаблицы.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		СоответствияПодобраны = Ложь;
		Закрыть(ТаблицаСоответствий);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		СоответствияПодобраны = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВарианты()
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВариантыСервер(ТекущаяСтрока.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыСервер(НаименованиеНоменклатуры)
	
	СтрокаСловНаименования = СтрЗаменить(НаименованиеНоменклатуры,"."," "); // убрали точки
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,","," "); // убрали запятые
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"+"," "); // убрали дефисы
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"_"," "); // убрали подчёркивание
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"("," "); // убрали (
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,")"," "); // убрали )
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"№"," "); // убрали №
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"/"," "); // убрали /
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"\"," "); // убрали \
	
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования," ", Символы.ПС); // разобьём на строки по словам
	
	// определимся с ключевым словом 
	УсловиеКлючевогоСлова = "";
	БылоИ = Ложь;
	Если ИспользованиеКлючевогоСлова Тогда
		Если СтрЧислоСтрок(СтрокаСловНаименования) >= НомерКлючевогоСлова Тогда
			
			КлючевоеСлово =  СокрЛП(СтрПолучитьСтроку(СтрокаСловНаименования,НомерКлючевогоСлова));
			ПозицияКавычки = Найти(КлючевоеСлово,"""");
			Если ПозицияКавычки <> 0 Тогда
				КлючевоеСлово = Лев(КлючевоеСлово,ПозицияКавычки-1);
			КонецЕсли;	
			УсловиеКлючевогоСлова = " И (Номенклатура.Наименование ПОДОБНО ""%"+КлючевоеСлово+"%"""; 
			БылоИ = Истина;
			Если ОбязательноеНаличиеКлючевогоСлова Тогда
				БылоИ = Ложь;
				УсловиеКлючевогоСлова = УсловиеКлючевогоСлова + ")";
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Наименование,
	|	Номенклатура.ор_Производитель КАК Производитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И НЕ Номенклатура.ПометкаУдаления"+
	УсловиеКлючевогоСлова;
	
	Если ИспользоватьИЛИ Тогда
		ИлиИ = "ИЛИ";
	Иначе
		ИлиИ = "И";
	КонецЕсли;
	
	Если ОтборПоЧисловымЗначениям Тогда
		Для Сч = 1 По СтрЧислоСтрок(СтрокаСловНаименования) Цикл
			ЧислоСтр = ВыделитьЧисло(СокрЛП(СтрПолучитьСтроку(СтрокаСловНаименования,Сч)));
			Если ЧислоСтр <> "" Тогда
				ТекстЗапроса =ТекстЗапроса + ?(БылоИ," "+ИлиИ+" "," И (")+"Номенклатура.Наименование ПОДОБНО ""%"+ЧислоСтр+"%"""; 
				БылоИ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если БылоИ Тогда
		ТекстЗапроса = ТекстЗапроса + ")";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаНоменклатуры.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыделитьЧисло(Знач Стр)
	
	ВозвСтр="";
	Стр=СокрЛП(Стр);
	
	Для Сч=1 По СтрДлина(Стр) Цикл
		ВозвСтр=ВозвСтр+?(Найти("1234567890",Сред(Стр,Сч,1))=0,"",Сред(Стр,Сч,1));
	КонецЦикла;
	
	Возврат ВозвСтр;
	
КонецФункции

&НаКлиенте
Процедура УправлениеДоступностьюГруппаПоискПоСловам()
	
	Элементы.НомерКлючевогоСлова.Доступность               = ИспользованиеКлючевогоСлова;
	Элементы.ОбязательноеНаличиеКлючевогоСлова.Доступность = ИспользованиеКлючевогоСлова;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюГруппаЧисловыеЗначения()
	
	Элементы.ИспользоватьИЛИ.Доступность = ОтборПоЧисловымЗначениям;
	
КонецПроцедуры

#КонецОбласти


