#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задать настройки формы отчета.
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения	 - Форма отчета
//  КлючВарианта - Строка						 - Ключ загружаемого варианта
//  Настройки	 - Структура					 - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт

	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// Процедура - Обработчик заполнения настроек отчета и варианта
//
// Параметры:
//  НастройкиОтчета		 - Структура - Настройки отчета, подробнее см. процедуру ОтчетыУНФ.ИнициализироватьНастройкиОтчета 
//  НастройкиВариантов	 - Структура - Настройки варианта отчета, подробнее см. процедуру ОтчетыУНФ.ИнициализироватьНастройкиВарианта
//
Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Теги = НСтр("ru = 'Продажи,Запасы,Номенклатура'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОтчетыУНФ.ФормаОтчетаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработчик события ПриЗагрузкеВариантаНаСервере
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения	 - Форма отчета
//  НовыеНастройкиКД - НастройкиКомпоновкиДанных	 - Загружаемые настройки КД
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	ОтчетыУНФ.ПреобразоватьСтарыеНастройки(Форма, НовыеНастройкиКД);
	ОтчетыУНФ.ОбновитьВидимостьОтбораОрганизация(Форма.Отчет.КомпоновщикНастроек);
	ОтчетыУНФ.ФормаОтчетаПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД);
	
КонецПроцедуры

// Обработчик события ПриЗагрузкеПользовательскихНастроекНаСервере
//
// Параметры:
//  Форма							 - ФормаКлиентскогоПриложения				 - Форма отчета
//  НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - Загружаемые 
// 										пользовательские настройки КД
//
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ОтчетыУНФ.ПеренестиПараметрыЗаголовкаВНастройки(КомпоновщикНастроек.Настройки, НовыеПользовательскиеНастройкиКД);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	// Получаем настройки СКД.
	НастройкиСКД = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	// Получаем СКД макет.
	СКД = Отчеты.ор_ЦеныЖНВЛП.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// Ищем в параметрах ВидЦен для запроса
	Для Каждого Параметр Из НастройкиСКД.ПараметрыДанных.Элементы Цикл
		
		// Проверка что параметр используется(если не используется то отчёт не будет построен) 
		// и что это параметр именно магазин
		Если Параметр.Использование И ТипЗнч(Параметр.Значение) = Тип("СправочникСсылка.ВидыЦен")
			И Параметр.Значение <> Справочники.ВидыЦен.ПустаяСсылка() Тогда
			ВидЦен = Параметр.Значение;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ВидЦен <> Неопределено Тогда
		
		ПолеЦенаПоМагазину = СКД.НаборыДанных.НаборДанных1.Поля.Найти("ЦенаПоМагазину");
		ПолеЦенаПоМагазину.Заголовок = ВидЦен.Наименование;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЦенор_ПараметрыРасчетаФормул.Ссылка.Наименование КАК ВидЦеныНаименование,
		|	ВидыЦенор_ПараметрыРасчетаФормул.ВидЦенБазыРасчета.Наименование КАК ор_ВидЦенБазыРасчетаНаименование,
		|	ВидыЦенор_ПараметрыРасчетаФормул.ВидЦенДляРасчетаНаценки.Наименование КАК ор_ВидЦенДляРасчетаНаценкиНаименование
		|ИЗ
		|	Справочник.ВидыЦен.ор_ПараметрыРасчетаФормул КАК ВидыЦенор_ПараметрыРасчетаФормул
		|ГДЕ
		|	ВидыЦенор_ПараметрыРасчетаФормул.Ссылка = &ВидЦены
		|	И ВидыЦенор_ПараметрыРасчетаФормул.ВариантРасчета = ЗНАЧЕНИЕ(Перечисление.ор_ВидыДополнительныхАлгоритмовРасчетаЦен.ЖНВЛП)";
		
		Запрос.УстановитьПараметр("ВидЦены", ВидЦен);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		// Если выборка пустая, значит по виду цены не используется ЖНВЛП расчёт, заголовки останутся стандартными.
		Если Выборка.Следующий() Тогда
			
			ПолеЦенаБазырасчётаБезНДС = СКД.НаборыДанных.НаборДанных1.Поля.Найти("ЦенаБазырасчётаБезНДС");
			ПолеЦенаРасчётаНаценкиБезНДС =  СКД.НаборыДанных.НаборДанных1.Поля.Найти("ЦенаРасчётаНаценкиБезНДС");
			
			ПолеЦенаБазырасчётаБезНДС.Заголовок = Выборка.ор_ВидЦенБазыРасчетаНаименование + " (Без НДС)";
			ПолеЦенаРасчётаНаценкиБезНДС.Заголовок = Выборка.ор_ВидЦенДляРасчетаНаценкиНаименование + " (Без НДС)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидЦен <> Неопределено Тогда
		
		// выводим отчёт
		СтандартнаяОбработка = Ложь;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиСКД,,, Тип("ГенераторМакетаКомпоновкиДанных"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли