
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр эв_СтавкиБонусовПервостольника
	Движения.эв_СтавкиБонусовПервостольника.Записывать = Истина;
	Для Каждого ТекСтрокаСтавкиБонусов Из СтавкиБонусов Цикл 
		Движение = Движения.эв_СтавкиБонусовПервостольника.Добавить();
		Движение.Период = Дата;
		Движение.СтруктурнаяЕдиница = ТекСтрокаСтавкиБонусов.СтруктурнаяЕдиница;
		Движение.ЦеноваяГруппа = ТекСтрокаСтавкиБонусов.ЦеноваяГруппа;
		Движение.Номенклатура = ТекСтрокаСтавкиБонусов.Номенклатура;
		Движение.ПроцентИБ = ТекСтрокаСтавкиБонусов.ПроцентИБ;
		Движение.ПроцентКБ = ТекСтрокаСтавкиБонусов.ПроцентКБ;
		Движение.СуммаИБ = ТекСтрокаСтавкиБонусов.СуммаИБ;
		Движение.СуммаКБ = ТекСтрокаСтавкиБонусов.СуммаКБ;
		Движение.ДатаОкончания = ?(ТекСтрокаСтавкиБонусов.ДатаОкончания = '00010101', ДатаОкончания, ТекСтрокаСтавкиБонусов.ДатаОкончания);
		Движение.Автор = Ответственный;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный");

КонецПроцедуры
