
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиУНФ.ЗаполнитьДополнительныеПараметры(Объект,
		"ГруппаДополнительныеРеквизиты", , , , ПоложениеЗаголовкаЭлементаФормы.Лево);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	НаборСвойств_Документ_ПриходныйОрдер = УправлениеСвойствами.НаборСвойствПоИмени("Документ_ПриходныйОрдер");
	// Конец СтандартныеПодсистемы.Свойства
	
	// +ор интеграция МДЛП
	ор_СобытияФормМДЛП.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -ор интеграция МДЛП
	
	ИспользоватьПередачуТоваровМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = Константы.УчетПоКомпании.Компания(Объект.Организация);
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
			
		Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка = Истина;
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		Если НЕ Объект.СтруктурнаяЕдиница.ОрдерныйСклад Тогда
			
			Объект.СтруктурнаяЕдиница = Неопределено;
			
		ИначеЕсли НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
			
			Элементы.СтруктурнаяЕдиница.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Установить текст Основание
	ТекстЗаголовка = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	УстановитьЗаголовокНадписиОснование(ЭтотОбъект, ТекстЗаголовка);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	МенеджерОборудованияУНФ.УстановитьВидимостьЭлементовПоДоступномуПодключаемомуОборудованию(Элементы,
		"ЗапасыЗагрузитьДанныеИзТСД",
		"ЗапасыПолучитьВес");
	// Конец ПодключаемоеОборудование
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	
	// Серии номенклатуры
	ИспользоватьСерииНоменклатурыОстатки = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Элементы.ЗапасыГруппаСерииНоменклатуры.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	
	// Характеристики
	НоменклатураВДокументахСервер.ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристик(ЭтаФорма);
	Если Параметры.Ключ.Пустая()
		Тогда
		НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект, Истина)
	КонецЕсли;
	
	НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтаФорма, "ПриходныйОрдер", НастройкиФормыВыбораНоменклатуры);
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтаФорма, "Запасы");
	
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");

	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);	
	
	// ++ Аптека
	ор_ОбщегоНазначенияСервер.ДобавитьИндикациюЖНВЛСВТаблицуТоваров(ЭтотОбъект);
	// -- Аптека
	
	// + ор интеграция МДЛП
	Если Объект.Ссылка.Пустая() Тогда
		СформироватьТекстУведомлениеМДЛПСервер();
		ИнтеграцияМДЛПВызовСервера();
		ЗаполнитьПризнакИспользованияСерийПроизводителяВТаблице();
		ЗаполнитьКолонкиСерииИСрокаГодности();
	КонецЕсли;
	// - ор интеграция МДЛП
	ПриИзмененииВидаУчетаСклада();
	
	// ор ++
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПараметрыВводаСерий",
		"ТолькоПросмотр",
		НЕ Объект.ор_ВводСерийПоПараметрам);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗапасыСерияПроизводителя",
		"Видимость",
		Объект.ор_ВводСерийПоПараметрам);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗапасыСрокГодности",
		"Видимость",
		Объект.ор_ВводСерийПоПараметрам);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗапасыХарактеристика",
		"ПропускатьПриВводе",
		Объект.ор_ВводСерийПоПараметрам);
	// ор --
	// ИнтеграцияГосИС
	СобытияФормИСУНФ.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// Конец ИнтеграцияГосИС
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ПриходныйОрдер.ПараметрыУказанияСерий(Объект));
	ЗаполнитьСписокДокументОснование();
	
	МобильныйКлиентУНФ.НастроитьФормуОбъектаМобильныйКлиент(Элементы, "Запасы");
	
	АдаптацияФормыТакси();
	АдаптацияФормыМК();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменений
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменений
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	// + ор интеграция МДЛП
	СформироватьТекстУведомлениеМДЛПСервер();
	ИнтеграцияМДЛПВызовСервера();
	// - ор интеграция МДЛП
	
	// ор ++
	ЗаполнитьПризнакИспользованияСерийПроизводителяВТаблице();
	ЗаполнитьКолонкиСерииИСрокаГодности();
	// ор --
	
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриЗакрытии()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект,, Отказ);
	Иначе
		НоменклатураВДокументахКлиент.ПроверитьТабличнуюЧастьНаЗапретДробныхЗначений(Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("МодифицированностьВФорме",Модифицированность);
	// Конец Обсуждения
	
	// ОбратнаяСвязь
	ОбратнаяСвязь.ПередЗаписьюДокумента(Отказ, ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);
	// Конец ОбратнаяСвязь
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// + ор интеграция МДЛП
	СформироватьТекстУведомлениеМДЛПСервер();
	ИнтеграцияМДЛПВызовСервера();
	// - ор интеграция МДЛП
	
	// ор ++
	ЗаполнитьПризнакИспользованияСерийПроизводителяВТаблице();
	ЗаполнитьКолонкиСерииИСрокаГодности();
	// ор --

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("ОбновитьСписокФинДокументовКПоступлению"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		АдресЗапасовВХранилище = Параметр;
		
		Если ЗапрашиватьОбъединениеСтрок Тогда
			
			МассивНомеровИдентичныхСтрок = НомераИдентичныхСтрокВТабличнойЧасти(АдресЗапасовВХранилище, "Запасы");
			
			Если МассивНомеровИдентичныхСтрок.Количество() Тогда
				ДопПараметр = Новый Структура("ЭтоПодбор, АдресЗапасовВХранилище", Истина, АдресЗапасовВХранилище);
				Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
				ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивНомеровИдентичныхСтрок = Новый Массив;
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, "Запасы", Истина, Истина, МассивНомеровИдентичныхСтрок);
		
		Для Каждого НомерСтроки Из МассивНомеровИдентичныхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект["Запасы"][НомерСтроки];
			
			// Серии номенклатуры
			Если ИспользоватьСерииНоменклатурыОстатки<>Неопределено Тогда
				СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, СтрокаТабличнойЧасти);
				СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		ПолучитьСерииНоменклатурыИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Запасы");
	КонецЕсли;
	
	// + ор интеграция МДЛП
	ор_СобытияФормМДЛПКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// - ор интеграция МДЛП
	
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения

КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеСтруктурнойЕдиницыПриИзменении(Объект.СтруктурнаяЕдиница);
	ЗаполнитьЗначенияСвойств(Объект, СтруктураДанные);
	
	СтруктурнаяЕдиницаПриИзмененииСервер(); 
	
КонецПроцедуры

&НаСервере
Процедура СтруктурнаяЕдиницаПриИзмененииСервер()
	
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	ПриИзмененииВидаУчетаСклада();
	
	Если Не Элементы.ДокументПоступления.Видимость И Не Элементы.ЗапасыДокументПоступления.Видимость Тогда
		Возврат
	КонецЕсли;
	
	Объект.ДокументПоступления = Неопределено;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.ДокументПоступления = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент) 
	
	Если Не Элементы.ДокументПоступления.Видимость И Не Элементы.ЗапасыДокументПоступления.Видимость Тогда
		Возврат
	КонецЕсли;
	
	Объект.ДокументПоступления = Неопределено;
	
	Если Объект.ПоложениеДокументаПоступления = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
		Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			СтрокаТабличнойЧасти.ДокументПоступления = Неопределено;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиница.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаОткрытие()

&НаКлиенте
Процедура ДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Организация", Объект.Организация);
	СтруктураОткрытия.Вставить("ТолькоПоДокументам", Истина);
	СтруктураОткрытия.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	СтруктураОткрытия.Вставить("ТолькоПоОрдерам", Ложь);
	СтруктураОткрытия.Вставить("КПоступлению", Истина);
	СтруктураОткрытия.Вставить("Контрагент", Объект.Контрагент);
	
	ОткрытьФорму("ОбщаяФорма.ПодборПоОстаткамТоваровКПоступлениюРеализации", СтруктураОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПоступленияПриИзменении(Элемент)
	
	ЗначениеЗаполнения = ?(ЗначениеЗаполнено(Объект.ДокументПоступления), Объект.ДокументПоступления, Неопределено);
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.ДокументПоступления = ЗначениеЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДокументОснование, Элемент);
	Иначе
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоСсылке(Объект.ДокументОснование);
	КонецЕсли;
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийСвернутоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, 
	"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбранноеИмяФормы, Параметры) Экспорт
	
	Если ВыбранноеИмяФормы<>Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура();
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбранноеИмяФормы.Значение, СтруктураПараметровОтбора, ЭтотОбъект, ,,,ОповещениеОЗакрытии);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбранноеЗначение, Параметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект.ДокументОснование = ВыбранноеЗначение;
		ТекстЗаголовка = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбранноеЗначение);
		УстановитьЗаголовокНадписиОснование(ЭтотОбъект, ТекстЗаголовка);
		Модифицированность = Истина;
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ru = 'Заполнить документ по выбранному основанию?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Организация", Объект.Организация);
	СтруктураОткрытия.Вставить("ТолькоПоДокументам", Ложь);
	СтруктураОткрытия.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	СтруктураОткрытия.Вставить("ТолькоПоОрдерам", Ложь);
	СтруктураОткрытия.Вставить("КПоступлению", Истина);
	СтруктураОткрытия.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	СтруктураОткрытия.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	СтруктураОткрытия.Вставить("Партия", ТекущиеДанные.Партия);
	СтруктураОткрытия.Вставить("Контрагент", Объект.Контрагент);
	
	ОткрытьФорму("ОбщаяФорма.ПодборПоОстаткамТоваровКПоступлениюРеализации", СтруктураОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерииНоменклатуры = "";
		СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, Элемент.ТекущиеДанные);
		// + ор интеграция МДЛП
		Элемент.ТекущиеДанные.ор_ИдентификаторСтроки = Новый УникальныйИдентификатор;
		ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, Элемент.ТекущиеДанные);
		// - ор интеграция МДЛП
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
		
	Если Элемент.ТекущийЭлемент = Элементы.ЗапасыСерииНоменклатуры Тогда
		ОткрытьПодборСерииНоменклатуры();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;	
	
КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

&НаКлиенте
Процедура ЗапасыПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ЭтоПодбор") И ДополнительныеПараметры.ЭтоПодбор Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		МассивНомеровИдентичныхСтрок = Новый Массив;
		ПолучитьЗапасыИзХранилища(ДополнительныеПараметры.АдресЗапасовВХранилище, "Запасы", Истина, Истина, МассивНомеровИдентичныхСтрок);
		
		Для Каждого НомерСтроки Из МассивНомеровИдентичныхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект["Запасы"][НомерСтроки];
			
			// Серии номенклатуры
			Если ИспользоватьСерииНоменклатурыОстатки<>Неопределено Тогда
				СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, СтрокаТабличнойЧасти);
				СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЭтоПоискПоШтрихКоду") И ДополнительныеПараметры.ЭтоПоискПоШтрихКоду Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		ДополнительныеПараметры.Вставить("ОбработкаПослеУточненияОбъединенияКоличества", Истина);
		ЗаполнитьПоДаннымШтрихкодовЗавершение(Неопределено, ДополнительныеПараметры);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	ЗапасыНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)

	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("Партия", СтрокаТабличнойЧасти.Партия);
	
	// + ор интеграция МДЛП
	СтруктураДанные.Вставить("ЗапретитьВводНомеров", ПолучитьПризнакЗапрета());
	// - ор интеграция МДЛП
	
	СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Объект, СтруктураДанные);
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	
	// Серии номенклатуры
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		СерииНоменклатурыУНФКлиентСервер.УдалитьСерииНоменклатурыПоКлючуСвязи(Объект.СерииНоменклатуры, ТекущиеДанныеСтроки,
			ИспользоватьСерииНоменклатурыОстатки);
	КонецЦикла;
	
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		Если ПодборНоменклатурыИзСписка И ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтрокаТабличнойЧасти.Характеристика = СтруктураВыбораНоменклатуры.Характеристика;
			СтруктураВыбораНоменклатуры.Характеристика = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
	КонецЕсли;
	
	//Партии
	СтрокаТабличнойЧасти.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
	
	Если СтруктураДанные.ИспользоватьПартии Тогда
		Если ПодборНоменклатурыИзСписка И ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтрокаТабличнойЧасти.Партия = СтруктураВыбораНоменклатуры.Партия;
			СтруктураВыбораНоменклатуры.Партия = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.Партия = СтруктураДанные.Партия;
		КонецЕсли;
	КонецЕсли;
	// Конец Партии
	
	СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитымдлпВСтрокеТЧ(СтрокаТабличнойЧасти, СтруктураДанные);
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, СтрокаТабличнойЧасти);
	// - ор интеграция МДЛП
	
	// ор ++
	СтрокаТабличнойЧасти.ИспользуютсяСерииПроизводителя = СтрокаТабличнойЧасти.ИспользоватьХарактеристики И ВедетсяУчетСерий(СтрокаТабличнойЧасти.Номенклатура);
	// ор --
	
	СтрокаТабличнойЧасти.СтатусыСерийНоменклатуры = СтруктураДанные.СтатусыСерийНоменклатуры;
	
	ПодборНоменклатурыИзСписка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
	
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		
		Если ВыбранноеЗначение.Свойство("СтруктураНастроек") Тогда
			НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(ЭтаФорма, "ПриходныйОрдер", НастройкиФормыВыбораНоменклатуры, Истина, "Запасы", ВыбранноеЗначение.СтруктураНастроек);
			НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтаФорма, "Запасы");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
		
		ПодборНоменклатурыИзСписка = ВыбранноеЗначение.Свойство("Ячейка");
		
		Если НЕ ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтруктураВыбораНоменклатуры = Новый Структура("Характеристика, Партия");
		КонецЕсли;
		
		СтруктураВыбораНоменклатуры.Характеристика = ВыбранноеЗначение.Характеристика;
		СтруктураВыбораНоменклатуры.Партия = ВыбранноеЗначение.Партия;
		
		ВыбранноеЗначение = ВыбранноеЗначение.Номенклатура;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика",		СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("Партия",				СтрокаТабличнойЧасти.Партия);
	
	// + ор интеграция МДЛП
	СтруктураДанные.Вставить("ЗапретитьВводНомеров", ПолучитьПризнакЗапрета());
	// - ор интеграция МДЛП
	
	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитымдлпВСтрокеТЧ(СтрокаТабличнойЧасти, СтруктураДанные);
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, СтрокаТабличнойЧасти);
	// - ор интеграция МДЛП
	
	// ++ Аптека.
	СтруктураДанных = ПолучитьСериюИСрокГодностиДляХарактеристики(
		СтрокаТабличнойЧасти.Характеристика,
		СтрокаТабличнойЧасти.Номенклатура,
		СтрокаТабличнойЧасти.ИспользоватьХарактеристики);
	СтрокаТабличнойЧасти.СрокГодности                   = СтруктураДанных.СрокГодности;
	СтрокаТабличнойЧасти.СерияПроизводителя             = СтруктураДанных.СерияПроизводителя;
	СтрокаТабличнойЧасти.ИспользуютсяСерииПроизводителя = СтруктураДанных.ИспользуютсяСерииПроизводителя;
	// -- Аптека.
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	// Серии номенклатуры
	Если ИспользоватьСерииНоменклатурыОстатки<>Неопределено Тогда
		СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, Элементы.Запасы.ТекущиеДанные);
		
		СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
		СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, СтрокаТабличнойЧасти);
	// - ор интеграция МДЛП
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, СтрокаТабличнойЧасти);
	// - ор интеграция МДЛП
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередНачаломИзменения(Элемент, Отказ)
	
	// +ор интеграция МДЛП
	Если Элемент.ТекущийЭлемент = Элементы.ЗапасыСтатусЗаполненияУпаковок Тогда
		
		ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
		
		Если НЕ ТекущиеДанные = Неопределено
			И (ТекущиеДанные.ИспользоватьНомераУпаковок
			ИЛИ НЕ ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 0) Тогда
			Отказ = Истина;
			УказатьНомераУпаковок();
		КонецЕсли;
		
	КонецЕсли;
	// +ор интеграция МДЛП
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриАктивизацииЯчейки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	УстанавливатьФорматРедактированияЗапретаДробногоКоличества = Истина;
	Если Не СбрасыватьКоличество Тогда
		УстанавливатьФорматРедактированияЗапретаДробногоКоличества = СтрокаТабличнойЧасти.Количество = Цел(СтрокаТабличнойЧасти.Количество);
	КонецЕсли;
	
	Если Не Элемент.ТекущийЭлемент = Неопределено И Элемент.ТекущийЭлемент.Имя = "ЗапасыКоличество" Тогда
		Элементы.ЗапасыКоличество.ФорматРедактирования = ?(СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества И УстанавливатьФорматРедактированияЗапретаДробногоКоличества, "ЧДЦ=0", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	// Серии номенклатуры
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ПолучитьСтрокиДляОбработки() Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		СерииНоменклатурыУНФКлиентСервер.УдалитьСерииНоменклатурыПоКлючуСвязи(Объект.СерииНоменклатуры, ТекущиеДанныеСтроки,
			ИспользоватьСерииНоменклатурыОстатки);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаФормы(Команда) 
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастройкаФормы, "Нажатие");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента) 
	
	ПараметрыДиалога = Новый Структура;
	
	СтруктураДоступности = Новый Структура("ПоложениеЯчейки, ПоложениеДокументаПоступления", Ложь, Ложь);
		
	Если Элементы.ГруппаДокументПоступления.Видимость Или Элементы.ЗапасыДокументПоступления.Видимость Тогда
		ПараметрыДиалога.Вставить("ПоложениеДокументаПоступления", Объект.ПоложениеДокументаПоступления);
		СтруктураДоступности.ПоложениеДокументаПоступления = Истина;
	Иначе
		ПараметрыДиалога.Вставить("ПоложениеДокументаПоступления", Объект.ПоложениеДокументаПоступления);
	КонецЕсли;
	
	Если Элементы.Ячейка.Видимость Или Элементы.ЗапасыЯчейка.Видимость Тогда
		ПараметрыДиалога.Вставить("ПоложениеЯчейки", Объект.ПоложениеЯчейки);
		СтруктураДоступности.ПоложениеЯчейки = Истина;
	Иначе
		ПараметрыДиалога.Вставить("ПоложениеЯчейки", Объект.ПоложениеЯчейки);
	КонецЕсли;
	
	ПараметрыДиалога.Вставить("Доступность", СтруктураДоступности);
	ПараметрыДиалога.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", ПараметрыДиалога, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("БылиВнесеныИзменения") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.БылиВнесеныИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ПоложениеДокументаПоступления")
		И Объект.ПоложениеДокументаПоступления <> Результат.ПоложениеДокументаПоступления Тогда

		Объект.ПоложениеДокументаПоступления = Результат.ПоложениеДокументаПоступления;
		
		Если Объект.ПоложениеДокументаПоступления = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
			Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
				СтрокаТабличнойЧасти.ДокументПоступления = Объект.ДокументПоступления;
			КонецЦикла;
		Иначе
			Если Объект.Запасы.Количество() Тогда
				Объект.ДокументПоступления = Объект.Запасы[0].ДокументПоступления;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.Свойство("ПоложениеЯчейки")
		И Объект.ПоложениеЯчейки <> Результат.ПоложениеЯчейки Тогда
		Объект.ПоложениеЯчейки = Результат.ПоложениеЯчейки;
		
		Если Объект.ПоложениеЯчейки = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
			Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
				СтрокаТабличнойЧасти.Ячейка = Объект.Ячейка;
			КонецЦикла;
		Иначе
			Если Объект.Запасы.Количество() Тогда
				Объект.Ячейка = Объект.Запасы[0].Ячейка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ШапкаТабличнаяЧастьЗавершениеНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ШапкаТабличнаяЧастьЗавершениеНаСервере(Результат) 
	
	ПриИзмененииВидаУчетаСклада(Истина);
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРеквизитыПечатиНажатие(Элемент)
	
	ОткрытьФормуРеквизитыПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Запасы.Очистить();
        ЗаполнитьПоДокументу(Объект.ДокументОснование);		
    КонецЕсли;

КонецПроцедуры // ЗаполнитьПоОснованию()

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборСвойств_Документ_ПриходныйОрдер);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличества(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", НСтр("ru = 'Сбрасывать количество при изменении номенклатуры'"));
	Оповещение = Новый ОписаниеОповещения("НастройкаСбросаКоличестваЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ФормаНастройкиПользователя", СтруктураПараметров, , , , ,
		Оповещение);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, 
		Элементы.ЗапасыКонтекстноеМенюНастройкаСбросаКоличества, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриходныеНакладныеПоНоменклатуре(Команда) 
	
	Отказ = ЗаполнениеПоДокументамОснованияНеВозможно();
	
	Если Отказ Тогда
		Возврат 
	КонецЕсли;
	
	Если Не Объект.Запасы.Количество() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Распределение производится по номенклатуре которая предварительно добавлена в таблицу.'"),, НСтр("ru = 'Добавьте номенклатуру в таблицу'"));
		Возврат
	КонецЕсли;
	
	Объект.СерииНоменклатуры.Очистить();
	
	ЗаполнитьДокументыОснованияПоНоменклатуреСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыОснованияПоНоменклатуреСервер()
	
	ДополнительныеПараметры = Новый Структура("ПоложениеДокументаПоступления",Объект.ПоложениеДокументаПоступления);
	СкладскойУчетСервер.РаспределитьНоменклатуруПоДокументамОснованияПриход(ЭтотОбъект, ДополнительныеПараметры, "Запасы");
	СерииНоменклатурыУНФ.УдалитьСерииНоменклатурыВТабличнойЧастиВЗависимостиОтПолитики(Объект);
	
	ЭтаФорма.Модифицированность = Истина;
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамПриходныхНакладных(Команда) 
	
	Отказ = ЗаполнениеПоДокументамОснованияНеВозможно();
	
	Если Отказ Тогда
		Возврат 
	КонецЕсли;
	
	Если Объект.Запасы.Количество() Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОчиститьЗапасыИЗаполнитьПоДокументамОснования", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Перед заполнением табличная часть будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат
	КонецЕсли;
	
	Объект.Запасы.Очистить();
	Объект.СерииНоменклатуры.Очистить();
	
	Если Объект.ПоложениеДокументаПоступления = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке")
		И Не ЗначениеЗаполнено(Объект.ДокументПоступления) Тогда
		Объект.ПоложениеДокументаПоступления = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
		ПриИзмененииВидаУчетаСклада(Истина);
	КонецЕсли;
		
	ИдентификаторыНовыхСтрок = Новый Массив;
	ЗагрузитьПоОстаткамНаСервере(ИдентификаторыНовыхСтрок);
	
	Если Объект.Запасы.Количество() Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчиститьЗапасыИЗаполнитьПоДокументамОснования(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат 
	КонецЕсли;
	
	Объект.Запасы.Очистить();
	Объект.СерииНоменклатуры.Очистить();
	
	Если Объект.ПоложениеДокументаПоступления = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке")
		И Не ЗначениеЗаполнено(Объект.ДокументПоступления) Тогда
		Объект.ПоложениеДокументаПоступления = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
		ПриИзмененииВидаУчетаСклада(Истина);
	КонецЕсли;
		
	ИдентификаторыНовыхСтрок = Новый Массив;
	ЗагрузитьПоОстаткамНаСервере(ИдентификаторыНовыхСтрок);
	
	Если Объект.Запасы.Количество() Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПоОстаткамНаСервере(ИдентификаторыНовыхСтрок) 
	
	ДополнительныеПараметры = Новый Структура("ПоложениеДокументаПоступления", Объект.ПоложениеДокументаПоступления);
	ЗапасыКПоступлению = СкладскойУчетСервер.ПолучитьТаблицуОстатковПоДокументамОснованияПриход(Объект, ДополнительныеПараметры);
	ПолучитьЗапасыИзХранилища(ЗапасыКПоступлению, "Запасы", ИдентификаторыНовыхСтрок, Истина);
	СерииНоменклатурыУНФ.УдалитьСерииНоменклатурыВТабличнойЧастиВЗависимостиОтПолитики(Объект);
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументуПоступления(Команда) 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоДокументуЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(
	ОписаниеОповещения,
	НСтр("ru = 'Документ будет полностью перезаполнен по документу поступления. Продолжить выполнение операции?'"),
	РежимДиалогаВопрос.ДаНет,
	0);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументуЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументу(Объект.ДокументПоступления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомандыОснование(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКомандыОснования", ЭтотОбъект);
	
	КомандыОснования = Новый СписокЗначений;
	КомандыОснования.Добавить("Заполнить", НСтр("ru = 'Заполнить документ'"));
	КомандыОснования.Добавить("Выбрать", НСтр("ru = 'Выбрать основание'"));
	КомандыОснования.Добавить("Удалить", НСтр("ru = 'Удалить основание'"));
	ПоказатьВыборИзМеню(ОписаниеОповещения, КомандыОснования, Элементы.ОткрытьКомандыОснование);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЗаполнениеПоДокументамОснованияНеВозможно() 
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Организация", , Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Контрагент"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Контрагент", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Склад"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.СтруктурнаяЕдиница", , Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов()
	ДополнительныеСвойства = Новый Структура("ИзменениеКлючевыхРеквизитов", Истина);
	СерииНоменклатурыУНФ.ЗаполнитьПризнакиИспользованияСерий(Объект, ДополнительныеСвойства);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаУчетаСклада(ШапкаТабличнаяЧасть = Ложь)

	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ВидУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтруктурнаяЕдиница, "ВидУчетаОрдерныхСкладов");
		
		Элементы.ЗапасыЗаполнение.Видимость = ВидУчета = Перечисления.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам;
		
		Если Не ЗначениеЗаполнено(Объект.ПоложениеДокументаПоступления) Или Объект.ПоложениеДокументаПоступления = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Элементы.ГруппаДокументПоступления.Видимость = ?(ВидУчета = Перечисления.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам, Истина, Ложь);
			Элементы.ЗапасыДокументПоступления.Видимость = Ложь;
			Элементы.ЗапасыЗаполнитьПриходныеНакладныеПоНоменклатуре.Видимость = Ложь;
		
			Если ШапкаТабличнаяЧасть Тогда
				
				Если ЗначениеЗаполнено(Объект.ДокументПоступления) Тогда
					ДокументПоступленияВСтроке = Объект.ДокументПоступления;
				Иначе
					ДокументПоступленияВСтроке = Неопределено;
				КонецЕсли;
				
				Для Каждого СтрокаЗапасов Из Объект.Запасы Цикл
					СтрокаЗапасов.ДокументПоступления = ДокументПоступленияВСтроке;
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			Элементы.ЗапасыДокументПоступления.Видимость = ВидУчета = Перечисления.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам;
			Элементы.ГруппаДокументПоступления.Видимость = Ложь;
			Элементы.ЗапасыЗаполнитьПриходныеНакладныеПоНоменклатуре.Видимость = Истина;
			
			Если ШапкаТабличнаяЧасть Тогда
				Объект.ДокументПоступления = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Элементы.ГруппаДокументПоступления.Видимость = Ложь;
		Элементы.ЗапасыДокументПоступления.Видимость = Ложь;
		
		Если ШапкаТабличнаяЧасть Тогда
			Для Каждого СтрокаЗапасов Из Объект.Запасы Цикл
				СтрокаЗапасов.ДокументПоступления = Неопределено;
			КонецЦикла;
			Объект.ДокументПоступления = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьЯчейки(ШапкаТабличнаяЧасть);

КонецПроцедуры

Процедура УстановитьВидимостьЯчейки(ШапкаТабличнаяЧасть = Ложь) 
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ПоложениеЯчейки) Или Объект.ПоложениеЯчейки = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Элементы.Ячейка.Видимость = Истина;
			Элементы.ЗапасыЯчейка.Видимость = Ложь;
		
			Если ШапкаТабличнаяЧасть Тогда
				
				Если ЗначениеЗаполнено(Объект.Ячейка) Тогда
					ЯчейкаВСтроке = Объект.Ячейка;
				Иначе
					ЯчейкаВСтроке = Неопределено;
				КонецЕсли;
				
				Для Каждого СтрокаЗапасов Из Объект.Запасы Цикл
					СтрокаЗапасов.Ячейка = ЯчейкаВСтроке;
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			Элементы.ЗапасыЯчейка.Видимость = Истина;
			Элементы.Ячейка.Видимость = Ложь;
			
			Если ШапкаТабличнаяЧасть Тогда
				Объект.Ячейка = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Элементы.Ячейка.Видимость = Ложь;
		Элементы.ЗапасыЯчейка.Видимость = Ложь;
		
		Если ШапкаТабличнаяЧасть Тогда
			Для Каждого СтрокаЗапасов Из Объект.Запасы Цикл
				СтрокаЗапасов.Ячейка = Неопределено;
			КонецЦикла;
			Объект.Ячейка = Неопределено;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает обработку заполнения документа по основанию.
//
&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
	ПриИзмененииВидаУчетаСклада(); 
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	// + ор интеграция МДЛП
	ИнтеграцияМДЛПВызовСервера();
	// - ор интеграция МДЛП
	
КонецПроцедуры // ЗаполнитьПоДокументу()

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнойЕдиницыПриИзменении(СтруктурнаяЕдиница)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("ПодписьКладовщика", СтруктурнаяЕдиница.ПодписьМОЛ);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)
	
	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	// Наборы
	СтруктураДанные.Вставить("ЭтоНабор", СтруктураДанные.Номенклатура.ЭтоНабор);
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьХарактеристики
		Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено
			Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика), СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики",Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",СтруктураДанные.Номенклатура.ПроверятьЗаполнениеХарактеристики);
	КонецЕсли; 
	// Конец Характеристики
	
	//Партии
	СтруктураДанные.Вставить("ИспользоватьПартии",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеПартий",Ложь);
	
	Если НЕ СтруктураДанные.Свойство("Партия") Тогда
		СтруктураДанные.Вставить("Партия", Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьПартии
		Тогда
		
		Если СтруктураДанные.Свойство("СтатусПартии")
			Тогда
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура,СтруктураДанные.СтатусПартии);
		Иначе
			Если Не СтруктураДанные.Свойство("ВидОперации")
				Тогда
				ВидОперации = Неопределено
			Иначе
				ВидОперации = СтруктураДанные.ВидОперации
			КонецЕсли;
			
			СтатусПартии = НоменклатураВДокументахСервер.СоответствиеВидаОперацииИлиХозОперацииСтатусуПартии(, ВидОперации);
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура,СтатусПартии);
		КонецЕсли;
		
		ПартияПоУмолчанию = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Если Не ЗначенияПартииПоУмолчанию = Неопределено
			Тогда
			ПартияПоУмолчанию = ЗначенияПартииПоУмолчанию;
		КонецЕсли;
		
		СтруктураДанные.Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия), СтруктураДанные.Партия, ПартияПоУмолчанию);
		
		СтруктураДанные.ПроверятьЗаполнениеПартий = СтруктураДанные.Номенклатура.ПроверятьЗаполнениеПартий;
		СтруктураДанные.ИспользоватьПартии = Истина;
		
	КонецЕсли;
	// Конец Партии
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьСерииНоменклатуры Тогда
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные));
	Иначе
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", 0);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ЗапретитьВводДробногоКоличества", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура, "ЗапретитьВводДробногоКоличества"));
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПолучитьСлужебныеРеквизитыМДЛП(СтруктураДанные);
	// - ор интеграция МДЛП
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные)
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ПолучитьСлужебныеРеквизитыМДЛП(СтруктураДанные);
	// - ор интеграция МДЛП
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРеквизитыПечати()

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиПриходныйОрдер", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзмененияКоличества()
	
	НастройкиКоличества = ДокументыУНФКлиентСервер.ПараметрыСбросаКоличества();
	ДокументыУНФ.ЗаполнитьНастройкиКоличества(НастройкиКоличества);
	Возврат НастройкиКоличества;
КонецФункции

// ПодключаемоеОборудование
&НаСервереБезКонтекста
// Процедура получает данные по штрихкодам.
//
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	МассивШтрихкодовБезГОСИС = Новый Массив;
	ДанныеПоШтрихКодамГОСИС = Новый Соответствие;
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекШтрихкод, "ЭтоКодМаркировки")
			И ТекШтрихкод.ЭтоКодМаркировки Тогда
			ДополнитьДанныеПоШтрихкодамГОСИС(СтруктураДанные.ПараметрыСканированияМаркировки,
				СтруктураДанные.ДанныеФормы, ТекШтрихкод, ДанныеПоШтрихКодамГОСИС);
		Иначе
			РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
			МассивШтрихкодовБезГОСИС.Добавить(ТекШтрихкод);
		КонецЕсли;
		
	КонецЦикла;
	
	// + ор
	ПараметрыСобытийПО = Новый Структура;
	ПараметрыСобытийПО.Вставить("ДобавлятьНоменклатуруПоЗаводскомуШК");
	// + ор
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодамВМассиве(
		МассивШтрихкодовБезГОСИС,,, ПараметрыСобытийПО);
	Если ДанныеПоШтрихКодамГОСИС.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДанныеПоШтрихКодам, ДанныеПоШтрихКодамГОСИС, Истина);
	КонецЕсли;
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		МассивДанныхШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если МассивДанныхШтрихкода <> Неопределено
			И МассивДанныхШтрихкода.Количество() <> 0 Тогда
			
			Для Каждого ДанныеШтрихкода Из МассивДанныхШтрихкода Цикл
				
				СтруктураДанныеНоменклатуры = Новый Структура();
				СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
				СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
				// + ор интеграция МДЛП
				СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
				СтруктураДанныеНоменклатуры.Вставить("ЗапретитьВводНомеров", СтруктураДанные.ЗапретитьВводНомеров);
				СтруктураДанныеНоменклатуры.Вставить("ЭтоТоварМДЛП",
					ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(ДанныеШтрихкода.Номенклатура)
					И ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(ДанныеШтрихкода.Характеристика));
				// - ор интеграция МДЛП
				ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры));
				
				Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
					ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для каждого парам Из Метаданные.Документы.ПриходныйОрдер.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение)=Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
			    МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	// + ор интеграция МДЛП
	ор_ИнтеграцияМДЛПКлиент.ОбработатьМассивШтрихкодовМДЛП(Объект, МассивШтрихкодов, ПолучитьПризнакЗапрета());
	// - ор интеграция МДЛП
	КодМаркировки = Ложь;
	ПодготовленныеШтрихкоды = ПодготовленныеШтрихкоды(МассивШтрихкодов, КодМаркировки);
	
	СтруктураДанные = Новый Структура();
	// + ор интеграция МДЛП
	СтруктураДанные.Вставить("ЗапретитьВводНомеров", ПолучитьПризнакЗапрета());
	// - ор интеграция МДЛП
	СтруктураДанные.Вставить("МассивШтрихкодов", ПодготовленныеШтрихкоды);
	Если КодМаркировки Тогда
		ДанныеФормы = Новый Структура;
		ДанныеФормы.Вставить("ИмяФормы", ИмяФормы);
		ДанныеФормы.Вставить("Объект", Новый Структура("Ссылка", Объект.Ссылка));
		ДанныеФормы.Вставить("Модифицированность", Модифицированность);
		ПараметрыСканированияМаркировки = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ЭтотОбъект);
		
		СтруктураДанные.Вставить("ПараметрыСканированияМаркировки", ПараметрыСканированияМаркировки);
		СтруктураДанные.Вставить("ДанныеФормы", ДанныеФормы);
	КонецЕсли;
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		// ор ++
		Если ТекШтрихкод.Свойство("ДанныеМаркировкиМДЛП") Тогда
			
			МассивСтрокКУдалению = Новый Массив();
			
			Для ИндексМассива = 0 По ДанныеШтрихкода.ВГраница() Цикл
				Если Не ДанныеШтрихкода[ИндексМассива].СтруктураДанныеНоменклатуры.ЭтоТоварМДЛП Тогда
					МассивСтрокКУдалению.Добавить(ИндексМассива);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаМассива Из МассивСтрокКУдалению Цикл
				ДанныеШтрихкода.Удалить(СтрокаМассива);
			КонецЦикла;
			
			Если ДанныеШтрихкода.Количество() = 0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru='Не найдено данных по считанному коду маркировки.'"));
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		// ор --
		
		Если ДанныеШтрихкода.Количество() > 1 Тогда
			
			ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", ДанныеШтрихкода, ТекШтрихкод);
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект, Новый Структура("СтруктураДанные",СтруктураДанные));
			
			ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.ДублиНоменклатурыПоШтрихКодам", ПараметрыОткрытия, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Продолжить;
		КонецЕсли;
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено 
			ИЛИ ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
			ОписаниеШтрихкода = Новый Структура;
			ОписаниеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
			ОписаниеШтрихкода.Вставить("Номенклатура", ДанныеШтрихкода[0].Номенклатура);
			ОписаниеШтрихкода.Вставить("ТипНоменклатуры",
				ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры);
			ОписаниеШтрихкода.Вставить("ЭтоНабор", ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор);
			ШтрихкодыНекорректногоТипа.Добавить(ОписаниеШтрихкода);
		Иначе
			
			ДанныеШтрихкода = ДанныеШтрихкода[0];
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			ПараметрыОтбора.Вставить("Партия", ДанныеШтрихкода.Партия);
			ПараметрыОтбора.Вставить("ЕдиницаИзмерения", ДанныеШтрихкода.ЕдиницаИзмерения);
			
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
			
			Если ЗапрашиватьОбъединениеСтрок И МассивСтрокТЧ.Количество() Тогда
				ДопПараметр = Новый Структура("ЭтоПоискПоШтрихКоду, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные", Истина, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные);
				Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
				ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
				Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
			КонецЕсли;
			
			Если МассивСтрокТЧ.Количество() = 0 Или НЕ ОбъединятьСтрокиПриДобавлении Тогда
				НоваяСтрока = Объект.Запасы.Добавить();
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
				
				// + ор интеграция МДЛП
				ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитымдлпВСтрокеТЧ(НоваяСтрока, ДанныеШтрихкода.СтруктураДанныеНоменклатуры);
				ПараметрыФормыУказания = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
				ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьСтрокуНомераУпаковки(Объект, НоваяСтрока, ПараметрыФормыУказания, ТекШтрихкод);
				ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, НоваяСтрока);
				// - ор интеграция МДЛП
				
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			Иначе
				НоваяСтрока = МассивСтрокТЧ[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
				
				// + ор интеграция МДЛП
				ПараметрыФормыУказания = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
				ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьСтрокуНомераУпаковки(Объект, НоваяСтрока, ПараметрыФормыУказания, ТекШтрихкод);
				ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, НоваяСтрока);
				// - ор интеграция МДЛП
				
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
			// ор ++
			ЗаполнитьПризнакИспользованияСерийПроизводителяВТаблице();
			ЗаполнитьКолонкиСерииИСрокаГодности();
			// ор --
			
			Если ДанныеШтрихкода.Свойство("Серия") И ЗначениеЗаполнено(ДанныеШтрихкода.Серия) Тогда
				СерииНоменклатурыУНФКлиентСервер.ДобавитьСерияВСтроку(НоваяСтрока, ДанныеШтрихкода.Серия, Объект);
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
	
КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт
	
	ОбработкаПослеУточненияОбъединенияКоличества = Параметры.Свойство("ОбработкаПослеУточненияОбъединенияКоличества")
		И Параметры.ОбработкаПослеУточненияОбъединенияКоличества;
	
	Если ОбработкаПослеУточненияОбъединенияКоличества Тогда
		ДанныеШтрихкода = Параметры.ДанныеШтрихкода;
		ТекШтрихкод = Параметры.ТекШтрихкод;
		СтруктураДанные = Параметры.СтруктураДанные;
	Иначе
		
		Если СтруктураНоменклатуры = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеШтрихкода = СтруктураНоменклатуры.МассивНоменклатуры[0];
		ТекШтрихкод = СтруктураНоменклатуры.ТекШтрихкод;
		СтруктураДанные = Параметры.СтруктураДанные;
		
	КонецЕсли;
	
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры)
		= Неопределено Или ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
		ОписаниеШтрихкода = Новый Структура;
		ОписаниеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
		ОписаниеШтрихкода.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
		ОписаниеШтрихкода.Вставить("ТипНоменклатуры", ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры);
		ОписаниеШтрихкода.Вставить("ЭтоНабор", ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор);
		ШтрихкодыНекорректногоТипа.Добавить(ОписаниеШтрихкода);
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
		ПараметрыОтбора.Вставить("Партия", ДанныеШтрихкода.Партия);
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения", ДанныеШтрихкода.ЕдиницаИзмерения);
		
		МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		Если МассивСтрокТЧ.Количество() И ЗапрашиватьОбъединениеСтрок И Не ОбработкаПослеУточненияОбъединенияКоличества Тогда
			ДопПараметр = Новый Структура("ЭтоПоискПоШтрихКоду, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные", Истина, ДанныеШтрихкода, ТекШтрихкод, СтруктураДанные);
			Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
			ОткрытьФорму("ОбщаяФорма.ПодтверждениеОбъединенияСтрокПриДобавленииВТабличнуюЧасть", , , , , , Оповещение);
			Возврат;
		КонецЕсли;
		
		Если МассивСтрокТЧ.Количество() = 0 Или НЕ ОбъединятьСтрокиПриДобавлении Тогда
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
			НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
			НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
			НоваяСтрока.Количество = ТекШтрихкод.Количество;
			НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
			
			// + ор интеграция МДЛП
			ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьСлужебныеРеквизитымдлпВСтрокеТЧ(НоваяСтрока, ДанныеШтрихкода.СтруктураДанныеНоменклатуры);
			ПараметрыФормыУказания = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
			ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьСтрокуНомераУпаковки(Объект, НоваяСтрока, ПараметрыФормыУказания, ТекШтрихкод);
			ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, НоваяСтрока);
			// - ор интеграция МДЛП
			
			Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Иначе
			НоваяСтрока = МассивСтрокТЧ[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
			
			// + ор интеграция МДЛП
			ПараметрыФормыУказания = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
			ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьСтрокуНомераУпаковки(Объект, НоваяСтрока, ПараметрыФормыУказания, ТекШтрихкод);
			ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, НоваяСтрока);
			// - ор интеграция МДЛП
			
			Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		Если ДанныеШтрихкода.Свойство("Серия") И ЗначениеЗаполнено(ДанныеШтрихкода.Серия) Тогда
			СерииНоменклатурыУНФКлиентСервер.ДобавитьСерияВСтроку(НоваяСтрока, ДанныеШтрихкода.Серия, Объект);
		КонецЕсли;
		
	КонецЕсли;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	Модифицированность = Истина;
	
	НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

#Область Штрихкодирование

&НаКлиенте
Функция ПодготовленныеШтрихкоды(Знач МассивШтрихкодов, КодМаркировки)
	
	ТипСсылки = ТипЗнч(Объект.Ссылка);
	
	ИспользуетсяИСМП = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КэшДанныхГОСИС,
		"ИнтеграцияИСМП");
	ИспользуетсяЕГАИС = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КэшДанныхГОСИС,
		"ИнтеграцияЕГАИС");
	
	Для Каждого ТекШтрихкод Из МассивШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = 
			ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ТекШтрихкод.Штрихкод, ТипСсылки);
			
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки
			И ДополнительныеДанныеПоШтрихкоду.ЭтоПродукцияЕГАИС
			И ИспользуетсяЕГАИС Тогда
			ОбработатьКакМаркировкуТоваров = Истина;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки
			И НЕ ДополнительныеДанныеПоШтрихкоду.ЭтоПродукцияЕГАИС
			И ИспользуетсяИСМП Тогда
			ОбработатьКакМаркировкуТоваров = Истина;
		Иначе
			ОбработатьКакМаркировкуТоваров = Ложь;
		КонецЕсли;
		
		Если ОбработатьКакМаркировкуТоваров Тогда
			ТекШтрихкод.Вставить("ЭтоКодМаркировки", Истина);
			ТекШтрихкод.Вставить("ШтрихкодBase64", ДополнительныеДанныеПоШтрихкоду.ШтрихкодBase64);
			Если ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
				ТекШтрихкод.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
			КонецЕсли;
			КодМаркировки = Истина;
			// ор ++
			Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировкиМДЛП Тогда
				ТекШтрихкод.Вставить("ДанныеМаркировкиМДЛП", ДополнительныеДанныеПоШтрихкоду.ДанныеМаркировкиМДЛП);
			КонецЕсли;
			// ор --
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки
			И ЗначениеЗаполнено(ДополнительныеДанныеПоШтрихкоду.EAN) Тогда
			ТекШтрихкод.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ТекШтрихкод.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивШтрихкодов;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьДанныеПоШтрихкодамГОСИС(Знач ПараметрыСканированияМаркировки, Знач ДанныеФормы,
	Знач ШтрихкодГОСИС, ДанныеПоШтрихкодамГОСИС)
	
	НайденныеДанныеПоШтрихкодам = ДанныеПоШтрихкодамГОСИС.Получить(ШтрихкодГОСИС.Штрихкод);
	Если НайденныеДанныеПоШтрихкодам <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеПоШтрихкодуГОСИС = Новый Массив;
	
	ДанныеШтрихкодаДляОбработки = Новый Структура;
	ДанныеШтрихкодаДляОбработки.Вставить("Количество", ШтрихкодГОСИС.Количество);
	ДанныеШтрихкодаДляОбработки.Вставить("ОбработатьБезМаркировки", Истина);
	ДанныеШтрихкодаДляОбработки.Вставить("ФорматBase64", Истина);
	ДанныеШтрихкодаДляОбработки.Вставить("Штрихкод", ШтрихкодГОСИС.ШтрихкодBase64);
	
	РезультатОбработкиШтрихкода = ШтрихкодированиеОбщегоНазначенияИС.ОбработатьВводШтрихкода(
		ДанныеФормы, ДанныеШтрихкодаДляОбработки, Неопределено, ПараметрыСканированияМаркировки);
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	
	Если ДанныеШтрихкода = Неопределено Тогда
		ДанныеПоШтрихкодамГОСИС.Вставить(ШтрихкодГОСИС.Штрихкод, ДанныеПоШтрихкодуГОСИС);
		Возврат;
	КонецЕсли;
	
	Если ДанныеШтрихкода.СписокНоменклатуры.Количество() Тогда
		Для каждого ТекНоменклатура Из ДанныеШтрихкода.СписокНоменклатуры Цикл
			Если НЕ ЗначениеЗаполнено(ТекНоменклатура.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПоШтрихкоду = ИнтеграцияИСУНФ.ДанныеПоШтрихкодуГосИС(ТекНоменклатура);
			ДанныеПоШтрихкодуГОСИС.Добавить(ДанныеПоШтрихкоду);
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура) Тогда
			ДанныеПоШтрихкоду = ИнтеграцияИСУНФ.ДанныеПоШтрихкодуГосИС(ДанныеШтрихкода);
			ДанныеПоШтрихкодуГОСИС.Добавить(ДанныеПоШтрихкоду);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПоШтрихкодамГОСИС.Вставить(ШтрихкодГОСИС.Штрихкод, ДанныеПоШтрихкодуГОСИС);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияХарактеристик()
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		Если ТекНекорректныйШтрихкод.Свойство("ЭтоНабор") И ТекНекорректныйШтрихкод.ЭтоНабор Тогда
			// Наборы
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", НСтр("ru = 'Набор'"));
		Иначе
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		КонецЕсли; 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

// Конец ПодключаемоеОборудование

&НаСервере
Процедура ЗаполнитьСписокДокументОснование()
	
	СписокДокументОснование.Добавить("Документ.ЗаказПоставщику.ФормаВыбора", НСтр("ru = 'Заказ поставщику'"));
	СписокДокументОснование.Добавить("Документ.ОприходованиеЗапасов.ФормаВыбора", НСтр("ru = 'Оприходование запасов'"));
	СписокДокументОснование.Добавить("Документ.ПересортицаЗапасов.ФормаВыбора", НСтр("ru = 'Пересортица запасов'"));
	СписокДокументОснование.Добавить("Документ.ОтчетПереработчика.ФормаВыбора", НСтр("ru = 'Отчет переработчика'"));
	СписокДокументОснование.Добавить("Документ.ПеремещениеЗапасов.ФормаВыбора", НСтр("ru = 'Перемещение запасов'"));
	СписокДокументОснование.Добавить("Документ.ПриходнаяНакладная.ФормаВыбора", НСтр("ru = 'Приходная накладная'"));
	СписокДокументОснование.Добавить("Документ.СборкаЗапасов.ФормаВыбора", НСтр("ru = 'Производство'"));
	СписокДокументОснование.Добавить("Документ.РасходныйОрдер.ФормаВыбора", НСтр("ru = 'Расходный ордер'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКомандыОснования(ВыбранноеДействие, Параметры) Экспорт
	
	Если ВыбранноеДействие = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ВыбранноеДействие.Значение = "Удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Элементы.ОткрытьКомандыОснование.Видимость = Ложь;
		Модифицированность = Истина;
	ИначеЕсли ВыбранноеДействие.Значение = "Заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли ВыбранноеДействие.Значение = "Выбрать" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДокументОснование, Элементы.ОткрытьКомандыОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокНадписиОснование(Форма, ТекстЗаголовка)
	
	ЭлементыФормы = Форма.Элементы;
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы.ДокументОснованиеНадпись.Заголовок = ТекстЗаголовка;
	ЭлементыФормы.ОткрытьКомандыОснование.Видимость = ЗначениеЗаполнено(ОбъектФормы.ДокументОснование);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ЭтоИнтерфейсТакси Тогда
		Элементы.Комментарий.КнопкаВыбора = Истина;
		Элементы.ПодвалСвернут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыМК()
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.Номер.АвтоМаксимальнаяШирина = Истина;
		Элементы.Дата.АвтоМаксимальнаяШирина = Истина;
		Элементы.СтруктурнаяЕдиница.АвтоМаксимальнаяШирина = Истина;
		Элементы.Ячейка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.Ячейка.АвтоМаксимальнаяШирина = Истина;
		Элементы.Организация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.Организация.АвтоМаксимальнаяШирина = Истина;
		Элементы.ШапкаКарточка.ОтображатьКакКарточку = Ложь;
		Элементы.КолонкаСсылки.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
		Элементы.ПодвалСвернут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Запасы", "Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки("Запасы");
	
КонецПроцедуры

// Вызывает процедуру копирования строк и оповещает пользователя о количестве скопированных.
//
&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ, ИмяЭлемента)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, ИмяЭлемента, КоличествоСкопированных, Элементы[ИмяЭлемента].ПолучитьСтрокиДляОбработки());
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру вставки строк и оповещает пользователя о количестве вставленных.
//
&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

// Выполняет копирование выделенных строк в буфер обмена.
//
&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, ИмяЭлемента, КоличествоСкопированных, ВыделенныеСтроки)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

// Вставляет скопированные строки из буфера обмена в выбранную табличную часть.
//
&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	// + ор интеграция МДЛП
	Если ИмяТЧ = "Запасы" Тогда
		ИнтеграцияМДЛПВызовСервера();
	КонецЕсли;
	// - ор интеграция МДЛП
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
			Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПодбором

// Процедура - обработчик события Действие команды Подбор
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти 	= "Запасы";
	ПодборНоменклатурыВДокументахКлиент.ОткрытьФормуПодбораНоменклатуры(ЭтотОбъект, ИмяТабличнойЧасти);
	
КонецПроцедуры // ПодборВыполнить()

// Функция получает список товаров из временного хранилища
//
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии, МассивНомеровИдентичныхСтрок = Неопределено)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	ЕстьЦенаВТабличнойЧасти = ДокументыУНФ.ЕстьЦенаВТабличнойЧасти(Объект, ИмяТабличнойЧасти);
	
	СтруктурыПоискаИдентичныхСтрок = ДокументыУНФ.СтруктурыПоискаИдентичныхСтрок(Объект, ТаблицаДляЗагрузки, ИмяТабличнойЧасти);
	СтруктураПоискаСЦеной = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаСЦеной;
	СтруктураПоискаБезЦены = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаБезЦены;
	
	ОбъединятьСтроки = ОбъединятьСтрокиПриДобавлении И Не МассивНомеровИдентичныхСтрок = Неопределено;
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		Если ОбъединятьСтроки Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Цена) 
				Или Не ЕстьЦенаВТабличнойЧасти Тогда
				СтруктураПоиска = СтруктураПоискаБезЦены;
			Иначе
				СтруктураПоиска = СтруктураПоискаСЦеной;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаЗагрузки);
			НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + СтрокаЗагрузки.Количество;
				МассивНомеровИдентичныхСтрок.Добавить(НайденныеСтроки[0].НомерСтроки - 1);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
		// Характеристики
		СтруктураДанныеНоменклатуры = Новый Структура();
		СтруктураДанныеНоменклатуры.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураДанныеНоменклатуры.Вставить("Характеристика", СтрокаЗагрузки.Характеристика);
		
		СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Объект, СтруктураДанныеНоменклатуры);
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
		
		НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
		НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
		НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
		
		Если СтруктураДанные.ИспользоватьХарактеристики
			Тогда
			НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
		// Конец Характеристики
		
		//Партии
		НоваяСтрока.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
		НоваяСтрока.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
		
		НоваяСтрока.Партия = ?(ЗначениеЗаполнено(СтрокаЗагрузки.Партия), СтрокаЗагрузки.Партия, СтруктураДанные.Партия);
		// Конец Партии
		
		НоваяСтрока.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
		
		НоваяСтрока.СтатусыСерийНоменклатуры = СтруктураДанные.СтатусыСерийНоменклатуры;
		ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(Объект[ИмяТабличнойЧасти], НоваяСтрока, "КлючСвязи");
		
	КонецЦикла;
	
	// + ор интеграция МДЛП
	Если ИмяТабличнойЧасти = "Запасы" Тогда
		ИнтеграцияМДЛПВызовСервера();
	КонецЕсли;
	// - ор интеграция МДЛП
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
Функция НомераИдентичныхСтрокВТабличнойЧасти(АдресЗапасовВХранилище, ИмяТабличнойЧасти = "Запасы")
	
	Возврат ДокументыУнф.НомераИдентичныхСтрокВТабличнойЧасти(Объект, АдресЗапасовВХранилище, ИмяТабличнойЧасти);
	
КонецФункции

// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));
	
	#Если МобильныйКлиент Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду",,,,,,ОбработкаЗавершения);
	#Иначе
		ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(СтрШаблон("ПоискПоШтрихкоду%1",
		РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы)));
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкоду()

// Процедура - обработчик события Действие команды ПолучитьВес
//
&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтотОбъект, "Запасы", Ложь);
	
КонецПроцедуры // ПолучитьВес()

// Процедура - обработчик команды ЗагрузитьДанныеИзТСД.
//
&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтотОбъект);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()

&НаКлиенте
Процедура ВыгрузитьДанныеВТСД(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТаблицыВыборки", "Запасы");
	
	ПодключаемоеОборудованиеУНФКлиент.ВыгрузитьДокументВТСД(ЭтотОбъект, Ложь, ДополнительныеПараметры);
	
КонецПроцедуры

// Конец ПодключаемоеОборудование

#КонецОбласти

#Область РаботаССериямиНоменклатуры

&НаКлиенте
Процедура ЗапасыСерииНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерииНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерииНоменклатуры()
		
	ТекущиеДанныеИдентификатор = Элементы.Запасы.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийНоменклатуры = ПараметрыПодбораСерийНоменклатуры(ТекущиеДанныеИдентификатор);
	
	ОткрытьФорму("Обработка.ПодборСерийНоменклатуры.Форма", ПараметрыСерийНоменклатуры, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПолучитьСерииНоменклатурыИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	Модифицированность = Истина;
	Возврат СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки);
	
КонецФункции

&НаСервере
Функция ПараметрыПодбораСерийНоменклатуры(ТекущиеДанныеИдентификатор)
	
	Возврат СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатуры(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор, Ложь);
	
КонецФункции

// Конец ПодключаемоеОборудование

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)

	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

#Область МаркировкаМДЛП

#Область МаркировкаМДЛПТекстУведомления

&НаСервере
Процедура СформироватьТекстУведомлениеМДЛПСервер() Экспорт
	
	ИнтеграцияМДЛП.СформироватьТекстУведомленияМДЛП(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТекстУведомленияМДЛПОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ИнтеграцияМДЛПКлиент.ТекстУведомленияМДЛПОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаМДЛПВводУпаковок

&НаКлиенте
Процедура УказатьНомераУпаковок()
	
	ТекущиеДанныеИдентификатор = Элементы.Запасы.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыФормыУказания = ПараметрыФормыНомеровУпаковок(ТекущиеДанныеИдентификатор);
	
	ОбработчикУказанияСерий = Новый ОписаниеОповещения("ОбработатьУказаниеНомеровУпаковок", ЭтотОбъект, ПараметрыФормыУказания);
	РежимБлокировки = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму(ПараметрыФормыУказания.ИмяФормы, ПараметрыФормыУказания, ЭтаФорма,,,, ОбработчикУказанияСерий, РежимБлокировки);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыНомеровУпаковок(ТекущиеДанныеИдентификатор)
	
	ПараметрыФормыУказанияМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
	ПараметрыФормыУказанияМДЛП.ТекущиеДанныеИдентификатор = ТекущиеДанныеИдентификатор;
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПараметрыФормыВводаНомеровУпаковок(Объект, ЭтаФорма, ПараметрыФормыУказанияМДЛП, Элементы.ор_СоставТранспортныхУпаковок.Видимость);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьУказаниеНомеровУпаковок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("Результат", Результат);
		ОбработатьУказаниеНомеровУпаковоСервер(ДополнительныеПараметры);
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУказаниеНомеровУпаковоСервер(ДополнительныеПараметры)
	
	ор_ИнтеграцияМДЛП.ЗаполнитьНомераУпаковок(Объект, ДополнительныеПараметры, ЭтотОбъект);
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
	ИнтеграцияМДЛПВызовСервера();
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаМДЛПЗаполнениеКизов

&НаКлиенте
Процедура Подключаемый_ЗаполнитьНомераУпаковок(Команда)
	
	ПараметрыФормыУказания = ПараметрыФормыЗаполненияНомеровУпаковок();
	
	Если ПараметрыФормыУказания.Свойство("Отказ") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикЗаполненияНомеровУпаковок = Новый ОписаниеОповещения("ЗаполнениеНомеровУпаковокЗавершение", ЭтотОбъект, ПараметрыФормыУказания);
	РежимБлокировки = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму(ПараметрыФормыУказания.ИмяФормы, ПараметрыФормыУказания, ЭтаФорма,,,, ОбработчикЗаполненияНомеровУпаковок, РежимБлокировки);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыЗаполненияНомеровУпаковок()
	
	ПараметрыФормыУказанияМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПараметрыФормыЗаполненияНомеровУпаковок(Объект, ЭтаФорма, ПараметрыФормыУказанияМДЛП);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеНомеровУпаковокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("Результат", Результат);
		ЗаполнениеНомеровУпаковокЗавершениеСервер(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеНомеровУпаковокЗавершениеСервер(ДополнительныеПараметры)
	
	ор_ИнтеграцияМДЛП.ЗаполнитьТоварыИНомераУпаковок(Объект, ДополнительныеПараметры, ЭтотОбъект);
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
	ИнтеграцияМДЛПВызовСервера();
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаМДЛПСопоставлениеУпаковок

&НаКлиенте
Процедура СопоставитьПоУведомлению(Команда)
	
	Если НЕ ПроверитьЗаполнениеДляУведомления("СопоставитьПоУведомлению") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыУказания = ПараметрыФормыСопоставленияНомеровУпаковокПоУведомлению();
	
	Если ПараметрыФормыУказания.Свойство("Отказ") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикЗаполненияНомеровУпаковок = Новый ОписаниеОповещения("СопоставлениеНомеровУпаковокПоУведомлениюЗавершение", ЭтотОбъект, ПараметрыФормыУказания);
	РежимБлокировки = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму(ПараметрыФормыУказания.ИмяФормы, ПараметрыФормыУказания, ЭтаФорма,,,, ОбработчикЗаполненияНомеровУпаковок, РежимБлокировки);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыСопоставленияНомеровУпаковокПоУведомлению()
	
	ПараметрыФормыУказанияМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПараметрыФормыСопоставленияНомеровУпаковокПоУведомлению(Объект, ЭтаФорма, ПараметрыФормыУказанияМДЛП);
	
КонецФункции

&НаКлиенте
Процедура СопоставлениеНомеровУпаковокПоУведомлениюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("Результат", Результат);
		СопоставлениеНомеровУпаковокПоУведомлениюЗавершениеСервер(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СопоставлениеНомеровУпаковокПоУведомлениюЗавершениеСервер(ДополнительныеПараметры)
	
	ор_ИнтеграцияМДЛП.СопоставитьТоварыИНомераУпаковокПоУведомлению(Объект, ДополнительныеПараметры, ЭтотОбъект);
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
	ИнтеграцияМДЛПВызовСервера();
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаМДЛПТранспортныеУпаковокиТЧ

&НаКлиенте
Процедура Подключаемый_ор_ТранспортныеУпаковкиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.ор_СоставТранспортныхУпаковок.ОтборСтрок,
			Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.ор_СоставТранспортныхУпаковок.ОтборСтрок,
			Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		Если Копирование Тогда
			ТекущиеДанные.НомерУпаковки = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ТранспортныеУпаковкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Если УдалитьСтрокиУпаковокИзТабличнойЧасти(Объект.ор_ТранспортныеУпаковки, Элемент.ВыделенныеСтроки, Объект.ор_СоставТранспортныхУпаковок) Тогда
		ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(Объект);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ПолучитьПризнакЗапрета() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Заполнение транспортных упаковкок недоступно.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ор_СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если НЕ ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(ТекущаяСтрока.Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной номенклатуры не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	СтрокаТабличнойЧасти = ТекущаяСтрока;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ор_СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если НЕ ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(ТекущаяСтрока.Характеристика) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной характеристики не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.ор_ТранспортныеУпаковки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана транспортная упаковка.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Элементы.ор_ТранспортныеУпаковки.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокПослеУдаления(Элемент)
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокКоличествоПриИзменении(Элемент)
	
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СоставТранспортныхУпаковокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ор_СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаМДЛПЗаполнениеТранспортныхУпаковок

&НаКлиенте
Процедура Подключаемый_ЗаполнитьСоставТранспортнойУпаковки(Команда)
	
	ТекущиеДанные = Элементы.ор_ТранспортныеУпаковки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана транспортная упаковка.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	НайденныйСтроки = Объект.ор_СоставТранспортныхУпаковок.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныйСтроки.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьСоставТранспортнойУпаковкиОповещения", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Состав транспортой упаковки ""%НомерУпаковки%"" будет перезаполнен. Продолжить?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%НомерУпаковки%", ТекущиеДанные.НомерУпаковки);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПродолжитьЗаполнениеСоставаТранспортнойУпаковки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставТранспортнойУпаковкиОповещения(ОтветНаВопрос, Параметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗаполнениеСоставаТранспортнойУпаковки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеСоставаТранспортнойУпаковки()
	
	ТекущиеДанныеИдентификатор = Элементы.ор_ТранспортныеУпаковки.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыФормыУказания = ПараметрыФормыЗаполненияСоставаТранспортнойУпаковки(ТекущиеДанныеИдентификатор);
	
	Если ПараметрыФормыУказания.Свойство("Отказ") Тогда
		Если ПараметрыФормыУказания.Свойство("ТекстОшибки") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ПараметрыФормыУказания.ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ОбработчикЗаполненияНомеровУпаковок = Новый ОписаниеОповещения("ЗаполнениеСоставаТранспортнойУпаковкиЗавершение", ЭтотОбъект, ПараметрыФормыУказания);
	РежимБлокировки = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму(ПараметрыФормыУказания.ИмяФормы, ПараметрыФормыУказания, ЭтаФорма,,,, ОбработчикЗаполненияНомеровУпаковок, РежимБлокировки);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыЗаполненияСоставаТранспортнойУпаковки(ТекущиеДанныеИдентификатор)
	
	ПараметрыФормыУказанияМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.ПараметрыФормыУказанияМДЛП();
	ПараметрыФормыУказанияМДЛП.ТекущиеДанныеИдентификатор = ТекущиеДанныеИдентификатор;
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПараметрыФормыЗаполненияСоставаТранспортнойУпаковки(Объект, ЭтаФорма, ПараметрыФормыУказанияМДЛП);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеСоставаТранспортнойУпаковкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("Результат", Результат);
		ЗаполнениеСоставаТранспортнойУпаковкиЗавершениеСервер(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСоставаТранспортнойУпаковкиЗавершениеСервер(ДополнительныеПараметры)
	
	ор_ИнтеграцияМДЛП.ЗаполнитьСоставТранспортныхУпаковок(Объект, ДополнительныеПараметры, ЭтотОбъект);
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
	ИнтеграцияМДЛПВызовСервера();
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаМДЛППрочее

&НаКлиенте
Функция ПроверитьЗаполнениеДляУведомления(ИмяКоманды)
	
	ЕстьОшибки = Ложь;
	
	Если ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций() И Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ТекстСообщения = НСтр("ru = 'Склад не заполнен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НЕ ЕстьОшибки И
		(Модифицированность ИЛИ Объект.Ссылка.Пустая()) Тогда
		ЕстьОшибки = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьДокументОповещения", ЭтотОбъект, Новый Структура("ИмяКоманды",ИмяКоманды));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Документ не записан. Записать?'"), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьДокументОповещения(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Записать() Тогда
		СопоставитьПоУведомлению(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций()
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПризнакИспользоватьМестаДеятельностиОрганизаций();
	
КонецФункции

&НаСервере
Процедура ИнтеграцияМДЛПВызовСервера()
	
	ор_ИнтеграцияМДЛПКлиентСервер.ЗаполнитьПризнакИспользоватьНомераУпаковок(Объект,, ПолучитьПризнакЗапретаСервер());
	ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(Объект);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПризнакЗапрета()
	
	Возврат ПолучитьПризнакЗапретаСерверБезКонтекста(Объект.ДокументОснование);
	
КонецФункции

&НаСервере
Функция ПолучитьПризнакЗапретаСервер()
	
	Возврат ПолучитьПризнакЗапретаСерверБезКонтекста(Объект.ДокументОснование);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПризнакЗапретаСерверБезКонтекста(ДокументПеремещение)
	
	Если ТипЗнч(ДокументПеремещение) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		Если ДокументПеремещение.ор_ЕстьМаркируемаяПродукция Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция УдалитьСтрокиУпаковокИзТабличнойЧасти(ТабличнаяЧасть, СтрокиКУдалению, СоставУпаковок = Неопределено)
	
	УдаляемыеСтроки = Новый Массив;
	Для Каждого ИдентификаторСтроки Из СтрокиКУдалению Цикл
		ТекущаяСтрока = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
		УдаляемыеСтроки.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из УдаляемыеСтроки Цикл
		Если СоставУпаковок <> Неопределено Тогда
			НайденныйСтроки = СоставУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
			Для Каждого СтрокаСостава Из НайденныйСтроки Цикл
				СоставУпаковок.Удалить(СтрокаСостава);
			КонецЦикла;
		КонецЕсли;
		ТабличнаяЧасть.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	Возврат УдаляемыеСтроки.Количество() > 0;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВводСерийПоПараметрам

&НаКлиенте
Процедура Подключаемый_ВводСерийПоПараметрамПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПараметрыВводаСерий",
		"ТолькоПросмотр",
		НЕ Объект.ор_ВводСерийПоПараметрам);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗапасыСерияПроизводителя",
		"Видимость",
		Объект.ор_ВводСерийПоПараметрам);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗапасыСрокГодности",
		"Видимость",
		Объект.ор_ВводСерийПоПараметрам);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗапасыХарактеристика",
		"ПропускатьПриВводе",
		Объект.ор_ВводСерийПоПараметрам);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АвтоматическиФормироватьШтрихкодСерииПриСозданииПриИзменении(Элемент)
	
	Если Объект.ор_АвтоматическиФормироватьШтрихкодСерииПриСоздании Тогда
		Объект.ор_ЗапрашиватьШтрихкодСерииПриСоздании = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапрашиватьШтрихкодСерииПриСозданииПриИзменении(Элемент)
	
	Если Объект.ор_ЗапрашиватьШтрихкодСерииПриСоздании Тогда
		Объект.ор_АвтоматическиФормироватьШтрихкодСерииПриСоздании = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапасыСерияПроизводителяПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
		И ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности)
		И ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя) Тогда
		ВыполнитьВводСерииПоПараметрам(ТекущаяСтрока);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя) Тогда
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		ЗапасыХарактеристикаПриИзменении(Элементы.ЗапасыХарактеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапасыСрокГодностиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
		И ЗначениеЗаполнено(ТекущаяСтрока.СерияПроизводителя)
		И ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности) Тогда
		ВыполнитьВводСерииПоПараметрам(ТекущаяСтрока);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности) Тогда
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		ЗапасыХарактеристикаПриИзменении(Элементы.ЗапасыХарактеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВводСерииПоПараметрам(ТекущаяСтрока)
	
	Если НЕ (Объект.ор_ВводСерийПоПараметрам
		И ТекущаяСтрока.ИспользоватьХарактеристики И ТекущаяСтрока.ИспользуютсяСерииПроизводителя) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ор_ВсегдаФормироватьНовыеСерии Тогда
		
		// Создаем новую серию
		Если Объект.ор_ЗапрашиватьШтрихкодСерииПриСоздании Тогда
			ОбработчикОповещения = Новый ОписаниеОповещения("ОкончаниеВводаШКСерии", ЭтотОбъект);
			Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ОткрытьФорму("ОбщаяФорма.ор_ФормаВводаШтрихкодаСерии",,,,,, ОбработчикОповещения, Режим);
		Иначе
			СоздатьНовуюСерию(ТекущаяСтрока);
			ЗапасыХарактеристикаПриИзменении(Элементы.ЗапасыХарактеристика);
		КонецЕсли;
		
	Иначе
		// Пытаемся найти существующую серию по параметрам
		НайденнаяСерия = ор_ОбщегоНазначенияСервер.НайтиСериюПоПараметрам(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.СерияПроизводителя, ТекущаяСтрока.СрокГодности);
		
		Если ЗначениеЗаполнено(НайденнаяСерия) Тогда
			ТекущаяСтрока.Характеристика = НайденнаяСерия;
			ЗапасыХарактеристикаПриИзменении(Элементы.ЗапасыХарактеристика);
		Иначе
			Если Объект.ор_ЗапрашиватьШтрихкодСерииПриСоздании Тогда
				ОбработчикОповещения = Новый ОписаниеОповещения("ОкончаниеВводаШКСерии", ЭтотОбъект);
				Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
				ОткрытьФорму("ОбщаяФорма.ор_ФормаВводаШтрихкодаСерии",,,,,, ОбработчикОповещения, Режим);
			Иначе 
				СоздатьНовуюСерию(ТекущаяСтрока);
				ЗапасыХарактеристикаПриИзменении(Элементы.ЗапасыХарактеристика);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСерию(ТекущаяСтрока, ЗначениеШК = "")
	
	НоваяСерия = ор_ОбщегоНазначенияСервер.СоздатьСериюПоПараметрам(ТекущаяСтрока.Номенклатура,
		ТекущаяСтрока.СерияПроизводителя,
		ТекущаяСтрока.СрокГодности,
		Объект.ор_АвтоматическиФормироватьШтрихкодСерииПриСоздании,
		ЗначениеШК);
		
	ТекущаяСтрока.Характеристика = НоваяСерия;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаШКСерии(ЗначениеШК, ДополнительныеПараметры) Экспорт 
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	Если ЗначениеШК <> Неопределено Тогда
		СоздатьНовуюСерию(ТекущаяСтрока, ЗначениеШК);
	Иначе
		СоздатьНовуюСерию(ТекущаяСтрока);
	КонецЕсли;
	ЗапасыХарактеристикаПриИзменении(Элементы.ЗапасыХарактеристика);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиСерииИСрокаГодности()
	
	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
			СтрокаТЧ.СрокГодности       = СтрокаТЧ.Характеристика.ор_СрокГодности;
			СтрокаТЧ.СерияПроизводителя = СтрокаТЧ.Характеристика.ор_СерияПроизводителя;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакИспользованияСерийПроизводителяВТаблице()
	
	Если Объект.Запасы.Количество() = 0
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура).ИспользоватьХарактеристики
	|			ИЛИ ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура).КатегорияНоменклатуры.ИспользоватьХарактеристики)
	|			И ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура).КатегорияНоменклатуры.ор_ВестиСерийныйУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользуютсяСерииПроизводителя
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", Объект.Запасы.Выгрузить(,"НомерСтроки,Номенклатура"));
	
	ТаблицаПризнаков = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТабл из Объект.Запасы Цикл
		
		СтрокаХарактеристик = ТаблицаПризнаков[СтрТабл.НомерСтроки-1];
		
		СтрТабл.ИспользуютсяСерииПроизводителя = СтрокаХарактеристик.ИспользуютсяСерииПроизводителя;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВедетсяУчетСерий(Номенклатура)
	Возврат Номенклатура.КатегорияНоменклатуры.ор_ВестиСерийныйУчет;
КонецФункции

&НаСервере
Функция ПолучитьСериюИСрокГодностиДляХарактеристики(Характеристика, Номенклатура, ХарактеристикиИспользуются)
	
	СтруктураДанных = Новый Структура;
	Если ЗначениеЗаполнено(Характеристика) Тогда 
		СтруктураДанных.Вставить("СрокГодности", Характеристика.ор_СрокГодности);
		СтруктураДанных.Вставить("СерияПроизводителя", Характеристика.ор_СерияПроизводителя);
		СтруктураДанных.Вставить("ИспользуютсяСерииПроизводителя", ХарактеристикиИспользуются И Номенклатура.КатегорияНоменклатуры.ор_ВестиСерийныйУчет);
	Иначе
		СтруктураДанных.Вставить("СрокГодности", Дата("00010101000000"));
		СтруктураДанных.Вставить("СерияПроизводителя", "");
		СтруктураДанных.Вставить("ИспользуютсяСерииПроизводителя", ХарактеристикиИспользуются И Номенклатура.КатегорияНоменклатуры.ор_ВестиСерийныйУчет);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#КонецОбласти
