
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК Ссылка,
	|	ВидыЦен.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.Ссылка В(&МассивВидовЦен)
	|	И (ВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ДинамическийПроцент)
	|			ИЛИ ВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ДинамическийФормула))";
	
	Запрос.УстановитьПараметр("МассивВидовЦен", ВидыЦенДокументов(Параметры.МассивДокументов));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаВидЦены = ТаблицаНастроек.Добавить();
		НоваяСтрокаВидЦены.Наименование     = Выборка.Наименование;
		НоваяСтрокаВидЦены.Параметр         = Выборка.Ссылка;
		НоваяСтрокаВидЦены.ИндексКартинки   = 1;
		НоваяСтрокаВидЦены.ВыводитьНаПечать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОтборЦеноваяГруппаПриИзменении(Элемент)
	
	Элементы.ЦеноваяГруппа.Доступность = ОтборЦеноваяГруппа;
	Элементы.ЦеноваяГруппа.АвтоОтметкаНезаполненного = ОтборЦеноваяГруппа;
	
	Если НЕ ОтборЦеноваяГруппа Тогда 
		ЦеноваяГруппа = ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидыЦенВыбратьВсе(Команда)
	
	Для Каждого ВидЦены Из ТаблицаНастроек Цикл
		ВидЦены.ВыводитьНаПечать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенИсключитьВсе(Команда)
	
	Для Каждого ВидЦены Из ТаблицаНастроек Цикл
		ВидЦены.ВыводитьНаПечать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если ОтборЦеноваяГруппа И Не ЗначениеЗаполнено(ЦеноваяГруппа) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение отбора по ценовой группе!",,"ЦеноваяГруппа");
		Возврат;
	КонецЕсли;
	
	МассивВидовЦен = Новый Массив;
	Для Каждого ТекСтрока Из ТаблицаНастроек Цикл
		Если ТекСтрока.ВыводитьНаПечать тогда
			МассивВидовЦен.Добавить(ТекСтрока.Параметр);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ОтборЖНВЛП",         ОтборЖНВЛП);
	ПараметрыПечати.Вставить("ОтборНСиПТВ",        ОтборНСиПТВ);
	ПараметрыПечати.Вставить("ОтборЦеноваяГруппа", ОтборЦеноваяГруппа);
	ПараметрыПечати.Вставить("ЦеноваяГруппа",      ЦеноваяГруппа);
	ПараметрыПечати.Вставить("МассивВидовЦен",     МассивВидовЦен);
	
	Закрыть(ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВидыЦенДокументов(МассивДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены КАК ВидЦены
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Запасы КАК УстановкаЦенНоменклатурыВидыЦен
	|ГДЕ
	|	УстановкаЦенНоменклатурыВидыЦен.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦены");
	
КонецФункции

#КонецОбласти
