
&НаСервере
&После("ПриСозданииНаСервере")
Процедура эв_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    эв_ВывестиРеквизитыПервостольникаВЗапасы();
    
КонецПроцедуры

&НаСервере
&После("ПриЧтенииНаСервере")
Процедура эв_ПриЧтенииНаСервере(ТекущийОбъект)
    
    эв_ВывестиРеквизитыПервостольникаВЗапасы();
    
КонецПроцедуры

&НаСервере
Процедура эв_ВывестиРеквизитыПервостольникаВЗапасы()
    
    ТаблицаЗапасы = Элементы.Найти("Запасы");
    Если ТаблицаЗапасы = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    эв_ДобавитьПолеРеквизитаЗапасы(ТаблицаЗапасы, "эв_ИБ", НСтр("ru = 'Индивидуальный бонус'"));
    эв_ДобавитьПолеРеквизитаЗапасы(ТаблицаЗапасы, "эв_КБ", НСтр("ru = 'Коллективный бонус'"));
    
КонецПроцедуры

&НаСервере
Процедура эв_ДобавитьПолеРеквизитаЗапасы(ТаблицаЗапасы, ИмяРеквизита, ЗаголовокПоля)
    
    ИмяЭлемента = "Запасы" + ИмяРеквизита;
    
    Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ТаблицаЗапасы);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.Запасы." + ИмяРеквизита;
    НовыйЭлемент.Заголовок = ЗаголовокПоля;
    НовыйЭлемент.Ширина = 10;
    НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
    
КонецПроцедуры