
#Область ПрограммныйИнтерфейс

// Переопределяет запуск выполнения проверки КМ (см. процедуру РазрешительныйРежимМДЛПКлиент.НачатьПроверкуКМ).
//
// Параметры:
//  ПараметрыПроверкиКМ - Структура - см. функцию РазрешительныйРежимМДЛПКлиент.ПараметрыПроверкиКМ.
//  СтандартнаяОбработка - Булево - Истина, если нужно чтоб стандартный механизм процедуры РазрешительныйРежимМДЛПКлиент.НачатьПроверкуКМ не выполнялся.
//
Процедура НачатьПроверкуКМ(ПараметрыПроверкиКМ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
