
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если НЕ Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Управление запасами используется только для запасов'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		// Наборы
		ИначеЕсли Номенклатура.ЭтоНабор Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Управление запасами недоступно для наборов'");
			Элементы.Список.ТолькоПросмотр = Истина;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборТолькоСклада") Тогда
		ВыборТолькоСклада = Параметры.ВыборТолькоСклада;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	Оповестить("ИзменениеРегистраМинимальныхОстатков");
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура("Номенклатура", Номенклатура));
	ПараметрыОткрытия.Вставить("ВыборТолькоСклада", ВыборТолькоСклада);
	
	ОткрытьФорму("РегистрСведений.УправлениеЗапасами.ФормаЗаписи", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Ключ = ПолучитьКлючЗаписиРегистраСведений(
		ТекДанные.Организация,
		ТекДанные.Склад,
		ТекДанные.Номенклатура,
		ТекДанные.Характеристика);
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Ключ);
	ПараметрыФормы.Вставить("ВыборТолькоСклада", ВыборТолькоСклада);
	
	ОткрытьФорму("РегистрСведений.УправлениеЗапасами.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

Функция ПолучитьКлючЗаписиРегистраСведений(Организация, Склад, Номенклатура, Характеристика)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", 	Организация);
	Отбор.Вставить("Склад", 		Склад);
	Отбор.Вставить("Номенклатура", 	Номенклатура);
	Отбор.Вставить("Характеристика",Характеристика);
	
	Возврат РегистрыСведений.УправлениеЗапасами.СоздатьКлючЗаписи(Отбор);
	
КонецФункции

#КонецОбласти