

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

    УстановитьВидимостьНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНаСервере()

    Портал = ПорталВида(Запись.ИсточникЗаказов.Вид);
    ЭтоМегаАптека = Портал = Перечисления.эв_ВидыИсточниковЗаказа.МегаАптека;
    ЭтоЮтека = Портал = Перечисления.эв_ВидыИсточниковЗаказа.Ютека;
    ЭтоАсна = Портал = Перечисления.эв_ВидыИсточниковЗаказа.Асна;
    ЭтоЭвалар = Портал = Перечисления.эв_ВидыИсточниковЗаказа.Эвалар;
    ЭтоАптекаМос = Портал = Перечисления.эв_ВидыИсточниковЗаказа.АптекаМос;

	
 	Элементы.Пароль.Видимость = ЭтоАптекаМос;
	Элементы.АСНА.Видимость = ЭтоАсна;
	Элементы.АдресФТП.Видимость = ЭтоЭвалар;
	Элементы.ЭквайринговыйТерминал.Видимость = ЭтоЭвалар;

    Если ЭтоЭвалар Тогда
	
		Элементы.Адрес.Заголовок = "Адрес (Заказы)";
		Элементы.auth_token.Заголовок = "Bearer token";

		Элементы.merchant.Заголовок = "Адрес (Остатки/цены)";
		Элементы.Логин.Заголовок = "Secure token";

		Элементы.АдресФТП.Заголовок = "Ид каталога";

	КонецЕсли;

КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПорталВида(Вид)

    Если Не ЗначениеЗаполнено(Вид) Тогда
        Возврат Перечисления.эв_ВидыИсточниковЗаказа.ПустаяСсылка();
    КонецЕсли;

    Портал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вид, "Портал");
    Если Не ЗначениеЗаполнено(Портал) Тогда
        Возврат Перечисления.эв_ВидыИсточниковЗаказа.ПустаяСсылка();
    КонецЕсли;

    Возврат Портал;

КонецФункции

