#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

Процедура ЗаполнитьПоИнвентаризацияПотребительскихУпаковокМДЛП(ДанныеЗаполнения) Экспорт
	
	ор_ИнтеграцияМДЛП.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, "", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 	
	
	
	Если ДанныеЗаполнения <> Неопределено
	// +ор интеграция МДЛП
		И ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ИнвентаризацияПотребительскихУпаковокМДЛП")
	// -ор интеграция МДЛП
		И ДанныеЗаполнения.Свойство("СписокНоменклатуры") Тогда
		
		СписокНоменклатуры = ДанныеЗаполнения.СписокНоменклатуры;
		
		ДанныеЗаполнения.Удалить("СписокНоменклатуры");
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения); 
		
		Документы.ИнвентаризацияЗапасов.ЗаполнитьПоОстаткамНаСкладе(ЭтотОбъект, СписокНоменклатуры, Неопределено, Неопределено);		
		
		Возврат;
		
	КонецЕсли;	 
	
	// +ор интеграция МДЛП
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияПотребительскихУпаковокМДЛП")] = "ЗаполнитьПоИнвентаризацияПотребительскихУпаковокМДЛП";
	// -ор интеграция МДЛП
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения); 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Серии номенклатуры
	Если СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки() = Истина Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Объект", ЭтотОбъект);
		ДополнительныеПараметры.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		СерииНоменклатурыУНФ.ПроверитьЗаполнениеСерийНоменклатуры(Отказ, Запасы, СерииНоменклатуры, 
			ДополнительныеПараметры);
	КонецЕсли;
	
	НоменклатураВДокументахСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, Отказ, Истина);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	СсылкаПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
	ПометкаУдаленияЗаписанная = ОписаниеТиповБулево.ПривестиЗначение(СсылкаПометкаУдаления);
	
	Если (ПометкаУдаления) И (НЕ ПометкаУдаленияЗаписанная) Тогда
		ПрослеживаемостьПереопределяемый.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
		// Запись наборов записей
		ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ПрослеживаемостьУНФ.УдалениеПроведенияПервичногоДокумента(Ссылка);
		
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПрослеживаемостьПереопределяемый.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.ИнвентаризацияЗапасов.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПрослеживаемостьУНФ.ЗарегистрироватьПрослеживаемыйТовар(ПараметрыПроведения.Реквизиты);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли