
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СКД = Справочники.ор_ПрайсЛистИнформационногоКиоска.ПолучитьМакет("СКДНоменклатура");
	АдресСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	
	СохранитьСКДНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекРодитель = Элементы.Дерево.ТекущаяСтрока;
	СоздатьЭлементыСправочника(ВыбранноеЗначение, ТекРодитель);
	ОбновитьДанныеНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипНоменклатуры", МассивТипов);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	
	ОткрытьФорму(
		"Справочник.Номенклатура.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПомеченныеНаУдаление(Команда)
	
	УдалитьПомеченныеНаУдалениеНаСервере();
	ОбновитьДанныеНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПрайсЛист(Команда)
	
	ТекРодитель = Элементы.Дерево.ТекущаяСтрока;
	Сформировать(ТекРодитель);
	ПоказатьОповещениеПользователя(
		НСтр("ru='Формирование ветки прайс листа закончено'"),,
		НСтр("ru='Ветка сформирована.'")
	);
	ОбновитьДанныеНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиСхемыКомпоновкиДанных(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСхемыКомпоновкиДанных", АдресСКД);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Настройка заполнения справочника Прайс-лист.'"));
	ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("НастраиватьОтбор", Истина);
	ПараметрыФормы.Вставить("НастраиватьПараметры", Истина);
	ПараметрыФормы.Вставить("НастраиватьПорядок", Ложь);
	ПараметрыФормы.Вставить("НастраиватьУсловноеОформление", Ложь);
	ПараметрыФормы.Вставить("НастраиватьВыбор", Истина);
	ПараметрыФормы.Вставить("РедактироватьСхемуКомпоновкиДанных", Истина);
	ПараметрыФормы.Вставить("ПомещатьНастройкиВСхемуКомпоновкиДанных", Истина);
	
	ОткрытьФорму(
		"ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных",
		ПараметрыФормы,,,,,
		Новый ОписаниеОповещения("ОткрытьФормуНастройкиСхемыКомпоновкиДанныхЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СоздатьЭлементыСправочника(ВыбранноеЗначение, Родитель)
	
	Родитель = ?(Родитель = Неопределено, Справочники.ор_ПрайсЛистИнформационногоКиоска.ПустаяСсылка(), Родитель);
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого ЭлементВыбора Из ВыбранноеЗначение Цикл
			Если ЭлементВыбора.ЭтоГруппа Тогда
				НоваяГруппа = Справочники.ор_ПрайсЛистИнформационногоКиоска.СоздатьГруппу();
				НоваяГруппа.Родитель     = Родитель;
				НоваяГруппа.Наименование = Строка(ЭлементВыбора);
				НоваяГруппа.Записать();
			Иначе
				НовыйЭлемент = Справочники.ор_ПрайсЛистИнформационногоКиоска.СоздатьЭлемент();
				НовыйЭлемент.Наименование = Строка(ЭлементВыбора);
				НовыйЭлемент.Номенклатура = ЭлементВыбора;
				НовыйЭлемент.Родитель     = Родитель;
				НовыйЭлемент.Записать();
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Если ВыбранноеЗначение.ЭтоГруппа Тогда
			НоваяГруппа = Справочники.ор_ПрайсЛистИнформационногоКиоска.СоздатьГруппу();
			НоваяГруппа.Родитель     = Родитель;
			НоваяГруппа.Наименование = Строка(ВыбранноеЗначение);
			НоваяГруппа.Записать();
		Иначе
			НовыйЭлемент = Справочники.ор_ПрайсЛистИнформационногоКиоска.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Строка(ВыбранноеЗначение);
			НовыйЭлемент.Номенклатура = ВыбранноеЗначение;
			НовыйЭлемент.Родитель     = Родитель;
			НовыйЭлемент.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаФорме()
	Элементы.Дерево.Обновить();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ор_ПрайсЛистИнформационногоКиоска"));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьПомеченныеНаУдалениеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрайсЛист.Ссылка
	|ИЗ
	|	Справочник.ор_ПрайсЛистИнформационногоКиоска КАК ПрайсЛист
	|ГДЕ
	|	ПрайсЛист.ПометкаУдаления";
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Таблица.ВыгрузитьКолонку("Ссылка");
	
	УдалитьОбъекты(МассивСсылок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиСхемыКомпоновкиДанныхЗавершение(ОбработкаРезультата, ДополнительныеПараметры) Экспорт
	
	СохранитьСКДНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСКДНаСервере()
	
	СхемаКомпоновкиДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСКД));
	
КонецПроцедуры

&НаСервере
Процедура Сформировать(Родитель)
	
	Если Родитель = Неопределено Тогда
		Родитель = Справочники.ор_ПрайсЛистИнформационногоКиоска.ПустаяСсылка();
	КонецЕсли;
	
	СнятьПривилегированныйРежим = Ложь;
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
		СнятьПривилегированныйРежим = Истина;
	КонецЕсли;
	
	СписокЭлементов = СписокЭлементовСКД();
	
	Для Каждого Элемент Из СписокЭлементов Цикл
		Если Элемент.ЭтоГруппа Тогда
			НоваяГруппа = Справочники.ор_ПрайсЛистИнформационногоКиоска.СоздатьГруппу();
			НоваяГруппа.Наименование = Строка(Элемент.Номенклатура);
			НоваяГруппа.Родитель     = Родитель;
			НоваяГруппа.Записать();
		Иначе
			НовыйЭлемент = Справочники.ор_ПрайсЛистИнформационногоКиоска.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Строка(Элемент.Номенклатура);
			НовыйЭлемент.Родитель     = Родитель;
			НовыйЭлемент.Номенклатура = Элемент.Номенклатура;
			НовыйЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Если СнятьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаСКД(СКД, Настройки)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СКД,Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")
	);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция СписокЭлементовСКД()
	
	Настройки = ПолучитьНастройкиСписка();
	Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки);
	
КонецФункции

&НаСервере
Функция ПолучитьНастройкиСписка()
	
	СКД = СхемаКомпоновкиДанных.Получить();
	
	Поля = СКД.НаборыДанных.СписокНоменклатуры.Поля;
	Для Каждого Поле Из Поля Цикл
		Поле.ОграничениеИспользования.Поле = Ложь;
	КонецЦикла;
	
	НастройкиСписка = СКД.ВариантыНастроек.Основной.Настройки;
	Настройки = СКД.НастройкиПоУмолчанию;
	
	Возврат Новый Структура("СКД, Настройки", СКД, Настройки);
	
КонецФункции

#КонецОбласти
