
#Область ПрограммныйИнтерфейс

#Область ПроверкаКодаМаркировки

Процедура НачатьПроверкуКМНаВнутреннемТСПИоТ(ПараметрыПроверкиКМ, ОповещениеОЗавершении) Экспорт
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ);
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаВнутреннемТСПИоТ Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ПараметрыВыполненияПроверки.РезультатПроверки);
		Возврат;
	КонецЕсли;
	
	НастройкиПодключения = ИнтеграцияТСПИоТМДЛПКлиентСервер.НастройкиПодключенияЭкземпляраТСПИоТ(ПараметрыВыполненияПроверки.НомерФискальногоНакопителя, ПараметрыВыполненияПроверки.ККТФФД12МДЛП).НастройкиПодключения;
	
	ПараметрыВыполненияПроверки.Вставить("НастройкиПодключения" , НастройкиПодключения);
	ПараметрыВыполненияПроверки.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	ПараметрыВыполненияПроверки.РезультатПроверки.Вставить("СтатусыТСПИоТ", Неопределено);
	
	ПродолжитьПроверкуКМНаВнутреннемТСПИоТ(Неопределено, ПараметрыВыполненияПроверки);
	
КонецПроцедуры

Процедура ПродолжитьПроверкуКМНаВнутреннемТСПИоТ(ПорцияРезультатаПроверки, ПараметрыВыполненияПроверки) Экспорт
	
	Если ПорцияРезультатаПроверки <> Неопределено Тогда
		
		//////////////////////////////////////////////////////////////////////////////////
		// Окончание очередной итерации рекурентного выполнения.
		
		РезультатЗапросаНаТСПИоТ = Новый Структура;
		РезультатЗапросаНаТСПИоТ.Вставить("АварийныйРежим"               , Ложь);
		
		РезультатЗапросаНаТСПИоТ.Вставить("ТекстОшибки"                  , "");
		РезультатЗапросаНаТСПИоТ.Вставить("КонтролиРазрешительногоРежима", Новый Соответствие);
		
		РезультатЗапросаНаТСПИоТ.Вставить("СтатусыКодовМаркировкиГИСМТ"  , Новый Соответствие);
		РезультатЗапросаНаТСПИоТ.Вставить("КодыМаркировкиБезДанных"      , Новый Соответствие);
		РезультатЗапросаНаТСПИоТ.Вставить("СтатусыТСПИоТ"                , Неопределено);
		
		РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.РезультатВыполненияОперации();
		Если ПорцияРезультатаПроверки.Результат Тогда
			
			РезультатОтправкиЗапроса.КодСостояния = 200;
			РезультатОтправкиЗапроса.КодОшибки    = РезультатОтправкиЗапроса.КодСостояния;
			РезультатОтправкиЗапроса.Вставить("ОтветТранспортногоМодуля", ПорцияРезультатаПроверки.РезультатПроверки);
			
		Иначе
			
			// Ошибка при подключении компоненты, ошибка при проверке.
			РезультатОтправкиЗапроса.Статус         = "Ошибка";
			РезультатОтправкиЗапроса.ОписаниеОшибки = ПорцияРезультатаПроверки.ОписаниеОшибки;
			
		КонецЕсли;
		
		Если ПорцияРезультатаПроверки.Свойство("СтатусСостояния") Тогда
			
			РезультатЗапросаНаТСПИоТ.СтатусыТСПИоТ = ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторДаныхСтатусаТСПИоТ();
			ЗаполнитьЗначенияСвойств(РезультатЗапросаНаТСПИоТ.СтатусыТСПИоТ, ПорцияРезультатаПроверки.СтатусСостояния);
			
			Если РезультатЗапросаНаТСПИоТ.СтатусыТСПИоТ.АварийныйРежим Тогда
				РезультатОтправкиЗапроса.КодСостояния = РазрешительныйРежимМДЛПКлиентСервер.АварийныйРежимКодОтветаСервисаГИСМТ();
			КонецЕсли;
			
		КонецЕсли;
		
		ЭлементПроверки = ПараметрыВыполненияПроверки.ДанныеДляПроверки[0];
		
		ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("");
		ДанныеЗапроса.АдресЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПорцияРезультатаПроверки, "ЗапросПроверки", "");
		
		ИнтеграцияТСПИоТМДЛПКлиентСервер.ОбработатьРезультатОтправкиЗапросаНаТСПИоТ(
			РезультатОтправкиЗапроса,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлементПроверки),
			ПараметрыВыполненияПроверки.НастройкиПодключения,
			ДанныеЗапроса,
			РезультатЗапросаНаТСПИоТ);
		
		РазрешительныйРежимМДЛПКлиентСервер.ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(ПараметрыВыполненияПроверки.РезультатПроверки, РезультатЗапросаНаТСПИоТ);
		
		Если ПараметрыВыполненияПроверки.РезультатПроверки.ЕстьОшибки Тогда
			
			ЗавершитьПроверкуКМНаВнутреннемТСПИоТ = Новый ОписаниеОповещения("ЗавершитьПроверкуКМНаВнутреннемТСПИоТ", ЭтотОбъект, ПараметрыВыполненияПроверки);
			ВыполнитьОбработкуОповещения(ЗавершитьПроверкуКМНаВнутреннемТСПИоТ, Истина);
			
			Возврат;
			
		КонецЕсли;
		
		ПараметрыВыполненияПроверки.ДанныеДляПроверки.Удалить(0);
		
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Начало очередной итерации рекурентного выполнения.
	
	Если ПараметрыВыполненияПроверки.ДанныеДляПроверки.Количество() = 0
		Или РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж() Тогда
		// Крайний случай рекурентного выполнения.
		ЗавершитьПроверкуКМНаВнутреннемТСПИоТ = Новый ОписаниеОповещения("ЗавершитьПроверкуКМНаВнутреннемТСПИоТ", ЭтотОбъект, ПараметрыВыполненияПроверки);
		ВыполнитьОбработкуОповещения(ЗавершитьПроверкуКМНаВнутреннемТСПИоТ, Истина);
		Возврат;
	КонецЕсли;
	
	ЭлементПроверки = ПараметрыВыполненияПроверки.ДанныеДляПроверки[0];
	
	СтруктураПередачиКода = Новый Структура;
	СтруктураПередачиКода.Вставить("cis",   ЭлементПроверки.ПолныйКодМаркировки);
	СтруктураПередачиКода.Вставить("sntin", ЭлементПроверки.ПолныйКодМаркировки);
	СтруктураПередачиКода.Вставить("ki",    ЭлементПроверки.СокращенныйКодМаркировки);
	СтруктураПередачиКода.Вставить("pg",    РазрешительныйРежимМДЛПКлиентСервер.НомерТоварнойГруппыЛекарственныеСредства());
	
	СтруктураПередачиКодовМаркировки = Новый Структура("codes", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураПередачиКода));
	
	МодульОборудованиеЧекопечатающиеУстройстваКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
	ПараметрыОперации = МодульОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПроверкиКМПИоТ();
	ПараметрыОперации.ЗапросJSON = ТранспортМДЛПКлиентСервер.ПреобразоватьЗначениеВJSON(СтруктураПередачиКодовМаркировки);
	
	МодульМенеджерОборудованияКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиентСервер");
	ДополнительныеПараметрыОперации = МодульМенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
	
	ПродолжитьПроверкуКМНаВнутреннемТСПИоТ = Новый ОписаниеОповещения("ПродолжитьПроверкуКМНаВнутреннемТСПИоТ", ЭтотОбъект, ПараметрыВыполненияПроверки);
	
	МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
	МодульОборудованиеКлиент.НачатьПроверкаКМПИоТ(
		ПродолжитьПроверкуКМНаВнутреннемТСПИоТ,
		ПараметрыВыполненияПроверки.УникальныйИдентификатор,
		ПараметрыВыполненияПроверки.ККТФФД12МДЛП,
		ПараметрыОперации,
		ДополнительныеПараметрыОперации);
	
КонецПроцедуры

Процедура ЗавершитьПроверкуКМНаВнутреннемТСПИоТ(Выполнено, ПараметрыВыполненияПроверки) Экспорт
	
	РезультатПроверки = ПараметрыВыполненияПроверки.РезультатПроверки;
	
	Если РезультатПроверки.ЕстьОшибки Тогда
		
		Если РезультатПроверки.СтатусыТСПИоТ <> Неопределено
			И Не ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(РезультатПроверки.СтатусыТСПИоТ) Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ПодключаемоеОборудование", ПараметрыВыполненияПроверки.ККТФФД12МДЛП);
			ПараметрыОткрытия.Вставить("ДанныеСтатусаТСПИоТ",      РезультатПроверки.СтатусыТСПИоТ);
			
			ПослеЗавершенияПроверкиГотовностиСтатусаТСПИоТ = Новый ОписаниеОповещения("ПослеЗавершенияПроверкиГотовностиСтатусаТСПИоТ", ЭтотОбъект, ПараметрыВыполненияПроверки);
			
			ОткрытьФорму(
				"ОбщаяФорма.ФормаПроверкиСтатусовГотовностиТСПИоТМДЛП",
				ПараметрыОткрытия,,,,,
				ПослеЗавершенияПроверкиГотовностиСтатусаТСПИоТ);
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполненияПроверки.ОповещениеОЗавершении, РезультатПроверки);
	
КонецПроцедуры

Асинх Процедура ПослеЗавершенияПроверкиГотовностиСтатусаТСПИоТ(Результат, ПараметрыВыполненияПроверки) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПараметрыВыполненияПроверки.ОповещениеОЗавершении, ПараметрыВыполненияПроверки.РезультатПроверки);
		Возврат;
	КонецЕсли;
	
	ПродолжитьПроверкуКМНаВнутреннемТСПИоТ(Неопределено, ПараметрыВыполненияПроверки);
	
КонецПроцедуры

#КонецОбласти // ПроверкаКодаМаркировки

#КонецОбласти // ПрограммныйИнтерфейс
