
&НаСервере
Процедура ос_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Выводим адрес
	ЭЛ = Элементы.Добавить("АдресДоставки", Тип("ПолеФормы"), Элементы.Список); 
	ЭЛ.Вид = ВидПоляФормы.ПолеВвода;
	ЭЛ.ПутьКДанным = "Список.Ссылка.АдресДоставки";
	ЭЛ.Заголовок = "Адрес доставки";
	
	//Выводим оплату на сайте
	СтрокаПоиска = "ЕСТЬNULL(ФактОплаты.СуммаОплаты, 0) + ЕСТЬNULL(ФактОплаты.СуммаАванса, 0)"; 
	ТекстЗапроса = Список.ТекстЗапроса;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,СтрокаПоиска,СтрокаПоиска+" + ЕСТЬNULL(ФактОплаты.СуммаОплатыНаСайте, 0)");

	СтруктураСвойств = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();  
	СтруктураСвойств.ОсновнаяТаблица = "Документ.ЗаказПокупателя";
	СтруктураСвойств.ТекстЗапроса = ТекстЗапроса;
	СтруктураСвойств.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СтруктураСвойств);   
	
КонецПроцедуры
