
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРегистрацииРецепта          = Параметры.ДатаРегистрацииРецепта;
	НомерСерииРецепта               = Параметры.НомерСерииРецепта;
	НомерРецепта                    = Параметры.НомерРецепта;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомендаОК(Команда)
	
	ОчиститьСообщения();
	
	Если (ЗначениеЗаполнено(НомерСерииРецепта)
		ИЛИ ЗначениеЗаполнено(НомерРецепта))
		И НЕ ЗначениеЗаполнено(ДатаРегистрацииРецепта) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена дата регистрации рецепта.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РезультатВводаРецепта = Новый Структура;
	РезультатВводаРецепта.Вставить("НомерСерииРецепта", НомерСерииРецепта);
	РезультатВводаРецепта.Вставить("НомерРецепта", НомерРецепта);
	РезультатВводаРецепта.Вставить("ДатаРегистрацииРецепта", ДатаРегистрацииРецепта);
	
	Закрыть(РезультатВводаРецепта);
	
КонецПроцедуры

#КонецОбласти
