
#Область СлужебныеПроцедурыИФункции

// Процедура заполненяет предопределенные настроек
//
Процедура ЗаполнитьПредопределенныеНастройки() Экспорт
	
	// Заполним соответствие предопределенных элементов и имен макетов шаблонов настроек.
	СоответствиеМакетовИЭлементов = Новый Соответствие();
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.АптекаХолд,
		"НастройкаАптекаХолд");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Генезис,
		"НастройкаГенезис");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Катрен,
		"НастройкаКатрен");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Морон,
		"НастройкаМорон");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Протек,
		"НастройкаПротек");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Сиа,
		"НастройкаСиа");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЗагрузкаФальсификатовMDB,
		"НастройкаЗагрузкаФальсификатовMDB");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЗагрузкаФальсификатовDBF,
		"НастройкаЗагрузкаФальсификатовDBF");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЗагрузкаЦенЖНВЛС,
		"НастройкаЗагрузкаЦенЖНВЛС");
	СоответствиеМакетовИЭлементов.Вставить(Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЗагрузкаЦенЖНВЛСНедействующие,
		"НастройкаЗагрузкаЦенЖНВЛСНедействующие");
	
	Для Каждого Элемент Из СоответствиеМакетовИЭлементов Цикл
		
		СправочникОбъект = Элемент.Ключ.ПолучитьОбъект();
		
		// Пропустим уже заполненные настройки (заполненными могут быть при конвертации, их будем конвертировать).
		Настройки = СправочникОбъект.НастройкиЗагрузкиВыгрузки.Получить();
		//Если ТипЗнч(Настройки)=Тип("ТабличныйДокумент") Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если ЗаполнитьНастройкиЗагрузкиИзТабличногоДокумента(СправочникОбъект, СправочникОбъект.ПолучитьМакет(Элемент.Значение)) Тогда
			Попытка
				СправочникОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// Заполняет настройки колонок по умолчанию для табличной части доп. параметров справочника настроек
//
// Параметры:
//  НастройкиДопПараметров - Соответствие - Соответствие данных для заполнения значений колонки "НомерКолонки"
//
Процедура ЗаполнитьНастройкиКолонокТабличнойЧастиДопПараметровСправочникаНастроек(НастройкиПараметров=Неопределено, ТаблицаДополнительныхПараметров = Неопределено) Экспорт
	
	Если ТаблицаДополнительныхПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДополнительныхПараметров.Очистить();

	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Номер серии производителя";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Срок годности";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Производитель";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Сертификат";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "ШтрихКод";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Наименование характеристики";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Наименование товара";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Цена";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Страна происхождения";
	
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Орган выдавший сертификат";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Срок действия сертификата";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Декларацию зарегистрировал";
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Декларант";
	
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Маркируемый товар";
	
	ЗагружаемыйРеквизит                     = ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "GTIN";
	
	Если НастройкиПараметров <> Неопределено Тогда
		Для Каждого Строка Из ТаблицаДополнительныхПараметров Цикл
			Строка.НомерКолонки  = НастройкиПараметров[Строка.ИмяРеквизита];
			Строка.РежимЗагрузки = НастройкиПараметров[Строка.ИмяРеквизита + " РежимЗагрузки"];
			Строка.Выражение     = НастройкиПараметров[Строка.ИмяРеквизита + " Выражение"];
			Если НЕ ЗначениеЗаполнено(Строка.РежимЗагрузки) Тогда
				Строка.РежимЗагрузки = "Искать";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполненяет соответствие параметров из флагов
//
Функция ЗаполнитьСоответствиеПараметровИзФлагов(ВерсияОбработки, СтруктураФлагов, Настройки) Экспорт
	
	НастройкиПараметров = Новый Соответствие;
	НастройкиПараметров.Вставить("Номер серии производителя", СтруктураФлагов.НомерСерииПроизводителя);
	НастройкиПараметров.Вставить("Срок годности"            , СтруктураФлагов.СрокГодности);
	НастройкиПараметров.Вставить("Сертификат"               , СтруктураФлагов.Сертификат);
	НастройкиПараметров.Вставить("Производитель"            , СтруктураФлагов.Производитель);
	НастройкиПараметров.Вставить("ШтрихКод"                 , СтруктураФлагов.ШтрихКод);
	НастройкиПараметров.Вставить("Наименование товара"      , СтруктураФлагов.НаименованиеТовара);
	НастройкиПараметров.Вставить("Цена"                     , СтруктураФлагов.Цена);
	НастройкиПараметров.Вставить("Страна происхождения"     , СтруктураФлагов.СтранаПроисхождения);
	
	НастройкиПараметров.Вставить("Номер серии производителя РежимЗагрузки", Настройки.Область("R43C5").Текст);
	НастройкиПараметров.Вставить("Номер серии производителя Выражение"    , Настройки.Область("R44C5").Текст);
	
	НастройкиПараметров.Вставить("Срок годности РежимЗагрузки", Настройки.Область("R47C5").Текст);
	НастройкиПараметров.Вставить("Срок годности Выражение"    , Настройки.Область("R48C5").Текст);
	
	НастройкиПараметров.Вставить("Сертификат РежимЗагрузки", Настройки.Область("R57C5").Текст);
	НастройкиПараметров.Вставить("Сертификат Выражение"    , Настройки.Область("R58C5").Текст);
	
	НастройкиПараметров.Вставить("Производитель РежимЗагрузки", Настройки.Область("R50C5").Текст);
	НастройкиПараметров.Вставить("Производитель Выражение"    , Настройки.Область("R51C5").Текст);
	
	НастройкиПараметров.Вставить("ШтрихКод РежимЗагрузки", Настройки.Область("R24C5").Текст);
	НастройкиПараметров.Вставить("ШтрихКод Выражение"    , Настройки.Область("R25C5").Текст);
	
	НастройкиПараметров.Вставить("Наименование товара РежимЗагрузки", Настройки.Область("R33C5").Текст);
	НастройкиПараметров.Вставить("Наименование товара Выражение"    , Настройки.Область("R34C5").Текст);
	
	НастройкиПараметров.Вставить("Цена РежимЗагрузки", Настройки.Область("R39C5").Текст);
	НастройкиПараметров.Вставить("Цена Выражение"    , Настройки.Область("R40C5").Текст);
	
	НастройкиПараметров.Вставить("Страна происхождения РежимЗагрузки", Настройки.Область("R54C5").Текст);
	НастройкиПараметров.Вставить("Страна происхождения Выражение"    , Настройки.Область("R55C5").Текст);
	
	НастройкиПараметров.Вставить("Наименование характеристики"              , Настройки.Область("R35C5").Текст);
	НастройкиПараметров.Вставить("Наименование характеристики РежимЗагрузки", Настройки.Область("R36C5").Текст);
	НастройкиПараметров.Вставить("Наименование характеристики Выражение"    , Настройки.Область("R37C5").Текст);
	
	// Необходимо для реестра сертификатов соответствий.
	НастройкиПараметров.Вставить("Срок действия сертификата"              , Настройки.Область("R61C5").Текст);
	НастройкиПараметров.Вставить("Срок действия сертификата РежимЗагрузки", Настройки.Область("R62C5").Текст);
	НастройкиПараметров.Вставить("Срок действия сертификата Выражение"    , Настройки.Область("R63C5").Текст);
	
	НастройкиПараметров.Вставить("Орган выдавший сертификат"              , Настройки.Область("R64C5").Текст);
	НастройкиПараметров.Вставить("Орган выдавший сертификат РежимЗагрузки", Настройки.Область("R65C5").Текст);
	НастройкиПараметров.Вставить("Орган выдавший сертификат Выражение"    , Настройки.Область("R66C5").Текст);
	
	НастройкиПараметров.Вставить("Декларацию зарегистрировал"              , Настройки.Область("R67C5").Текст);
	НастройкиПараметров.Вставить("Декларацию зарегистрировал РежимЗагрузки", Настройки.Область("R68C5").Текст);
	НастройкиПараметров.Вставить("Декларацию зарегистрировал Выражение"    , Настройки.Область("R69C5").Текст);
	
	НастройкиПараметров.Вставить("Декларант"              , Настройки.Область("R70C5").Текст);
	НастройкиПараметров.Вставить("Декларант РежимЗагрузки", Настройки.Область("R71C5").Текст);
	НастройкиПараметров.Вставить("Декларант Выражение"    , Настройки.Область("R72C5").Текст);
	
	НастройкиПараметров.Вставить("Маркируемый товар"              , Настройки.Область("R73C5").Текст);
	НастройкиПараметров.Вставить("Маркируемый товар РежимЗагрузки", Настройки.Область("R74C5").Текст);
	НастройкиПараметров.Вставить("Маркируемый товар Выражение"    , Настройки.Область("R75C5").Текст);
	
	НастройкиПараметров.Вставить("GTIN"              , Настройки.Область("R76C5").Текст);
	НастройкиПараметров.Вставить("GTIN РежимЗагрузки", Настройки.Область("R77C5").Текст);
	НастройкиПараметров.Вставить("GTIN Выражение"    , Настройки.Область("R78C5").Текст);
	
	Возврат НастройкиПараметров;
	
КонецФункции

// Процедура заполненяет табличный документ настройками дополнительных параметров
//
Процедура ЗаполнитьТабличныйДокументНастройкамиДопПараметров(ОбластьШапки, СтруктураПараметров) Экспорт
	Попытка
		ОбластьШапки.Параметры.ФорматДатыСрокаГодности           = СтруктураПараметров.ФорматДатыСрокаГодности;
		ОбластьШапки.Параметры.ВсегдаФормироватьНовыеСерии       = ?(СтруктураПараметров.ВсегдаФормироватьНовыеСерии, "Х","");
		ОбластьШапки.Параметры.СоздаватьСтрануПроисхождения      = ?(СтруктураПараметров.СоздаватьСтрануПроисхождения, "Х","");
		ОбластьШапки.Параметры.ЗагружатьGTINДляСерии             = ?(СтруктураПараметров.ЗагружатьGTINДляСерии, "Х","");
		ОбластьШапки.Параметры.НеФормироватьДопНомерСерии        = ?(СтруктураПараметров.НеФормироватьДопНомерСерии, "Х","");
		ОбластьШапки.Параметры.СоздаватьПроизводителя            = ?(СтруктураПараметров.СоздаватьПроизводителя, "Х","");
		ОбластьШапки.Параметры.ЗагружатьШК                       = ?(СтруктураПараметров.ЗагружатьШК, "Х","");
		ОбластьШапки.Параметры.ШКЯвляетсяПолемПоискаНоменклатуры = ?(СтруктураПараметров.Свойство("ШКЯвляетсяПолемПоискаНоменклатуры"),?(СтруктураПараметров.ШКЯвляетсяПолемПоискаНоменклатуры, "Х",""), "");
		ОбластьШапки.Параметры.СоздаватьОбщиеХарактеристики      = ?(СтруктураПараметров.Свойство("СоздаватьОбщиеХарактеристики"),?(СтруктураПараметров.СоздаватьОбщиеХарактеристики, "Х",""), "");
		Для Каждого СтрокаТаблицы Из СтруктураПараметров.ТаблицаДополнительныхПараметров Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.РежимЗагрузки) Тогда
				СтрокаТаблицы.РежимЗагрузки = "Искать";
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(СтруктураПараметров.ТаблицаДополнительныхПараметров) = Тип("ТаблицаЗначений") Тогда
			ТаблицаВременная = СтруктураПараметров.ТаблицаДополнительныхПараметров.Скопировать();
		Иначе
			ТаблицаВременная = СтруктураПараметров.ТаблицаДополнительныхПараметров.Выгрузить();
		КонецЕсли;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Номер серии производителя","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииНомер              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииНомерРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииНомерВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Срок годности","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСрокГодности             = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСрокГодностиРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСрокГодностиВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Производитель","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииПроизводитель              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииПроизводительРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииПроизводительВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Сертификат","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСертификат              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСертификатРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСертификатВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("ШтрихКод","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииШтрихКод              = НайденнаяСтрока.НомерКолонки; 
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииШтрихКодРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииШтрихКодВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Наименование характеристики","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовНаименованиеХарактеристики              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовНаименованиеХарактеристикиРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовНаименованиеХарактеристикиВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Наименование товара","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовНаименованиеТоваров             = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовНаименованиеТоваровРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовНаименованиеТоваровВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Цена","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовЦена              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовЦенаРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовЦенаВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Страна происхождения","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСтранаПроисхождения              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСтранаПроисхожденияРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСтранаПроисхожденияВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Орган выдавший сертификат","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииОрганВыдавшийСертификат              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииОрганВыдавшийСертификатРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииОрганВыдавшийСертификатВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Срок действия сертификата","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСрокДействияСертификата              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСрокДействияСертификатаРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииСрокДействияСертификатаВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Декларацию зарегистрировал","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииДекларациюЗарегистрировал              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииДекларациюЗарегистрировалРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииДекларациюЗарегистрировалВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Декларант","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииДекларант              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииДекларантРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииДекларантВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("Маркируемый товар","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииМаркируемыйТовар              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииМаркируемыйТоварРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииМаркируемыйТоварВыражение     = НайденнаяСтрока.Выражение;
		
		НайденнаяСтрока = ТаблицаВременная.Найти("GTIN","ИмяРеквизита");
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииGTIN              = НайденнаяСтрока.НомерКолонки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииGTINРежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
		ОбластьШапки.Параметры.ТаблицаРеквизитовСерииGTINВыражение     = НайденнаяСтрока.Выражение;
		
	Исключение
	КонецПопытки;

КонецПроцедуры

// Процедура дополняет список выбора имен представлений
//
Процедура ДополнитьСписокВыбораИменПредставлений(Тип, СписокВыбора) Экспорт
	Если Тип = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		СписокВыбора.Добавить("СерияПроизводителяИСрокГодности", "Серия произв. и срок годн.");
	КонецЕсли;
	
КонецПроцедуры

// Функция вычисляет значение ячейки для режима "Вычислять"
//
// Параметры:
//  Выражение 		- Строка	- Программный код, который необходимо выполнить
//  ТекущиеДанные  	- Структура	- Структура загруженных значений
//  ТекстЯчейки    	- Строка	- Текст текущей ячейки
//  ТекстыЯчеек    	- Массив	- Массив текстов ячеек строки
//  Результат      	- Число		- Результат вычисления
//
// Возвращаемое значение:
//  Структура		- Структура, содержащая Результат и ОписаниеОшибки
//
Функция ВычислитьЗначениеДляХарактеристики(Знач Выражение, Знач ТекстЯчейки, Знач ТекстыЯчеек, Знач Результат, Знач СсылкаИсточника, СтруктураПараметровЛогирования = Неопределено) Экспорт 
	
	ТекстЯчейки = СокрЛП(ТекстЯчейки);
	ТекстСообщения = "";
	Попытка
		Выполнить(Выражение);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка при вычислении выражения %1: %2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выражение, ОписаниеОшибки());
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Новый Структура("Результат,ОписаниеОшибки",Результат,ТекстСообщения);
	
КонецФункции // ВычислитьЗначениеДляХарактеристики()

// Функция формирует новую характеристику(серию)
//
// Параметры:
//  ТекстыЯчеек    	   - Массив - Массив текстов ячеек строки
//  Серия	           – СправочникСсылка.ХарактеристикиНоменклатуры – характеристика.
//  ДопНомерСерии	   – Число	– Индекс серии.
//
// Возвращаемое значение:
//  Серия	   – СправочникСсылка.ХарактеристикиНоменклатуры – серия.
//
Функция СформироватьНовуюСерию(ТекстыЯчеек, СтруктураПараметров, Серия = Неопределено, ДопНомерСерии = 0, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ТаблицаДополнительныхПараметров = СтруктураПараметров.ТаблицаДополнительныхПараметров;
	ТаблицаЗагружаемыхРеквизитов = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов;
	ВладелецСерии = СтруктураПараметров.ВладелецСерии;
	ПроверятьСрокиГодности = СтруктураПараметров.ПроверятьСрокиГодности;
	НеФормироватьДопНомерСерии = СтруктураПараметров.НеФормироватьДопНомерСерии;
	
	Попытка
		СтрокаШтрихКод   = ТаблицаДополнительныхПараметров.Найти("ШтрихКод","ИмяРеквизита");
		НомерКолонкиШтрихКод = СтрокаШтрихКод.НомерКолонки;
	Исключение
		СтрокаШтрихКод = Неопределено;
		НомерКолонкиШтрихКод = 0;
	КонецПопытки;

	Попытка
		СтрокаGTIN   = ТаблицаДополнительныхПараметров.Найти("GTIN","ИмяРеквизита");
		НомерКолонкиGTIN = СтрокаGTIN.НомерКолонки;
	Исключение
		СтрокаGTIN = Неопределено;
		НомерКолонкиGTIN = 0;
	КонецПопытки;
	
	Если ТаблицаДополнительныхПараметров.Количество() > 0 Тогда
		
		СтрокаНастройкиЗагрузкиНоменклатуры =  ТаблицаЗагружаемыхРеквизитов.Найти("Номенклатура","ПредставлениеРеквизита"); 
		Если (СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено) ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.Пометка = Ложь) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		СтрокаНастройкиЗагрузкиСерии =  ТаблицаЗагружаемыхРеквизитов.Найти("Характеристика","ПредставлениеРеквизита"); 
		Если (СтрокаНастройкиЗагрузкиСерии = Неопределено) ИЛИ (СтрокаНастройкиЗагрузкиСерии.Пометка = Ложь)  Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВладелецСерии) Тогда 
			ТекстСообщения = НСтр("ru = 'Не указан владелец, не можем сформировать новую серию'");
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Возврат Неопределено;
		КонецЕсли;
		
		Если ТипЗнч(ВладелецСерии)=Тип("СправочникСсылка.Номенклатура") Тогда
			Если Не ВладелецСерии.КатегорияНоменклатуры.ИспользоватьХарактеристики Тогда
				// Учет по характеристикам не ведется, но надо проверить ШК
				
				Если ЗначениеЗаполнено(НомерКолонкиШтрихКод) И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиШтрихКод])Тогда
					
					ШтрихКодСерииДляРегистрации = ТекстыЯчеек[НомерКолонкиШтрихКод];
					
				Иначе
					ШтрихКодСерииДляРегистрации = "";
				КонецЕсли;
				
				Если СтруктураПараметров.Свойство("НоменклатураДляЗаписиШК") Тогда
					ЗарегистрироватьШтрихКод(ШтрихКодСерииДляРегистрации,СтруктураПараметров.НоменклатураДляЗаписиШК,Неопределено,Неопределено, СтруктураПараметровЛогирования);
				КонецЕсли;	
				
				Возврат Неопределено;
				
			ИначеЕсли СтруктураПараметров.СоздаватьОбщиеХарактеристики Тогда
				// Серии подчинены виду номенклатуры
				ВладелецСерии = ВладелецСерии.КатегорияНоменклатуры;
				СтруктураПараметров.ВладелецСерии = ВладелецСерии;
			КонецЕсли;
		Иначе
			Если Не ВладелецСерии.ИспользоватьХарактеристики Тогда
				// Учет по характеристикам не ведется, но надо проверить ШК
				
				Если ЗначениеЗаполнено(НомерКолонкиШтрихКод) И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиШтрихКод])Тогда
					
					ШтрихКодСерииДляРегистрации = ТекстыЯчеек[НомерКолонкиШтрихКод];
					
				Иначе
					ШтрихКодСерииДляРегистрации = "";
				КонецЕсли;
				
				Если СтруктураПараметров.Свойство("НоменклатураДляЗаписиШК") Тогда
					ЗарегистрироватьШтрихКод(ШтрихКодСерииДляРегистрации,СтруктураПараметров.НоменклатураДляЗаписиШК,Неопределено,Неопределено, СтруктураПараметровЛогирования);
				КонецЕсли;	
				
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			СтрокаСерии = ТаблицаДополнительныхПараметров.Найти("Номер серии производителя","ИмяРеквизита");
			НомерКолонкиСерия = СтрокаСерии.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаСрокГодности   = ТаблицаДополнительныхПараметров.Найти("Срок годности","ИмяРеквизита");
			НомерКолонкиСрокГодности = СтрокаСрокГодности.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаПроизводитель   = ТаблицаДополнительныхПараметров.Найти("Производитель","ИмяРеквизита");
			НомерКолонкиПроизводитель = СтрокаПроизводитель.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаСтранаПроисхождения = ТаблицаДополнительныхПараметров.Найти("Страна происхождения","ИмяРеквизита");
			НомерКолонкиСтранаПроисхождения = СтрокаСтранаПроисхождения.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаСертификат   = ТаблицаДополнительныхПараметров.Найти("Сертификат","ИмяРеквизита");
			НомерКолонкиСертификат = СтрокаСертификат.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаНаименование   = ТаблицаДополнительныхПараметров.Найти("Наименование характеристики", "ИмяРеквизита");
			НомерКолонкиНаименование = СтрокаНаименование.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаОрганВыдавшийСертификат       = ТаблицаДополнительныхПараметров.Найти("Орган выдавший сертификат", "ИмяРеквизита");
			НомерКолонкиОрганВыдавшийСертификат = СтрокаОрганВыдавшийСертификат.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаСрокДействияСертификата       = ТаблицаДополнительныхПараметров.Найти("Срок действия сертификата", "ИмяРеквизита");
			НомерКолонкиСрокДействияСертификата = СтрокаСрокДействияСертификата.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаОрганЗарегистрировавшийДекларацию       = ТаблицаДополнительныхПараметров.Найти("Декларацию зарегистрировал", "ИмяРеквизита");
			НомерКолонкиОрганЗарегистрировавшийДекларацию = СтрокаОрганЗарегистрировавшийДекларацию.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаДекларант       = ТаблицаДополнительныхПараметров.Найти("Декларант", "ИмяРеквизита");
			НомерКолонкиДекларант = СтрокаДекларант.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаМаркируемыйТовар   = ТаблицаДополнительныхПараметров.Найти("Маркируемый товар","ИмяРеквизита");
			НомерКолонкиМаркируемыйТовар = СтрокаМаркируемыйТовар.НомерКолонки;
		Исключение
		КонецПопытки;
		
		Если СтрокаСерии.РежимЗагрузки = "Искать" Тогда
			Если НЕ ЗначениеЗаполнено(НомерКолонкиСерия) Тогда 
				ТекстСообщения = НСтр("ru = 'Не заполнены обязательные реквизиты, не можем сформировать новую серию!'");
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаСрокГодности.РежимЗагрузки = "Искать" Тогда
			Если НЕ ЗначениеЗаполнено(НомерКолонкиСрокГодности) Тогда 
				ТекстСообщения = НСтр("ru = 'Не заполнены обязательные реквизиты, не можем сформировать новую серию!'");
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		СпрХарактеристики	= Справочники.ХарактеристикиНоменклатуры;
		обСерия             = СпрХарактеристики.СоздатьЭлемент();
		обСерия.УстановитьНовыйКод();
		обСерия.Владелец            = ВладелецСерии;
		
		Если СтрокаМаркируемыйТовар.РежимЗагрузки = "Искать" Тогда
			обСерия.ор_МаркируемыйТовар = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(ТекстыЯчеек[НомерКолонкиМаркируемыйТовар],Новый ОписаниеТипов("Булево"));
		Иначе
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаМаркируемыйТовар.Выражение,?(СтрокаМаркируемыйТовар.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаМаркируемыйТовар.НомерКолонки]),ТекстыЯчеек, Ложь, СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_МаркируемыйТовар = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'Не удалось вычислить обязательные реквизиты, не можем сформировать новую серию!
				| <%1>'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если обСерия.ор_МаркируемыйТовар И Не ПолучитьФункциональнуюОпцию("ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов") Тогда
			обСерия.ор_МаркируемыйТовар = Ложь;
		КонецЕсли;
		
		Если обСерия.ор_МаркируемыйТовар Тогда
			// Если флаг был взведен для маркируемого товара ГИС МТ, то сбросим его.
			ЭтоТоварГосИС = ПолучитьФлагМаркируемогоТовараГосИС(ВладелецСерии);
			Если ЭтоТоварГосИС Тогда
				обСерия.ор_МаркируемыйТовар = Ложь;
			КонецЕсли;
			
			ЭтоТоварМДЛП = ор_ИнтеграцияМДЛП.ПолучитьФлагМаркируемогоТовара(ВладелецСерии);
			ЭтоМаркируемыйТовар = ЭтоТоварМДЛП Или ЭтоТоварГосИС;
			Если НЕ ЭтоМаркируемыйТовар Тогда
				ТекстСообщения = НСтр("ru= 'У владельца <%1> не включена маркировка. Серия %2 не создана!'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВладелецСерии, обСерия.ор_СерияПроизводителя);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				обСерия = Неопределено;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаСерии.РежимЗагрузки = "Искать" Тогда
			обСерия.ор_СерияПроизводителя = ТекстыЯчеек[НомерКолонкиСерия];
		Иначе
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаСерии.Выражение,?(СтрокаСерии.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаСерии.НомерКолонки]),ТекстыЯчеек,"", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_СерияПроизводителя = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось вычислить обязательные реквизиты, не можем сформировать новую серию!
				| %1'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Вычисление.ОписаниеОшибки); 
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаСрокГодности.РежимЗагрузки = "Искать" Тогда
			обСерия.ор_СрокГодности = ПолучитьДатуСрокаГодностиСерии(ТекстыЯчеек[НомерКолонкиСрокГодности], СтруктураПараметров.ФорматДатыСрокаГодности);
		Иначе // Если СтрокаСрокГодности.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаСрокГодности.Выражение,?(СтрокаСрокГодности.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаСрокГодности.НомерКолонки]),ТекстыЯчеек,'00010101', СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_СрокГодности = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'Не удалось вычислить обязательные реквизиты, не можем сформировать новую серию!
				| <%1>'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если обСерия.ор_СрокГодности = '00010101000000' Тогда
			ТекстСообщения = НСтр("ru= 'Не указан срок годности, для владельца <%1> серия %2 не создана!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВладелецСерии, обСерия.ор_СерияПроизводителя);
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			обСерия = Неопределено;
			Возврат Неопределено;
		ИначеЕсли обСерия.ор_СрокГодности < НачалоДня(ТекущаяДата()) Тогда
			ТекстСообщения = НСтр("ru= 'Срок годности <%1> истек: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВладелецСерии, Формат(обСерия.ор_СрокГодности,"ДФ=dd.MM.yyyy"));
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 2, СтруктураПараметровЛогирования);
			КонецЕсли;
			СтруктураПараметров.ЕстьНовыеПросроченныеСерии = Истина;
			Если ПроверятьСрокиГодности Тогда
				обСерия = Неопределено;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаСертификат.РежимЗагрузки = "Искать" Тогда
			Если ЗначениеЗаполнено(НомерКолонкиСертификат) Тогда
				обСерия.ор_СертификатСтрока= ТекстыЯчеек[НомерКолонкиСертификат];
			КонецЕсли;
		Иначе // Если СтрокаСертификат.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаСертификат.Выражение,?(СтрокаСертификат.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаСертификат.НомерКолонки]),ТекстыЯчеек,"", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_СертификатСтрока = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'При вычислении выражения
				| <%1>
				| Произошла ошибка: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаСертификат.Выражение, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаПроизводитель.РежимЗагрузки = "Искать" Тогда
			Если ЗначениеЗаполнено(НомерКолонкиПроизводитель) Тогда
				спрПроизводители = Справочники.ор_Производители;
				// Попробуем найти по наименованию
				Если ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиПроизводитель]) Тогда
					сПроизводитель     = спрПроизводители.НайтиПоНаименованию(СокрЛП(ТекстыЯчеек[НомерКолонкиПроизводитель]),Истина);
					Если НЕ сПроизводитель.Пустая() Тогда
						обСерия.ор_Производитель = сПроизводитель;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе // Если СтрокаПроизводитель.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаПроизводитель.Выражение,?(СтрокаПроизводитель.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаПроизводитель.НомерКолонки]),ТекстыЯчеек,Справочники.ор_Производители.ПустаяСсылка(), СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_Производитель = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'При вычислении выражения
				| %1
				| Произошла ошибка: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаПроизводитель.Выражение, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаСрокДействияСертификата.РежимЗагрузки = "Искать" Тогда
			Если ЗначениеЗаполнено(НомерКолонкиСрокДействияСертификата) Тогда
				обСерия.ор_СрокДействияСертификата = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКДате(
					ТекстыЯчеек[НомерКолонкиСрокДействияСертификата],
					Новый ОписаниеТипов("Дата"));
			КонецЕсли;
		Иначе
			Вычисление = ВычислитьЗначениеДляХарактеристики(
				СтрокаСрокДействияСертификата.Выражение,
				?(СтрокаСрокДействияСертификата.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаСрокДействияСертификата.НомерКолонки]),
				ТекстыЯчеек,
				'00010101',
				СтруктураПараметров.СсылкаИсточника,
				СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_СрокДействияСертификата = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'При вычислении выражения
				| <%1>
				| Произошла ошибка: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаСрокДействияСертификата.Выражение, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОрганВыдавшийСертификат.РежимЗагрузки = "Искать" Тогда
			Если ЗначениеЗаполнено(НомерКолонкиОрганВыдавшийСертификат) Тогда
				обСерия.ор_ОрганВыдавшийСертификат= ТекстыЯчеек[НомерКолонкиОрганВыдавшийСертификат];
			КонецЕсли;
		Иначе // Если СтрокаОрганВыдавшийСертификат.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаОрганВыдавшийСертификат.Выражение,?(СтрокаОрганВыдавшийСертификат.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаОрганВыдавшийСертификат.НомерКолонки]),ТекстыЯчеек,"", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_ОрганВыдавшийСертификат = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'При вычислении выражения
				| <%1>
				| Произошла ошибка: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаОрганВыдавшийСертификат.Выражение, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОрганЗарегистрировавшийДекларацию.РежимЗагрузки = "Искать" Тогда
			Если ЗначениеЗаполнено(НомерКолонкиОрганЗарегистрировавшийДекларацию) Тогда
				обСерия.ор_ОрганЗарегистрировавшийДекларацию= ТекстыЯчеек[НомерКолонкиОрганЗарегистрировавшийДекларацию];
			КонецЕсли;
		Иначе // Если СтрокаОрганЗарегистрировавшийДекларацию.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаОрганЗарегистрировавшийДекларацию.Выражение,?(СтрокаОрганЗарегистрировавшийДекларацию.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаОрганЗарегистрировавшийДекларацию.НомерКолонки]),ТекстыЯчеек,"", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_ОрганЗарегистрировавшийДекларацию = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'При вычислении выражения
				| <%1>
				| Произошла ошибка: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаОрганЗарегистрировавшийДекларацию.Выражение, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДекларант.РежимЗагрузки = "Искать" Тогда
			обСерия.ор_Декларант = ТекстыЯчеек[НомерКолонкиДекларант];
		Иначе // Если СтрокаДекларант.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаДекларант.Выражение,?(СтрокаДекларант.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаДекларант.НомерКолонки]),ТекстыЯчеек,"", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_Декларант = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось вычислить обязательные реквизиты, не можем сформировать новую серию!
				| %1'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Вычисление.ОписаниеОшибки); 
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		
		Если СтрокаСтранаПроисхождения.РежимЗагрузки = "Искать" Тогда
			Если ЗначениеЗаполнено(НомерКолонкиСтранаПроисхождения) Тогда
				спрСтраныМира = Справочники.СтраныМира;
				// Попробуем найти по наименованию
				Если ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиСтранаПроисхождения]) Тогда
					сСтранаПроисхождения = спрСтраныМира.НайтиПоНаименованию(СокрЛП(ТекстыЯчеек[НомерКолонкиСтранаПроисхождения]),Истина);
					Если НЕ сСтранаПроисхождения.Пустая() Тогда 
						обСерия.ор_СтранаПроисхождения = сСтранаПроисхождения;
					ИначеЕсли СтруктураПараметров.СоздаватьСтрануПроисхождения Тогда
						НаименованиеСтраны = ТекстыЯчеек[НомерКолонкиСтранаПроисхождения];
						НоваяСтрана = спрСтраныМира.СоздатьЭлемент();
						ДанныеКлассификатора = Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоНаименованию(ВРег(НаименованиеСтраны));
						Если ДанныеКлассификатора = Неопределено Тогда
							НоваяСтрана.Наименование = НаименованиеСтраны;
							НоваяСтрана.Код = "--";
						Иначе
							ЗаполнитьЗначенияСвойств(НоваяСтрана, ДанныеКлассификатора);
						КонецЕсли;
						НоваяСтрана.Записать();
						обСерия.ор_СтранаПроисхождения = НоваяСтрана.Ссылка;
						
						ТекстСообщения = НСтр("ru = 'Создан элемент справочника стран мира: %1'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,НаименованиеСтраны);
						Если СтруктураПараметровЛогирования = Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Иначе
							ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 3, СтруктураПараметровЛогирования);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе // Если СтрокаСтранаПроисхождения.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаСтранаПроисхождения.Выражение,?(СтрокаСтранаПроисхождения.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаСтранаПроисхождения.НомерКолонки]),ТекстыЯчеек,Справочники.СтраныМира.ПустаяСсылка(), СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.ор_СтранаПроисхождения = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'При вычислении выражения
				| %1
				| Произошла ошибка: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаСтранаПроисхождения.Выражение, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаНаименование.РежимЗагрузки = "Вычислять" Тогда
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаНаименование.Выражение,?(СтрокаНаименование.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаНаименование.НомерКолонки]),ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				обСерия.Наименование = Вычисление.Результат;
			Иначе
				ТекстСообщения = НСтр("ru= 'Не удалось вычислить наименование серии! Серия не сформирована!
				| <%1>'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Вычисление.ОписаниеОшибки);
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
				КонецЕсли;
				обСерия = Неопределено;
				Возврат Неопределено;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(НомерКолонкиНаименование) Тогда
			обСерия.Наименование = ТекстыЯчеек[НомерКолонкиНаименование];
		ИначеЕсли ДопНомерСерии = 0 ИЛИ НеФормироватьДопНомерСерии Тогда
			обСерия.Наименование = обСерия.ор_СерияПроизводителя+", "+Формат(обСерия.ор_СрокГодности, "ДФ=dd.MM.yyyy");
		Иначе
			обСерия.Наименование = обСерия.ор_СерияПроизводителя+" '"+ДопНомерСерии+"'"+", "+Формат(обСерия.ор_СрокГодности, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		обСерия.НаименованиеДляПечати = обСерия.Наименование;
		
		Если НЕ НеФормироватьДопНомерСерии Тогда
			// Теперь проверим, чтобы не было серий с таким наименованием
			НайдСерия = СпрХарактеристики.НайтиПоНаименованию(СокрЛП(обСерия.Наименование), Истина, ВладелецСерии);
			Если ЗначениеЗаполнено(НайдСерия) Тогда
				Сч = ?(ДопНомерСерии=0, 1, ДопНомерСерии);
				Пока Истина Цикл
					Если СтрокаНаименование.РежимЗагрузки = "Вычислять" ИЛИ (ЗначениеЗаполнено(НомерКолонкиНаименование) И  СтрокаНаименование.РежимЗагрузки = "Искать") Тогда
						НаименованиеСерии ="'"+Сч+"' "+обСерия.Наименование;
					Иначе
						НаименованиеСерии = обСерия.ор_СерияПроизводителя+" '"+Сч+"'"+", "+Формат(обСерия.ор_СрокГодности, "ДФ=dd.MM.yyyy");
					КонецЕсли;
					НайдСерия = СпрХарактеристики.НайтиПоНаименованию(НаименованиеСерии, Истина, ВладелецСерии);
					Если Не ЗначениеЗаполнено(НайдСерия) Тогда
						обСерия.Наименование = НаименованиеСерии;
						Прервать;
					КонецЕсли;
					Сч = Сч+1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаписатьОбъект(обСерия,СтруктураПараметров,,СтруктураПараметровЛогирования) Тогда
			ТекстСообщения = НСтр("ru= 'Сформирована новая серия <%1> владельца <%2>'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, обСерия,ВладелецСерии);
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 3, СтруктураПараметровЛогирования);
			КонецЕсли;
			
			// Сформируем штрихкод серии.
			Если ЗначениеЗаполнено(СтрокаШтрихКод) И СтрокаШтрихКод.РежимЗагрузки = "Искать" И ЗначениеЗаполнено(НомерКолонкиШтрихКод) И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиШтрихКод])Тогда
				ШтрихКодСерии = ТекстыЯчеек[НомерКолонкиШтрихКод];
			ИначеЕсли ЗначениеЗаполнено(СтрокаШтрихКод) И СтрокаШтрихКод.РежимЗагрузки = "Вычислять" Тогда
				Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаШтрихКод.Выражение,?(СтрокаШтрихКод.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаШтрихКод.НомерКолонки]),ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
				Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
					ШтрихКодСерии = Вычисление.Результат;
				Иначе
					ШтрихКодСерии = "";
				КонецЕсли;
			Иначе
				ШтрихКодСерии = "";
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("НоменклатураДляЗаписиШК") Тогда
				ЗарегистрироватьШтрихКод(ШтрихКодСерии,СтруктураПараметров.НоменклатураДляЗаписиШК,обСерия.Ссылка,Неопределено, СтруктураПараметровЛогирования);
			КонецЕсли;
			
			// Сформируем штрихкод серии 
			Если ЗначениеЗаполнено(СтрокаGTIN) И СтрокаGTIN.РежимЗагрузки = "Искать" И ЗначениеЗаполнено(НомерКолонкиGTIN) И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиGTIN])Тогда
				GTINСерии = ТекстыЯчеек[НомерКолонкиGTIN];
			ИначеЕсли ЗначениеЗаполнено(СтрокаGTIN) И СтрокаGTIN.РежимЗагрузки = "Вычислять" Тогда
				Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаGTIN.Выражение,?(СтрокаGTIN.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаGTIN.НомерКолонки]),ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
				Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
					GTINСерии = Вычисление.Результат;
				Иначе
					GTINСерии = "";
				КонецЕсли;
			Иначе
				GTINСерии = "";
			КонецЕсли;
			
			ДляХарактеристики = Ложь;
			Если СтруктураПараметров.Свойство("ЗагружатьGTINДляСерии") Тогда
				ДляХарактеристики = СтруктураПараметров.ЗагружатьGTINДляСерии;
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("НоменклатураДляЗаписиШК") И ЗначениеЗаполнено(GTINСерии) И обСерия.ор_МаркируемыйТовар Тогда
				Если ДляХарактеристики Тогда
					ЗарегистрироватьGTIN(GTINСерии, СтруктураПараметров.НоменклатураДляЗаписиШК, обСерия.Ссылка, СтруктураПараметровЛогирования);
				Иначе
					ЗарегистрироватьGTIN(GTINСерии, СтруктураПараметров.НоменклатураДляЗаписиШК, Неопределено, СтруктураПараметровЛогирования);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат обСерия.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Регистрирует GTIN в регистре сведений
//
Процедура ЗарегистрироватьGTIN(GTIN, Номенклатура, ХарактеристикаНоменклатуры, СтруктураПараметровЛогирования = Неопределено) Экспорт 
	
	Если ХарактеристикаНоменклатуры = Неопределено Тогда
		ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегШтрихкоды.Номенклатура КАК Номенклатура,
	|	РегШтрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК РегШтрихкоды
	|ГДЕ
	|	РегШтрихкоды.Штрихкод = &Штрихкод
	|	И РегШтрихкоды.Номенклатура = &Номенклатура
	|	И РегШтрихкоды.Характеристика = &Характеристика
	|");
	
	Запрос.УстановитьПараметр("Штрихкод", GTIN);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	ТекЗапись.Штрихкод       = GTIN;
	ТекЗапись.Номенклатура  = Номенклатура;
	ТекЗапись.Характеристика = ХарактеристикаНоменклатуры;
	
	Попытка
		ТекЗапись.Записать();
	Исключение
		ТекстОшибки = НСтр("ru= 'Ошибка при записи GTIN: %1'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ИнформацияОбОшибке().Описание);
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Иначе
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

// Регистрирует серию в регистре сведений
//
// Параметры:
//  ШтрихКод	       – Строка	– Строка штрих-кода.
//  Номенклатура	   – СправочникСсылка.Номенклатура	– номенклатура для которой формируем штрих-код.
//  Характеристика	   – СправочникСсылка.ХарактеристикиНоменклатуры – характеристика для которой формируем штрих-кода.
//  ЕдиницаИзмерения   – СправочникСсылка.ЕдиницыИзмерения	– единица измерения штрих-кода.
//
Процедура ЗарегистрироватьШтрихКод(ШтрихКод,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения, СтруктураПараметровЛогирования = Неопределено, СоздаватьНовыйШК = Истина) Экспорт 
	
	ТекЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	ТекЗапись.Номенклатура   = Номенклатура;
	ТекЗапись.Характеристика = ХарактеристикаНоменклатуры;
	
	Если НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
		ТекЗапись.Штрихкод               = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
	Иначе
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегШтрихкоды.Номенклатура КАК Номенклатура,
		|	РегШтрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК РегШтрихкоды
		|ГДЕ
		|	РегШтрихкоды.ШтрихКод = &ШтрихКод
		|");
		
		Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() ИЛИ Константы.ИспользоватьНеуникальныеШтрихкоды.Получить() Тогда
			ТекЗапись.Штрихкод = ШтрихКод;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если СоздаватьНовыйШК Тогда
				ТекстОшибки = НСтр("ru= 'Штрихкод %1 уже имеет владельца <%2>. Будет сформирован новый штрихкод.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.ШтрихКод, СокрЛП(Выборка.Номенклатура));
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 2, СтруктураПараметровЛогирования);
				КонецЕсли;
				ТекЗапись.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
			Иначе
				ТекстОшибки = НСтр("ru= 'Штрихкод %1 уже имеет владельца <%2>.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.ШтрихКод, СокрЛП(Выборка.Номенклатура));
				Если СтруктураПараметровЛогирования = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Иначе
					ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 2, СтруктураПараметровЛогирования);
				КонецЕсли;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ТекЗапись.Записать();
	Исключение
		ТекстОшибки = НСтр("ru= 'Ошибка при записи штрихкода: %1'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ИнформацияОбОшибке().Описание);
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Иначе
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

// Получить дату в формате
//
Функция ПолучитьДатуСрокаГодностиСерии(СтрокаДаты, ФорматДатыСрокаГодности) Экспорт
	
	Если НЕ ПустаяСтрока(СтрокаДаты) Тогда
		Попытка
			СтрокаДаты = СокрЛП(СтрЗаменить(СтрокаДаты,",","."));
			Если ФорматДатыСрокаГодности = "дд.мм.гггг" Тогда
				Если СтрДлина(СтрокаДаты) = 10 Тогда
					Возврат Дата(СтрокаДаты+" 00:00:00");
				Иначе
					Возврат Дата(СтрокаДаты);  
				КонецЕсли;
			ИначеЕсли ФорматДатыСрокаГодности = "ддммгггг" Тогда
				Возврат Дата(Прав(СтрокаДаты,4)+Сред(СтрокаДаты,3,2)+Лев(СтрокаДаты,2)+"000000");
			ИначеЕсли ФорматДатыСрокаГодности = "дд.мм.гг" Тогда
				Возврат Дата("20"+Прав(СтрокаДаты,2)+Сред(СтрокаДаты,4,2)+Лев(СтрокаДаты,2)+"000000")
			ИначеЕсли ФорматДатыСрокаГодности = "ггггммдд" Тогда
				Возврат Дата(СтрокаДаты+"000000");
			ИначеЕсли ФорматДатыСрокаГодности = "гггг.мм.дд" Тогда
				Возврат Дата(Лев(СтрокаДаты,4)+Сред(СтрокаДаты,6,2)+Прав(СтрокаДаты,2)+"000000");
			ИначеЕсли ФорматДатыСрокаГодности = "мм.гггг" Тогда
				Возврат Дата(Прав(СтрокаДаты,4)+Лев(СтрокаДаты,2)+"01"+"000000"); 
			ИначеЕсли ФорматДатыСрокаГодности = "ммгггг" Тогда
				Возврат Дата(Прав(СтрокаДаты,4)+Лев(СтрокаДаты,2)+"01"+"000000"); 
			ИначеЕсли ФорматДатыСрокаГодности = "гггг.мм" Тогда
				Возврат Дата(Лев(СтрокаДаты,4)+Прав(СтрокаДаты,2)+"01"+"000000"); 
			ИначеЕсли ФорматДатыСрокаГодности = "ггггмм" Тогда
				Возврат Дата(СтрокаДаты+"01"+"000000");
			ИначеЕсли ФорматДатыСрокаГодности = "мм.гг" Тогда
				Возврат Дата("01."+Лев(СтрокаДаты,2)+".20"+Прав(СтрокаДаты,2)+" 00:00:00");
			Иначе
				Возврат Дата(СтрокаДаты);
			КонецЕсли;
		Исключение
			Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКДате(СтрокаДаты, Новый ОписаниеТипов("Дата"));
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

// Процедура проверки новых просроченных серии
//
Процедура ПроверитьНовыеПросроченныеСерии(ОбъектИсточника, СтруктураПараметров, СтруктураПараметровЛогирования = Неопределено) Экспорт
	Если (СтруктураПараметров.ЕстьНовыеПросроченныеСерии ИЛИ СтруктураПараметров.ПодобранаПросроченнаяСерия) и (СтруктураПараметров.РежимЗагрузки = 1 ИЛИ (СтруктураПараметров.РежимЗагрузки = 3 И ПустаяСтрока(СтруктураПараметров.ИмяСправочника) И ПустаяСтрока(СтруктураПараметров.ИмяВидаРегистра))) Тогда
		Если СтруктураПараметров.ПроверятьСрокиГодности Тогда
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "В процессе загрузки документа в загружаемом файле обнаружены просроченные серии. Табличная часть документа очищена." + Символы.ПС;
			Если СтруктураПараметров.РежимЗагрузки = 3 Тогда
				СтруктураПараметров.ТЧДокумента.Очистить();
			Иначе
				ОбъектИсточника[СтруктураПараметров.ТабличнаяЧастьИсточника].Очистить();
			КонецЕсли;
		Иначе
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "В процессе загрузки документа в загружаемом файле обнаружены просроченные серии." + Символы.ПС;
		КонецЕсли;
		
		Если СтруктураПараметровЛогирования = Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибок);
		Иначе
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(СтруктураПараметров.ОписаниеОшибок, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Процедура добавляет в описание ошибок строку о загрузке справочника
//
Процедура ДобавитьВОписаниеОшибокСтрокуОЗагрузкеСправочника(СтруктураПараметров, ТекстВопросаИсточника, Загружено, КоличествоЭлементов, Сообщать = Истина, СтруктураПараметровЛогирования = Неопределено) Экспорт
	Если НЕ ((СтруктураПараметров.ЕстьНовыеПросроченныеСерии ИЛИ СтруктураПараметров.ПодобранаПросроченнаяСерия)И СтруктураПараметров.ПроверятьСрокиГодности) Тогда
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Выполняется загрузка"+ 	ТекстВопросаИсточника + Символы.ПС;
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "" +Загружено +" из "+ КоличествоЭлементов + " элементов." + Символы.ПС;
		Если Сообщать Тогда
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибок);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(СтруктураПараметров.ОписаниеОшибок, 3, СтруктураПараметровЛогирования);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Функция получения параметров по версии обработки для справочника настроек
//
Функция ПолучитьПараметрыПоВерсииОбработкиДляСправочникаНастроек(ВерсияОбработки, Настройки) Экспорт
	
	ВозвращаемыеПараметры = Новый Структура;
	// Строка с которой начинается таблица реквизитов
	ВозвращаемыеПараметры.Вставить("НаименованиеТовара", 	Настройки.Область("R32C5").Текст);
	ВозвращаемыеПараметры.Вставить("Цена", 					Настройки.Область("R38C5").Текст);
	ВозвращаемыеПараметры.Вставить("СтранаПроисхождения",	Настройки.Область("R53C5").Текст);
	ВозвращаемыеПараметры.Вставить("Табуляция", Настройки.Область("R16C5").Текст);
	
	ТекущаяСтрока = 89;
	ТекущаяСтрокаШапка = 100;
	
	ВозвращаемыеПараметры.Вставить("ТекущаяСтрока", 								ТекущаяСтрока);
	ВозвращаемыеПараметры.Вставить("ТекущаяСтрокаШапка", 							ТекущаяСтрокаШапка);
	ВозвращаемыеПараметры.Вставить("НеСоздаватьНовыхЭлементов", 					НЕ ПустаяСтрока(Настройки.Область("R4C5").Текст));
	ВозвращаемыеПараметры.Вставить("ЗапретОбновленияСуществующихЭлементов",			НЕ ПустаяСтрока(Настройки.Область("R5C5").Текст));
	ВозвращаемыеПараметры.Вставить("флПоискПоПрайсуПоставщика",						НЕ ПустаяСтрока(Настройки.Область("R15C5").Текст));
	ВозвращаемыеПараметры.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",		НЕ ПустаяСтрока(Настройки.Область("R7C5").Текст));
	ВозвращаемыеПараметры.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", НЕ ПустаяСтрока(Настройки.Область("R22C5").Текст));
	ВозвращаемыеПараметры.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", НЕ ПустаяСтрока(Настройки.Область("R17C5").Текст));
	ВозвращаемыеПараметры.Вставить("ИдентификаторОбработкиЗагрузкиИзXML",          Настройки.Область("R18C5").Текст);
	
	ВозвращаемыеПараметры.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера. ПривестиКЧислу(Настройки.Область("R8C5").Текст));
	ВозвращаемыеПараметры.Вставить("ПерваяСтрокаДанныхШапки",               ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область("R23C5").Текст));
	ВозвращаемыеПараметры.Вставить("ДействиеСЗагружаемымФайлом",            Настройки.Область("R9C5").Текст);
	ВозвращаемыеПараметры.Вставить("КаталогАрхиваЗагруженныхФайлов",        Настройки.Область("R10C5").Текст);
	ВозвращаемыеПараметры.Вставить("Производитель",                         Настройки.Область("R11C5").Текст);
	ВозвращаемыеПараметры.Вставить("ШтрихКод",                              Настройки.Область("R12C5").Текст);
	
	ВозвращаемыеПараметры.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры", НЕ ПустаяСтрока(Настройки.Область("R26C5").Текст));
	ВозвращаемыеПараметры.Вставить("СоздаватьОбщиеХарактеристики",      НЕ ПустаяСтрока(Настройки.Область("R30C5").Текст));
	
	// ++ Отраслевые аптечные флаги.
	ВозвращаемыеПараметры.Вставить("ФорматДатыСрокаГодности",      Настройки.Область("R45C5").Текст);
	ВозвращаемыеПараметры.Вставить("ВсегдаФормироватьНовыеСерии",  НЕ ПустаяСтрока(Настройки.Область("R41C5").Текст));
	ВозвращаемыеПараметры.Вставить("СоздаватьСтрануПроисхождения", НЕ ПустаяСтрока(Настройки.Область("R52C5").Текст));
	ВозвращаемыеПараметры.Вставить("СоздаватьПроизводителя",       НЕ ПустаяСтрока(Настройки.Область("R49C5").Текст));
	ВозвращаемыеПараметры.Вставить("НеФормироватьДопНомерСерии",   НЕ ПустаяСтрока(Настройки.Область("R59C5").Текст));
	ВозвращаемыеПараметры.Вставить("ЗагружатьШК",                  НЕ ПустаяСтрока(Настройки.Область("R60C5").Текст));
	ВозвращаемыеПараметры.Вставить("НомерСерииПроизводителя",      Настройки.Область("R42C5").Текст);
	ВозвращаемыеПараметры.Вставить("СрокГодности",                 Настройки.Область("R46C5").Текст);
	ВозвращаемыеПараметры.Вставить("Сертификат",                   Настройки.Область("R56C5").Текст);
	
	ВозвращаемыеПараметры.Вставить("СрокДействияСертификата",   Настройки.Область("R61C5").Текст);
	ВозвращаемыеПараметры.Вставить("ОрганВыдавшийСертификат",   Настройки.Область("R64C5").Текст);
	ВозвращаемыеПараметры.Вставить("ДекларациюЗарегистрировал", Настройки.Область("R67C5").Текст);
	ВозвращаемыеПараметры.Вставить("Декларант",                 Настройки.Область("R70C5").Текст);
	
	ВозвращаемыеПараметры.Вставить("МаркируемыйТовар",      Настройки.Область("R73C5").Текст);
	ВозвращаемыеПараметры.Вставить("GTIN",                  Настройки.Область("R76C5").Текст);
	ВозвращаемыеПараметры.Вставить("ЗагружатьGTINДляСерии", НЕ ПустаяСтрока(Настройки.Область("R79C5").Текст));
	// -- Отраслевые аптечные флаги.
	
	ВозвращаемыеПараметры.Вставить("Кодировка",  Настройки.Область("R13C5").Текст);
	ВозвращаемыеПараметры.Вставить("ИмяТаблицы", Настройки.Область("R14C5").Текст);
	ВозвращаемыеПараметры.Вставить("КоличествоНеОбрабатываемыхСтрок", ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область("R29C5").Текст));
	
	ВозвращаемыеПараметры.Вставить("ЗагружатьДополнительныеРеквизитыИСведения", НЕ ПустаяСтрока(Настройки.Область("R19C5").Текст));
	ВозвращаемыеПараметры.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие", НЕ ПустаяСтрока(Настройки.Область("R20C5").Текст));
	ВозвращаемаяКатегорияНоменклатуры = Настройки.Область("R21C5").Текст;
	Если Не ПустаяСтрока(ВозвращаемаяКатегорияНоменклатуры) Тогда
		Попытка
			КатегорияНоменклатурыЗначение = ЗначениеИзСтрокиВнутр(ВозвращаемаяКатегорияНоменклатуры);
		Исключение
			КатегорияНоменклатурыЗначение = Неопределено;
		КонецПопытки;
	Иначе
		КатегорияНоменклатурыЗначение = Неопределено;
	КонецЕсли;
	ВозвращаемыеПараметры.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек", КатегорияНоменклатурыЗначение);
	Возврат ВозвращаемыеПараметры;
	
КонецФункции

// Функция получения параметров по версии обработки
//
Функция ПолучитьПараметрыПоВерсииОбработки(ВерсияОбработки, Настройки) Экспорт
	
	ВозвращаемыеПараметры = Новый Структура;
	ТекущаяСтрока = 89;
	ТекущаяСтрокаШапка = 100;
	
	ВозвращаемыеПараметры.Вставить("ТекущаяСтрока",                             ТекущаяСтрока);
	ВозвращаемыеПараметры.Вставить("ТекущаяСтрокаШапка",                        ТекущаяСтрокаШапка);
	ВозвращаемыеПараметры.Вставить("НеСоздаватьНовыхЭлементов",                 НЕ ПустаяСтрока(Настройки.Область("R4C5").Текст));
	ВозвращаемыеПараметры.Вставить("НеОбновлятьСуществующиеЭлементы",           НЕ ПустаяСтрока(Настройки.Область("R5C5").Текст));
	ВозвращаемыеПараметры.Вставить("ЗамещатьСуществующиеЗаписи",                НЕ ПустаяСтрока(Настройки.Область("R6C5").Текст));
	ВозвращаемыеПараметры.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", НЕ ПустаяСтрока(Настройки.Область("R7C5").Текст));
	ВозвращаемыеПараметры.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",     ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область("R8C5").Текст));
	ВозвращаемыеПараметры.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", НЕ ПустаяСтрока(Настройки.Область("R22C5").Текст));
	ВозвращаемыеПараметры.Вставить("ПерваяСтрокаДанныхШапки",                           ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область("R23C5").Текст));
	
	ВозвращаемыеПараметры.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры", НЕ ПустаяСтрока(Настройки.Область("R26C5").Текст));
	ВозвращаемыеПараметры.Вставить("СоздаватьОбщиеХарактеристики",      НЕ ПустаяСтрока(Настройки.Область("R30C5").Текст));
	
	ВозвращаемыеПараметры.Вставить("флПоискПоПрайсуПоставщика",      НЕ ПустаяСтрока(Настройки.Область("R15C5").Текст));
	ВозвращаемыеПараметры.Вставить("ДействиеСЗагружаемымФайлом",     Настройки.Область("R9C5").Текст);
	ВозвращаемыеПараметры.Вставить("КаталогАрхиваЗагруженныхФайлов", Настройки.Область("R10C5").Текст);
	ВозвращаемыеПараметры.Вставить("Табуляция",                      Настройки.Область("R16C5").Текст);
	
	ВозвращаемыеПараметры.Вставить("ФорматДатыСрокаГодности",      Настройки.Область("R45C5").Текст);
	ВозвращаемыеПараметры.Вставить("ВсегдаФормироватьНовыеСерии",  НЕ ПустаяСтрока(Настройки.Область("R41C5").Текст));
	ВозвращаемыеПараметры.Вставить("СоздаватьСтрануПроисхождения", НЕ ПустаяСтрока(Настройки.Область("R52C5").Текст));
	ВозвращаемыеПараметры.Вставить("НеФормироватьДопНомерСерии",   НЕ ПустаяСтрока(Настройки.Область("R59C5").Текст));
	ВозвращаемыеПараметры.Вставить("ЗагружатьШК",                  НЕ ПустаяСтрока(Настройки.Область("R60C5").Текст));
	ВозвращаемыеПараметры.Вставить("СоздаватьПроизводителя",       НЕ ПустаяСтрока(Настройки.Область("R49C5").Текст));
	ВозвращаемыеПараметры.Вставить("ЗагружатьGTINДляСерии",        НЕ ПустаяСтрока(Настройки.Область("R79C5").Текст));
	
	ВозвращаемыеПараметры.Вставить("Кодировка", Настройки.Область("R13C5").Текст);
	ВозвращаемыеПараметры.Вставить("ИмяТаблицы", Настройки.Область("R14C5").Текст);
	
	ИспользоватьВнешнийМодульПреобразованияФайла = Ложь;
	ОбработкаПреобразования = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	ИспользоватьВнешнийМодульПреобразованияФайла = НЕ ПустаяСтрока(Настройки.Область("R17C5").Текст);
	ИдентификаторОбработкиЗагрузки = Настройки.Область("R18C5").Текст; 
	Попытка
		ОбработкаПреобразования = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторОбработкиЗагрузки));
	Исключение
	КонецПопытки;
	
	ВозвращаемыеПараметры.Вставить("КоличествоНеОбрабатываемыхСтрок", ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область("R29C5").Текст));
	
	ВозвращаемыеПараметры.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", ИспользоватьВнешнийМодульПреобразованияФайла);
	ВозвращаемыеПараметры.Вставить("ОбработкаПреобразования", ОбработкаПреобразования);
	
	ВозвращаемыеПараметры.Вставить("ЗагружатьДополнительныеРеквизитыИСведения", НЕ ПустаяСтрока(Настройки.Область("R19C5").Текст));
	ВозвращаемыеПараметры.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие", НЕ ПустаяСтрока(Настройки.Область("R20C5").Текст));
	ВозвращаемаяКатегорияНоменклатуры = Настройки.Область("R21C5").Текст;
	Если Не ПустаяСтрока(ВозвращаемаяКатегорияНоменклатуры) Тогда
		Попытка
			КатегорияНоменклатурыЗначение = ЗначениеИзСтрокиВнутр(ВозвращаемаяКатегорияНоменклатуры);
		Исключение
			КатегорияНоменклатурыЗначение = Неопределено;
		КонецПопытки;
	Иначе
		КатегорияНоменклатурыЗначение = Неопределено;
	КонецЕсли;
	ВозвращаемыеПараметры.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек", КатегорияНоменклатурыЗначение);
	
	Возврат ВозвращаемыеПараметры;

КонецФункции

// Процедура дополняет структуру параметров создания табличного документа отраслевыми свойствами при заполнении 
// табличного документа из настроек.
//
Процедура ДополнитьСтруктуруПараметровЗаполнитьТабличныйДокументИзНастроек(СтруктураПараметров, ЭтаФорма) Экспорт
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности", 		ЭтаФорма.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",		ЭтаФорма.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",    ЭтаФорма.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("НеФормироватьДопНомерСерии",      ЭтаФорма.НеФормироватьДопНомерСерии);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",          ЭтаФорма.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("ЗагружатьШК",                     ЭтаФорма.ЗагружатьШК);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",           ЭтаФорма.ЗагружатьGTINДляСерии);
	СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров", ЭтаФорма.ТаблицаДополнительныхПараметров);
	СтруктураПараметров.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры", ЭтаФорма.ШКЯвляетсяПолемПоискаНоменклатуры);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики", ЭтаФорма.СоздаватьОбщиеХарактеристики);
КонецПроцедуры

// Процедура дополняет структуру параметров создания табличного документа отраслевыми свойствами при заполнении 
// табличного документа из настроек в форме помощника.
//
Процедура ДополнитьСтруктуруПараметровЗаполнитьТабличныйДокументИзНастроекПомощника(СтруктураПараметров, Объект, ТаблицаДополнительныхПараметров) Экспорт
	
	СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров",   ТаблицаДополнительныхПараметров);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики",      Объект.СоздаватьОбщиеХарактеристики);
	
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",      Объект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",  Объект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения", Объект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("НеФормироватьДопНомерСерии",   Объект.НеФормироватьДопНомерСерии);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",       Объект.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("ЗагружатьШК",                  Объект.ЗагружатьШК);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",        Объект.ЗагружатьGTINДляСерии);
	
КонецПроцедуры

// Процедура устанавливает дополнительные параметры загрузки.
//
Процедура УстановитьДополнительныеПараметрыЗагрузки(Результат, Объект = Неопределено) Экспорт
	Если Объект<>Неопределено Тогда
		Объект.ВсегдаФормироватьНовыеСерии     = Результат.ВсегдаФормироватьНовыеСерии;
		Объект.СоздаватьПроизводителя          = Результат.СоздаватьПроизводителя;
		Объект.ФорматДатыСрокаГодности         = Результат.ФорматДатыСрокаГодности;
		Объект.НеФормироватьДопНомерСерии      = Результат.НеФормироватьДопНомерСерии;
		Объект.СоздаватьСтрануПроисхождения    = Результат.СоздаватьСтрануПроисхождения;
		Объект.ЗагружатьGTINДляСерии           = Результат.ЗагружатьGTINДляСерии;
	КонецЕсли;
КонецПроцедуры

// Процедура устанавливает формат даты срока годности серий по умолчанию.
//
Процедура УстановитьФорматДатыСрокаГодностиСерийПоУмолчанию(ЭтаФорма) Экспорт
	ЭтаФорма.ФорматДатыСрокаГодности = "дд.мм.гггг";
КонецПроцедуры

// Процедура устанавливает текущую группу справочника.
//
Процедура УстановитьТекущуюГруппуСправочника(Параметры, Список) Экспорт
	Если Параметры.ПараметрОтборПоВариантуИспользования = Перечисления.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Список.ТекущийРодитель = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекВыгрузки;
		
	// ++ Отраслевое аптечное.
	ИначеЕсли Параметры.ПараметрОтборПоВариантуИспользования = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных 
		И Параметры.Свойство("ПараметрОтборПоМетаданным") 
		И Параметры.ПараметрОтборПоМетаданным = "РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП" Тогда
		
		Список.ТекущийРодитель = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекЗагрузкиРеестрЦенЖНВЛС;
	// -- Отраслевое аптечное.
	
	ИначеЕсли Параметры.ПараметрОтборПоВариантуИспользования = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Список.ТекущийРодитель = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекЗагрузки;
	КонецЕсли;
КонецПроцедуры

// Процедура устанавливает надпись "ТекстВыражения".
//
Процедура УстановитьНадписьТекстВыражения(Параметры, НадписьТекстВыражения) Экспорт
	
	Если Параметры.Свойство("ОткрытьДляРедактированияДопРеквизитов") Тогда
		НадписьТекстВыражения =
		НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные параметры:
		|   Результат      - результат вычисления (на входе пустая строка)
		|   ТекстыЯчеек    - массив текстов ячеек строки
		|   ТекстЯчейки    - текст текущей ячейки
		|   СсылкаИсточника - документ для загрузки данных
		|Встроенные функции, функции общих модулей.'");
	Иначе
		НадписьТекстВыражения =
		НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные параметры:
		|   Результат      - результат вычисления (на входе - значение по умолчанию)
		|   ТекстЯчейки    - текст текущей ячейки
		|   ТекстыЯчеек    - массив текстов ячеек строки
		|   ТекущиеДанные  - структура загруженных значений
		|   флКонтрольЗаполнения - флаг запрета создания новых элементов
		|   ДокументОбъект - документ для загрузки данных
		|Встроенные функции, функции общих модулей.'");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет настройки колонок по умолчанию для табличной части дополнительных параметров
//
Процедура ЗаполнитьНастройкиКолонокТабличнойЧастиДополнительныхПараметров(СтруктураПараметров, ТаблицаСтарыхЗнач=Неопределено) Экспорт
	
	СтруктураПараметров.ТаблицаДополнительныхПараметров.Очистить();
	
	Если СтруктураПараметров.ТаблицаДополнительныхПараметров.Колонки.Количество()=0 Тогда
		СтруктураПараметров.ТаблицаДополнительныхПараметров.Колонки.Добавить("ИмяРеквизита",  Новый ОписаниеТипов("Строка"));
		СтруктураПараметров.ТаблицаДополнительныхПараметров.Колонки.Добавить("НомерКолонки",  Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
		СтруктураПараметров.ТаблицаДополнительныхПараметров.Колонки.Добавить("РежимЗагрузки", Новый ОписаниеТипов("Строка"));
		СтруктураПараметров.ТаблицаДополнительныхПараметров.Колонки.Добавить("Выражение",     Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Номер серии производителя";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Срок годности";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Сертификат";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Производитель";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "ШтрихКод";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Наименование характеристики";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Наименование товара";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Цена";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Страна происхождения";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Орган выдавший сертификат";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Срок действия сертификата";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Декларацию зарегистрировал";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Декларант";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "Маркируемый товар";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	ЗагружаемыйРеквизит                     = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита        = "GTIN";
	ЗагружаемыйРеквизит.НомерКолонки        = 0;
	ЗагружаемыйРеквизит.РежимЗагрузки       = "Искать";
	
	Если НЕ ТаблицаСтарыхЗнач=Неопределено Тогда
		Для Каждого СтрокаТаблДопПар Из СтруктураПараметров.ТаблицаДополнительныхПараметров Цикл
			НайденнаяСтрока = ТаблицаСтарыхЗнач.Найти(СтрокаТаблДопПар.ИмяРеквизита);
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				СтрокаТаблДопПар.НомерКолонки  = НайденнаяСтрока.НомерКолонки;
				СтрокаТаблДопПар.РежимЗагрузки = НайденнаяСтрока.РежимЗагрузки;
				СтрокаТаблДопПар.Выражение     = НайденнаяСтрока.Выражение;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблДопПар.РежимЗагрузки) Тогда
					СтрокаТаблДопПар.РежимЗагрузки = "Искать";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	// ЗаполнитьНастройкиКолонокТабличнойЧастиДополнительныхПараметров()

// Процедура дополняет параметры по срокам годности при загрузке.
//
Процедура ДополнитьПараметрыПоСрокамГодностиПриЗагрузке(СтруктураПараметров) Экспорт
	
	Попытка
		ПроверятьСрокиГодности = НЕ Пользователи.РолиДоступны("ор_ПравоРазрешитьЗаписьДокументовСодержащихМедикаментыСИстекшимСрокомГодности", Пользователи.ТекущийПользователь());
	Исключение
		ПроверятьСрокиГодности = Ложь;
	КонецПопытки;
	
	СтруктураПараметров.Вставить("ПроверятьСрокиГодности",     ПроверятьСрокиГодности);
	СтруктураПараметров.Вставить("ЕстьНовыеПросроченныеСерии", Ложь);
	СтруктураПараметров.Вставить("ПодобранаПросроченнаяСерия", Ложь);
	
КонецПроцедуры

// Процедура расширяет до максимальной колонки с учетом таблицы дополнительных параметров.
//
Процедура РасширитьДоМаксимальнойКолонкиСУчетомТаблицыДопПараметров(СтруктураПараметров,МаксимальныНомерКолонки) Экспорт
	Попытка
		// Таблица серий не обязательна к заполнению справочников и регистров сведений.
		Для каждого Строка Из СтруктураПараметров.ТаблицаДополнительныхПараметров Цикл
			Если МаксимальныНомерКолонки < Строка.НомерКолонки Тогда
				МаксимальныНомерКолонки = Строка.НомерКолонки;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

// Процедура проверки возможности продолжения операции с учетом проверки на просроченность серий.
//
Функция НадоПрерватьОперациюИзЗаПросроченныхСерий(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.ЕстьНовыеПросроченныеСерии И СтруктураПараметров.ПроверятьСрокиГодности Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция проверки наличия колонки наименования в табличном документе
//
Функция НомерКолонкиНаименованияНеНайден(СтруктураПараметров, НомерКолонкиНаименованиеТабличногоДокумента) Экспорт
	НомерКолонкиНеНайден = Ложь;
	
	Если СтруктураПараметров.Свойство("ТаблицаДополнительныхПараметров") Тогда
		СтрокаНастройки = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Наименование товара","ИмяРеквизита");
		Если СтрокаНастройки = Неопределено Тогда
			НомерКолонкиНеНайден = Истина;
		ИначеЕсли СтрокаНастройки.РежимЗагрузки = "Вычислять" Тогда
		Иначе
			Если СтрокаНастройки.НомерКолонки = 0 Тогда
				НомерКолонкиНеНайден = Истина; 
			Иначе
				НомерКолонкиНаименованиеТабличногоДокумента = СтрокаНастройки.НомерКолонки;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НомерКолонкиНаименованиеТабличногоДокумента = 0 Тогда
		НомерКолонкиНеНайден = Истина;
	КонецЕсли;
	
	Возврат НомерКолонкиНеНайден;
	
КонецФункции

// Функция получения структуры отраслевых дополнительных параметров
//
Функция ПолучитьСтруктуруОтраслевыхДопПараметров(СтруктураПараметров) Экспорт
	
	СтруктураДопПараметров = Новый Структура();
	СтрСтавкаНДС = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Найти("СтавкаНДС","ИмяРеквизита");
	Если НЕ СтрСтавкаНДС = Неопределено И СтрСтавкаНДС.Пометка Тогда
		НомерКолонкиСтавкаНДС = СтрСтавкаНДС.НомерКолонки;
	Иначе
		НомерКолонкиСтавкаНДС = 0;
	КонецЕсли;
	СтруктураДопПараметров.Вставить("СтрСтавкаНДС", СтрСтавкаНДС);
	СтруктураДопПараметров.Вставить("НомерКолонкиСтавкаНДС", НомерКолонкиСтавкаНДС);
	
	СтрВидСтавкиНДС = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Найти("ВидСтавкиНДС","ИмяРеквизита");
	Если НЕ СтрВидСтавкиНДС = Неопределено И СтрВидСтавкиНДС.Пометка Тогда
		НомерКолонкиВидСтавкиНДС = СтрВидСтавкиНДС.НомерКолонки;
	Иначе
		НомерКолонкиВидСтавкиНДС = 0;
	КонецЕсли;
	СтруктураДопПараметров.Вставить("СтрВидСтавкиНДС", СтрВидСтавкиНДС);
	СтруктураДопПараметров.Вставить("НомерКолонкиВидСтавкиНДС", НомерКолонкиВидСтавкиНДС);
	
	Попытка
		СтрШтрихкод = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("ШтрихКод","ИмяРеквизита");
	Исключение
		СтрШтрихкод = Неопределено;
	КонецПопытки;
	Если НЕ СтрШтрихкод = Неопределено Тогда
		НомерКолонкиШтрихкод = СтрШтрихкод.НомерКолонки;
	Иначе
		НомерКолонкиШтрихкод = 0;
	КонецЕсли;
	СтруктураДопПараметров.Вставить("СтрШтрихкод", СтрШтрихкод);
	СтруктураДопПараметров.Вставить("НомерКолонкиШтрихкод", НомерКолонкиШтрихкод);
	
	Попытка
		СтрСтранаПроисхождения = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Страна происхождения","ИмяРеквизита");
	Исключение
		СтрСтранаПроисхождения = Неопределено;
	КонецПопытки;
	Если НЕ СтрСтранаПроисхождения = Неопределено Тогда
		НомерКолонкиСтранаПроисхождения = СтрСтранаПроисхождения.НомерКолонки;
	Иначе
		НомерКолонкиСтранаПроисхождения = 0;
	КонецЕсли;
	СтруктураДопПараметров.Вставить("СтрСтранаПроисхождения", СтрСтранаПроисхождения);
	СтруктураДопПараметров.Вставить("НомерКолонкиСтранаПроисхождения", НомерКолонкиСтранаПроисхождения);
	
	Попытка
		СтрПроизводитель = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Производитель","ИмяРеквизита");
	Исключение
		СтрПроизводитель = Неопределено;
	КонецПопытки;
	Если НЕ СтрПроизводитель = Неопределено Тогда
		НомерКолонкиПроизводитель = СтрПроизводитель.НомерКолонки;
	Иначе
		НомерКолонкиПроизводитель = 0;
	КонецЕсли;
	СтруктураДопПараметров.Вставить("СтрПроизводитель", СтрПроизводитель);
	СтруктураДопПараметров.Вставить("НомерКолонкиПроизводитель", НомерКолонкиПроизводитель);
	
	Возврат СтруктураДопПараметров;
	
Конецфункции

// Функция получения наименования для таблицы соответствий
//
Функция ПолучитьНаименованиеДляТаблицыСоответствия(СтруктураПараметров,ТабличныйДокумент, ТекстыЯчеек, НомерКолонкиНаименованиеТабличногоДокумента, Строка, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Наименование = "";
	
	СтрокаНастройки = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Наименование товара", "ИмяРеквизита");
	Если СтрокаНастройки.РежимЗагрузки = "Искать" Тогда
		Наименование = СокрЛП(ТабличныйДокумент.Область("R"+Формат(Строка,"ЧГ=")+"C"+Формат(СтрокаНастройки.НомерКолонки,"ЧГ=")).Текст);
	Иначе
		Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаНастройки.Выражение,?(СтрокаНастройки.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаНастройки.НомерКолонки]),ТекстыЯчеек,"", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			Наименование = Вычисление.Результат;
		Иначе
			ТекстСообщения = НСтр("ru = 'При вычислении выражения: %1
			| Произошла ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрокаНастройки.Выражение,Вычисление.ОписаниеОшибки);
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Наименование = "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

// Процедура заполняет строку таблицы соответствия по дополнительным параметрам
//
Процедура ЗаполнитьСтрокуТаблицыСоответствияПоДопПараметрам(СтруктураПараметров, НоваяСтрокаТаблСоответсвия,СтруктураОтраслевыхДополнительныхПараметров, ТабличныйДокумент, НомерСтроки, ТекстыЯчеек, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ВидСтавкиНДС = "";
	// Заполняем ставку НДС
	Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("НомерКолонкиСтавкаНДС") И СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиСтавкаНДС>0 Тогда
		Попытка
			СтавкаНДС = Число(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиСтавкаНДС,"ЧГ=")).Текст));
		Исключение
			СтавкаНДС = "";
		КонецПопытки;
		ВидСтавкиНДС = СтавкаНДС;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаТаблСоответсвия, "СтавкаНДС") Тогда
			Если СтавкаНДС = 0 Тогда
				НоваяСтрокаТаблСоответсвия.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.БезНДС);
			ИначеЕсли СтавкаНДС = 10 Тогда
				НоваяСтрокаТаблСоответсвия.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная);
			ИначеЕсли СтавкаНДС = 18 Тогда
				НоваяСтрокаТаблСоответсвия.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая);
			ИначеЕсли СтавкаНДС = 20 Тогда
				НоваяСтрокаТаблСоответсвия.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая);
			Иначе
				НоваяСтрокаТаблСоответсвия.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("НомерКолонкиВидСтавкиНДС") И СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиВидСтавкиНДС>0 Тогда
		Попытка
			ВидСтавкиНДС = Число(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиВидСтавкиНДС,"ЧГ=")).Текст));
		Исключение
			ВидСтавкиНДС = "";
		КонецПопытки;
	КонецЕсли;
	
	Если ВидСтавкиНДС <> "" И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаТаблСоответсвия, "ВидСтавкиНДС") Тогда
		Если ВидСтавкиНДС = 0 Тогда
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС;
		ИначеЕсли ВидСтавкиНДС = 10 Тогда
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Пониженная;
		ИначеЕсли ВидСтавкиНДС = 18 Тогда
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
		ИначеЕсли ВидСтавкиНДС = 20 Тогда
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
		ИначеЕсли ВидСтавкиНДС = 5 Тогда
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПониженнаяУСН;
		ИначеЕсли ВидСтавкиНДС = 7 Тогда
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяУСН;
		Иначе
			НоваяСтрокаТаблСоответсвия.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	// Заполняем штрихкод
	Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("СтрШтрихкод") И СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод <> Неопределено И СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод.РежимЗагрузки = "Искать" Тогда
		Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("НомерКолонкиШтрихкод") И СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиШтрихкод>0 Тогда
			Попытка
				Штрихкод = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиШтрихкод,"ЧГ=")).Текст);
			Исключение
				Штрихкод = "";
			КонецПопытки;
			НоваяСтрокаТаблСоответсвия.Штрихкод = Штрихкод;
		КонецЕсли;
	ИначеЕсли СтруктураОтраслевыхДополнительныхПараметров.Свойство("СтрШтрихкод") И СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод <> Неопределено И СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод.РежимЗагрузки = "Вычислять" Тогда
		Вычисление = ВычислитьЗначениеДляХарактеристики(СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод.Выражение, ?(СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод.НомерКолонки = 0, "", ТекстыЯчеек[СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод.НомерКолонки]), ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			Штрихкод = Вычисление.Результат;
		Иначе
			ТекстСообщения = НСтр("ru = 'При вычислении выражения: %1
			| Произошла ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтруктураОтраслевыхДополнительныхПараметров.СтрШтрихкод.Выражение,Вычисление.ОписаниеОшибки);
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Штрихкод = "";
		КонецЕсли;
		НоваяСтрокаТаблСоответсвия.Штрихкод = Штрихкод;
	КонецЕсли;
	
	// Заполняем страну происхождения
	Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("СтрСтранаПроисхождения") И СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения <> Неопределено И СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения.РежимЗагрузки = "Искать" Тогда
		Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("НомерКолонкиСтранаПроисхождения") И СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиСтранаПроисхождения>0 Тогда
			Попытка
				СтранаПроисхождения = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиСтранаПроисхождения,"ЧГ=")).Текст);
			Исключение
				СтранаПроисхождения = "";
			КонецПопытки;
			НоваяСтрокаТаблСоответсвия.СтранаПроисхождения = СтранаПроисхождения;
		КонецЕсли;
	ИначеЕсли СтруктураОтраслевыхДополнительныхПараметров.Свойство("СтрСтранаПроисхождения") И СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения <> Неопределено И СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения.РежимЗагрузки = "Вычислять" Тогда
		Вычисление = ВычислитьЗначениеДляХарактеристики(СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения.Выражение,?(СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения.НомерКолонки = 0, "", ТекстыЯчеек[СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения.НомерКолонки]),ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			СтранаПроисхождения = Вычисление.Результат;
		Иначе
			ТекстСообщения = НСтр("ru = 'При вычислении выражения: %1
			| Произошла ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтруктураОтраслевыхДополнительныхПараметров.СтрСтранаПроисхождения.Выражение,Вычисление.ОписаниеОшибки);
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			СтранаПроисхождения = "";
		КонецЕсли;
		НоваяСтрокаТаблСоответсвия.СтранаПроисхождения = СтранаПроисхождения;
	КонецЕсли;
	
	// Заполним производителя
	Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("СтрПроизводитель") И СтруктураОтраслевыхДополнительныхПараметров.СтрПроизводитель <> Неопределено Тогда
		ИщемПроизводителя = Истина;
		Если СтруктураОтраслевыхДополнительныхПараметров.СтрПроизводитель.РежимЗагрузки = "Искать" Тогда
			// Заполняем производителя
			Если СтруктураОтраслевыхДополнительныхПараметров.Свойство("НомерКолонкиПроизводитель") И СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиПроизводитель>0 Тогда
				Попытка
					Производитель = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(СтруктураОтраслевыхДополнительныхПараметров.НомерКолонкиПроизводитель,"ЧГ=")).Текст);
				Исключение
					Производитель = "";
				КонецПопытки;
			Иначе
				ИщемПроизводителя = Ложь;
			КонецЕсли;
		Иначе // СтрПроизводитель.РежимЗагрузки = "Вычислять"
			Вычисление = ВычислитьЗначениеДляХарактеристики(СтруктураОтраслевыхДополнительныхПараметров.СтрПроизводитель.Выражение,?(СтруктураОтраслевыхДополнительныхПараметров.СтрПроизводитель.НомерКолонки = 0, "", ТекстыЯчеек[СтруктураОтраслевыхДополнительныхПараметров.СтрПроизводитель.НомерКолонки]),ТекстыЯчеек, Справочники.ор_Производители.ПустаяСсылка(), СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если ПустаяСтрока(СтруктураОтраслевыхДополнительныхПараметров.СтрПроизводитель.Выражение) Тогда
				ИщемПроизводителя = Ложь;
			КонецЕсли;
			Если ПустаяСтрока(Вычисление.ОписаниеОшибки)Тогда
				Попытка
					Производитель = Строка(Вычисление.Результат);
				Исключение
					Производитель = "";
				КонецПопытки;
			Иначе
				Производитель = "";
			КонецЕсли;
		КонецЕсли;
		
		НаименованиеПроизводителя = СокрЛП(Производитель);
		НоваяСтрокаТаблСоответсвия.ПроизводительЛС = НаименованиеПроизводителя;
		
		// Попробуем найти производителя по прайс листу поставщика
		ПроизводительСсылка = Неопределено;
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			ПроизводительСсылка = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.НайтиЗначениеВПрайсеПоставщика(Штрихкод, "Штрихкод", СтруктураПараметров.Поставщик, "Производитель",,СтруктураПараметров.флПоискПоПрайсуПоставщика,СтруктураПараметровЛогирования);
		КонецЕсли;
		// Если не найден по прайсу поставщика, попробуем найти по наименованию
		Если НЕ ЗначениеЗаполнено(ПроизводительСсылка) Тогда
			Производители = Справочники.ор_Производители;
			Если ЗначениеЗаполнено(НаименованиеПроизводителя) Тогда
				ПроизводительСсылка = Производители.НайтиПоНаименованию(НаименованиеПроизводителя); 
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ПроизводительСсылка) и ИщемПроизводителя И Не ПустаяСтрока(НаименованиеПроизводителя) Тогда
				Если СтруктураПараметров.СоздаватьПроизводителя Тогда
					НовыйПроизводитель = Производители.СоздатьЭлемент();
					НовыйПроизводитель.Наименование = НаименованиеПроизводителя;
					НовыйПроизводитель.Записать();
					ПроизводительСсылка = НовыйПроизводитель.Ссылка;
					ТекстСообщения = НСтр("ru = 'Создан элемент справочника производителей: %1'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,НаименованиеПроизводителя);
					Если СтруктураПараметровЛогирования = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Иначе
						ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 3, СтруктураПараметровЛогирования);
					КонецЕсли;
				Иначе
					ТекстСообщения = НСтр("ru = 'Не найден элемент <%1> в справочнике производителей.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,НаименованиеПроизводителя);
					Если СтруктураПараметровЛогирования = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Иначе
						ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаТаблСоответсвия.Производитель = ПроизводительСсылка;
	КонецЕсли;
	
	// Если в прайс грузим цену, то ее тоже заполняем
	СтрокаНастройки = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Цена", "ИмяРеквизита");
	Если СтрокаНастройки = Неопределено Тогда
		НомерКолонкиЦена = 0;
	Иначе
		НомерКолонкиЦена = СтрокаНастройки.НомерКолонки;
	КонецЕсли;
	Если СтрокаНастройки <> Неопределено И СтрокаНастройки.РежимЗагрузки = "Искать" Тогда
		Если НомерКолонкиЦена>0 Тогда
			Попытка
				НоваяСтрокаТаблСоответсвия.Цена = Число(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонкиЦена,"ЧГ=")).Текст));
			Исключение
				НоваяСтрокаТаблСоответсвия.Цена = 0; //Цена не найдена
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли СтрокаНастройки <> Неопределено И СтрокаНастройки.РежимЗагрузки = "Вычислять" Тогда
		Вычисление = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ВычислитьЗначениеДляХарактеристики(СтрокаНастройки.Выражение,?(СтрокаНастройки.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаНастройки.НомерКолонки]),ТекстыЯчеек, 0, СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			НоваяСтрокаТаблСоответсвия.Цена = Вычисление.Результат;
		Иначе
			ТекстСообщения = НСтр("ru = 'При вычислении выражения: %1
			| Произошла ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрокаНастройки.Выражение,Вычисление.ОписаниеОшибки);
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Иначе
				ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			НоваяСтрокаТаблСоответсвия.Цена = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет настройки дополнительных параметров
//
Процедура ЗаполнитьНастройкиДополнительныхПараметров(СтруктураПараметров, Настройки, ВерсияОбработки) Экспорт
	// для книжек код пустой
	
	СтруктураПараметров.ТаблицаДополнительныхПараметров.Очистить();
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Номер серии производителя";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R42C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R43C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R44C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Срок годности";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R46C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R47C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R48C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Производитель";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R11C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R50C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R51C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Сертификат";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R56C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R57C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R58C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "ШтрихКод";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R12C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R24C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R25C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Наименование характеристики";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R35C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R36C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R37C5").Текст;

	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Наименование товара";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R32C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R33C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R34C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Цена";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R38C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R39C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R40C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Страна происхождения";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R53C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R54C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R55C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Срок действия сертификата";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R61C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R62C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R63C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Орган выдавший сертификат";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R64C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R65C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R66C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Декларацию зарегистрировал";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R67C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R68C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R69C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Декларант";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R70C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R71C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R72C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "Маркируемый товар";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R73C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R74C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R75C5").Текст;
	
	ЗагружаемыйРеквизит               = СтруктураПараметров.ТаблицаДополнительныхПараметров.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита  = "GTIN";
	ЗагружаемыйРеквизит.НомерКолонки  = Настройки.Область("R76C5").Текст;
	ЗагружаемыйРеквизит.РежимЗагрузки = Настройки.Область("R77C5").Текст;
	ЗагружаемыйРеквизит.Выражение     = Настройки.Область("R78C5").Текст;
	
КонецПроцедуры

// Процедура выполняет поиск в справочниках Номенклатура и Характеристики номенклатуры по штрихкоду.
//
Процедура ОтработатьПоискСправочникаПоШК(СтруктураПараметров,
										ТаблицаНоменклатурыИХарактеристик,
										НайденныеЗначения,
										ТЧДокумента,
										ТекстыЯчеек,
										ТипРеквизита, 
										флКонтрольЗаполнения,
										СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ДопНомерСерии = 0;
	Для каждого СтрокаШК Из ТаблицаНоменклатурыИХарактеристик Цикл
		Если ТипРеквизита = Тип("СправочникСсылка.Номенклатура") Тогда
			Если НЕ ТипЗнч(СтрокаШК.Объект)=Тип("СправочникСсылка.Номенклатура") Тогда Продолжить; КонецЕсли;
			НайденныеЗначения.Добавить(СтрокаШК.Объект);
			Прервать;
		ИначеЕсли ТипРеквизита = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
			Если Не ТипЗнч(СтрокаШК.ХарактеристикаНоменклатуры) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
				Продолжить;
			КонецЕсли;
			
			ЦенаСерии = ПолучитьЦенуЗагружаемойСерии(ТекстыЯчеек, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
			Если Не СерияИспользуетсяВТЧДокумента(ТЧДокумента, СтрокаШК.ХарактеристикаНоменклатуры) Тогда
				НайденныеЗначения.Добавить(СтрокаШК.ХарактеристикаНоменклатуры);
				Если ЗначениеЗаполнено(СтрокаШК.ХарактеристикаНоменклатуры)
					И СтрокаШК.ХарактеристикаНоменклатуры.ор_СрокГодности < НачалоДня(ТекущаяДата()) Тогда
					СтруктураПараметров.ПодобранаПросроченнаяСерия = Истина;
				КонецЕсли;
				Прервать;
			Иначе
				Запрос=Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ХарактеристикиНоменклатуры.Ссылка 
				|ИЗ
				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				|ГДЕ
				|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
				Запрос.УстановитьПараметр("Владелец", СтрокаШК.ХарактеристикаНоменклатуры.Владелец);
				Выборка =  Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ДопНомерСерии = ПолучитьДопНомерСерии(Выборка.Ссылка,ДопНомерСерии);
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныеЗначения.Количество() = 0
		И флКонтрольЗаполнения = Ложь
		И ТипРеквизита = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		НоваяСерия = СформироватьНовуюСерию(ТекстыЯчеек, СтруктураПараметров,, ДопНомерСерии + 1, СтруктураПараметровЛогирования);
		Если НоваяСерия <> Неопределено Тогда
			НайденныеЗначения.Добавить(НоваяСерия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получить индекс серии
//
// Параметры:
//  Серия          - Ссылка	- ссылка на серию
//  ДопНомерСерии  – Список	– номер серии
//
// Возвращаемое значение:
//  Число	- следующий номер серии
//
Функция ПолучитьДопНомерСерии(Серия,ДопНомерСерии) Экспорт
	
	Попытка
		НаименованиеСерии = Серия.Наименование;
		НачСимвол = Найти(НаименованиеСерии,"'");
		Если НачСимвол <> 0 Тогда 
			ДопНомерТекущейСерии = Число(Сред(НаименованиеСерии,НачСимвол+1,Найти(Сред(НаименованиеСерии,НачСимвол),"'")));
			Если ДопНомерТекущейСерии > ДопНомерСерии Тогда
				ДопНомерСерии = ДопНомерТекущейСерии;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат ДопНомерСерии;
	
КонецФункции

 // Проверка использования серии в табличной части документа
//
Функция СерияИспользуетсяВТЧДокумента(ТЧДокумента,СерияНоменклатуры) Экспорт
	
	Попытка
		НайденнаяСтрока = ТЧДокумента.Найти(СерияНоменклатуры,"Характеристика");
		Если НайденнаяСтрока <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Ложь;
	
КонецФункции

// Процедура обрабатывает все найденные значения.
//
Процедура ОбработатьВсеНайденныеЗначения(ТипРеквизита, 
										СтруктураПараметров, 
										ТекстыЯчеек, 
										Выборка, 
										НайденныеЗначения,
										ИскатьПо,
										Представление,
										НормаЗначений,
										Запрос,
										ТаблицаСлов,
										ПоискПоСхожести,
										ЭтоСправочник,
										ИскатьПоСерииИСрокуГодности = Ложь,
										СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Если ТипРеквизита = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		ДопНомерСерии = 0;
		ЦенаСерии = ПолучитьЦенуЗагружаемойСерии(ТекстыЯчеек, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		
		// Найдем значение маркируемый товар.
		МаркируемыйТовар = Ложь;
		ЕстьКолонкаМаркируемыйТовар = Ложь;
		Попытка
			СтрокаМаркируемыйТовар = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Маркируемый товар","ИмяРеквизита");
			Если СтрокаМаркируемыйТовар <> Неопределено Тогда
				НомерКолонкиМаркируемыйТовар = СтрокаМаркируемыйТовар.НомерКолонки;
				ЕстьКолонкаМаркируемыйТовар = СтрокаМаркируемыйТовар.НомерКолонки <> 0;
				Если ЗначениеЗаполнено(НомерКолонкиМаркируемыйТовар) И СтрокаМаркируемыйТовар.РежимЗагрузки = "Искать" Тогда
					МаркируемыйТовар = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(ТекстыЯчеек[НомерКолонкиМаркируемыйТовар], Новый ОписаниеТипов("Булево"));
				Иначе
					Вычисление = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ВычислитьЗначениеДляХарактеристики(
						СтрокаМаркируемыйТовар.Выражение,
						?(ЕстьКолонкаМаркируемыйТовар, "", ТекстыЯчеек[НомерКолонкиМаркируемыйТовар]),
						ТекстыЯчеек,
						Ложь,
						СтруктураПараметров.СсылкаИсточника,
						СтруктураПараметровЛогирования);
					Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
						МаркируемыйТовар = Вычисление.Результат;
					Иначе
						ТекстОшибки = НСтр("ru= 'При вычислении выражения: 
						| %1
						| Произошла ошибка: %2'");
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаМаркируемыйТовар.Выражение, Вычисление.ОписаниеОшибки);
						Если СтруктураПараметровЛогирования = Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
						Иначе
							ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 1, СтруктураПараметровЛогирования);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ИскатьПоСерииИСрокуГодности Тогда
			
			// Найдем представление серии производителя.
			Попытка
				СтрокаСерии = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Номер серии производителя","ИмяРеквизита");
				Если СтрокаСерии.РежимЗагрузки = "Вычислять" Тогда
					Вычисление = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ВычислитьЗначениеДляХарактеристики(
						СтрокаСерии.Выражение,
						?(СтрокаСерии.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаСерии.НомерКолонки]),
						ТекстыЯчеек,
						"",
						СтруктураПараметров.СсылкаИсточника,
						СтруктураПараметровЛогирования);
					Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
						Представление = Вычисление.Результат;
					КонецЕсли;
				Иначе
					НомерКолонкиСерия = СтрокаСерии.НомерКолонки;
					Если ЗначениеЗаполнено(НомерКолонкиСерия) Тогда
						Представление = ТекстыЯчеек[НомерКолонкиСерия];
					КонецЕсли;
				КонецЕсли;
				Запрос.УстановитьПараметр("Представление", Представление);
				Выборка = Запрос.Выполнить().Выбрать();
			Исключение
			КонецПопытки;
			
			// Найдем представление срока годности.
			СрокГодностиСерии = Дата('00010101');
			Попытка
				НайденнаяСтрока = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Срок годности","ИмяРеквизита");
				Если НайденнаяСтрока <> Неопределено Тогда 
					НомерКолонкиСрокГодности = НайденнаяСтрока.НомерКолонки;
					Если ЗначениеЗаполнено(НомерКолонкиСрокГодности) И НайденнаяСтрока.РежимЗагрузки = "Искать" Тогда
						СрокГодностиСерии = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьДатуСрокаГодностиСерии(ТекстыЯчеек[НомерКолонкиСрокГодности], СтруктураПараметров.ФорматДатыСрокаГодности);
					Иначе
						Вычисление = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ВычислитьЗначениеДляХарактеристики(
							НайденнаяСтрока.Выражение,
							?(НайденнаяСтрока.НомерКолонки = 0, "", ТекстыЯчеек[НайденнаяСтрока.НомерКолонки]),
							ТекстыЯчеек,
							Дата('00010101'),
							СтруктураПараметров.СсылкаИсточника,
							СтруктураПараметровЛогирования);
						Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
							СрокГодностиСерии = Вычисление.Результат;
						Иначе
							ТекстОшибки = НСтр("ru= 'При вычислении выражения: 
							| %1
							| Произошла ошибка: %2'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, НайденнаяСтрока.Выражение, Вычисление.ОписаниеОшибки);
							Если СтруктураПараметровЛогирования = Неопределено Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
							Иначе
								ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 1, СтруктураПараметровЛогирования);
							КонецЕсли;
							СрокГодностиСерии = Дата('00010101');
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Пометить = Истина;
			Пока Выборка.Следующий() Цикл 
				ДопНомерСерии = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьДопНомерСерии(Выборка.Ссылка,ДопНомерСерии);
				Если (Не ЕстьКолонкаМаркируемыйТовар Или Выборка.Ссылка.ор_МаркируемыйТовар = МаркируемыйТовар)
					И Выборка.Ссылка.ор_СрокГодности = СрокГодностиСерии
					И НЕ СтруктураПараметров.ВсегдаФормироватьНовыеСерии
					И НЕ СерияИспользуетсяВТЧДокумента(СтруктураПараметров.ТЧДокумента,Выборка.Ссылка) Тогда
					// Если выбранная серия не используется, тогда необходимо изменить этот статус.
					Если Пометить И Выборка.Ссылка.Недействителен Тогда
						СерияОбъект = Выборка.Ссылка.ПолучитьОбъект();
						СерияОбъект.Недействителен = Ложь;
						Попытка
							СерияОбъект.Записать();
							ТекстСообщения = НСтр("ru= 'Серия %1 владельца %2 помечена как %3'");
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СерияОбъект.Наименование, СокрЛП(СерияОбъект.Владелец.Наименование), ?(СерияОбъект.Недействителен,"недействительная","используемая"));
							Если СтруктураПараметровЛогирования = Неопределено Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Иначе
								ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 3, СтруктураПараметровЛогирования);
							КонецЕсли;
						Исключение
							ТекстСообщения = НСтр("ru= 'Не удалось изменить статус ""Недействителен"" для серии <%1>'");
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.Ссылка);
							Если СтруктураПараметровЛогирования = Неопределено Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Иначе
								ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
							КонецЕсли;
						КонецПопытки;
					КонецЕсли;
					Пометить = Ложь;
					НайденныеЗначения.Добавить(Выборка.Ссылка);
					Если Выборка.Ссылка.ор_СрокГодности < НачалоДня(ТекущаяДата()) Тогда
						СтруктураПараметров.ПодобранаПросроченнаяСерия = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Пометить = Истина;
			// Проверим если производится поиск по "Наименование" и выборка по запросу пустая
			// то подменим параметр "Представление" на тот который задан в дополнительных параметрах
			// если он задан либо вычислив его либо просто взяв текст ячейки.
			Если Выборка.Количество() = 0 И ИскатьПо = "Наименование" Тогда
				Попытка
					НайденнаяСтрока   = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Наименование характеристики","ИмяРеквизита");
					Если НайденнаяСтрока <> Неопределено Тогда 
						НомерКолонкиНаименование = НайденнаяСтрока.НомерКолонки;
						Если ЗначениеЗаполнено(НомерКолонкиНаименование) И НайденнаяСтрока.РежимЗагрузки = "Искать" Тогда
							лНаименование = ТекстыЯчеек[НомерКолонкиНаименование];
						Иначе
							Вычисление = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ВычислитьЗначениеДляХарактеристики(
								НайденнаяСтрока.Выражение,
								?(НайденнаяСтрока.НомерКолонки = 0, "", ТекстыЯчеек[НайденнаяСтрока.НомерКолонки]),
								ТекстыЯчеек,
								"",
								СтруктураПараметров.СсылкаИсточника,
								СтруктураПараметровЛогирования);
							Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
								лНаименование = Вычисление.Результат;
							Иначе
								ТекстСообщения = НСтр("ru= 'При вычислении выражения: 
								|%1
								| Произошла ошибка: %2'");
								ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НайденнаяСтрока.Выражение,Вычисление.ОписаниеОшибки);
								Если СтруктураПараметровЛогирования = Неопределено Тогда
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
								Иначе
									ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
								КонецЕсли;
								лНаименование = "";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки;
				Если ЗначениеЗаполнено(лНаименование) Тогда
					Запрос.УстановитьПараметр("Представление", лНаименование);
					Выборка = Запрос.Выполнить().Выбрать();
				КонецЕсли;
			КонецЕсли;
			
			Пока Выборка.Следующий() Цикл
				ДопНомерСерии = ПолучитьДопНомерСерии(Выборка.Ссылка,ДопНомерСерии);
				Если Выборка.Ссылка.ор_МаркируемыйТовар = МаркируемыйТовар
					И Не СтруктураПараметров.ВсегдаФормироватьНовыеСерии
					И Не СерияИспользуетсяВТЧДокумента(СтруктураПараметров.ТЧДокумента,Выборка.Ссылка) Тогда
					
					// Если выбранная серия не используется, тогда необходимо изменить этот статус.
					Если Пометить И Выборка.Ссылка.Недействителен Тогда
						СерияОбъект = Выборка.Ссылка.ПолучитьОбъект();
						СерияОбъект.Недействителен = Ложь;
						Попытка
							СерияОбъект.Записать();
							ТекстСообщения = НСтр("ru= 'Серия <%1> владельца <%2> помечена как %3'");
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СерияОбъект.Наименование,СокрЛП(СерияОбъект.Владелец.Наименование), ?(СерияОбъект.Недействителен,"недействительная","используемая"));
							Если СтруктураПараметровЛогирования = Неопределено Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Иначе
								ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 3, СтруктураПараметровЛогирования);
							КонецЕсли;
						Исключение
							ТекстСообщения = НСтр("ru= 'Не удалось изменить статус ""Недействителен"" для серии <%1>'");
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.Ссылка);
							Если СтруктураПараметровЛогирования = Неопределено Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Иначе
								ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
							КонецЕсли;
						КонецПопытки;
					КонецЕсли;
					Пометить = Ложь;
					НайденныеЗначения.Добавить(Выборка.Ссылка);
					Если Выборка.Ссылка.ор_СрокГодности < НачалоДня(ТекущаяДата()) Тогда
						СтруктураПараметров.ПодобранаПросроченнаяСерия = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если НЕ ПоискПоСхожести Тогда
			Пока Выборка.Следующий() Цикл
				НайденныеЗначения.Добавить(Выборка.Ссылка);
			КонецЦикла;
		Иначе
			// Попробуем найти точное совпадение
			СтрокаНайденная = ТаблицаСлов.Найти(Представление, "ЗначениеРеквизита");
			Если СтрокаНайденная = Неопределено Тогда
				ТаблицаНайденных = Новый ТаблицаЗначений;
				ТаблицаНайденных.Колонки.Добавить("Значение");
				ТаблицаНайденных.Колонки.Добавить("СтепеньСоответствия");
				ИсходныйСписокСлов = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСлов(Представление);
				Сч = 1;
				Пока ТаблицаСлов.Количество() > 0 И Сч<=НормаЗначений Цикл
					КоличествоСтрок = ТаблицаСлов.Количество();
					СписокСтрок = Новый СписокЗначений;
					СтрокаСравнения = ТаблицаСлов[0];
					СписокСловСравнения = СтрокаСравнения.СписокСлов.Скопировать();
					ТекущийСписокСлов = ИсходныйСписокСлов.Скопировать();
					СтепеньСоответствия = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ВернутьСтепеньСоответствияСписковСлов(ТекущийСписокСлов, СписокСловСравнения);
					НовСтр = ТаблицаНайденных.Добавить();
					НовСтр.Значение = СтрокаСравнения.Ссылка;
					НовСтр.СтепеньСоответствия = СтепеньСоответствия;
					ТаблицаСлов.Удалить(СтрокаСравнения);
					Сч = Сч+1;
				КонецЦикла;
				ТаблицаНайденных.Сортировать("СтепеньСоответствия Убыв");
				Если ТаблицаНайденных.Количество() > 1 Тогда
					ТекстСообщения = "Для значения <"+Представление+"> найдено несколько вариантов:"+Символы.ПС;
					Для Каждого Зн из ТаблицаНайденных Цикл
						ТекстСообщения = ТекстСообщения+Символы.Таб+Зн.Значение+Символы.ПС;
					КонецЦикла;
					ТекстОшибки = НСтр("ru= '%1'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ТекстСообщения);
					Если СтруктураПараметровЛогирования = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
					Иначе
						ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДобавитьВЛог(ТекстОшибки, 2, СтруктураПараметровЛогирования);
					КонецЕсли;
				КонецЕсли;
				НайденныеЗначения = ТаблицаНайденных.ВыгрузитьКолонку("Значение");
			Иначе
				НайденныеЗначения.Добавить(СтрокаНайденная.Ссылка);
				Если ТипЗнч(СтрокаНайденная.Ссылка) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры")
					И СтрокаНайденная.Ссылка.ор_СрокГодности < НачалоДня(ТекущаяДата()) Тогда
					СтруктураПараметров.ПодобранаПросроченнаяСерия = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НайденныеЗначения.Количество() = 0
		И ЭтоСправочник
		И СтруктураПараметров.флКонтрольЗаполнения=Ложь
		И ТипРеквизита = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		НоваяСерия = СформироватьНовуюСерию(ТекстыЯчеек, СтруктураПараметров,, ДопНомерСерии + 1, СтруктураПараметровЛогирования);
		Если НоваяСерия <> Неопределено Тогда
			НайденныеЗначения.Добавить(НоваяСерия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция получения данных производителя из дополнительных параметров
//
Функция ПолучитьДанныеПроизводителяИзДопПараметров(СтруктураПараметров) Экспорт
	
	// Для книжек ничего менять даже не надо, стоит проверка на наличие доп. параметров
	СтруктураВозврата = Новый Структура();
	
	Если СтруктураПараметров.Свойство("ТаблицаДополнительныхПараметров") и СтруктураПараметров.ТаблицаДополнительныхПараметров<>Неопределено Тогда
		КолонкаПроизводителя = 0;
		СтрокаПроизводитель = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("Производитель");
		Если НЕ СтрокаПроизводитель = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаПроизводитель.НомерКолонки) Тогда
				КолонкаПроизводителя = СтрокаПроизводитель.НомерКолонки;
			КонецЕсли;
		КонецЕсли;
		СтруктураВозврата.Вставить("СтрокаПроизводитель",  СтрокаПроизводитель);
		СтруктураВозврата.Вставить("КолонкаПроизводителя", КолонкаПроизводителя);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция получения значения по производителю
//
Функция ПолучитьЗначенияПоПроизводителю(ТабличныйДокумент, 
											ТекстыЯчеек, 
											Примечание, 
											Представление,
											НайденнаяСтрока,
											НомерСтроки,
											СтруктураПараметровПроизводителя,
											СтруктураПараметров,
											СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	// Для книжек ничего менять не нужно, отработает первая ветка если.
	Если СтруктураПараметровПроизводителя.Количество() = 0 Тогда
		НайденныеЗначения = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьВозможныеЗначения(НайденнаяСтрока, Представление, Примечание, НайденнаяСтрока, ТекстыЯчеек, СтруктураПараметров, 1, Неопределено,,СтруктураПараметровЛогирования);
	Иначе
		Дополнительно = Новый Структура;
		Если СтруктураПараметровПроизводителя.Свойство("КолонкаПроизводителя") И СтруктураПараметровПроизводителя.Свойство("СтрокаПроизводитель") Тогда
			Если НЕ СтруктураПараметровПроизводителя.КолонкаПроизводителя = 0 И СтруктураПараметровПроизводителя.СтрокаПроизводитель.РежимЗагрузки = "Искать" Тогда
				Производитель = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(СтруктураПараметровПроизводителя.КолонкаПроизводителя,"ЧГ=")).Текст;
				Если НЕ ПустаяСтрока(Производитель) Тогда
					Дополнительно.Вставить("Производитель",Производитель);
				КонецЕсли;
			ИначеЕсли СтруктураПараметровПроизводителя.СтрокаПроизводитель <> Неопределено
				И СтруктураПараметровПроизводителя.СтрокаПроизводитель.РежимЗагрузки = "Вычислять" Тогда
				Попытка
					Вычисление = ВычислитьЗначениеДляХарактеристики(
						СтруктураПараметровПроизводителя.СтрокаПроизводитель.Выражение,
						?(СтруктураПараметровПроизводителя.СтрокаПроизводитель.НомерКолонки = 0, "", ТекстыЯчеек[СтруктураПараметровПроизводителя.СтрокаПроизводитель.НомерКолонки]),
						ТекстыЯчеек,
						Справочники.ор_Производители.ПустаяСсылка(),
						СтруктураПараметров.СсылкаИсточника,
						СтруктураПараметровЛогирования);
					// Здесь для поиска нам необходимо будет строковое значение.
					Дополнительно.Вставить("Производитель",Строка(Вычисление.Результат));
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		НайденныеЗначения = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьВозможныеЗначения(НайденнаяСтрока, Представление, Примечание, НайденнаяСтрока, ТекстыЯчеек, СтруктураПараметров, 1, Дополнительно,, СтруктураПараметровЛогирования);
	КонецЕсли;
	
	Возврат НайденныеЗначения;
	
КонецФункции

// Процедура выполняет запись отраслевых параметров в прайс-лист
//
Процедура ЗаписатьОтраслевыеПараметрыВПрайс(НоваяПозицияПрайсЛиста, ЗначениеДляПоиска, СтрокаИсточника = Неопределено) Экспорт
	// Для книжек оставить пустую процедуру
	
	Если СтрокаИсточника = Неопределено Тогда
		НоваяПозицияПрайсЛиста.ШтрихКод = ЗначениеДляПоиска;
	Иначе
		НоваяПозицияПрайсЛиста.Штрихкод = СтрокаИсточника.ШтрихКод;
		НоваяПозицияПрайсЛиста.СтранаПроисхождения = СтрокаИсточника.СтранаПроисхождения;
		НоваяПозицияПрайсЛиста.Производитель       = СтрокаИсточника.Производитель;
		НоваяПозицияПрайсЛиста.ПроизводительЛС     = СтрокаИсточника.ПроизводительЛС;
	КонецЕсли;
	
КонецПроцедуры

////////////////////

// Процедура дополняет структуру параметров значениями таблицы дополнительных параметров.
//
Процедура ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтаФорма, ЭтотОбъект, ТолькоКолонки = Ложь) Экспорт
	
	Если ТолькоКолонки Тогда
		СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров", ЭтаФорма.ТаблицаДополнительныхПараметров.Выгрузить().СкопироватьКолонки());
	Иначе
		СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров", ЭтаФорма.ТаблицаДополнительныхПараметров.Выгрузить());
	КонецЕсли;
	СтруктураПараметров.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры", ЭтотОбъект.ШКЯвляетсяПолемПоискаНоменклатуры);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики",      ЭтотОбъект.СоздаватьОбщиеХарактеристики);
	СтруктураПараметров.Вставить("НеФормироватьДопНомерСерии",        ЭтотОбъект.НеФормироватьДопНомерСерии);
	СтруктураПараметров.Вставить("ЗагружатьШК",                       ЭтотОбъект.ЗагружатьШК);
	
КонецПроцедуры

// Процедура дополняет структуру параметров значениями таблицы дополнительных параметров, 
// необходимых для автоматической загрузки.
//
Процедура ДополнитьВСтруктуруДопПараметрыАвтозагрузка(СтруктураПараметров, СтруктураТаблиц) Экспорт
	
	СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров",   СтруктураТаблиц.ТаблицаДополнительныхПараметров);
	СтруктураПараметров.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры", Ложь);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики",      Ложь);
	СтруктураПараметров.Вставить("НеФормироватьДопНомерСерии",        Ложь);
	СтруктураПараметров.Вставить("ЗагружатьШК",                       Ложь);
	
КонецПроцедуры

// Процедура сохраняет таблицу соответствий.
//
Процедура СохранитьТаблицуСоответствия(ПрайсЛистКонтрагента, ИскатьПо, ТаблицаЗагружаемыхРеквизитов, СоответствиеНоменклатуры, ЭтаФорма) Экспорт
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.СохранитьТаблицуСоответствия(ПрайсЛистКонтрагента, ИскатьПо, ТаблицаЗагружаемыхРеквизитов, СоответствиеНоменклатуры, ЭтаФорма.ТаблицаДополнительныхПараметров.Выгрузить());
	
КонецПроцедуры

// Процедура переносит значения из дополнительных параметров в объект и отображает их на форме.
//
Процедура ПеренестиДопПараметрыВОбъектИНаФорму(СтруктураПараметров, ЭтаФорма, ЭтотОбъект) Экспорт
	
	ЭтотОбъект.ТаблицаДополнительныхПараметров = СтруктураПараметров.ТаблицаДополнительныхПараметров.Скопировать();
	ЭтаФорма.ТаблицаДополнительныхПараметров.Загрузить(ЭтотОбъект.ТаблицаДополнительныхПараметров);
	
КонецПроцедуры

// Процедура переносит структуру колонок дополнительных параметров в объект.
//
Процедура ПеренестиСтруктуруКолонокДопПараметровВОбъект(Объект, ЭтаФорма) Экспорт
	
	Объект.ТаблицаДополнительныхПараметров.Загрузить(ЭтаФорма.ТаблицаДополнительныхПараметров.Выгрузить());
	
КонецПроцедуры

// Функция выполняет создание элемента справочника Номенклатура по переданной настройке.
//
Функция СоздатьНоменклатуруПоНастройке(ТабличныйДокумент,
										Настройка, 
										НомерКолонки, 
										СоответствиеНоменклатуры, 
										ЭтаФорма,
										ПерваяСтрокаДанныхТабличногоДокумента,
										СтруктураПараметровЛогирования = Неопределено) Экспорт


	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.СоздатьНоменклатуруПоНастройке(
				ТабличныйДокумент,
				Настройка,
				НомерКолонки,
				СоответствиеНоменклатуры,
				ЭтаФорма.ТаблицаЗагружаемыхРеквизитов.Выгрузить().СкопироватьКолонки(),
				ЭтаФорма.ТаблицаДополнительныхПараметров.Выгрузить().СкопироватьКолонки(),
				ПерваяСтрокаДанныхТабличногоДокумента,
				ЭтаФорма.ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить().СкопироватьКолонки(),
				СтруктураПараметровЛогирования);
КонецФункции

// Процедура дописывает в новый созданный элемент справочника Номенклатура дополнительные параметры.
//
Процедура ДописатьПараметрыВСоздаваемуюНоменклатуру(Номенклатура,СтрокаТаблицыСоответствия, СтранаПроисхождения) Экспорт
	
	Страна = Справочники.СтраныМира.ПустаяСсылка();
	Если ЗначениеЗаполнено(СтрокаТаблицыСоответствия.СтранаПроисхождения) Тогда
		Страна = Справочники.СтраныМира.НайтиПоНаименованию(СтрокаТаблицыСоответствия.СтранаПроисхождения);
	КонецЕсли;
	
	Номенклатура.СтранаПроисхождения = ?(Страна.Пустая(), СтранаПроисхождения, Страна);
	Номенклатура.ор_Производитель    = СтрокаТаблицыСоответствия.Производитель;
	
КонецПроцедуры

// Процедура дополняет структуру параметров значениями отраслевых флагов.
//
Процедура ДополнитьВСтруктуруОтраслевыеФлаги(СтруктураПараметров,Объект) Экспорт
	
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии", Объект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("ЕстьНовыеПросроченныеСерии",  Ложь);
	СтруктураПараметров.Вставить("ПодобранаПросроченнаяСерия",  Ложь);
	Попытка
		ПроверятьСрокиГодности = НЕ Пользователи.РолиДоступны("ор_ПравоРазрешитьЗаписьДокументовСодержащихМедикаментыСИстекшимСрокомГодности", Пользователи.ТекущийПользователь());
	Исключение
		ПроверятьСрокиГодности = Ложь;
	КонецПопытки;
	СтруктураПараметров.Вставить("ПроверятьСрокиГодности", ПроверятьСрокиГодности);
	
КонецПроцедуры

// Функция получает номер колонки наименования из реквизита переданной формы.
//
Функция ПолучитьНомерКолонкиНаименованияСФормы(ЭтаФорма) Экспорт
	
	Возврат 0;
	
КонецФункции

// Процедура выполняет загрузку заводских ШК.
//
Процедура ЗагрузитьЗаводскиеШК(СтруктураПараметров, СтруктураПараметровЛогирования = Неопределено) Экспорт
	// Разберемся с заводскими ШК.
	Если СтруктураПараметров.ЗагружатьШК И СтруктураПараметров.СоответствиеНоменклатуры.Количество() > 0 Тогда
		Для Каждого СтрокаТЧ Из СтруктураПараметров.СоответствиеНоменклатуры Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Штрихкод) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			ЗарегистрироватьШтрихКод(СтрокаТЧ.Штрихкод, СтрокаТЧ.Номенклатура, Неопределено, Неопределено, СтруктураПараметровЛогирования, Ложь);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура заполняет реквизиты предопределенного элемента.
//
// Параметры:
//  Объект    - СправочникОбъект.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента - объект, реквизиты
//                      которого надо заполнить.
//  Настройки - ТабличныйДокумент - Табличный документ.
//
// Возвращаемое значение:
//  Булево - признак успешности выполнения операции.
//
Функция ЗаполнитьНастройкиЗагрузкиИзТабличногоДокумента(Объект, Настройки)
	
	Если ТипЗнч(Настройки)<>Тип("ТабличныйДокумент") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст);
		
		ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область("R2C5").Текст);
		Если (ТекстВосстановленногоРежимаЗагрузки <> "в табличную часть"
				И ТекстВосстановленногоРежимаЗагрузки <> "в справочник")
				И ТекстВосстановленногоРежимаЗагрузки <> "Х" Тогда
			Возврат Ложь;
		КонецЕсли;
		
		фМетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(СокрЛП(Настройки.Область("R3C5").Текст));
		Если фМетаданныеИсточника = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Объект.ЗапретСозданияНовыхЭлементов = НЕ ПустаяСтрока(Настройки.Область("R4C5").Текст);
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	// Заполним реквизиты справочника настроек.
	Если Объект.ВариантИспользованияНастройки <> Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Объект.ВариантИспользованияНастройки = Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Содержит(фМетаданныеИсточника) Тогда
		// Это регистр сведений.
		Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений;
		Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Имя;
		Объект.ИмяТабличнойЧасти               = "";
		Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Представление();
		Объект.ПредставлениеТабличнойЧасти     = "";
	ИначеЕсли Метаданные.Справочники.Содержит(фМетаданныеИсточника) Тогда
		// Это справочник.
		Объект.ТипПрикладногоОбъекта           = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
		Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Имя;
		Объект.ИмяТабличнойЧасти               = "";
		Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Представление();
		Объект.ПредставлениеТабличнойЧасти     = "";
	Иначе
		// Это ТЧ, только надо разобраться, чья.
		Если Метаданные.Документы.Содержит(фМетаданныеИсточника.Родитель()) Тогда
			Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ;
		ИначеЕсли Метаданные.Справочники.Содержит(фМетаданныеИсточника.Родитель()) Тогда
			Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
		ИначеЕсли Метаданные.Обработки.Содержит(фМетаданныеИсточника.Родитель()) Тогда
			Объект.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка;
		КонецЕсли;
		Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Родитель().Имя;
		Объект.ИмяТабличнойЧасти               = фМетаданныеИсточника.Имя;
		Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Родитель().Представление();
		Объект.ПредставлениеТабличнойЧасти     = фМетаданныеИсточника.Представление();
	КонецЕсли;
	
	Объект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(Настройки);
	
	Возврат Истина;
	
КонецФункции

// Получить цену загружаемой серии.
//
Функция ПолучитьЦенуЗагружаемойСерии(ТекстыЯчеек, ТаблицаЗагружаемыхРеквизитов) Экспорт
	
	Попытка
		НайденнаяСтрока = ТаблицаЗагружаемыхРеквизитов.Найти("Цена","ИмяРеквизита");
		Если НайденнаяСтрока <> Неопределено Тогда 
			НомерКолонкиЦена = НайденнаяСтрока.НомерКолонки;
			Если ЗначениеЗаполнено(НомерКолонкиЦена)  Тогда
				Возврат Число(ТекстыЯчеек[НомерКолонкиЦена]);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат 0;
	
КонецФункции

// Функция получает штрихкод номенклатуры из настроек
//
Функция ПолучитьШКНоменклатурыИзНастроек(СтруктураПараметров, ТекстыЯчеек, СтруктураПараметровЛогирования = Неопределено) Экспорт
	Попытка
		СтрокаШтрихКод   = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("ШтрихКод","ИмяРеквизита");
		НомерКолонкиШтрихКод = СтрокаШтрихКод.НомерКолонки;
	Исключение
		СтрокаШтрихКод = Неопределено;
		НомерКолонкиШтрихКод = 0;
	КонецПопытки;
	
	// Найдем штрихкод 
	Если ЗначениеЗаполнено(СтрокаШтрихКод) И СтрокаШтрихКод.РежимЗагрузки = "Искать" И ЗначениеЗаполнено(НомерКолонкиШтрихКод) И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиШтрихКод])Тогда
		ВозвращаемыйШтрихКод = ТекстыЯчеек[НомерКолонкиШтрихКод];
	ИначеЕсли ЗначениеЗаполнено(СтрокаШтрихКод) И СтрокаШтрихКод.РежимЗагрузки = "Вычислять" Тогда
		Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаШтрихКод.Выражение,?(СтрокаШтрихКод.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаШтрихКод.НомерКолонки]),ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			ВозвращаемыйШтрихКод = Вычисление.Результат;
		Иначе
			ВозвращаемыйШтрихКод = "";
		КонецЕсли;
	Иначе
		ВозвращаемыйШтрихКод = "";
	КонецЕсли;
	
	Возврат ВозвращаемыйШтрихКод;
	
КонецФункции

// Функция получает штрихкод номенклатуры из параметров
//
Функция ПолучитьШтрихкодИзПараметров(ТабличныйДокумент, СтруктураПараметров, ТекстыЯчеек, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ВозвращаемыйШК = "";
	Попытка
		СтрокаШтрихКод   = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("ШтрихКод","ИмяРеквизита");
		НомерКолонкиШтрихКод = СтрокаШтрихКод.НомерКолонки;
	Исключение
		СтрокаШтрихКод = Неопределено;
		НомерКолонкиШтрихКод = 0;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(СтрокаШтрихКод) И СтрокаШтрихКод.РежимЗагрузки = "Искать" И ЗначениеЗаполнено(НомерКолонкиШтрихКод) И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиШтрихКод])Тогда
		ВозвращаемыйШК = ТекстыЯчеек[НомерКолонкиШтрихКод];
	ИначеЕсли ЗначениеЗаполнено(СтрокаШтрихКод) И СтрокаШтрихКод.РежимЗагрузки = "Вычислять" Тогда
		Вычисление = ВычислитьЗначениеДляХарактеристики(СтрокаШтрихКод.Выражение,?(СтрокаШтрихКод.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаШтрихКод.НомерКолонки]),ТекстыЯчеек, "", СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			ВозвращаемыйШК = Вычисление.Результат;
		Иначе
			ВозвращаемыйШК = "";
		КонецЕсли;
	Иначе
		ВозвращаемыйШК = "";
	КонецЕсли;
	
	Возврат ВозвращаемыйШК;
	
КонецФункции

Функция ПолучитьФлагМаркируемогоТовараГосИС(Владелец)
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоМаркируемыйТовар = Ложь;
	Если ТипЗнч(Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		ДанныеПродукции = ОбщегоНазначенияИС.СвойстваМаркируемойПродукции(Владелец);
		ЭтоМаркируемыйТовар = ДанныеПродукции.МаркируемаяПродукция;
	ИначеЕсли ТипЗнч(Владелец)=Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		ДанныеВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "ВидПродукцииИС, ВидАлкогольнойПродукции");
		
		ЭтоМаркируемыйТовар = (ДанныеВида.ВидПродукцииИС <> Перечисления.ВидыПродукцииИС.ПустаяСсылка()
				И ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП"))
			Или (ДанныеВида.ВидАлкогольнойПродукцииЕГАИС.Маркируемый
				И ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции"));
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЭтоМаркируемыйТовар;
	
КонецФункции

#КонецОбласти