
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	НаборЦветов = РегистрыСведений.ор_ИндикацияСерийПоСрокамГодности.СоздатьНаборЗаписей();
	НаборЦветов.Прочитать();
	
	Для Каждого Цвет Из НаборЦветов Цикл
		НоваяСтрока = ор_ТаблицаИндикацииСерий.Добавить();
		НоваяСтрока.КоличествоДней = Цвет.КоличествоДней;
		НоваяСтрока.ЦветНаФорме    = Цвет.Цвет.Получить();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаскраситьТаблицуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ор_ТаблицаИндикацииСерийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не Копирование Тогда
		РаскраситьТаблицуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ор_ТаблицаИндикацииСерийЦветНаФормеПриИзменении(Элемент)
	
	РаскраситьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ор_ТаблицаИндикацииСерийПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ор_ТаблицаИндикацииСерий.Сортировать("КоличествоДней");
	
	КоличествоСтрок = ор_ТаблицаИндикацииСерий.Количество()-1;
	ТекущееЗначение=0;
	
	Для Сч = 0 По КоличествоСтрок Цикл
		
		ПроверяемоеЗначение = ор_ТаблицаИндикацииСерий[Сч].КоличествоДней;
		
		Если ТекущееЗначение < ПроверяемоеЗначение Тогда
			ТекущееЗначение = ПроверяемоеЗначение;
		Иначе
			ТекстСообщения = НСтр("ru = 'Интервалы индикации серий должны иметь продолжительность больше одного дня.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ор_ТаблицаИндикацииСерийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеИндикацииВРегистрНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РаскраситьТаблицуНаСервере()
	
	Для Каждого Строка Из ор_ТаблицаИндикацииСерий Цикл
		
		ЭлементСтарый = Неопределено;
		
		// Проверка существует ли такой отбор для Условного Оформления
		Для Каждого ЭлементУО Из ЭтотОбъект.УсловноеОформление.Элементы Цикл
			
			ЭлементО = ЭлементУО.Отбор.Элементы;
			ЭлементОф = ЭлементУО.Поля.Элементы;
			Если ЭлементО.Количество() = 1 И ЭлементОф.Количество() = 1 
				И ЭлементО[0].ЛевоеЗначение = Строка.ЦветНаФорме
				И ЭлементОф.Элементы[0].Поле = "ор_ТаблицаИндикацииСерийЦветНаФорме" Тогда
				
				ЭлементСтарый = ЭлементУО;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭлементСтарый = Неопределено Тогда
			
			ЭлементУО =ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Строка.ЦветНаФорме);
			
			ЭлементУсловия                  = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ор_ТаблицаИндикацииСерий.ЦветНаФорме");
			ЭлементУсловия.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение   = Строка.ЦветНаФорме;
			
			ОформляемоеПоле                 = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле            = Новый ПолеКомпоновкиДанных("ор_ТаблицаИндикацииСерийЦветНаФорме");
			
		Иначе
			ЭлементУО = ЭлементСтарый;
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Строка.ЦветНаФорме);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере 
Процедура ЗаписатьДанныеИндикацииВРегистрНаСервере()
	
	ТаблицаЦветов = РеквизитФормыВЗначение("ор_ТаблицаИндикацииСерий");
	НаборЗаписей=РегистрыСведений.ор_ИндикацияСерийПоСрокамГодности.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаЦвета Из ТаблицаЦветов Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.КоличествоДней = СтрокаЦвета.КоличествоДней;
		ЗаписьНабора.Цвет           = Новый ХранилищеЗначения(СтрокаЦвета.ЦветНаФорме);
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось установить цвета индикации серий. Повторите попытку.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ор_ТаблицаИндикацииСерийПослеУдаления(Элемент)
	
	ОчиститьСообщения();
	ЗаписатьДанныеИндикацииВРегистрНаСервере();
	
КонецПроцедуры

#КонецОбласти
