
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ИсключитьСсылку;
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Параметры.Свойство("Формула", Формула);
	Параметры.Свойство("Ссылка", ИсключитьСсылку);
	
	Если Параметры.Свойство("ИдентификаторВидаЦен") Тогда
		
		ИсключитьСсылку = ЦенообразованиеФормулыСервер.НайтиВидЦенПоИдентификатору(Параметры.ИдентификаторВидаЦен).ВидЦен;
		
	КонецЕсли;
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ЦеныКонтрагентов", ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов"));
	КэшЗначений.Вставить("ОперандНачало", ЦенообразованиеФормулыСервер.СтрокаНачалаОперанда());
	КэшЗначений.Вставить("ОперандКонец", ЦенообразованиеФормулыСервер.СтрокаКонцаОперанда());
	
	ЭтоФормированиеЦен = Ложь;
	Если Параметры.Свойство("ЭтоФормированиеЦен") Тогда
		
		ЭтоФормированиеЦен = Параметры.ЭтоФормированиеЦен;
		
	КонецЕсли;
	
	ЗаполнитьДеревоОперандов(ИсключитьСсылку, ЭтоФормированиеЦен, Истина, КэшЗначений.ЦеныКонтрагентов);
	ЗаполнитьДеревоОператоров();
	
	Если Параметры.Свойство("ДополнительныеПараметры") Тогда
		
		ЭтотОбъект.ор_АдресХранилищаДополнительныхПараметров = Параметры.ДополнительныеПараметры;
		ДополнительныеПараметры = ПолучитьИзВременногоХранилища(ЭтотОбъект.ор_АдресХранилищаДополнительныхПараметров);
		
		ЭтотОбъект.ор_ВариантРасчета = ДополнительныеПараметры.ВариантРасчета;
		ЭтотОбъект.ор_ДиапазоныНаценок.Загрузить(ДополнительныеПараметры.ДиапазоныНаценок);
		
		Если ЭтотОбъект.ор_ВариантРасчета = Перечисления.ор_ВидыДополнительныхАлгоритмовРасчетаЦен.ЖНВЛП Тогда
			
			ЭтотОбъект.ор_ВидЦенБазыРасчета       = ДополнительныеПараметры.ВидЦенБазыРасчета;
			ЭтотОбъект.ор_ВидЦенДляРасчетаНаценки = ДополнительныеПараметры.ВидЦенДляРасчетаНаценки;
			ЭтотОбъект.ор_КонтрольМаксНаценки     = ДополнительныеПараметры.КонтрольМаксНаценки;
			ЭтотОбъект.ор_КонтрольМинНаценки      = ДополнительныеПараметры.КонтрольМинНаценки;
			ЭтотОбъект.ор_ЗначениеМаксНаценки     = ДополнительныеПараметры.ЗначениеМаксНаценки;
			ЭтотОбъект.ор_ЗначениеМинНаценки      = ДополнительныеПараметры.ЗначениеМинНаценки;
			ЭтотОбъект.ор_ИспользоватьДиапазоны   = ДополнительныеПараметры.ИспользоватьДиапазоны;
			ЭтотОбъект.ор_ПроцентНаценки          = ДополнительныеПараметры.ПроцентНаценки;
			ЭтотОбъект.ор_СистемаНалогообложения  = ДополнительныеПараметры.СистемаНалогообложения;
			
			Элементы.ор_ФормулаСтраницаЖНВЛП.Заголовок = НСтр("ru = 'Формула для расчета цен ЖНВЛП'");
			Элементы.ор_ГруппаСтраницы.ТекущаяСтраница = Элементы.ор_СтраницаРасчетЖНВЛП;
			
		ИначеЕсли ЭтотОбъект.ор_ВариантРасчета = Перечисления.ор_ВидыДополнительныхАлгоритмовРасчетаЦен.НСиПТВ Тогда
			
			ЭтотОбъект.ор_ВидЦенБазыРасчета       = ДополнительныеПараметры.ВидЦенБазыРасчета;
			ЭтотОбъект.ор_ВидЦенДляРасчетаНаценки = ДополнительныеПараметры.ВидЦенДляРасчетаНаценки;
			ЭтотОбъект.ор_КонтрольМаксНаценки     = ДополнительныеПараметры.КонтрольМаксНаценки;
			ЭтотОбъект.ор_КонтрольМинНаценки      = ДополнительныеПараметры.КонтрольМинНаценки;
			ЭтотОбъект.ор_ЗначениеМаксНаценки     = ДополнительныеПараметры.ЗначениеМаксНаценки;
			ЭтотОбъект.ор_ЗначениеМинНаценки      = ДополнительныеПараметры.ЗначениеМинНаценки;
			ЭтотОбъект.ор_ИспользоватьДиапазоны   = ДополнительныеПараметры.ИспользоватьДиапазоны;
			ЭтотОбъект.ор_ПроцентНаценки          = ДополнительныеПараметры.ПроцентНаценки;
			ЭтотОбъект.ор_СистемаНалогообложения  = ДополнительныеПараметры.СистемаНалогообложения;
			
			Элементы.ор_ФормулаСтраницаЖНВЛП.Заголовок = НСтр("ru = 'Формула для расчета цен НСиПТВ'");
			Элементы.ор_ГруппаСтраницы.ТекущаяСтраница = Элементы.ор_СтраницаРасчетЖНВЛП;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормыНаСервере();
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы И Модифицированность И НЕ ПустаяСтрока(Формула) Тогда
		Отказ = Истина;
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПроверкаМодифицированности", ЭтотОбъект);
		Текст = НСтр("ru = 'Формула была изменена. Сохранить изменения?'");
		ПоказатьВопрос(ОповещениеОЗакрытии, Текст, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаМодифицированности(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ОК( Неопределено );
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ФормулаПриИзменении(Элемент)
	
	ОператорыДопускающуюЗапятую = Новый Массив;
	ОператорыДопускающуюЗапятую.Добавить("Мин");
	ОператорыДопускающуюЗапятую.Добавить("Макс");
	ОператорыДопускающуюЗапятую.Добавить("Окр");
	
	КоличествоДопустимыхЗапятых = 0;
	Для каждого ЭлементМассива Из ОператорыДопускающуюЗапятую Цикл
		
		КоличествоДопустимыхЗапятых = КоличествоДопустимыхЗапятых + СтрЧислоВхождений(ВРЕГ(Формула), ВРЕГ(ЭлементМассива));
		
	КонецЦикла;
	
	КоличествоЗапятых = СтрЧислоВхождений(Формула, ",");
	Если КоличествоЗапятых > КоличествоДопустимыхЗапятых Тогда
		
		ТекстСообщения = НСтр("ru ='Для указания дробной части необходимо использовать точку, а не запятую.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Формула");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОперандовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеТекущейСтроки = Элементы.ДеревоОперандов.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстВставки = КэшЗначений.ОперандНачало + ДанныеТекущейСтроки.Операнд + КэшЗначений.ОперандКонец;
	
	ВставитьТекстВФормулу(ТекстВставки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОперандовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеТекущейСтроки = Элементы.ДеревоОперандов.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = КэшЗначений.ОперандНачало + ДанныеТекущейСтроки.Операнд + КэшЗначений.ОперандКонец;
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеТекущейСтроки = Элементы.Операторы.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыДобавленияТекста = ПередДобавлениемТекстаВФормулу(ДанныеТекущейСтроки.Оператор);
	Если НЕ ПараметрыДобавленияТекста.Отказ = Истина Тогда
		
		ВставитьТекстВФормулу(ПараметрыДобавленияТекста.ТекстВставки, ПараметрыДобавленияТекста.ЗаменитьТекстФормулы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ПараметрыПеретаскивания.Значение.Количество() < 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеТекущейСтроки = ПараметрыПеретаскивания.Значение[0];
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДобавленияТекста = ПередДобавлениемТекстаВФормулу(ДанныеТекущейСтроки.Оператор);
	Если НЕ ПараметрыДобавленияТекста.Отказ = Истина Тогда
		
		ВставитьТекстВФормулу(ПараметрыДобавленияТекста.ТекстВставки, ПараметрыДобавленияТекста.ЗаменитьТекстФормулы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Перем Ошибки;
	
	Если НЕ ПроверитьКорректностьПределовНаценки() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьКорректностьЗаполненияДиапазоновНаценки() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ПроверитьФормулуНаСервере(Ошибки);   
	
	Если Ошибки = Неопределено Тогда
		
		ДополнительнаяОбработкаФормулы();
		Модифицированность = Ложь;
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Результат", КодВозвратаДиалога.Да);
		СтруктураРезультат.Вставить("Формула", Формула);
		СтруктураРезультат.Вставить("ор_АдресХранилищаДополнительныхПараметров", ЭтотОбъект.ор_АдресХранилищаДополнительныхПараметров);
		Закрыть(СтруктураРезультат);
		
	Иначе
		
		Если Интерфейс85 Тогда
			
			ТекстПредупреждения = НСтр("ru ='Ошибка в формуле!'");
			ПоказатьПредупреждение(, ТекстПредупреждения, , НСтр("ru ='Проверка формулы'"));
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки); 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулу(Команда)
	Перем Ошибки;
	
	ОчиститьСообщения();
	ПроверитьФормулуНаСервере(Ошибки);
	
	Если Ошибки = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru ='Формула пригодна для расчетов.'");
		ПоказатьПредупреждение(, ТекстПредупреждения, , НСтр("ru ='Проверка формулы'"));
		
	Иначе
		
		Если Интерфейс85 Тогда
			
			ТекстПредупреждения = НСтр("ru ='Ошибка в формуле!'");
			ПоказатьПредупреждение(, ТекстПредупреждения, , НСтр("ru ='Проверка формулы'"));
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки); 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если Интерфейс85 Тогда 
		
		Элементы.Переместить(Элементы.ОК, Элементы.ГруппаКомандыФормы);
		Элементы.Переместить(Элементы.Проверить, Элементы.ГруппаКомандыФормы);  
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПанель", 
			"Видимость", Ложь);  
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьРасчетныйОперанд(НоваяГруппа, НаименованиеОперанда, ПредставлениеОперанда, ЭтоВидЦенНоменклатуры = Неопределено, ИндексКартинка = 0)
	
	НоваяСтрока = НоваяГруппа.Строки.Добавить();
	
	НоваяСтрока.Операнд					= НаименованиеОперанда;
	НоваяСтрока.Представление			= ПредставлениеОперанда;
	НоваяСтрока.ЭтоВидЦенНоменклатуры	= ЭтоВидЦенНоменклатуры;
	НоваяСтрока.Картинка				= ИндексКартинка;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОперандов(ИсключитьСсылку, ЭтоФормированиеЦен, ВключаяЦеныНоменклатуры, ВключаяЦеныКонтрагентов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ВидыЦен.ИдентификаторФормул КАК Операнд,
	|	ПРЕДСТАВЛЕНИЕ(ВидыЦен.Ссылка) КАК Представление,
	|	ИСТИНА КАК ЭтоВидЦенНоменклатуры,
	|	0 КАК Картинка
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.Ссылка <> &ИсключитьСсылку
	|	И НЕ ВидыЦен.Недействителен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЦенКонтрагентов.ИдентификаторФормул,
	|	ПРЕДСТАВЛЕНИЕ(ВидыЦенКонтрагентов.Ссылка),
	|	ЛОЖЬ,
	|	0
	|ИЗ
	|	Справочник.ВидыЦенКонтрагентов КАК ВидыЦенКонтрагентов
	|ИТОГИ
	|	ВЫБОР
	|		КОГДА ЭтоВидЦенНоменклатуры = ИСТИНА
	|			ТОГДА ""ЦЕНЫ НОМЕНКЛАТУРЫ""
	|		ИНАЧЕ ""ЦЕНЫ КОНТРАГЕНТОВ""
	|	КОНЕЦ КАК Представление,
	|	1 КАК Картинка
	|ПО
	|	ЭтоВидЦенНоменклатуры");
	
	Запрос.УстановитьПараметр("ИсключитьСсылку", ИсключитьСсылку);
	ДеревоРезультата = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Если ЭтоФормированиеЦен Тогда
		
		НоваяГруппа 				= ДеревоРезультата.Строки.Вставить(0);
		НоваяГруппа.Картинка		= 1;
		НоваяГруппа.Представление	= НСтр("ru ='РАСЧЕТНЫЕ ЗНАЧЕНИЯ'");
		
		ДобавитьРасчетныйОперанд(НоваяГруппа, "ТекущееЗначение",		НСтр("ru ='Текущее значение'"));
		ДобавитьРасчетныйОперанд(НоваяГруппа, "ПоследняяЦенаВПриходе",	НСтр("ru ='Последняя цена поступления'"));
		ДобавитьРасчетныйОперанд(НоваяГруппа, "ПоследняяЦенаВРасходе",	НСтр("ru ='Последняя цена реализации'"));
		
		Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
			
			Если Справочники.Валюты.НайтиПоКоду("840") <> Неопределено Тогда
				
				ДобавитьРасчетныйОперанд(НоваяГруппа, "КурсДоллара", 	НСтр("ru ='Текущий курс доллара'"));
				
			КонецЕсли;
			
			Если Справочники.Валюты.НайтиПоКоду("978") <> Неопределено Тогда
				
				ДобавитьРасчетныйОперанд(НоваяГруппа, "КурсЕвро", 		НСтр("ru ='Текущий курс евро'"));
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДобавитьРасчетныйОперанд(НоваяГруппа, "Себестоимость", 			НСтр("ru ='Себестоимость'"));
		
		Если Константы.ВалютаУчета.Получить() <> Константы.НациональнаяВалюта.Получить() Тогда
			
			ДобавитьРасчетныйОперанд(НоваяГруппа, "СебестоимостьНацВалюта", НСтр("ru ='Себестоимость (нац. валюта)'"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключаяЦеныНоменклатуры = Ложь Тогда
		
		НайденнаяСтрока = ДеревоРезультата.Строки.Найти("ЦЕНЫ НОМЕНКЛАТУРЫ", "Представление", Ложь);
		Если НайденнаяСтрока <> Неопределено Тогда
			
			ДеревоРезультата.Строки.Удалить(НайденнаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключаяЦеныКонтрагентов = Ложь Тогда
		
		НайденнаяСтрока = ДеревоРезультата.Строки.Найти("ЦЕНЫ КОНТРАГЕНТОВ", "Представление", Ложь);
		Если НайденнаяСтрока <> Неопределено Тогда
			
			ДеревоРезультата.Строки.Удалить(НайденнаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоРезультата, "ДеревоОперандов");
	
КонецПроцедуры

&НаКлиенте
Функция ПередДобавлениемТекстаВФормулу(ЗНАЧ ТекстВставки)
	
	ПараметрыДобавленияТекста = Новый Структура("ТекстВставки, ЗаменитьТекстФормулы, Отказ", ТекстВставки, Ложь, Ложь);
	
	ДанныеОперанда = Элементы.ДеревоОперандов.ТекущиеДанные;
	
	Если СокрЛП(ПараметрыДобавленияТекста.ТекстВставки) = "%1"
		ИЛИ СокрЛП(ПараметрыДобавленияТекста.ТекстВставки) = "%5"
		ИЛИ СокрЛП(ПараметрыДобавленияТекста.ТекстВставки) = "%20"
		ИЛИ СокрЛП(ПараметрыДобавленияТекста.ТекстВставки) = "%50"
		Тогда
		
		Если ДанныеОперанда = Неопределено 
			ИЛИ ПустаяСтрока(ДанныеОперанда.Операнд) Тогда
			
			ТекстСообщения = НСтр("ru ='Укажите вид цен, от которого необходимо вычислить процент'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ДеревоОперандов");
			
			ПараметрыДобавленияТекста.Отказ = Истина;
			Возврат ПараметрыДобавленияТекста;
			
		Иначе
			
			ПредставлениеЧисло = СтрЗаменить(ТекстВставки, "%", "");
			ПараметрыДобавленияТекста.ТекстВставки = СтрШаблон(" + (%1", КэшЗначений.ОперандНачало) + ДанныеОперанда.Операнд + СтрШаблон("%1 / 100 * ", КэшЗначений.ОперандКонец) + ПредставлениеЧисло + ".0)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СокрЛП(ПараметрыДобавленияТекста.ТекстВставки) = "ЕСЛИ" Тогда
		
		ПервоеЗначениеУсловногоОператора = "<?>";
		Если НЕ ПустаяСтрока(Формула) Тогда
			
			ПервоеЗначениеУсловногоОператора = Формула;
			Формула = "";
			ПараметрыДобавленияТекста.ЗаменитьТекстФормулы = Истина;
			
		ИначеЕсли ДанныеОперанда <> Неопределено 
			И НЕ ПустаяСтрока(ДанныеОперанда.Операнд) Тогда
			
			ПервоеЗначениеУсловногоОператора = КэшЗначений.ОперандНачало + ДанныеОперанда.Операнд + КэшЗначений.ОперандКонец;
			
		КонецЕсли;
		
		ПараметрыДобавленияТекста.ТекстВставки = СтрШаблон("#ЕСЛИ <Условие>%1%2#ТОГДА %3%1%2#ИНАЧЕ <?>%1#КОНЕЦЕСЛИ", Символы.ПС, Символы.Таб, ПервоеЗначениеУсловногоОператора);
		
	КонецЕсли;
	
	Возврат ПараметрыДобавленияТекста;
	
КонецФункции

&НаКлиенте
Процедура ВставитьТекстВФормулу(ТекстВставки, ЗаменитьТекстФормулы = Ложь)
	
	Если ПустаяСтрока(ТекстВставки) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если ЗаменитьТекстФормулы Тогда
		
		Формула = ТекстВставки;
		Возврат;
		
	КонецЕсли;
	
	#Если МобильныйКлиент Тогда
		
		Формула = Формула + ТекстВставки;
		
	#Иначе
		
		СтрокаНач = 0;
		СтрокаКон = 0;
		КолонкаНач = 0;
		КолонкаКон = 0;
		
		Элементы.Формула.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
		Если (КолонкаКон = КолонкаНач) И (КолонкаКон + СтрДлина(ТекстВставки)) > Элементы.Формула.Ширина / 8 Тогда
			
			Элементы.Формула.ВыделенныйТекст = "";
			
		КонецЕсли;
			
		Элементы.Формула.ВыделенныйТекст = ТекстВставки;
		
	#КонецЕсли
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Формула;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОператоров()
	
	ДеревоОператоров = РеквизитФормыВЗначение("Операторы", Тип("ДеревоЗначений"));
	
	ГруппаСтрок 				= ДеревоОператоров.Строки.Добавить();
	ГруппаСтрок.Наименование	= НСтр("ru ='АРИФМЕТИЧЕСКИЕ ОПЕРАТОРЫ'");
	ГруппаСтрок.Картинка		= 1;
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Сложение ""+""'");
	НоваяСтрока.Оператор		= " + ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Вычитание ""-""'");
	НоваяСтрока.Оператор		= " - ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Умножение ""*""'");
	НоваяСтрока.Оператор		= " * ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Деление ""/""'");
	НоваяСтрока.Оператор		= " / ";
	
	ГруппаСтрок 				= ДеревоОператоров.Строки.Добавить();
	ГруппаСтрок.Наименование	= НСтр("ru ='ЛОГИЧЕСКИЕ ОПЕРАТОРЫ'");
	ГруппаСтрок.Картинка		= 1;
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Если...Иначе...КонецЕсли'");
	НоваяСтрока.Оператор		= "ЕСЛИ"; // "#ЕСЛИ <Условие> #ТОГДА <?> #ИНАЧЕ <?> #КОНЕЦЕСЛИ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='>'");
	НоваяСтрока.Оператор		= " > ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='>='");
	НоваяСтрока.Оператор		= " >= ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='<'");
	НоваяСтрока.Оператор		= " < ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='<='");
	НоваяСтрока.Оператор		= " <= ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='='");
	НоваяСтрока.Оператор		= " = ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='<>'");
	НоваяСтрока.Оператор		= " <> ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='И'");
	НоваяСтрока.Оператор		= " И ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='ИЛИ'");
	НоваяСтрока.Оператор		= " ИЛИ ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='НЕ'");
	НоваяСтрока.Оператор		= " НЕ ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='ИСТИНА'");
	НоваяСтрока.Оператор		= " ИСТИНА ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='ЛОЖЬ'");
	НоваяСтрока.Оператор		= " ЛОЖЬ ";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Открывающая скобка ""(""'");
	НоваяСтрока.Оператор		= " (";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Закрывающая скобка "")""'");
	НоваяСтрока.Оператор		= ") ";
	
	ГруппаСтрок 				= ДеревоОператоров.Строки.Добавить();
	ГруппаСтрок.Наименование	= НСтр("ru ='ФУНКЦИИ'");
	ГруппаСтрок.Картинка		= 1;
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Максимум'");
	НоваяСтрока.Оператор		= " Макс(<?>,<?>)";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Минимум'");
	НоваяСтрока.Оператор		= " Мин(<?>,<?>)";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Целая часть'");
	НоваяСтрока.Оператор		= " Цел(<?>)";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Округление'");
	НоваяСтрока.Оператор		= " Окр(<?>,<Точность?>)";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Предопределенное значение'");
	НоваяСтрока.Оператор		= " ПредопределенноеЗначение(<?>)";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Значение заполнено'");
	НоваяСтрока.Оператор		= " ЗначениеЗаполнено(<?>)";
	
	ГруппаСтрок 				= ДеревоОператоров.Строки.Добавить();
	ГруппаСтрок.Наименование	= НСтр("ru ='ШАБЛОНЫ'");
	ГруппаСтрок.Картинка		= 1;
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Процент ""1%""'");
	НоваяСтрока.Оператор		= " %1";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Процент ""5%""'");
	НоваяСтрока.Оператор		= " %5";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Процент ""20%""'");
	НоваяСтрока.Оператор		= " %20";
	
	НоваяСтрока 				= ГруппаСтрок.Строки.Добавить();
	НоваяСтрока.Наименование	= НСтр("ru ='Процент ""50%""'");
	НоваяСтрока.Оператор		= " %50";
	
	ЗначениеВРеквизитФормы(ДеревоОператоров, "Операторы");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулуНаСервере(Ошибки)
	
	ЦенообразованиеФормулыСервер.ПроверитьФормулу(Ошибки, Формула);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУмножениеВФормулу()
	
	// Процедура заменяет "][" на "]*["
	ТаблицаВставок = Новый ТаблицаЗначений;
	ТаблицаВставок.Колонки.Добавить("ПозицияНачалаОперанда");
	ТаблицаВставок.Колонки.Добавить("ПозицияКонцаОперанда");
	
	НачалоОперанда	= ЦенообразованиеФормулыСервер.СтрокаНачалаОперанда();
	КонецОперанда	= ЦенообразованиеФормулыСервер.СтрокаКонцаОперанда();
	
	ПозицияНачалаОперанда = 0;
	ПозицияКонцаОперанда = 0;
	
	СтрокаМежду			= "";
	ДлинаСтроки 		= СтрДлина(Формула);
	Для ИндексСимвола = 0 По ДлинаСтроки Цикл
		
		Символ = Сред(Формула, ИндексСимвола, 1);
		Если Символ = КонецОперанда Тогда
			
			СтрокаМежду 			= "";
			ПозицияКонцаОперанда 	= ИндексСимвола;
			ПозицияНачалаОперанда	= 0;
			
		ИначеЕсли Символ = НачалоОперанда Тогда
			
			ПозицияНачалаОперанда	= ИндексСимвола;
			
		КонецЕсли;
			
		Если ПозицияКонцаОперанда <> 0 
			И ПозицияНачалаОперанда = 0
			И Символ <> КонецОперанда Тогда
			
			СтрокаМежду = СтрокаМежду + Символ;
			
		ИначеЕсли ПозицияКонцаОперанда <> 0 
			И ПозицияНачалаОперанда <> 0 Тогда
			
			Если ПустаяСтрока(СокрЛП(СтрокаМежду)) Тогда
				
				НоваяСтрока							= ТаблицаВставок.Добавить();
				НоваяСтрока.ПозицияНачалаОперанда	= ПозицияНачалаОперанда;
				НоваяСтрока.ПозицияКонцаОперанда	= ПозицияКонцаОперанда;
				
			КонецЕсли;
			
			СтрокаМежду				= "";
			ПозицияНачалаОперанда	= 0;
			ПозицияКонцаОперанда	= 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоВставок = ТаблицаВставок.Количество();
	Если КоличествоВставок > 0 Тогда
		
		Пока КоличествоВставок <> 0 Цикл
			
			СтрокаТаблицы = ТаблицаВставок.Получить(КоличествоВставок - 1);
			
			ПерваяПодстрока = Лев(Формула, СтрокаТаблицы.ПозицияКонцаОперанда);
			ВтораяПодстрока = Сред(Формула, СтрокаТаблицы.ПозицияНачалаОперанда);
			
			Формула 		= ПерваяПодстрока + " * " + ВтораяПодстрока;
			
			КоличествоВставок = КоличествоВставок - 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительнаяОбработкаФормулы()
	
	ДобавитьУмножениеВФормулу();
	// ор ++
	ПолучитьСтруктуруДополнительныхПараметров();
	// ор --
	
КонецПроцедуры

#Область ОтраслевыеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ор_ВидЦенБазыРасчетаПриИзменении(Элемент)
	Формула = ПолучитьФормулуДляРасчетаЦены();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ВидЦенДляРасчетаНаценкиПриИзменении(Элемент)
	Формула = ПолучитьФормулуДляРасчетаЦены();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ИспользоватьДиапазоныПриИзменении(Элемент)
	
	УправлениеЭлементамиФормыНаСервере();
	
	Если ЭтотОбъект.ор_ИспользоватьДиапазоны Тогда
		ЭтотОбъект.ор_ПроцентНаценки = 0;
		ЭтотОбъект.ор_КонтрольМаксНаценки = Ложь;
		ЭтотОбъект.ор_ЗначениеМаксНаценки = 0;
		ЭтотОбъект.ор_КонтрольМинНаценки = Ложь;
		ЭтотОбъект.ор_ЗначениеМинНаценки = 0;
	Иначе
		ЭтотОбъект.ор_ДиапазоныНаценок.Очистить();
	КонецЕсли;
	
	Формула = ПолучитьФормулуДляРасчетаЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ДиапазоныНаценокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// После ввода строки отсортируем ТЧ по возрастанию верхней границы.
	ЭтаФорма.ор_ДиапазоныНаценок.Сортировать("ВерхняяГраница");
	Формула = ПолучитьФормулуДляРасчетаЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ДиапазоныНаценокПослеУдаления(Элемент)
	
	Формула = ПолучитьФормулуДляРасчетаЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ДиапазоныНаценокВерхняяГраницаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ор_ДиапазоныНаценок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.ПредставлениеИнтервала = ПолучитьПредставлениеИнтервала(
		ЭтотОбъект.ор_ДиапазоныНаценок,
		Элементы.ор_ДиапазоныНаценок.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_СистемаНалогообложенияПриИзменении(Элемент)
	Формула = ПолучитьФормулуДляРасчетаЦены();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ПроцентНаценкиПриИзменении(Элемент)
	ПроверитьКорректностьПределовНаценки();
	Формула = ПолучитьФормулуДляРасчетаЦены();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_КонтрольМинНаценкиПриИзменении(Элемент)
	УправлениеЭлементамиФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_КонтрольМаксНаценкиПриИзменении(Элемент)
	УправлениеЭлементамиФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ЗначениеМинНаценкиПриИзменении(Элемент)
	ПроверитьКорректностьПределовНаценки();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ор_ЗначениеМаксНаценкиПриИзменении(Элемент)
	ПроверитьКорректностьПределовНаценки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
	
	Элементы.ор_ПроцентНаценки.Доступность    = НЕ ЭтотОбъект.ор_ИспользоватьДиапазоны;
	Элементы.ор_ЗначениеМаксНаценки.Видимость = ЭтотОбъект.ор_КонтрольМаксНаценки;
	Элементы.ор_ЗначениеМинНаценки.Видимость  = ЭтотОбъект.ор_КонтрольМинНаценки;
	
	НастроитьВидимостьСтраниц();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьСтраниц()
	
	Если ЭтотОбъект.ор_ИспользоватьДиапазоны Тогда
		Элементы.ор_СтраницыДиапазоныНаценок.ТекущаяСтраница = Элементы.ор_ГруппаДиапазоныНаценок;
	Иначе
		Элементы.ор_СтраницыДиапазоныНаценок.ТекущаяСтраница = Элементы.ор_ГруппаПределыНаценок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьПределовНаценки()
	
	Если ЭтотОбъект.ор_КонтрольМаксНаценки
		И ЭтотОбъект.ор_КонтрольМинНаценки
		И (ЭтотОбъект.ор_ЗначениеМаксНаценки <= ЭтотОбъект.ор_ЗначениеМинНаценки) Тогда
		Сообщение = НСтр("ru = 'Минимальная наценка должна быть меньше максимальной наценки !'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "ор_ЗначениеМинНаценки");
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтотОбъект.ор_КонтрольМаксНаценки
		И ЭтотОбъект.ор_ЗначениеМаксНаценки < ЭтотОбъект.ор_ПроцентНаценки Тогда
		Сообщение = НСтр("ru = 'Максимальная наценка должна быть выше значения наценки по умолчанию !'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "ор_ЗначениеМаксНаценки");
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтотОбъект.ор_КонтрольМинНаценки
		И ЭтотОбъект.ор_ПроцентНаценки < ЭтотОбъект.ор_ЗначениеМинНаценки Тогда
		Сообщение = НСтр("ru = 'Минимальная наценка должна быть ниже значения наценки по умолчанию !'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "ор_ЗначениеМинНаценки");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьКорректностьЗаполненияДиапазоновНаценки()
	
	Если ЭтаФорма.ор_ИспользоватьДиапазоны Тогда
		Если ЭтаФорма.ор_ДиапазоныНаценок.Количество() < 2 Тогда
			Сообщение = НСтр("ru = 'Невозможно получить шаблон формулы, необходимо задать более одного диапазона!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолучитьФормулуДляРасчетаЦены()
	
	РезультатВыполнения = "";
	НалогообложениеНДС = ор_ОбщегоНазначенияСервер.ПолучитьФлагНалогообложениеНДС(ЭтотОбъект.ор_СистемаНалогообложения);
	
	ШаблонВидЦенПроизводителя = ПолучитьШаблонФормулыВидаЦенДляРасчета(ЭтотОбъект.ор_ВидЦенДляРасчетаНаценки, Истина);
	ШаблонВидЦенПоставщика    = ПолучитьШаблонФормулыВидаЦенДляРасчета(ЭтотОбъект.ор_ВидЦенБазыРасчета, НалогообложениеНДС);
	
	Если ЭтотОбъект.ор_ИспользоватьДиапазоны Тогда
		ШаблонВидЦенПроизводителяДляДиапазонов = ПолучитьШаблонФормулыВидаЦенДляРасчета(ЭтотОбъект.ор_ВидЦенДляРасчетаНаценки, Истина);
		ШаблонФормулыДляНаценки = ПолучитьШаблонФормулыПоТаблицеДиапазонов(ШаблонВидЦенПроизводителяДляДиапазонов);
	Иначе
		ШаблонФормулыДляНаценки = Формат(ЭтотОбъект.ор_ПроцентНаценки / 100,"ЧРД=.; ЧГ=0");
	КонецЕсли;
	
	Если НалогообложениеНДС Тогда
		РезультатВыполнения = СтрШаблон(
			"(%1 + %2 * %3)*1.1",
			ШаблонВидЦенПоставщика,
			ШаблонВидЦенПроизводителя,
			ШаблонФормулыДляНаценки);
	Иначе
		РезультатВыполнения = СтрШаблон(
			"%1 + %2 * %3",
			ШаблонВидЦенПоставщика,
			ШаблонВидЦенПроизводителя,
			ШаблонФормулыДляНаценки);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ПолучитьСтруктуруДополнительныхПараметров()
	
	СтруктураДополнительныхПараметров = Новый Структура();
	
	СтруктураДополнительныхПараметров.Вставить("ВариантРасчета",          ЭтотОбъект.ор_ВариантРасчета);
	СтруктураДополнительныхПараметров.Вставить("ВидЦенБазыРасчета",       ЭтотОбъект.ор_ВидЦенБазыРасчета);
	СтруктураДополнительныхПараметров.Вставить("ВидЦенДляРасчетаНаценки", ЭтотОбъект.ор_ВидЦенДляРасчетаНаценки);
	СтруктураДополнительныхПараметров.Вставить("КонтрольМаксНаценки",     ЭтотОбъект.ор_КонтрольМаксНаценки);
	СтруктураДополнительныхПараметров.Вставить("КонтрольМинНаценки",      ЭтотОбъект.ор_КонтрольМинНаценки);
	СтруктураДополнительныхПараметров.Вставить("ЗначениеМаксНаценки",     ЭтотОбъект.ор_ЗначениеМаксНаценки);
	СтруктураДополнительныхПараметров.Вставить("ЗначениеМинНаценки",      ЭтотОбъект.ор_ЗначениеМинНаценки);
	СтруктураДополнительныхПараметров.Вставить("ИспользоватьДиапазоны",   ЭтотОбъект.ор_ИспользоватьДиапазоны);
	СтруктураДополнительныхПараметров.Вставить("ПроцентНаценки",          ЭтотОбъект.ор_ПроцентНаценки);
	СтруктураДополнительныхПараметров.Вставить("СистемаНалогообложения",  ЭтотОбъект.ор_СистемаНалогообложения);
	СтруктураДополнительныхПараметров.Вставить("ДиапазоныНаценок",        ЭтотОбъект.ор_ДиапазоныНаценок.Выгрузить());
	
	ЭтотОбъект.ор_АдресХранилищаДополнительныхПараметров = ПоместитьВоВременноеХранилище(СтруктураДополнительныхПараметров, ЭтотОбъект.ор_АдресХранилищаДополнительныхПараметров);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьШаблонФормулыВидаЦенДляРасчета(ВидЦен, НалогообложениеНДС)
	
	ШаблонДляРасчетаВидаЦен = "[" + ВидЦен.ИдентификаторФормул + "]";
	Если НалогообложениеНДС И ВидЦен.ЦенаВключаетНДС Тогда
		ШаблонДляРасчетаВидаЦен = ШаблонДляРасчетаВидаЦен + "/1.1";
	ИначеЕсли НЕ НалогообложениеНДС И НЕ ВидЦен.ЦенаВключаетНДС Тогда
		ШаблонДляРасчетаВидаЦен = ШаблонДляРасчетаВидаЦен + "*1.1";
	КонецЕсли;
	
	Возврат ШаблонДляРасчетаВидаЦен;
	
КонецФункции

&НаКлиенте
Функция ПолучитьШаблонФормулыПоТаблицеДиапазонов(ИдентификаторБазовыйВидЦен)
	
	ШаблонФормулы = "";
	
	Если ЭтотОбъект.ор_ДиапазоныНаценок.Количество() < 2 Тогда
		Возврат ШаблонФормулы;
	КонецЕсли;
	
	ПостфиксШаблона = "";
	Для Каждого СтрокаТЧ Из ЭтотОбъект.ор_ДиапазоныНаценок Цикл
		ШаблонФормулы = СтрШаблон(
			"%1?(%2<=%3, %4, ",
			ШаблонФормулы,
			ИдентификаторБазовыйВидЦен,
			Формат(СтрокаТЧ.ВерхняяГраница,"ЧРД=.; ЧГ=0"),
			Формат(СтрокаТЧ.ЗначениеНаценки / 100,"ЧРД=.; ЧГ=0; ЧН=0")
		);
		ПостфиксШаблона = ПостфиксШаблона + ")";
	КонецЦикла;
	
	ШаблонФормулы = ШаблонФормулы + "0" + ПостфиксШаблона;
	
	Возврат ШаблонФормулы;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеИнтервала(ТабличнаяЧасть, ТекущаяСтрока)
	
	ПредставлениеИнтервала = "";
	
	Если ТекущаяСтрока.ВерхняяГраница = 0 Тогда
		ПредставлениеИнтервала = "";
	Иначе
		
		ВалютаДиапазона = НСтр("ru = 'руб'");
		
		МинВерхняяГраница = 0.01;
		ПредыдущаяСтрока = Неопределено;
		Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
			Если МинВерхняяГраница <= СтрокаТЧ.ВерхняяГраница
					И ТекущаяСтрока.ВерхняяГраница >= СтрокаТЧ.ВерхняяГраница
					И СтрокаТЧ <> ТекущаяСтрока Тогда
				ПредыдущаяСтрока  = СтрокаТЧ;
				МинВерхняяГраница = СтрокаТЧ.ВерхняяГраница;
			КонецЕсли;
		КонецЦикла;
		
		Если ПредыдущаяСтрока = Неопределено Тогда
			ПредставлениеИнтервала = СтрШаблон(
				НСтр("ru = 'До %1 %2'"),
				СокрЛП(ТекущаяСтрока.ВерхняяГраница),
				ВалютаДиапазона);
		ИначеЕсли ТекущаяСтрока.ВерхняяГраница = ПредыдущаяСтрока.ВерхняяГраница Тогда
			ПредставлениеИнтервала = НСтр("ru = 'ОШИБКА: такая верхняя граница уже существует!'");
		Иначе
			ПредставлениеИнтервала = СтрШаблон(
				НСтр("ru = 'От %1 до %2 %3'"),
				СокрЛП(ПредыдущаяСтрока.ВерхняяГраница),
				СокрЛП(ТекущаяСтрока.ВерхняяГраница),
				ВалютаДиапазона);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредставлениеИнтервала;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

