
#Область ПрограммныйИнтерфейс

#Область РаботаСНоменклатуройПереопределяемый

// В запросе должны быть описаны временные таблицы с предопределенными полями (псевдонимами).
// На основании данных таблиц формируются файлы выгрузки номенклатуры.
//
// Если в прикладном решении отсутствуют данные для заполнения какого-то поля, либо целой таблицы, кроме обязательных,
// то это поле (или таблицу) следует исключить из запроса полностью, либо инициализировать значением(значениями) NULL.
// Обязательные таблицы и поля должны присутствовать в запросе даже если нет источников данных для их заполнения - в
// этом случае инициализировать поля значениями NULL
//
// На входе запрос содержит текст создания временной таблицы ОтборНоменклатуры, которая служит для ограничения выборки.
// Формируется на основе текста запроса, полученного методом ИнициализацияЗапросаОтбораДанныхНоменклатуры.
// Поля таблицы:
//  * Номенклатура   - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//      Если ОтборНоменклатуры.Характеристика ЕСТЬ NULL, то нужно получить данные по всем характеристикам номенклатуры
//  * ВидНоменклатуры - ОпределяемыйТип.ВидНоменклатурыРаботаСНоменклатурой - вид номенклатуры, может быть NULL, если
//                                                                            виды номенклатуры не используются.
//  * Родитель        - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - группа товара в иерархии, может быть NULL,
//      если справочник номенклатуры не иерархический.
// 
// Параметры запроса:
//  * ИсключенныеДополнительныеРеквизиты    - Массив - доп.реквизиты, запрещенные к выгрузке пользователем. Выгружать
//      надо все доп.реквизиты кроме исключений, заданных этим параметром.
//  * ВыгружатьИндивидуальныеХарактеристики - Булево   - признак необходимости выгружать индивидуальные характеристики номенклатуры.
//  * ИсключенныеВидыНоменклатуры           - Массив - виды номенклатуры, по которым пользователь запретил выгружать
//      характеристики. По всем остальным видам характеристики выгружаются.
// * Параметры запроса - строковые константы:
// * Ставки НДС:
//  * НДС0  - Строка - без НДС (или НДС 0%).
//  * НДС10 - Строка - НДС 10%.
//  * НДС18 - Строка - НДС 18%.
//  * НДС22 - Строка - НДС 22%.
// * Типы номенклатуры:
//  * Товар  - Строка - тип номенклатуры "Товар".
//  * Услуга - Строка - тип номенклатуры "Услуга".
// * Типы измеряемых величин:
//  * Вес                - Строка
//  * Объем              - Строка
//  * Площадь            - Строка
//  * Длина              - Строка
//  * КоличествоШтук     - Строка
//  * Упаковка           - Строка
//  * Мощность           - Строка
//  * Энергия            - Строка
//  * ЭлектрическийЗаряд - Строка
//  * Время              - Строка
// Классификаторы:
//  * ОКПД2  - Строка
//  * ТНВЭД  - Строка
//  * ЕГАИС  - Строка
//  * ОКВЭД2 - Строка
//
// Временные таблицы и предопределенные поля:
// Товары
//  * Номенклатура                - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика              - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//  * Наименование                - Строка - наименование товара.
//  * ХарактеристикаНаименование  - Строка - наименование характеристики.
//  * Артикул                     - Строка - артикул товара.
//  * СтавкаНДС                   - Строка - ставка НДС, значение из списка: &НДС0, &НДС10, &НДС18, &НДС22.
//  * ЕдиницаИзмерения                        - Строка - наименование базовой единицы измерения товара.
//  * ЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения товара.
//  * ЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - значение из списка: &Вес, &Объем, &Площадь, &Длина,
//      &КоличествоШтук, &Упаковка, &Мощность, &Энергия, &ЭлектрическийЗаряд, &Время.
//  * ЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения товара.
//  * ЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения товара.
//  * ЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения товара.
//  * ЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения товара к базовой величине.
//  * ЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения товара к базовой величине.
//  * ТипНоменклатуры             - Строка - значение из списка: &Товар, &Услуга.
//  * Описание                    - Строка - текстовое описание товара.
//  * НаименованияДляПечатиЧека   - Строка - краткое наименование товара для печати чека.
//  * ВестиУчетПоГТД              - Булево - вести учет по ГТД.
//  * ПродукцияМаркируемаяДляГИСМ - Булево - продукция, маркируемая для ГИСМ.
//  * ПодакцизныйТовар            - Булево - подакцизный товар.
//  * СтранаПроисхождения         - Строка - код страны происхождения товара согласно ОКСМ.
//  * Производитель               - Ссылка - ссылка (уникальный идентификатор) производителя.
//  * ПроизводительНаименование   - Строка - наименование производителя.
//  * ПроизводительИНН            - Строка - ИНН производителя.
//  * ПроизводительКПП            - Строка - КПП производителя.
//  * Марка                       - Ссылка - ссылка (уникальный идентификатор) марки (бренда).
//  * МаркаНаименование           - Строка - наименование марки (бренда).
//  * КоличествоВУпаковке                                        - Число  - количество штук в 1 единице (упаковке)
//      товара. Например: 1 пачка фломастеров содержит 10 штук фломастеров.
//  * КоличествоВУпаковкеЕдиницаИзмерения                        - Строка - наименование единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &КоличествоШтук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения
//                                                                          количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения
//                                                                          количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы
//                                                                          измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения
//                                                                          количества штук к базовой величине.
//  * КоличествоВУпаковкеЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения
//                                                                          количества штук к базовой величине.
//  * ВесЧислитель                               - Число  - числитель отношения единицы измерения веса к единице
//                                                          измерения товара.
//  * ВесЗнаменатель                             - Число  - знаменатель отношения единицы измерения веса к единице
//                                                          измерения товара.
//  * ВесЕдиницаИзмерения                        - Строка - наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения веса.
//  * ВесЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Вес.
//  * ВесЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения веса.
//  * ВесЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения веса.
//  * ВесЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения веса к базовой величине.
//  * ВесЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения веса к базовой величине.
//  * ДлинаЧислитель                               - Число  - числитель отношения единицы измерения длины к единице
//                                                            измерения товара.
//  * ДлинаЗнаменатель                             - Число  - знаменатель отношения единицы измерения длины к единице
//                                                            измерения товара.
//  * ДлинаЕдиницаИзмерения                        - Строка - наименование единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ДлинаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения длины к базовой величине.
//  * ДлинаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения длины к базовой величине.
//  * ОбъемЧислитель                               - Число  - числитель отношения единицы измерения объема к единице
//                                                            измерения товара.
//  * ОбъемЗнаменатель                             - Число  - знаменатель отношения единицы измерения объема к единице
//                                                            измерения товара.
//  * ОбъемЕдиницаИзмерения                        - Строка - наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Объем.
//  * ОбъемЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения объема к базовой величине.
//  * ОбъемЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения объема к базовой величине.
//  * ПлощадьЧислитель                               - Число  - числитель отношения единицы измерения площади к единице
//                                                              измерения товара.
//  * ПлощадьЗнаменатель                             - Число  - знаменатель отношения единицы измерения площади к
//                                                              единице измерения товара.
//  * ПлощадьЕдиницаИзмерения                        - Строка - наименование единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - &Площадь.
//  * ПлощадьЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения площади к базовой величине.
//  * ПлощадьЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения площади к
//                                                              базовой величине.
// КРИТИЧЕСКИ ВАЖНО! Таблица Товары должна содержать ровно по 1 строке на сочетание Номенклатура + Характеристика
// Поддерживается выгрузка дополнительных свойств Номенклатуры, не включенных в указанный выше список полей.
// Это означает, что все поля таблицы Товары будут включены в пакет выгрузки, как описанные выше, так и прочие.
// Например, таким образом можно добавлять данные из регистров сведений.
//
// Категории:
//  * Номенклатура - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Категория    - ОпределяемыйТип.ОбъектыСопоставленияБизнесСеть - ссылка на категорию.
//  * Наименование - Строка - наименование категории.
//  * Родитель     - ОпределяемыйТип.ОбъектыСопоставленияБизнесСеть - родитель категории в иерархии.
// Пояснение.
// Категории - это способ деления товаров на группы.
// В общем случае предполагается, что категорией может быть вид номенклатуры, либо родитель в иерархии номенклатуры.
// Наличие таблицы в запросе обязательно.
// Если в конфигурации нет возможности разделить номенклатуру на категории, следует инициализировать таблицу значениями
// NULL по всем полям. Минимально необходимо описать 2 уровня иерархии.
// То есть если справочник Номенклатура иерархический, то в список категорий должны попасть Родитель и Родитель.Родитель.
// Если виды номенклатуры используются, то в списке категорий должны быть ВидНоменклатуры и ВидНоменклатуры.Родитель.
// Допускается и более глубокое описание иерархии - 3, 4 и т.д. уровней.
// 
// Свойства:
//  * Номенклатура           - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика         - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//  * Свойство               - Ссылка - свойство товара.
//  * Значение               - Произвольный - значение свойства товара.
//  * РеквизитХарактеристики - Булево - признак свойства характеристики.
// ВАЖНО! В разрезе характеристик указать только свойства характеристик (СвойствоХарактеристики = ИСТИНА).
// Для свойств номенклатуры (СвойствоХарактеристики = ЛОЖЬ) характеристику не заполнять, указать NULL.
// Свойства номенклатуры не должны дублироваться (размножаться на количество различных характеристик номенклатуры).
//
// Штрихкоды:
//  * Номенклатура   - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//  * Упаковка       - Ссылка - единица измерения упаковки товара.
//  * Штрихкод       - Строка - штрихкод.
//
// Упаковки:
//  * Номенклатура         - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Ссылка               - Ссылка - ссылка (уникальный идентификатор) на упаковку.
//  * Наименование         - Строка - наименование упаковки.
//  * Родитель             - Ссылка - «родительская» (внешняя, более крупная) упаковка.
//  * РодительНаименование - Строка - наименование «родительской» упаковки.
//  * ЕдиницаКодОКЕИ       - Строка - код ОКЕИ единицы измерения упаковки.
//  * ЕдиницаНаименование  - Строка - наименование единицы измерения упаковки.
//  * Числитель            - Число  - числитель отношения единицы измерения к упаковке.
//  * Знаменатель          - Число  - знаменатель отношения единицы измерения к упаковке.
//  * Вес                                        - Число  - вес упаковки (брутто).
//  * ВесЕдиницаИзмерения                        - Строка - наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения веса.
//  * ВесЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Вес.
//  * ВесЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения веса.
//  * ВесЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения веса.
//  * ВесЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения веса к базовой величине.
//  * ВесЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения веса к базовой величине.
//  * Объем                                        - Число  - объем упаковки.
//  * ОбъемЕдиницаИзмерения                        - Строка - наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Объем.
//  * ОбъемЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения объема к базовой величине.
//  * ОбъемЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения объема к базовой величине.
//  * Высота                                        - Число  - высота упаковки.
//  * ВысотаЕдиницаИзмерения                        - Строка - наименование единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ВысотаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения высоты к базовой величине.
//  * ВысотаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения высоты к базовой величине.
//  * Ширина                                        - Число  - ширина упаковки.
//  * ШиринаЕдиницаИзмерения                        - Строка - наименование единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ШиринаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения ширины к базовой величине.
//  * ШиринаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения ширины к базовой величине.
//  * Глубина                                        - Число  - глубина упаковки.
//  * ГлубинаЕдиницаИзмерения                        - Строка - наименование единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ГлубинаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения глубины к базовой величине.
//  * ГлубинаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения глубины к
//                                                              базовой величине.
//
// Классификаторы:
//  * Номенклатура   - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Наименование   - Строка - имя классификатора, значение из списка &ОКПД2, &ТНВЭД, &ЕГАИС, &ОКВЭД2.
//  * Код            - Строка - код элемента классификатора.
//  * Описание       - Строка - название кода.
//
// Изображения:
//  * Номенклатура - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Файл         - Ссылка - ссылка (уникальный идентификатор) на файл.
//  * Наименование - Строка - наименование файла.
//  * Гиперссылка  - Строка - URL файла.
//
// Вложения:
//  * Номенклатура - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Файл         - Ссылка - ссылка (уникальный идентификатор) на файл.
//  * Наименование - Строка - наименование файла.
//  * Гиперссылка  - Строка - URL файла.
// 
// Сертификаты:
//  * Номенклатура               - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Сертификат                 - Ссылка - ссылка на сертификат.
//  * Номер                      - Строка - номер.
//  * ДатаНачалаСрокаДействия    - ДатаВремя - дата выдачи.
//  * ДатаОкончанияСрокаДействия - ДатаВремя - дата окончания срока действия.
//  * ТипСертификата             - Строка - тип сертификата.
//  * ОрганВыдавшийДокумент      - Строка - орган выдавший документ.
//
// ВложенияСертификатов:
//  * Сертификат   - Ссылка - ссылка на сертификат.
//  * Файл         - Ссылка - ссылка (уникальный идентификатор) на файл.
//  * Наименование - Строка - наименование файла.
//  * Гиперссылка  - Строка - URL файла.
//
// Обязательные таблицы и поля:
// Товары
//  * Номенклатура,
//  * Характеристика.
// Свойства: все поля.
// Категории: все поля.
// Штрихкоды: Номенклатура.
//
// При необходимости возможно добавление в пакет данных выгрузки произвольных дополнительных сведений общего характера,
// без привязки к товарной позиции. Для этого в тексте запроса можно описать любое нужное количество дополнительных
// запросов без создания временной таблицы. Важно, чтобы все эти запросы не использовали никакие вышеописанные временные
// таблицы, относящиеся к номенклатуре, так как выполняться эти запросы будут отдельно от запроса по номенклатуре,
// поскольку речь идет о сведениях, общих для всего пакета данных в целом. Если добавляемые в пакет дополнительные
// сведения имеют сложную структуру (не одномерный массив полей, а многомерный массив), то имя таблицы источника данных
// нужно сформировать по шаблону ДополнительныеДанные_ИмяТаблицы. В этом случае в пакет добавится дополнительное
// свойство ИмяТаблицы, значение которого будет заполнено данными запроса. Если таблица с префиксом
// ДополнительныеДанные_ в секции ИЗ не найдена, то все полученные запросом дополнительные сведения добавляются в пакет
// как одномерный массив пар значений <имя поля> - <значение поля>.
//
// Параметры:
//  Запрос - Запрос - запрос для получения данных номенклатуры.
//
Процедура ИнициализацияЗапросаВыборкиДанныхДляВыгрузки(Запрос) Экспорт

	Запрос.Текст = Запрос.Текст + Символы.ПС + ";" + Символы.ПС
	+ "ВЫБРАТЬ
	  |	СправочникНоменклатура.Ссылка КАК Номенклатура,
	  |	ОтборНоменклатуры.Характеристика КАК Характеристика,
	  |	СправочникНоменклатура.Наименование КАК Наименование,
	  |	ОтборНоменклатуры.Характеристика.Наименование КАК ХарактеристикаНаименование,
	  |	СправочникНоменклатура.Артикул КАК Артикул,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	  |			ТОГДА ""22""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	  |			ТОГДА ""22""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	  |			ТОГДА ""10""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	  |			ТОГДА ""10""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяУСН)
	  |			ТОГДА ""7""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяУСНРасчетная)
	  |			ТОГДА ""7""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяУСН)
	  |			ТОГДА ""5""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяУСНРасчетная)
	  |			ТОГДА ""5""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	  |			ТОГДА ""0""
	  |		ИНАЧЕ ""0""
	  |	КОНЕЦ КАК СтавкаНДС,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодОКЕИ,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	  |			ТОГДА &Вес
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	  |			ТОГДА &Объем
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	  |			ТОГДА &Площадь
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	  |			ТОГДА &Длина
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	  |			ТОГДА &КоличествоШтук
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	  |			ТОГДА &Упаковка
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	  |			ТОГДА &Мощность
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	  |			ТОГДА &Энергия
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	  |			ТОГДА &ЭлектрическийЗаряд
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	  |			ТОГДА &Время
	  |	КОНЕЦ КАК ЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименованиеПолное,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК ЕдиницаИзмеренияМеждународноеСокращение,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	  |			ТОГДА ""166 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	  |			ТОГДА ""113 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	  |			ТОГДА ""055 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	  |			ТОГДА ""006 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	  |			ТОГДА ""212 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	  |			ТОГДА ""243 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	  |			ТОГДА ""263 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	  |			ТОГДА ""354 ""
	  |	КОНЕЦ КАК ЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ЕдиницаИзмеренияЗнаменатель,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	  |			ТОГДА &Услуга
	  |		ИНАЧЕ &Товар
	  |	КОНЕЦ КАК ТипНоменклатуры,
	  |	NULL КАК Описание,
	  |	СправочникНоменклатура.НаименованиеПолное КАК НаименованияДляПечатиЧека,
	  |	NULL КАК ВестиУчетПоГТД,
	  |	NULL КАК ПродукцияМаркируемаяДляГИСМ,
	  |	NULL КАК ПодакцизныйТовар,
	  |	СправочникНоменклатура.СтранаПроисхождения.КодАльфа3 КАК СтранаПроисхождения,
	  | СправочникНоменклатура.СтранаПроисхождения.КодАльфа2 КАК СтранаПроизводства,
	  |	Производители.Ссылка КАК Производитель,
	  |	Производители.Наименование КАК ПроизводительНаименование,
	  |	Производители.ИНН КАК ПроизводительИНН,
	  |	Производители.КПП КАК ПроизводительКПП,
	  |	NULL КАК Марка,
	  |	NULL КАК МаркаНаименование,
	  |	NULL КАК КоличествоВУпаковке,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмерения,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияЧислитель,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияЗнаменатель,
	  |	СправочникНоменклатура.Вес КАК ВесЧислитель,
	  |	1 КАК ВесЗнаменатель,
	  |	""кг"" КАК ВесЕдиницаИзмерения,
	  |	NULL КАК ВесЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ВесЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ВесЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ВесЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ВесЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ВесЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ВесЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК ДлинаЧислитель,
	  |	NULL КАК ДлинаЗнаменатель,
	  |	NULL КАК ДлинаЕдиницаИзмерения,
	  |	NULL КАК ДлинаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ДлинаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ДлинаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ДлинаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ДлинаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ДлинаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ДлинаЕдиницаИзмеренияЗнаменатель,
	  |	СправочникНоменклатура.Объем * 1000 КАК ОбъемЧислитель,
	  |	1 КАК ОбъемЗнаменатель,
	  |	""л"" КАК ОбъемЕдиницаИзмерения,
	  |	NULL КАК ОбъемЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ОбъемЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ОбъемЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ОбъемЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК ПлощадьЧислитель,
	  |	NULL КАК ПлощадьЗнаменатель,
	  |	NULL КАК ПлощадьЕдиницаИзмерения,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияЗнаменатель,
	  |	СправочникНоменклатура.Наименование КАК НаименованиеТовараВУчетнойСистеме,
	  |	СправочникНоменклатура.Код КАК КодТовараВУчетнойСистеме
	  |ПОМЕСТИТЬ Товары
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	  |		ПО ОтборНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК ВидыНоменклатуры
	  |		ПО (СправочникНоменклатура.КатегорияНоменклатуры = ВидыНоменклатуры.Ссылка)
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Производители
	  |		ПО (СправочникНоменклатура.Производитель = Производители.Ссылка)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура,
	  |	Характеристика
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	ОтборНоменклатуры.ВидНоменклатуры КАК Категория,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Наименование КАК Наименование,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель КАК Родитель
	  |ПОМЕСТИТЬ Категории
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.ВидНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель.Наименование,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель.Родитель
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель <> ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	ОтборНоменклатуры.Родитель,
	  |	ОтборНоменклатуры.Родитель.Наименование,
	  |	ОтборНоменклатуры.Родитель.Родитель
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	ОтборНоменклатуры.Родитель.Родитель,
	  |	ОтборНоменклатуры.Родитель.Родитель.Наименование,
	  |	ОтборНоменклатуры.Родитель.Родитель.Родитель
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	  |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
	  |	НоменклатураДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока,
	  |	ЛОЖЬ КАК РеквизитХарактеристики
	  |ПОМЕСТИТЬ Свойства
	  |ИЗ
	  |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	  |ГДЕ
	  |	НЕ НоменклатураДополнительныеРеквизиты.Свойство В (&ИсключенныеДополнительныеРеквизиты)
	  |	И ИСТИНА В
	  |			(ВЫБРАТЬ ПЕРВЫЕ 1
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК Товары
	  |			ГДЕ
	  |				Товары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	Товары.Номенклатура,
	  |	Товары.Характеристика,
	  |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство,
	  |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	  |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.ТекстоваяСтрока,
	  |	ИСТИНА
	  |ИЗ
	  |	Товары КАК Товары
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	  |		ПО Товары.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	  |ГДЕ
	  |	НЕ ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство В (&ИсключенныеДополнительныеРеквизиты)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	Номенклатура.Ссылка,
	  |	NULL,
	  |	&Свойство,
	  |	&Значение,
	  |	"""",
	  |	ЛОЖЬ
	  |ИЗ
	  |	Справочник.Номенклатура КАК Номенклатура
	  |ГДЕ
	  |	ИСТИНА В
	  |			(ВЫБРАТЬ ПЕРВЫЕ 1
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК Товары
	  |			ГДЕ
	  |				Товары.Номенклатура = Номенклатура.Ссылка)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	Штрихкоды.Характеристика КАК Характеристика,
	  |	Штрихкоды.ЕдиницаИзмерения КАК Упаковка,
	  |	Штрихкоды.Штрихкод КАК Штрихкод
	  |ПОМЕСТИТЬ Штрихкоды
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	  |		ПО ОтборНоменклатуры.Номенклатура = Штрихкоды.Номенклатура
	  |			И ОтборНоменклатуры.Характеристика = Штрихкоды.Характеристика
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	Штрихкоды.Характеристика,
	  |	Штрихкоды.ЕдиницаИзмерения,
	  |	Штрихкоды.Штрихкод
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	  |		ПО ОтборНоменклатуры.Номенклатура = Штрихкоды.Номенклатура
	  |			И (ОтборНоменклатуры.Характеристика ЕСТЬ NULL)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	УпаковкиНоменклатуры.Ссылка КАК Ссылка,
	  |	УпаковкиНоменклатуры.Наименование КАК Наименование,
	  |	NULL КАК Родитель,
	  |	NULL КАК РодительНаименование,
	  |	ВЫБОР
	  |		КОГДА УпаковкиНоменклатуры.ЕдиницаИзмеренияПоКлассификатору ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
	  |			ТОГДА УпаковкиНоменклатуры.ЕдиницаИзмеренияПоКлассификатору.Код
	  |		ИНАЧЕ NULL
	  |	КОНЕЦ КАК ЕдиницаКодОКЕИ,
	  |	УпаковкиНоменклатуры.Наименование КАК ЕдиницаНаименование,
	  |	NULL КАК Числитель,
	  |	NULL КАК Знаменатель,
	  |	NULL КАК Вес,
	  |	NULL КАК ВесЕдиницаИзмерения,
	  |	NULL КАК ВесЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ВесЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ВесЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ВесЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ВесЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ВесЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ВесЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Объем,
	  |	""л"" КАК ОбъемЕдиницаИзмерения,
	  |	NULL КАК ОбъемЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ОбъемЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ОбъемЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ОбъемЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Высота,
	  |	NULL КАК ВысотаЕдиницаИзмерения,
	  |	NULL КАК ВысотаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ВысотаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ВысотаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ВысотаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ВысотаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ВысотаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ВысотаЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Ширина,
	  |	NULL КАК ШиринаЕдиницаИзмерения,
	  |	NULL КАК ШиринаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ШиринаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ШиринаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ШиринаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ШиринаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ШиринаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ШиринаЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Глубина,
	  |	NULL КАК ГлубинаЕдиницаИзмерения,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияЗнаменатель
	  |ПОМЕСТИТЬ Упаковки
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК УпаковкиНоменклатуры
	  |		ПО (УпаковкиНоменклатуры.Владелец = ОтборНоменклатуры.Номенклатура)
	  |ГДЕ
	  |	(ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	&ТНВЭД КАК Наименование,
	  |	КлассификаторТНВЭД.Код КАК Код,
	  |	КлассификаторТНВЭД.Наименование КАК Описание
	  |ПОМЕСТИТЬ Классификаторы
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	  |		ПО ОтборНоменклатуры.Номенклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
	  |ГДЕ
	  |	(ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	NULL,
	  |	&ОКПД2,
	  |	ОтборНоменклатуры.Номенклатура.КодОКПД2,
	  |	""""
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	(ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыЕГАИС.Характеристика,
	  |	&КодПродукцииЕГАИС,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Код,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	  |			И ОтборНоменклатуры.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыЕГАИС.Характеристика,
	  |	&КодПродукцииЕГАИС,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Код,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	  |			И (ОтборНоменклатуры.Характеристика ЕСТЬ NULL)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыВЕТИС.Характеристика,
	  |	&ИдентификаторВЕТИС,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Идентификатор,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	  |			И ОтборНоменклатуры.Характеристика = СоответствиеНоменклатурыВЕТИС.Характеристика
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыВЕТИС.Характеристика,
	  |	&ИдентификаторВЕТИС,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Идентификатор,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	  |			И (ОтборНоменклатуры.Характеристика ЕСТЬ NULL)
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	NULL КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	NULL КАК Сертификат,
	  |	NULL КАК Номер,
	  |	NULL КАК ДатаНачалаСрокаДействия,
	  |	NULL КАК ДатаОкончанияСрокаДействия,
	  |	NULL КАК ТипСертификата,
	  |	NULL КАК ОрганВыдавшийДокумент
	  |ПОМЕСТИТЬ Сертификаты
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры";

	Запрос.УстановитьПараметр("КодПродукцииЕГАИС", "EGAIS_code");
	Запрос.УстановитьПараметр("ИдентификаторВЕТИС", "Mercury");
	ДобавитьРеквизитыНоменклатурыВЗапрос(Запрос);	

КонецПроцедуры

// Получение публикуемых реквизитов номенклатуры.
// 
// Параметры:
//  ПубликуемыеРеквизиты - Соответствие - реквизиты справочника Номенклатура, публикуемые для торговых предложений.
//    * Ключ     - ОпределяемыйТип.ДополнительныеРеквизитыБизнесСеть - значение реквизита сопоставления.
//    * Значение - Структура - свойства реквизита:
//      ** Представление    - Строка - наименование для отображения.
//      ** ПутьКДанным      - Строка - текст запроса для получения данных.
//      ** ТипЗначения      - ОписаниеТипов - описание типа данных.
//      ** ПустоеЗначение   - Произвольный - Значение реквизита, при котором, он считается не заполненным.
//
Процедура ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ПубликуемыеРеквизиты) Экспорт
	
	// Номенклатура.Вес.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Вес'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Вес");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Вес, СвойстваРеквизита);
		
	// Номенклатура.Объем.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Объем'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Объем");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Объем, СвойстваРеквизита);
	
	// Номенклатура.Производитель.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Производитель'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Производитель");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", Справочники.Контрагенты.ПустаяСсылка());
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель, СвойстваРеквизита);
	
КонецПроцедуры

// См. РаботаСНоменклатуройПереопределяемый.ФормализованныеРеквизитыНоменклатурыДляВыгрузки 
Процедура ФормализованныеРеквизитыНоменклатурыДляВыгрузки(ФормализованныеРеквизиты) Экспорт
	
	ФормализованныеРеквизиты.Производитель 	= Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель;
	
КонецПроцедуры
#КонецОбласти

Процедура ПолучитьДанныеРеестраПредельныхОтпускныхЦен(Знач ПараметрыПроцедуры, Знач АдресРезультата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса КАК ИдРЛС
	|ПОМЕСТИТЬ втИдентификаторы
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|ГДЕ
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления = ЗНАЧЕНИЕ(Перечисление.СтатусыСопоставленияРаботаСНоменклатурой.Сопоставлено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Номенклатура КАК Ссылка
	|			ИЗ
	|				втИдентификаторы КАК Т)
	|	И Номенклатура.ор_ЖНВЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИдентификаторы.Номенклатура КАК Номенклатура,
	|	втИдентификаторы.ИдРЛС КАК ИдРЛС
	|ИЗ
	|	втИдентификаторы КАК втИдентификаторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатура КАК втНоменклатура
	|		ПО втИдентификаторы.Номенклатура = втНоменклатура.Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеНоменклатур = Новый Соответствие;
	
	ТаблицаЦен = Новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("ИдРЛС");
	ТаблицаЦен.Колонки.Добавить("Номенклатура");
	ТаблицаЦен.Колонки.Добавить("Цена");
	ТаблицаЦен.Колонки.Добавить("ДатаРегистрацииЦены");
	ТаблицаЦен.Колонки.Добавить("Наименование");
	ТаблицаЦен.Колонки.Добавить("НаименованиеПроизводителя");
	ТаблицаЦен.Колонки.Добавить("ИдРосЗдравНадзора");
	ТаблицаЦен.Колонки.Добавить("ШтрихКод");
	ТаблицаЦен.Колонки.Добавить("ФормаВыпускаКраткое");
	ТаблицаЦен.Колонки.Добавить("ФормаВыпускаПолное");
	ТаблицаЦен.Колонки.Добавить("МНН");
	ТаблицаЦен.Колонки.Добавить("КоличествоВУпаковке");
	
	ИдентификаторыНоменклатуры = Новый Массив;
	
	ПорцияДанных = 500;
	ВыборкаЦен = Результат.Выбрать();
	
	НужнаИтерация = ВыборкаЦен.Следующий();
	Пока НужнаИтерация Цикл
		
		ИдентификаторыНоменклатуры.Добавить(ВыборкаЦен.ИдРЛС);
		СоответствиеНоменклатур.Вставить(ВыборкаЦен.ИдРЛС, ВыборкаЦен.Номенклатура);
		
		НужнаИтерация = ВыборкаЦен.Следующий();
		
		Если ИдентификаторыНоменклатуры.Количество() = ПорцияДанных
			Или (Не НужнаИтерация И ИдентификаторыНоменклатуры.Количество() > 0) Тогда
			
			Отказ = Ложь;
			КодСостояния = 0;
			ПолучитьПредельныеОтпускныеЦены(ТаблицаЦен, ИдентификаторыНоменклатуры, Отказ, КодСостояния);
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			ИдентификаторыНоменклатуры.Очистить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаЦены Из ТаблицаЦен Цикл
		СтрокаЦены.Номенклатура = СоответствиеНоменклатур.Получить(СтрокаЦены.ИдРЛС);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаЦен, АдресРезультата);
	
КонецПроцедуры

#Область ПриПолученииДанныхИзСервиса

// См. РаботаСНоменклатуройПереопределяемый.ПриПолученииДанныхИзСервисаПоНоменклатуре.
Процедура ПриПолученииДанныхИзСервисаПоНоменклатуре(ДанныеПоНоменклатуре) Экспорт
	
	ДанныеПоНоменклатуре.Колонки.Добавить("ор_ЖНВЛС"                                , Новый ОписаниеТипов("Булево"));
	ДанныеПоНоменклатуре.Колонки.Добавить("ор_ЗарегистрированВСистемеМониторингаЦен", Новый ОписаниеТипов("Булево"));
	ДанныеПоНоменклатуре.Колонки.Добавить("ор_НаркотическоеСредство"                , Новый ОписаниеТипов("Булево"));
	ДанныеПоНоменклатуре.Колонки.Добавить("ор_ОтпускПоРецепту"                      , Новый ОписаниеТипов("Булево"));
	ДанныеПоНоменклатуре.Колонки.Добавить("ор_Яд"                                   , Новый ОписаниеТипов("Булево"));
	
	ДанныеПоНоменклатуре.Колонки.Добавить("ор_Производитель"   , Новый ОписаниеТипов("Структура"));
	ДанныеПоНоменклатуре.Колонки.Добавить("СтранаПроисхождения", Новый ОписаниеТипов("Структура"));
	
	Для Каждого ДанныеНоменклатуры Из ДанныеПоНоменклатуре Цикл
		
		СтрокаДополнительныхРеквизитов = ДанныеНоменклатуры.ДополнительныеРеквизиты.Найти(ИдентификаторЖНВЛС(), "Идентификатор");
		Если СтрокаДополнительныхРеквизитов <> Неопределено Тогда
			ДанныеНоменклатуры.ор_ЖНВЛС = СтрокаДополнительныхРеквизитов.Значение;
		КонецЕсли;
		
		СтрокаДополнительныхРеквизитов = ДанныеНоменклатуры.ДополнительныеРеквизиты.Найти(ИдентификаторНаркотическоеСредство(), "Идентификатор");
		Если СтрокаДополнительныхРеквизитов <> Неопределено Тогда
			ДанныеНоменклатуры.ор_НаркотическоеСредство = СтрокаДополнительныхРеквизитов.Значение;
		КонецЕсли;
		
		Если ДанныеНоменклатуры.ор_ЖНВЛС Тогда
			НайденнаяСтрока = ДанныеНоменклатуры.ПредельныеОтпускныеЦены.Найти("Предельная отпускная цена", "ТипЦены");
			ДанныеНоменклатуры.ор_ЗарегистрированВСистемеМониторингаЦен = НайденнаяСтрока <> Неопределено
				И ЗначениеЗаполнено(НайденнаяСтрока.Цена);
		КонецЕсли;
		
		СтруктураПроизводителя = Новый Структура;
		СтруктураПроизводителя.Вставить("ЕстьЗначение", ЗначениеЗаполнено(ДанныеНоменклатуры.НаименованиеПроизводителя));
		Если СтруктураПроизводителя.ЕстьЗначение Тогда
			СтруктураПроизводителя.Вставить("Наименование", ДанныеНоменклатуры.НаименованиеПроизводителя);
			Если ЗначениеЗаполнено(ДанныеНоменклатуры.КодСтраныПроизводителя) Тогда
				СтруктураПроизводителя.Вставить("КодСтраны", ДанныеНоменклатуры.КодСтраныПроизводителя);
			КонецЕсли;
		КонецЕсли;
		ДанныеНоменклатуры.ор_Производитель = СтруктураПроизводителя;
		
		СтруктураСтраны = Новый Структура;
		СтруктураСтраны.Вставить("ЕстьЗначение", ЗначениеЗаполнено(ДанныеНоменклатуры.КодСтраныПроизводителя));
		Если СтруктураСтраны.ЕстьЗначение Тогда
			СтруктураСтраны.Вставить("КодСтраны", ДанныеНоменклатуры.КодСтраныПроизводителя);
			Если ЗначениеЗаполнено(ДанныеНоменклатуры.НаименованиеСтраныПроизводителя) Тогда
				СтруктураСтраны.Вставить("Наименование", ДанныеНоменклатуры.НаименованиеСтраныПроизводителя);
			КонецЕсли;
		КонецЕсли;
		ДанныеНоменклатуры.СтранаПроисхождения = СтруктураСтраны;
		
		// Загрузка классификаторов.
		ДанныеНоменклатуры.Классификаторы.Колонки.Добавить("ДанныеИзСервиса");
		Для Каждого Классификатор ИЗ ДанныеНоменклатуры.Классификаторы Цикл
			
			СтурктураДанных = Новый Структура;
			СтурктураДанных.Вставить("Идентификатор", Классификатор.Идентификатор);
			СтурктураДанных.Вставить("Наименование", Классификатор.Наименование);
			СтурктураДанных.Вставить("ДанныеИзСервиса");
			
			ПолучитьКлассификаторы(СтурктураДанных);
			
			Классификатор.ДанныеИзСервиса = СтурктураДанных.ДанныеИзСервиса;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Получить отраслевые реквизиты по данным сервиса.
//
// Параметры:
//  ДанныеЗаполнения - Структура	 - данные сервиса.
// 
// Возвращаемое значение:
//   - Структура - отраслевые данные для заполнения номенклатуры.
//
Функция ПолучитьОтраслевыеРеквизиты(ДанныеЗаполнения) Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ор_ЖНВЛС", ДанныеЗаполнения.ор_ЖНВЛС);
	СтруктураВозврата.Вставить("ор_ЗарегистрированВСистемеМониторингаЦен", ДанныеЗаполнения.ор_ЗарегистрированВСистемеМониторингаЦен);
	СтруктураВозврата.Вставить("ор_НаркотическоеСредство", ДанныеЗаполнения.ор_НаркотическоеСредство);
	СтруктураВозврата.Вставить("ор_ОтпускПоРецепту", ДанныеЗаполнения.ор_ОтпускПоРецепту);
	СтруктураВозврата.Вставить("ор_Яд", ДанныеЗаполнения.ор_Яд);
	
	Если ДанныеЗаполнения.ор_Производитель.ЕстьЗначение Тогда
		СтруктураВозврата.Вставить("ор_Производитель", Справочники.ор_Производители.ПустаяСсылка());
		ОтраслевойПроизводительПоДаннымСервиса(ДанныеЗаполнения.ор_Производитель, СтруктураВозврата.ор_Производитель);
	КонецЕсли;
	
	Если ДанныеЗаполнения.СтранаПроисхождения.ЕстьЗначение Тогда
		СтруктураВозврата.Вставить("СтранаПроисхождения", Справочники.СтраныМира.ПустаяСсылка());
		СтранаПроисхожденияПоДаннымСервиса(ДанныеЗаполнения.СтранаПроисхождения, СтруктураВозврата.СтранаПроисхождения);
	КонецЕсли;
	
	Для Каждого Классификатор Из ДанныеЗаполнения.Классификаторы Цикл
		
		Если Классификатор.Наименование = ИмяКлассификатора_СМНН() И Классификатор.ДанныеИзСервиса.ДанныеПолучены Тогда
			
			СтруктураКлассификатор = Новый Структура;
			СтруктураКлассификатор.Вставить("Наименование", Классификатор.Наименование);
			СтруктураКлассификатор.Вставить("Идентификатор", Классификатор.Идентификатор);
			СтруктураКлассификатор.Вставить("ДанныеИзСервиса", Классификатор.ДанныеИзСервиса);
			СтруктураКлассификатор.Вставить("Ссылка");
			
			ЗагрузитьКлассификаторы(СтруктураКлассификатор);
			
			Если Не СтруктураКлассификатор.ДанныеИзСервиса.ДанныеПолучены Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураВозврата.Вставить("ор_СМНН", СтруктураКлассификатор.Ссылка);
			
			Для Каждого ВложенныйКлассификатор Из СтруктураКлассификатор.ДанныеИзСервиса.Классификаторы Цикл
				
				Если Не ВложенныйКлассификатор.ДанныеИзСервиса.ДанныеПолучены Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВложенныйКлассификатор.Наименование = ИмяКлассификатора_ЛекарственныеФормы() Тогда
					СтруктураВозврата.Вставить("ор_ЛекарственнаяФорма", ЗначениеЗаполнено(ВложенныйКлассификатор.Ссылка));
				ИначеЕсли ВложенныйКлассификатор.Наименование = ИмяКлассификатора_ФТГ()
					И ЗначениеЗаполнено(ВложенныйКлассификатор.Ссылка)Тогда
					СтруктураВозврата.Вставить("ор_ФТГ", ВложенныйКлассификатор.Ссылка);
				ИначеЕсли ВложенныйКлассификатор.Наименование = ИмяКлассификатора_АТХ() 
					И ЗначениеЗаполнено(ВложенныйКлассификатор.Ссылка)Тогда
					Если НЕ СтруктураВозврата.Свойство("АТХКлассификация") Тогда
						СтруктураВозврата.Вставить("АТХКлассификация", Новый Массив);
					КонецЕсли;
					СтруктураВозврата.АТХКлассификация.Добавить(ВложенныйКлассификатор.Ссылка);
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураКлассификатор.ДанныеИзСервиса.Свойство("ФормаВыпуска")
				И ЗначениеЗаполнено(СтруктураКлассификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка) Тогда
				СтруктураВозврата.Вставить("ор_ФормаВыпуска", СтруктураКлассификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка);
			КонецЕсли;
			
			Если СтруктураКлассификатор.ДанныеИзСервиса.Свойство("МНН")
				И ЗначениеЗаполнено(СтруктураКлассификатор.ДанныеИзСервиса.МНН.Ссылка) Тогда
				СтруктураВозврата.Вставить("ор_МНН", СтруктураКлассификатор.ДанныеИзСервиса.МНН.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Сравнение значений отраслевых реквизитов номенклатуры информационной базы и номенклатуры сервиса.
//
// Параметры:
//  ДанныеНоменклатурыСервиса - СтрокаТаблицыЗначений - Данные по номенклатуре.
//                              Описание таблицы значений см. РаботаСНоменклатурой.ДанныеНоменклатурыСервиса.
//  ДанныеНоменклатурыБазы    - СтрокаТаблицыЗначений, Структура, Ссылка - данные по номенклатуре.
//                              См. процедуры ПолучитьЗначенияРеквизитовНоменклатуры,
//                              ПолучитьЗначенияДополнительныхРеквизитовИзФормы.
//  ТаблицаОтличийРеквизитов  - ТаблицаЗначений - см. РаботаСНоменклатурой.ТаблицаОтличийРеквизитов.
//
Процедура ПолучитьОтраслевыеОтличияНоменклатуры(ДанныеНоменклатурыСервиса, ДанныеНоменклатурыБазы, ТаблицаОтличийРеквизитов) Экспорт
	
	Если ДанныеНоменклатурыБазы.ор_ЖНВЛС <> ДанныеНоменклатурыСервиса.ор_ЖНВЛС Тогда
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"ор_ЖНВЛС",
			ДанныеНоменклатурыСервиса.ор_ЖНВЛС,
			ДанныеНоменклатурыБазы.ор_ЖНВЛС,
			НСтр("ru = 'ЖНВЛП'"));
	КонецЕсли;
	
	Если ДанныеНоменклатурыБазы.ор_ЗарегистрированВСистемеМониторингаЦен <> ДанныеНоменклатурыСервиса.ор_ЗарегистрированВСистемеМониторингаЦен Тогда
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"ор_ЗарегистрированВСистемеМониторингаЦен",
			ДанныеНоменклатурыСервиса.ор_ЗарегистрированВСистемеМониторингаЦен,
			ДанныеНоменклатурыБазы.ор_ЗарегистрированВСистемеМониторингаЦен,
			НСтр("ru = 'Зарегистрирован в системе мониторинга цен'"));
	КонецЕсли;
	
	Если ДанныеНоменклатурыБазы.ор_НаркотическоеСредство <> ДанныеНоменклатурыСервиса.ор_НаркотическоеСредство Тогда
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"ор_НаркотическоеСредство",
			ДанныеНоменклатурыСервиса.ор_НаркотическоеСредство,
			ДанныеНоменклатурыБазы.ор_НаркотическоеСредство,
			НСтр("ru = 'Наркотическое средство'"));
	КонецЕсли;
	
	Если ДанныеНоменклатурыБазы.ор_ОтпускПоРецепту <> ДанныеНоменклатурыСервиса.ор_ОтпускПоРецепту Тогда
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"ор_ОтпускПоРецепту",
			ДанныеНоменклатурыСервиса.ор_ОтпускПоРецепту,
			ДанныеНоменклатурыБазы.ор_ОтпускПоРецепту,
			НСтр("ru = 'Отпуск по рецепту'"));
	КонецЕсли;
	
	Если ДанныеНоменклатурыБазы.ор_Яд <> ДанныеНоменклатурыСервиса.ор_Яд Тогда
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"ор_Яд",
			ДанныеНоменклатурыСервиса.ор_Яд,
			ДанныеНоменклатурыБазы.ор_Яд,
			НСтр("ru = 'Яд'"));
	КонецЕсли;
	
	Если ДанныеНоменклатурыСервиса.СтранаПроисхождения.ЕстьЗначение
		И СтрокиРазные(ДанныеНоменклатурыБазы.СтранаПроисхождения.Код, ДанныеНоменклатурыСервиса.СтранаПроисхождения.КодСтраны, Ложь) Тогда
		
		СтранаПроисхожденияСервиса = ДанныеНоменклатурыСервиса.СтранаПроисхождения;
		СтранаПроисхожденияВБазе = Неопределено;
		СтранаПроисхожденияВБазе(СтранаПроисхожденияСервиса, СтранаПроисхожденияВБазе);
		Если Не ЗначениеЗаполнено(СтранаПроисхожденияВБазе) Тогда
			СтранаПроисхожденияПоДаннымСервиса(СтранаПроисхожденияСервиса, СтранаПроисхожденияВБазе)
		КонецЕсли;
		
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"СтранаПроисхождения",
			СтранаПроисхожденияВБазе,
			ДанныеНоменклатурыБазы.СтранаПроисхождения.Наименование,
			НСтр("ru = 'Страна происхождения'"),
			СтранаПроисхожденияСервиса.Наименование);
	КонецЕсли;
	
	Если ДанныеНоменклатурыСервиса.ор_Производитель.ЕстьЗначение
		И СтрокиРазные(ДанныеНоменклатурыБазы.ор_Производитель.Наименование, ДанныеНоменклатурыСервиса.ор_Производитель.Наименование) Тогда
		
		орПроизводительСервиса = ДанныеНоменклатурыСервиса.ор_Производитель;
		орПроизводительВБазе = Неопределено;
		ОтраслевойПроизводительВБазе(орПроизводительСервиса, орПроизводительВБазе);
		Если Не ЗначениеЗаполнено(орПроизводительВБазе) Тогда
			ОтраслевойПроизводительПоДаннымСервиса(орПроизводительСервиса, орПроизводительВБазе)
		КонецЕсли;
		
		РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
			ТаблицаОтличийРеквизитов,
			"ор_Производитель",
			орПроизводительВБазе,
			ДанныеНоменклатурыБазы.ор_Производитель.Наименование,
			НСтр("ru = 'Производитель'"),
			орПроизводительСервиса.Наименование);
	КонецЕсли;
	
	Для Каждого КлассификаторСервиса Из ДанныеНоменклатурыСервиса.Классификаторы  Цикл 
		
		Если КлассификаторСервиса.Наименование <> ИмяКлассификатора_СМНН()
			Или Не КлассификаторСервиса.ДанныеИзСервиса.ДанныеПолучены Тогда
			Продолжить;
		КонецЕсли;
		
		// Дозагружаем данные из сервиса.
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", КлассификаторСервиса.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", КлассификаторСервиса.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", КлассификаторСервиса.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		// Проверка реквизита СМНН.
		Если ДанныеНоменклатурыБазы.ор_СМНН <> СтруктураКлассификатор.Ссылка Тогда
			РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
				ТаблицаОтличийРеквизитов,
				"ор_СМНН",
				СтруктураКлассификатор.Ссылка,
				ДанныеНоменклатурыБазы.ор_СМНН,
				НСтр("ru = 'СМНН'"));
		КонецЕсли;
		
		СписокАТХ = Новый СписокЗначений;
		Для каждого ВложенныйКлассификатор Из СтруктураКлассификатор.ДанныеИзСервиса.Классификаторы Цикл
			
			Если Не ВложенныйКлассификатор.ДанныеИзСервиса.ДанныеПолучены Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВложенныйКлассификатор.Наименование = ИмяКлассификатора_ФТГ()
				И ЗначениеЗаполнено(ВложенныйКлассификатор.Ссылка)
				И ДанныеНоменклатурыБазы.ор_ФТГ <> ВложенныйКлассификатор.Ссылка Тогда
				РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
					ТаблицаОтличийРеквизитов,
					"ор_ФТГ", 
					ВложенныйКлассификатор.Ссылка,
					ДанныеНоменклатурыБазы.ор_ФТГ,
					НСтр("ru = 'Фармакотерапевтическая группа'"));
			ИначеЕсли ВложенныйКлассификатор.Наименование = ИмяКлассификатора_АТХ()
				И ЗначениеЗаполнено(ВложенныйКлассификатор.Ссылка) Тогда
				СписокАТХ.Добавить(ВложенныйКлассификатор.Ссылка);
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверка ТЧ АТХ Классификация.
		ЕстьРазличияАТХ = Ложь;
		Если СписокАТХ.Количество() <> ДанныеНоменклатурыБазы.ор_АТХКлассификация.Количество() Тогда
			ЕстьРазличияАТХ = Истина;
		КонецЕсли;
		
		Для Каждого ЭлементАТХ Из СписокАТХ Цикл
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("АТХ", ЭлементАТХ.Значение);
			Если ДанныеНоменклатурыБазы.ор_АТХКлассификация.НайтиСтроки(ПараметрыПоиска).Количество() = 0 Тогда
				ЕстьРазличияАТХ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьРазличияАТХ Тогда
			СписокАТХТекущее = Новый СписокЗначений;
			ТаблицаЗначенийАТХКлассификация = ?(
				ТипЗнч(ДанныеНоменклатурыБазы.ор_АТХКлассификация) = Тип("ТаблицаЗначений"),
				ДанныеНоменклатурыБазы.ор_АТХКлассификация,
				ДанныеНоменклатурыБазы.ор_АТХКлассификация.Выгрузить());
			СписокАТХТекущее.ЗагрузитьЗначения(ТаблицаЗначенийАТХКлассификация.ВыгрузитьКолонку("АТХ"));
			
			РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
				ТаблицаОтличийРеквизитов,
				"ор_АТХКлассификация",
				СписокАТХ,
				СписокАТХТекущее,
				НСтр("ru = 'АТХ классификация'"));
		КонецЕсли;
		
		Если СтруктураКлассификатор.ДанныеИзСервиса.Свойство("ФормаВыпуска")
			И ЗначениеЗаполнено(СтруктураКлассификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка)
			И ДанныеНоменклатурыБазы.ор_ФормаВыпуска <> СтруктураКлассификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка Тогда
			РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
				ТаблицаОтличийРеквизитов,
				"ор_ФормаВыпуска",
				СтруктураКлассификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка,
				ДанныеНоменклатурыБазы.ор_ФормаВыпуска,
				НСтр("ru = 'Форма выпуска'"));
		КонецЕсли;
		
		Если СтруктураКлассификатор.ДанныеИзСервиса.Свойство("МНН")
			И ЗначениеЗаполнено(СтруктураКлассификатор.ДанныеИзСервиса.МНН.Ссылка)
			И ДанныеНоменклатурыБазы.ор_МНН <> СтруктураКлассификатор.ДанныеИзСервиса.МНН.Ссылка Тогда
			РаботаСНоменклатурой.ДобавитьСтрокуВТаблицуОтличий(
				ТаблицаОтличийРеквизитов,
				"ор_МНН",
				СтруктураКлассификатор.ДанныеИзСервиса.МНН.Ссылка,
				ДанныеНоменклатурыБазы.ор_МНН,
				НСтр("ru = 'МНН'"));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПолучениеИЗагрузкаКлассифакторовИзСервиса

Процедура ПолучитьКлассификаторы(СтруктураЗагружаемыйКлассификатор) Экспорт
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ФТГ() Тогда
		ПолучитьКлассификаторФТГ(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ЛекарственныеФормы() Тогда
		ПолучитьКлассификаторЛекарственныеФормы(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_АТХ() Тогда
		ПолучитьКлассификаторАТХ(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ДВЛП() Тогда
		ПолучитьКлассификаторДВЛП(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ЕдиницыИзмерения()Тогда
		ПолучитьКлассификаторЕдиницыИзмерения(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_СМНН() Тогда
		ПолучитьКлассификаторСМНН(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает данные набора классификаторов, объединенных по имени.
//
// Параметры:
//  ЗагружаемыеКлассификаторы - Соответствие - ключем которой является имя классификатора,
//    Значение - Соответствие - ключем которого является код классификатора,
//      Значение - Структура - новые данные классификатора.
//  ОбновлятьДанные - Булево - признак необходимости обновления данных классификатора новыми данными.
//
Процедура ЗагрузитьКлассификаторы(СтруктураЗагружаемыйКлассификатор) Экспорт
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_МНН() Тогда
		ЗагрузитьКлассификаторМНН(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ФТГ() Тогда
		ЗагрузитьКлассификаторФТГ(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ЛекарственныеФормы() Тогда
		ЗагрузитьКлассификаторЛекарственныеФормы(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_АТХ() Тогда
		ЗагрузитьКлассификаторАТХ(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ДВЛП() Тогда
		ЗагрузитьКлассификаторДВЛП(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ЕдиницыИзмерения() Тогда
		ЗагрузитьКлассификаторЕдиницыИзмерения(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_ФормыВыпуска() Тогда
		ЗагрузитьКлассификаторФормыВыпуска(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
	Если СтруктураЗагружаемыйКлассификатор.Наименование = ИмяКлассификатора_СМНН() Тогда
		ЗагрузитьКлассификаторСМНН(СтруктураЗагружаемыйКлассификатор);
	КонецЕсли;
	
КонецПроцедуры

#Область КлассификаторФТГ_СлужебныйИнтерфейс

Процедура ПолучитьКлассификаторФТГ(Классификатор)
	
	ЗагрузитьДанныеФТГ(Классификатор);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеФТГ(Классификатор)
	
	ТаблицаФТГ = Новый ТаблицаЗначений;
	ТаблицаФТГ.Колонки.Добавить("Идентификатор");
	ТаблицаФТГ.Колонки.Добавить("Описание");
	ТаблицаФТГ.Колонки.Добавить("ДанныеПолучены");
	
	НоваяСтрока = ТаблицаФТГ.Добавить();
	НоваяСтрока.Идентификатор = Классификатор.Идентификатор;
	НоваяСтрока.ДанныеПолучены = Ложь;
	
	РаботаСНоменклатуройСлужебный.ПолучитьЗначенияКлассификатораНоменклатуры(
		"esklp-ftg",
		ТаблицаФТГ,
		ОписаниеТаблицыКлассификатораФТГ());
	
	Классификатор.ДанныеИзСервиса = Новый Структура;
	Классификатор.ДанныеИзСервиса.Вставить("Идентификатор" , ТаблицаФТГ[0].Идентификатор);
	Классификатор.ДанныеИзСервиса.Вставить("Описание"      , ТаблицаФТГ[0].Описание);
	Классификатор.ДанныеИзСервиса.Вставить("ДанныеПолучены", ТаблицаФТГ[0].ДанныеПолучены);
	
КонецПроцедуры

Функция ОписаниеТаблицыКлассификатораФТГ()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор", Типы().Строка, "code");
	Результат.Колонки.Добавить("Описание"     , Типы().Строка, "description");
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьКлассификаторФТГ(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФТГ.Ссылка КАК Ссылка,
	|	ФТГ.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.ор_ФТГ КАК ФТГ
	|ГДЕ
	|	ФТГ.Наименование = &Наименование
	|	И НЕ ФТГ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ТРег(СокрЛП(Классификатор.ДанныеИзСервиса.Описание)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_ФТГ.СоздатьЭлемент();
	НовыйОбъект.Наименование       = ТРег(СокрЛП(Классификатор.ДанныеИзСервиса.Описание));
	НовыйОбъект.НаименованиеПолное = ТРег(СокрЛП(Классификатор.ДанныеИзСервиса.Описание));
	НовыйОбъект.КодРаздела         = СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор);
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание классификатора Фармако-терапевтических групп'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторФТГ_СлужебныйИнтерфейс

#Область КлассификаторЛекарственныеФормы_СлужебныйИнтерфейс

Процедура ПолучитьКлассификаторЛекарственныеФормы(Классификатор)
	
	ЗагрузитьДанныеЛекарственныеФормы(Классификатор);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеЛекарственныеФормы(Классификатор)
	
	ТаблицаЛекФорм = Новый ТаблицаЗначений;
	ТаблицаЛекФорм.Колонки.Добавить("Идентификатор");
	ТаблицаЛекФорм.Колонки.Добавить("Наименование");
	ТаблицаЛекФорм.Колонки.Добавить("НаименованиеЛатынь");
	ТаблицаЛекФорм.Колонки.Добавить("НаименованиеБазовая");
	ТаблицаЛекФорм.Колонки.Добавить("ДанныеПолучены");
	
	НоваяСтрока = ТаблицаЛекФорм.Добавить();
	НоваяСтрока.Идентификатор = Классификатор.Идентификатор;
	НоваяСтрока.ДанныеПолучены = Ложь;
	
	РаботаСНоменклатуройСлужебный.ПолучитьЗначенияКлассификатораНоменклатуры(
		"esklp-form",
		ТаблицаЛекФорм,
		ОписаниеТаблицыЛекарственныеФормы());
	
	Классификатор.ДанныеИзСервиса = Новый Структура;
	Классификатор.ДанныеИзСервиса.Вставить("Идентификатор"      , ТаблицаЛекФорм[0].Идентификатор);
	Классификатор.ДанныеИзСервиса.Вставить("Наименование"       , ТаблицаЛекФорм[0].Наименование);
	Классификатор.ДанныеИзСервиса.Вставить("НаименованиеЛатынь" , ТаблицаЛекФорм[0].НаименованиеЛатынь);
	Классификатор.ДанныеИзСервиса.Вставить("НаименованиеБазовая", ТаблицаЛекФорм[0].НаименованиеБазовая);
	Классификатор.ДанныеИзСервиса.Вставить("ДанныеПолучены"     , ТаблицаЛекФорм[0].ДанныеПолучены);
	
КонецПроцедуры

Функция ОписаниеТаблицыЛекарственныеФормы()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор"      , Типы().Строка, "code");
	Результат.Колонки.Добавить("Наименование"       , Типы().Строка, "name");
	Результат.Колонки.Добавить("НаименованиеЛатынь" , Типы().Строка, "nameLat");
	Результат.Колонки.Добавить("НаименованиеБазовая", Типы().Строка, "basicDoseForm");
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьКлассификаторЛекарственныеФормы(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛекарственныеФормы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_ЛекарственныеФормы КАК ЛекарственныеФормы
	|ГДЕ
	|	ЛекарственныеФормы.Наименование = &Наименование
	|	И НЕ ЛекарственныеФормы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛекарственныеФормы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_ЛекарственныеФормы КАК ЛекарственныеФормы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеИскатьБазовую
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ЛекарственныеФормы.Наименование = &НаименованиеБазовая
	|		КОНЕЦ
	|	И НЕ ЛекарственныеФормы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Классификатор.ДанныеИзСервиса.Наименование));
	Запрос.УстановитьПараметр("НеИскатьБазовую", ПустаяСтрока(Классификатор.ДанныеИзСервиса.НаименованиеБазовая));
	Запрос.УстановитьПараметр("НаименованиеБазовая", СокрЛП(Классификатор.ДанныеИзСервиса.НаименованиеБазовая));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_ЛекарственныеФормы.СоздатьЭлемент();
	НовыйОбъект.Наименование = СокрЛП(Классификатор.ДанныеИзСервиса.Наименование);
	НовыйОбъект.НаименованиеПолное = СокрЛП(Классификатор.ДанныеИзСервиса.Наименование);
	
	Если НЕ ЗначениеЗаполнено(Классификатор.ДанныеИзСервиса.НаименованиеБазовая) Тогда
		НовыйОбъект.НаименованиеЛатынь = СокрЛП(Классификатор.ДанныеИзСервиса.НаименованиеЛатынь);
		НовыйОбъект.НаименованиеЛатыньПолное = СокрЛП(Классификатор.ДанныеИзСервиса.НаименованиеЛатынь);
	КонецЕсли;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		НовыйОбъект.Родитель = Выборка.Ссылка;
	КонецЕсли;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание лекарственной формы'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторЛекарственныеФормы_СлужебныйИнтерфейс

#Область КлассификаторАТХ_СлужебныйИнтерфейс

Процедура ПолучитьКлассификаторАТХ(Классификатор)
	
	ЗагрузитьДанныеАТХ(Классификатор);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеАТХ(Классификатор)
	
	ТаблицаАТХ = Новый ТаблицаЗначений;
	ТаблицаАТХ.Колонки.Добавить("Идентификатор");
	ТаблицаАТХ.Колонки.Добавить("Описание");
	ТаблицаАТХ.Колонки.Добавить("ДанныеПолучены");
	
	НоваяСтрока = ТаблицаАТХ.Добавить();
	НоваяСтрока.Идентификатор = Классификатор.Идентификатор;
	НоваяСтрока.ДанныеПолучены = Ложь;
	
	РаботаСНоменклатуройСлужебный.ПолучитьЗначенияКлассификатораНоменклатуры(
		"esklp-atc",
		ТаблицаАТХ,
		ОписаниеТаблицыКлассификатораАТХ());
	
	Классификатор.ДанныеИзСервиса = Новый Структура;
	Классификатор.ДанныеИзСервиса.Вставить("Идентификатор" , ТаблицаАТХ[0].Идентификатор);
	Классификатор.ДанныеИзСервиса.Вставить("Описание"      , ТаблицаАТХ[0].Описание);
	Классификатор.ДанныеИзСервиса.Вставить("ДанныеПолучены", ТаблицаАТХ[0].ДанныеПолучены);
	
КонецПроцедуры

Функция ОписаниеТаблицыКлассификатораАТХ()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор", Типы().Строка, "code");
	Результат.Колонки.Добавить("Описание"     , Типы().Строка, "description");
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьКлассификаторАТХ(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АТХКлассификация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_КлассификаторАТХ КАК АТХКлассификация
	|ГДЕ
	|	АТХКлассификация.КодРаздела = &КодРаздела
	|	И НЕ АТХКлассификация.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КодРаздела", СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_КлассификаторАТХ.СоздатьЭлемент();
	НовыйОбъект.КодРаздела = СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор);
	
	ПозицияСкобки = СтрНайти(Классификатор.ДанныеИзСервиса.Описание,"{");
	Если ПозицияСкобки <> 0 Тогда
		НовыйОбъект.Наименование = СокрЛП(Лев(Классификатор.ДанныеИзСервиса.Описание,ПозицияСкобки - 1));
	Иначе
		НовыйОбъект.Наименование = СокрЛП(Классификатор.ДанныеИзСервиса.Описание);
	КонецЕсли;
	
	НовыйОбъект.НаименованиеПолное = НовыйОбъект.КодРаздела + " " + НовыйОбъект.Наименование;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание АТХ классификатора'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторАТХ_СлужебныйИнтерфейс

#Область КлассификаторДВЛП_СлужебныйИнтерфейс

Процедура ПолучитьКлассификаторДВЛП(Классификатор)
	
	ЗагрузитьДанныеДВЛП(Классификатор);
	ДозагрузкаПодчиненныхДВЛП(Классификатор);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеДВЛП(Классификатор)
	
	ТаблицаДВЛП = Новый ТаблицаЗначений;
	ТаблицаДВЛП.Колонки.Добавить("Идентификатор");
	ТаблицаДВЛП.Колонки.Добавить("ГруппаДействующегоВещества");
	ТаблицаДВЛП.Колонки.Добавить("Наименование");
	ТаблицаДВЛП.Колонки.Добавить("НаименованиеАнглийское");
	ТаблицаДВЛП.Колонки.Добавить("НаименованиеЛатинское");
	ТаблицаДВЛП.Колонки.Добавить("Классификаторы");
	ТаблицаДВЛП.Колонки.Добавить("ДанныеПолучены");
	
	НоваяСтрока = ТаблицаДВЛП.Добавить();
	НоваяСтрока.Идентификатор = Классификатор.Идентификатор;
	НоваяСтрока.ДанныеПолучены = Ложь;
	
	РаботаСНоменклатуройСлужебный.ПолучитьЗначенияКлассификатораНоменклатуры(
		"esklp-dvlp",
		ТаблицаДВЛП,
		ОписаниеТаблицыКлассификатораДВЛП());
	
	Классификатор.ДанныеИзСервиса = Новый Структура;
	Классификатор.ДанныеИзСервиса.Вставить("Идентификатор"             , ТаблицаДВЛП[0].Идентификатор);
	Классификатор.ДанныеИзСервиса.Вставить("ГруппаДействующегоВещества", ТаблицаДВЛП[0].ГруппаДействующегоВещества);
	Классификатор.ДанныеИзСервиса.Вставить("Наименование"              , ТаблицаДВЛП[0].Наименование);
	Классификатор.ДанныеИзСервиса.Вставить("НаименованиеАнглийское"    , ТаблицаДВЛП[0].НаименованиеАнглийское);
	Классификатор.ДанныеИзСервиса.Вставить("НаименованиеЛатинское"     , ТаблицаДВЛП[0].НаименованиеЛатинское); 
	Классификатор.ДанныеИзСервиса.Вставить("Классификаторы"            , ТаблицаДВЛП[0].Классификаторы);
	Классификатор.ДанныеИзСервиса.Вставить("ДанныеПолучены"            , ТаблицаДВЛП[0].ДанныеПолучены);
	
КонецПроцедуры

Функция ОписаниеТаблицыКлассификатораДВЛП()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор"             , Типы().Строка , "code");
	Результат.Колонки.Добавить("ГруппаДействующегоВещества", Типы().Число  , "groupCode");
	Результат.Колонки.Добавить("Наименование"              , Типы().Строка , "name");
	Результат.Колонки.Добавить("НаименованиеАнглийское"    , Типы().Строка , "nameEn");
	Результат.Колонки.Добавить("НаименованиеЛатинское"     , Типы().Строка , "nameLat");
	Результат.Колонки.Добавить("Классификаторы"            , Типы().Таблица, "classifiers|items.classifiers");
	
	Возврат Результат;
	
КонецФункции

Процедура ДозагрузкаПодчиненныхДВЛП(Классификатор)
	
	Если НЕ Классификатор.Свойство("ДанныеИзСервиса")
		Или Не Классификатор.ДанныеИзСервиса.Свойство("Классификаторы") Тогда
		Возврат;
	КонецЕсли;
	
	Классификатор.ДанныеИзСервиса.Классификаторы.Колонки.Добавить("ДанныеИзСервиса");
	
	Для Каждого СтрокаКлассификатор Из Классификатор.ДанныеИзСервиса.Классификаторы Цикл
		Если СтрокаКлассификатор.Наименование <> ИмяКлассификатора_АТХ() Тогда
			Продолжить;
		КонецЕсли;
		
		СтурктураДанных = Новый Структура;
		СтурктураДанных.Вставить("Идентификатор",СтрокаКлассификатор.Идентификатор);
		СтурктураДанных.Вставить("Наименование",СтрокаКлассификатор.Наименование);
		СтурктураДанных.Вставить("ДанныеИзСервиса");
		
		ПолучитьКлассификаторы(СтурктураДанных);
		
		СтрокаКлассификатор.ДанныеИзСервиса = СтурктураДанных.ДанныеИзСервиса;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьКлассификаторДВЛП(Классификатор)
	
	ПолучитьСсылкиПодчиненныхДВЛП(Классификатор);
	НайтиСоздатьДВЛП(Классификатор);
	
КонецПроцедуры

Процедура ПолучитьСсылкиПодчиненныхДВЛП(Классификатор)
	
	// Добавление классификаторов АТХ.
	Если Классификатор.ДанныеИзСервиса.Классификаторы.Колонки.Найти("Ссылка") = Неопределено Тогда
		Классификатор.ДанныеИзСервиса.Классификаторы.Колонки.Добавить("Ссылка");
	КонецЕсли;
	
	Для Каждого ПодчиненныйКлассификатор Из Классификатор.ДанныеИзСервиса.Классификаторы Цикл
		
		Если ЗначениеЗаполнено(ПодчиненныйКлассификатор.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", ПодчиненныйКлассификатор.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", ПодчиненныйКлассификатор.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", ПодчиненныйКлассификатор.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		ПодчиненныйКлассификатор.Ссылка = СтруктураКлассификатор.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиСоздатьДВЛП(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДействующиеВещества.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_ДВЛП КАК ДействующиеВещества
	|ГДЕ
	|	НЕ ДействующиеВещества.ПометкаУдаления
	|	И ДействующиеВещества.КодРаздела = &КодРаздела";
	
	Запрос.УстановитьПараметр("КодРаздела", СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_ДВЛП.СоздатьЭлемент();
	НовыйОбъект.КодРаздела                 = СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор);
	НовыйОбъект.Наименование               = СокрЛП(Классификатор.ДанныеИзСервиса.Наименование);
	НовыйОбъект.НаименованиеАнглийское     = СокрЛП(Классификатор.ДанныеИзСервиса.НаименованиеАнглийское);
	НовыйОбъект.НаименованиеЛатинское      = СокрЛП(Классификатор.ДанныеИзСервиса.НаименованиеЛатинское);
	НовыйОбъект.НаименованиеПолное         = СокрЛП(Классификатор.ДанныеИзСервиса.Наименование);
	НовыйОбъект.ГруппаДействующегоВещества = Классификатор.ДанныеИзСервиса.ГруппаДействующегоВещества;
	
	Для Каждого КлассификаторАТХ Из Классификатор.ДанныеИзСервиса.Классификаторы  Цикл
		НоваяСтрока = НовыйОбъект.АТХКлассификация.Добавить();
		НоваяСтрока.АТХ = КлассификаторАТХ.Ссылка;
	КонецЦикла;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание классификатора Действующие вещества лекарственных препаратов (ДВЛП)'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторДВЛП_СлужебныйИнтерфейс

#Область КлассификаторЕдиницыИзмерения_СлужебныйИнтерфейс

Процедура ПолучитьКлассификаторЕдиницыИзмерения(Классификатор)
	
	ЗагрузитьДанныеЕдиницыИзмерения(Классификатор);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеЕдиницыИзмерения(Классификатор)
	
	ТаблицаЕдиницыИзмерения = Новый ТаблицаЗначений;
	ТаблицаЕдиницыИзмерения.Колонки.Добавить("Идентификатор");
	//ТаблицаЕдиницыИзмерения.Колонки.Добавить("ИдентификаторОКЕИ");
	ТаблицаЕдиницыИзмерения.Колонки.Добавить("Наименование");
	ТаблицаЕдиницыИзмерения.Колонки.Добавить("ПолноеНаименование");
	ТаблицаЕдиницыИзмерения.Колонки.Добавить("МеждународноеСокращение");
	ТаблицаЕдиницыИзмерения.Колонки.Добавить("ТипИзмеряемойВеличины");
	ТаблицаЕдиницыИзмерения.Колонки.Добавить("ДанныеПолучены");
	
	НоваяСтрока = ТаблицаЕдиницыИзмерения.Добавить();
	НоваяСтрока.Идентификатор = Классификатор.Идентификатор;
	НоваяСтрока.ДанныеПолучены = Ложь;
	
	РаботаСНоменклатуройСлужебный.ПолучитьЗначенияКлассификатораНоменклатуры(
		"okei",
		ТаблицаЕдиницыИзмерения,
		ОписаниеТаблицыКлассификатораОКЕИ());
	
	Классификатор.ДанныеИзСервиса = Новый Структура;
	Классификатор.ДанныеИзСервиса.Вставить("Идентификатор"           , ТаблицаЕдиницыИзмерения[0].Идентификатор);
	//Классификатор.ДанныеИзСервиса.Вставить("ИдентификаторОКЕИ"       , ТаблицаЕдиницыИзмерения[0].ИдентификаторОКЕИ);
	Классификатор.ДанныеИзСервиса.Вставить("Наименование"            , ТаблицаЕдиницыИзмерения[0].Наименование);
	Классификатор.ДанныеИзСервиса.Вставить("ПолноеНаименование"      , ТаблицаЕдиницыИзмерения[0].ПолноеНаименование);
	Классификатор.ДанныеИзСервиса.Вставить("МеждународноеСокращение" , ТаблицаЕдиницыИзмерения[0].МеждународноеСокращение); 
	Классификатор.ДанныеИзСервиса.Вставить("ТипИзмеряемойВеличины"   , ТаблицаЕдиницыИзмерения[0].ТипИзмеряемойВеличины); 
	Классификатор.ДанныеИзСервиса.Вставить("ДанныеПолучены"          , ТаблицаЕдиницыИзмерения[0].ДанныеПолучены);

КонецПроцедуры

Функция ОписаниеТаблицыКлассификатораОКЕИ()
	
	Результат = Новый ТаблицаЗначений;
	//Результат.Колонки.Добавить("Идентификатор"          , Типы().Строка, "id");
	//Результат.Колонки.Добавить("ИдентификаторОКЕИ"      , Типы().Строка, "okei");
	Результат.Колонки.Добавить("Идентификатор"          , Типы().Строка, "okei");
	Результат.Колонки.Добавить("Наименование"           , Типы().Строка, "nationalSymbol");
	Результат.Колонки.Добавить("ПолноеНаименование"     , Типы().Строка, "name");
	Результат.Колонки.Добавить("МеждународноеСокращение", Типы().Строка, "internationalCodeMark");
	Результат.Колонки.Добавить("ТипИзмеряемойВеличины"  , Типы().Строка, "type");
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьКлассификаторЕдиницыИзмерения(Классификатор)
	
	ПоискПоКоду = Истина;
	//Если СокрЛП(Классификатор.ДанныеИзСервиса.ИдентификаторОКЕИ) = "876" Тогда
	Если СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор) = "876" Тогда
		//"876" - усл. ед. В таком случае ищем по наминованию.
		ПоискПоКоду = Ложь;
	КонецЕсли;
	
	Наименование = ?(ПустаяСтрока(Классификатор.ДанныеИзСервиса.Наименование),
		"~", СокрЛП(Классификатор.ДанныеИзСервиса.Наименование));
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоискПоКоду
	|				ТОГДА КлассификаторЕдиницИзмерения.Код = &Код
	|			ИНАЧЕ КлассификаторЕдиницИзмерения.Наименование = &Наименование
	|		КОНЕЦ
	|	И НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПоискПоКоду", ПоискПоКоду);
	Запрос.УстановитьПараметр("Код", СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор));
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
	
	НовыйОбъект.Код                     = СокрЛП(Классификатор.Идентификатор);
	НовыйОбъект.Наименование            = Наименование;
	НовыйОбъект.НаименованиеПолное      = Классификатор.ДанныеИзСервиса.ПолноеНаименование;
	НовыйОбъект.МеждународноеСокращение = ?(Классификатор.ДанныеИзСервиса.Свойство("МеждународноеСокращение"), СокрЛП(Классификатор.ДанныеИзСервиса.МеждународноеСокращение), "~");
	
	Если Не ПустаяСтрока(Классификатор.ДанныеИзСервиса.ТипИзмеряемойВеличины) Тогда
		НовыйОбъект.ТипИзмеряемойВеличины = ПолучитьТипИзмеряемойВеличины(
			ДоступныеТипыИзмеряемойВеличины(),
			Классификатор.ДанныеИзСервиса.ТипИзмеряемойВеличины);
	КонецЕсли;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание классификатора единицы измерения'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

Функция ДоступныеТипыИзмеряемойВеличины()
	
	ДоступныеТипыИзмеряемойВеличины = Новый Соответствие;
	Для Каждого Значение Из Перечисления.ТипыИзмеряемыхВеличин Цикл
		ДоступныеТипыИзмеряемойВеличины.Вставить(Строка(Значение), Значение);
	КонецЦикла;
	
	Возврат ДоступныеТипыИзмеряемойВеличины;
	
КонецФункции

Функция ПолучитьТипИзмеряемойВеличины(ДоступныеТипыИзмеряемойВеличины, ИмяТипа)
	
	ТипЕдиницы = Неопределено;
	Если ЗначениеЗаполнено(ИмяТипа) Тогда
		ТипЕдиницы = ДоступныеТипыИзмеряемойВеличины.Получить(ИмяТипа);
	КонецЕсли;
	
	Возврат ТипЕдиницы;
	
КонецФункции

#КонецОбласти // КлассификаторЕдиницыИзмерения_СлужебныйИнтерфейс

#Область КлассификаторФормыВыпуска_СлужебныйИнтерфейс

Процедура ЗагрузитьКлассификаторФормыВыпуска(Классификатор) 
	
	ПолучитьСсылкиПодчиненныхФормыВыпуска(Классификатор);
	НайтиСоздатьФормуВыпуска(Классификатор);
	
КонецПроцедуры

Процедура ПолучитьСсылкиПодчиненныхФормыВыпуска(Классификатор)
	
	// Получение лекарственных форм.
	ТекущиеДанные = Классификатор.ДанныеИзСервиса.ЛекарственнаяФорма;
	Если НЕ ТекущиеДанные.Свойство("Ссылка")
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", ТекущиеДанные.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", ТекущиеДанные.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		Классификатор.ДанныеИзСервиса.ЛекарственнаяФорма.Вставить("Ссылка", СтруктураКлассификатор.Ссылка);
		
	КонецЕсли;
	
	// Получение единиц измерения.
	ТекущиеДанные = Классификатор.ДанныеИзСервиса.ЕдиницаИзмеренияДозировки;
	Если НЕ ТекущиеДанные.Свойство("Ссылка")
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные) Тогда
		
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", ТекущиеДанные.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", ТекущиеДанные.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		Классификатор.ДанныеИзСервиса.ЕдиницаИзмеренияДозировки.Вставить("Ссылка",СтруктураКлассификатор.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьФормуВыпуска(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФормыВыпуска.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_ФормыВыпуска КАК ФормыВыпуска
	|ГДЕ
	|	НЕ ФормыВыпуска.ПометкаУдаления
	|	И ФормыВыпуска.ЛекарственнаяФорма = &ЛекарственнаяФорма
	|	И ФормыВыпуска.Количество = &Количество
	|	И ФормыВыпуска.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("ЛекарственнаяФорма", Классификатор.ДанныеИзСервиса.ЛекарственнаяФорма.Ссылка);
	Запрос.УстановитьПараметр("Количество", ТипЧисло.ПривестиЗначение(Классификатор.ДанныеИзСервиса.Количество));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Классификатор.ДанныеИзСервиса.ЕдиницаИзмеренияДозировки.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_ФормыВыпуска.СоздатьЭлемент();
	
	НовыйОбъект.Наименование       = Классификатор.ДанныеИзСервиса.Наименование;
	НовыйОбъект.ЛекарственнаяФорма = Классификатор.ДанныеИзСервиса.ЛекарственнаяФорма.Ссылка;
	НовыйОбъект.Количество         = Классификатор.ДанныеИзСервиса.Количество;
	НовыйОбъект.ЕдиницаИзмерения   = Классификатор.ДанныеИзСервиса.ЕдиницаИзмеренияДозировки.Ссылка;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание формы выпуска '",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторФормыВыпуска_СлужебныйИнтерфейс

#Область КлассификаторМНН_СлужебныйИнтерфейс

Процедура ЗагрузитьКлассификаторМНН(Классификатор)
	
	ПолучитьСсылкиПодчиненныхМНН(Классификатор);
	НайтиСоздатьМНН(Классификатор);
	
КонецПроцедуры

Процедура ПолучитьСсылкиПодчиненныхМНН(Классификатор)
	
	// Получение ДВЛП.
	ТекущиеДанные = Классификатор.ДанныеИзСервиса.ДВЛП;
	Если ТекущиеДанные <> Неопределено
		И (НЕ ТекущиеДанные.Свойство("Ссылка") Или НЕ ЗначениеЗаполнено(ТекущиеДанные.Ссылка)) Тогда
		//Поучение ДВЛП
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", ТекущиеДанные.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", ТекущиеДанные.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		Классификатор.ДанныеИзСервиса.ДВЛП.Вставить("Ссылка", СтруктураКлассификатор.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьМНН(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МНН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_МНН КАК МНН
	|ГДЕ
	|	МНН.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Классификатор.Идентификатор));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_МНН.СоздатьЭлемент();
	
	НовыйОбъект.КодРаздела              = Классификатор.ДанныеИзСервиса.КодРаздела;
	НовыйОбъект.Наименование            = Классификатор.ДанныеИзСервиса.Наименование;
	НовыйОбъект.НаименованиеРасширенное = Классификатор.ДанныеИзСервиса.НаименованиеРасширенное;
	НовыйОбъект.НаименованиеПолное      = Классификатор.ДанныеИзСервиса.Наименование;
	
	ДанныеДВЛП = Классификатор.ДанныеИзСервиса.ДВЛП;
	Если ДанныеДВЛП <> Неопределено
		И ЗначениеЗаполнено(ДанныеДВЛП.Ссылка) Тогда
		НовыйОбъект.НаименованиеЛатинское = ДанныеДВЛП.ДанныеИзСервиса.НаименованиеЛатинское;
	
		НоваяСтрока = НовыйОбъект.ДействующиеВещества.Добавить();
		НоваяСтрока.ДействующееВещество = ДанныеДВЛП.Ссылка;
	КонецЕсли;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание МНН'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторМНН_СлужебныйИнтерфейс

#Область КлассификаторСМНН_СлужебныйИнтерфейс

Процедура ПолучитьКлассификаторСМНН(Классификатор)
	
	ЗагрузитьДанныеСМНН(Классификатор);
	ДозагрузкаПодчиненныхСМНН(Классификатор);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеСМНН(Классификатор)

	ТаблицаСМНН = Новый ТаблицаЗначений;
	ТаблицаСМНН.Колонки.Добавить("Идентификатор");
	ТаблицаСМНН.Колонки.Добавить("Наименование");
	ТаблицаСМНН.Колонки.Добавить("Дозировка");
	ТаблицаСМНН.Колонки.Добавить("Классификаторы");
	ТаблицаСМНН.Колонки.Добавить("ДанныеПолучены");
	ТаблицаСМНН.Колонки.Добавить("ДополнительныеРеквизитыСМНН");
	ТаблицаСМНН.Колонки.Добавить("УникальныйИдентификаторЕСКЛП");
	
	НоваяСтрока = ТаблицаСМНН.Добавить();
	НоваяСтрока.Идентификатор = Классификатор.Идентификатор;
	НоваяСтрока.ДанныеПолучены = Ложь;
	
	РаботаСНоменклатуройСлужебный.ПолучитьЗначенияКлассификатораНоменклатуры(
		"smnn",
		ТаблицаСМНН,
		ОписаниеТаблицыСМНН());
	
	Классификатор.ДанныеИзСервиса = Новый Структура;
	Классификатор.ДанныеИзСервиса.Вставить("Идентификатор"               , ТаблицаСМНН[0].Идентификатор);
	Классификатор.ДанныеИзСервиса.Вставить("Наименование"                , ТаблицаСМНН[0].Наименование);
	Классификатор.ДанныеИзСервиса.Вставить("Классификаторы"              , ТаблицаСМНН[0].Классификаторы);
	Классификатор.ДанныеИзСервиса.Вставить("Дозировка"                   , ТаблицаСМНН[0].Дозировка);
	Классификатор.ДанныеИзСервиса.Вставить("ДополнительныеРеквизитыСМНН" , ТаблицаСМНН[0].ДополнительныеРеквизитыСМНН);
	Классификатор.ДанныеИзСервиса.Вставить("УникальныйИдентификаторЕСКЛП", ТаблицаСМНН[0].УникальныйИдентификаторЕСКЛП);
	Классификатор.ДанныеИзСервиса.Вставить("ДанныеПолучены"              , ТаблицаСМНН[0].ДанныеПолучены);
	
КонецПроцедуры

Функция ОписаниеТаблицыСМНН()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Классификаторы"              , Типы().Таблица  , "classifiers|items.classifiers");
	Результат.Колонки.Добавить("Идентификатор"               , Типы().Строка   , "code");
	Результат.Колонки.Добавить("Наименование"                , Типы().Строка   , "name");
	Результат.Колонки.Добавить("Дозировка"                   , Типы().Структура, "dosage|items.dosage");
	Результат.Колонки.Добавить("ДополнительныеРеквизитыСМНН" , Типы().Таблица  , "features|items.features");
	Результат.Колонки.Добавить("УникальныйИдентификаторЕСКЛП", Типы().Строка   , "uuid");
	Возврат Результат;
	
КонецФункции

Процедура ДозагрузкаПодчиненныхСМНН(Классификатор)
	
	Если НЕ Классификатор.Свойство("ДанныеИзСервиса")
		ИЛИ НЕ Классификатор.ДанныеИзСервиса.ДанныеПолучены Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Классификатор.ДанныеИзСервиса;
	
	// Дозагрузка классфикаторов АТХ, Лек. форм, ДВЛП, ФТГ.
	Если Данные.Свойство("Классификаторы") Тогда
		
		Данные.Классификаторы.Колонки.Добавить("ДанныеИзСервиса");
		
		Для Каждого СтрокаКлассификатор Из Данные.Классификаторы Цикл
			Если СтрокаКлассификатор.Наименование = ИмяКлассификатора_ЛекарственныеФормы()
				ИЛИ СтрокаКлассификатор.Наименование = ИмяКлассификатора_АТХ()
				ИЛИ СтрокаКлассификатор.Наименование = ИмяКлассификатора_ДВЛП()
				ИЛИ СтрокаКлассификатор.Наименование = ИмяКлассификатора_ФТГ() Тогда
				
				СтурктураДанных = Новый Структура;
				СтурктураДанных.Вставить("Идентификатор", СтрокаКлассификатор.Идентификатор);
				СтурктураДанных.Вставить("Наименование", СтрокаКлассификатор.Наименование);
				СтурктураДанных.Вставить("ДанныеИзСервиса");
				
				ПолучитьКлассификаторы(СтурктураДанных);
				
				СтрокаКлассификатор.ДанныеИзСервиса = СтурктураДанных.ДанныеИзСервиса;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Дозагрузка классификатора еденицы измерения дозировки.
	Если Данные.Свойство("Дозировка") Тогда
		
		СтурктураДанных = Новый Структура;
		СтурктураДанных.Вставить("Идентификатор", СокрЛП(Данные.Дозировка.ЕдиницаИзмеренияДозировки.Идентификатор));
		СтурктураДанных.Вставить("Наименование", ИмяКлассификатора_ЕдиницыИзмерения());
		СтурктураДанных.Вставить("ДанныеИзСервиса");
		
		ПолучитьКлассификаторы(СтурктураДанных);
		
		Данные.Дозировка.Вставить("ДанныеИзСервиса", СтурктураДанных.ДанныеИзСервиса);
		
	КонецЕсли;

	// Формы выпуска не загружаются, а формируются.
	ЛекФормаДляФормыВыпуска = Неопределено;
	Для Каждого ПодчиненныйКлассификатор Из Данные.Классификаторы Цикл
		Если ПодчиненныйКлассификатор.Наименование = ИмяКлассификатора_ЛекарственныеФормы() Тогда
			
			ЛекФормаДляФормыВыпуска = Новый Структура;
			ЛекФормаДляФормыВыпуска.Вставить("Идентификатор", ПодчиненныйКлассификатор.Идентификатор);
			ЛекФормаДляФормыВыпуска.Вставить("Наименование", ПодчиненныйКлассификатор.Наименование);
			ЛекФормаДляФормыВыпуска.Вставить("ДанныеИзСервиса", ПодчиненныйКлассификатор.ДанныеИзСервиса);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЕстьОшибка = Ложь;
	Если ЛекФормаДляФормыВыпуска = Неопределено Тогда
		// Ошибка создания Форм выпуска, нет лек форм.
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если Данные.Свойство("Дозировка")
		И Данные.Дозировка.Свойство("ЕдиницаИзмеренияДозировки") Тогда
		
		ЕдиницаИзмеренияДозировкиДляФормыВыпуска = Новый Структура;
		ЕдиницаИзмеренияДозировкиДляФормыВыпуска.Вставить("Идентификатор", Данные.Дозировка.ЕдиницаИзмеренияДозировки.Идентификатор);
		ЕдиницаИзмеренияДозировкиДляФормыВыпуска.Вставить("Наименование", ИмяКлассификатора_ЕдиницыИзмерения());
		ЕдиницаИзмеренияДозировкиДляФормыВыпуска.Вставить("ДанныеИзСервиса", Данные.Дозировка.ДанныеИзСервиса);
	Иначе
		// Ошибка создания Форм выпуска, нет данных дозировки.
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если Не ЕстьОшибка Тогда
		
		Данные.Вставить("ФормаВыпуска", Новый Структура);
		
		Идентификатор = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Ключ_%1/%2_%3_%4",
			ЛекФормаДляФормыВыпуска.Идентификатор,
			Данные.Дозировка.ЕдиницаИзмеренияДозировки.Идентификатор,
			Данные.Дозировка.ЕдиницаИзмеренияДозировки.Количество,
			Данные.Дозировка.ЕдиницаИзмеренияДозировки.Наименование);
		
		
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1, %2 %3",
			ЛекФормаДляФормыВыпуска.ДанныеИзСервиса.Наименование,
			Формат(Данные.Дозировка.ЕдиницаИзмеренияДозировки.Количество, "ЧРД=."),
			СокрЛП(Данные.Дозировка.ЕдиницаИзмеренияДозировки.Наименование));
		
		ДанныеИзСервисаФормыВыпуска = Новый Структура;
		ДанныеИзСервисаФормыВыпуска.Вставить("ЕдиницаИзмеренияДозировки", ЕдиницаИзмеренияДозировкиДляФормыВыпуска); 
		ДанныеИзСервисаФормыВыпуска.Вставить("ЛекарственнаяФорма", ЛекФормаДляФормыВыпуска);
		ДанныеИзСервисаФормыВыпуска.Вставить("Количество", Данные.Дозировка.ЕдиницаИзмеренияДозировки.Количество);
		ДанныеИзСервисаФормыВыпуска.Вставить("Наименование", Наименование);
		
		Данные.ФормаВыпуска.Вставить("Идентификатор", Идентификатор);
		Данные.ФормаВыпуска.Вставить("Наименование", ИмяКлассификатора_ФормыВыпуска());
		Данные.ФормаВыпуска.Вставить("ДанныеИзСервиса", ДанныеИзСервисаФормыВыпуска);
	
	КонецЕсли;
	
	// Классификатор МНН не загружаются а формируются.
	ДВЛПДляМНН = Неопределено;
	Для Каждого ПодчиненныйКлассификатор Из Данные.Классификаторы Цикл
		Если ПодчиненныйКлассификатор.Наименование = ИмяКлассификатора_ДВЛП() Тогда
			
			ДВЛПДляМНН  = Новый Структура;
			ДВЛПДляМНН.Вставить("Идентификатор", ПодчиненныйКлассификатор.Идентификатор);
			ДВЛПДляМНН.Вставить("Наименование", ПодчиненныйКлассификатор.Наименование);
			ДВЛПДляМНН.Вставить("ДанныеИзСервиса", ПодчиненныйКлассификатор.ДанныеИзСервиса);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаДопРеквизитМНН = Данные.ДополнительныеРеквизитыСМНН.Найти(31196, "ДопРеквизитИдентификатор");
	
	Если СтрокаДопРеквизитМНН <> Неопределено Тогда
		
		Данные.Вставить("МНН",Новый Структура);
		
		Идентификатор = СтрокаДопРеквизитМНН.Значение;
		
		ДанныеИзСервисаМНН = Новый Структура;
		ДанныеИзСервисаМНН.Вставить("КодРаздела", Данные.Идентификатор);
		ДанныеИзСервисаМНН.Вставить("Наименование", СтрокаДопРеквизитМНН.Значение);
		ДанныеИзСервисаМНН.Вставить("НаименованиеРасширенное", Данные.Наименование);
		ДанныеИзСервисаМНН.Вставить("ДВЛП", ДВЛПДляМНН);
		
		Данные.МНН.Вставить("Идентификатор", Идентификатор);
		Данные.МНН.Вставить("Наименование", ИмяКлассификатора_МНН());
		Данные.МНН.Вставить("ДанныеИзСервиса", ДанныеИзСервисаМНН);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьКлассификаторСМНН(Классификатор)
	
	// Дозаполняем подчиненные класификаторы.
	ПолучитьСсылкиПодчиненныхСМНН(Классификатор);
	
	// Поиск и при создание элемента при необходимости.
	НайтиСоздатьСМНН(Классификатор);
	
КонецПроцедуры

Процедура ПолучитьСсылкиПодчиненныхСМНН(Классификатор)
	
	// Добавление классификаторов Лек. форм, АТХ, ФТГ, ДВЛП.
	Если Классификатор.ДанныеИзСервиса.Классификаторы.Колонки.Найти("Ссылка") = Неопределено Тогда
		Классификатор.ДанныеИзСервиса.Классификаторы.Колонки.Добавить("Ссылка");
	КонецЕсли;
	
	Для Каждого ПодчиненныйКлассификатор Из Классификатор.ДанныеИзСервиса.Классификаторы Цикл
		
		Если ЗначениеЗаполнено(ПодчиненныйКлассификатор.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", ПодчиненныйКлассификатор.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", ПодчиненныйКлассификатор.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", ПодчиненныйКлассификатор.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		ПодчиненныйКлассификатор.Ссылка = СтруктураКлассификатор.Ссылка;
		
	КонецЦикла;
	
	// Формирование и создание Формы Выпуска.
	// После дозагрузки подчиненных СМНН Формы выпуска может не быть, если нет лек. формы.
	Если (Классификатор.ДанныеИзСервиса.Свойство("ФормаВыпуска")) 
		И (НЕ Классификатор.ДанныеИзСервиса.ФормаВыпуска.Свойство("Ссылка")
			ИЛИ НЕ ЗначениеЗаполнено(Классификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка)) Тогда
		
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", Классификатор.ДанныеИзСервиса.ФормаВыпуска.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", Классификатор.ДанныеИзСервиса.ФормаВыпуска.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", Классификатор.ДанныеИзСервиса.ФормаВыпуска.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		Классификатор.ДанныеИзСервиса.ФормаВыпуска.Вставить("Ссылка", СтруктураКлассификатор.Ссылка);
	КонецЕсли;

	// Формирование и создание МНН.
	// После дозагрузки подчиненных СМНН МНН может не быть.
	Если (Классификатор.ДанныеИзСервиса.Свойство("МНН")) 
		И (НЕ Классификатор.ДанныеИзСервиса.МНН.Свойство("Ссылка")
			ИЛИ НЕ ЗначениеЗаполнено(Классификатор.ДанныеИзСервиса.МНН.Ссылка)) Тогда
		
		СтруктураКлассификатор = Новый Структура;
		СтруктураКлассификатор.Вставить("Наименование", Классификатор.ДанныеИзСервиса.МНН.Наименование);
		СтруктураКлассификатор.Вставить("Идентификатор", Классификатор.ДанныеИзСервиса.МНН.Идентификатор);
		СтруктураКлассификатор.Вставить("ДанныеИзСервиса", Классификатор.ДанныеИзСервиса.МНН.ДанныеИзСервиса);
		СтруктураКлассификатор.Вставить("Ссылка");
		
		ЗагрузитьКлассификаторы(СтруктураКлассификатор);
		
		Классификатор.ДанныеИзСервиса.МНН.Вставить("Ссылка",СтруктураКлассификатор.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьСМНН(Классификатор)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМНН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_СМНН КАК СМНН
	|ГДЕ
	|	СМНН.КодЕСКЛП = &КодЕСКЛП";
	Запрос.УстановитьПараметр("КодЕСКЛП", СокрЛП(Классификатор.ДанныеИзСервиса.Идентификатор));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Классификатор.Ссылка = НайденнаяСсылка;
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_СМНН.СоздатьЭлемент();
	
	НовыйОбъект.КодЕСКЛП                     = Классификатор.ДанныеИзСервиса.Идентификатор;
	НовыйОбъект.НаименованиеПолное           = Классификатор.ДанныеИзСервиса.Наименование;
	НовыйОбъект.УникальныйИдентификаторЕСКЛП = Классификатор.ДанныеИзСервиса.УникальныйИдентификаторЕСКЛП;
	
	// Формы выпуска может не быть, если нет лек. формы.
	Если Классификатор.ДанныеИзСервиса.Свойство("ФормаВыпуска") Тогда
		НовыйОбъект.ФормаВыпуска             = Классификатор.ДанныеИзСервиса.ФормаВыпуска.Ссылка;
	КонецЕсли;
	// МНН так же может не быть.
	Если Классификатор.ДанныеИзСервиса.Свойство("МНН") Тогда
		НовыйОбъект.ДействующиеВеществаМНН   = Классификатор.ДанныеИзСервиса.МНН.Ссылка;
	КонецЕсли;
	
	Для Каждого Строка Из Классификатор.ДанныеИзСервиса.ДополнительныеРеквизитыСМНН Цикл
		Если Строка.ДопРеквизитИдентификатор = 31198 Тогда // Признак ЖНВЛП.
			НовыйОбъект.ЖНВЛП = ?(Строка.Значение = "true", Истина, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	// Вытягиваем данные из ТЧ классифкаторов.
	Для каждого Строка из Классификатор.ДанныеИзСервиса.Классификаторы Цикл
		Если Строка.Наименование = ИмяКлассификатора_АТХ() Тогда
			НоваяСтрока = НовыйОбъект.АТХКлассификация.Добавить();
			НоваяСтрока.АТХ = Строка.Ссылка;
		КонецЕсли;
		Если Строка.Наименование = ИмяКлассификатора_ФТГ() Тогда
			НовыйОбъект.ФармакоТерапевтическаяГруппа = Строка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание СМНН'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Классификатор.Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти // КлассификаторСМНН_СлужебныйИнтерфейс

// Типы получаемых данных.
// 
// Возвращаемое значение:
//  Структура - описание типов:
//   * Простой         - простой тип.
//   * Строка          - тип Строка.
//   * Число           - тип Число.
//   * Булево          - тип Булево.
//   * Структура       - тип Структура.
//   * Дата            - тип Дата.
//   * ТаблицаЗначений - тип ТаблицаЗначений.
//
Функция Типы()
	Результат = Новый Структура;
	Результат.Вставить("Простой",   Новый ОписаниеТипов("Строка, Булево, Число, Дата"));
	Результат.Вставить("Булево",    Новый ОписаниеТипов("Булево"));
	Результат.Вставить("Число",     Новый ОписаниеТипов("Число"));
	Результат.Вставить("Дата",      Новый ОписаниеТипов("Дата"));
	Результат.Вставить("Строка",    Новый ОписаниеТипов("Строка"));
	Результат.Вставить("Структура", Новый ОписаниеТипов("Структура"));
	Результат.Вставить("Массив",    Новый ОписаниеТипов("Массив"));
	Результат.Вставить("Таблица",   Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьЗначениеВJSON(Значение, НастройкиСериализации = Неопределено) Экспорт
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Значение, НастройкиСериализации);
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ПреобразоватьJSONВЗначение(Строка, ПрочитатьВСоответствие = Истина, ИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат Строка;
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Строка);
	Значение = ПрочитатьJSON(Чтение, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
	Возврат Значение;
	
КонецФункции

Функция СтрокаВДату(Знач Значение) Экспорт
	
	Попытка
		ДанныеДаты = ПреобразоватьJSONВЗначение(ПреобразоватьЗначениеВJSON(Новый Структура("Дата", Значение)), Ложь, "Дата");
		Дата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДаты, "Дата");
	Исключение
		Дата = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ПреобразоватьСтрокуВДату(Значение);
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

// Функция преобразовывает строку в тип Дата
//
// Параметры:
//  СтрокаДаты - строка, представляющая дату
//
// Возвращаемое значение:
//  Дата - дата из строки или '00010101'
//
Функция ПреобразоватьСтрокуВДату(СтрокаДаты) Экспорт
	
	Результат = '00010101';
	ОписаниеДата = Новый ОписаниеТипов("Дата");
	
	Если Не ПустаяСтрока(СтрокаДаты) Тогда
		Результат = ОписаниеДата.ПривестиЗначение(СтрокаДаты);
		Если Не ЗначениеЗаполнено(Результат) Тогда //Дата не в каноническом виде, будем преобразовывать самостоятельно
			СтрокаРазделителей = ".-/\TZ+:MSK";
			СтрокаЧисел = "0123456789";
			ДлинаСтроки = СтрДлина(СтрокаДаты);
			МассивЧастейДаты = Новый Массив;
			ВременнаяСтрока = "";
			КоличествоЧастейДаты = 0;
			Для Сч = 1 По ДлинаСтроки Цикл
				СимволСтроки = Сред(СтрокаДаты, Сч, 1);
				Если Найти(СтрокаЧисел, СимволСтроки) Тогда
					ВременнаяСтрока = ВременнаяСтрока + СимволСтроки;
				ИначеЕсли Найти(СтрокаРазделителей, СимволСтроки) Тогда
					Если Не ПустаяСтрока(ВременнаяСтрока) Тогда
						МассивЧастейДаты.Добавить(ВременнаяСтрока);
						ВременнаяСтрока = "";
						КоличествоЧастейДаты = КоличествоЧастейДаты + 1;
					КонецЕсли;
				Иначе
					МассивЧастейДаты.Очистить();
					Прервать; //неверный формат даты
				КонецЕсли;
				Если КоличествоЧастейДаты = 3 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ПустаяСтрока(ВременнаяСтрока) Тогда           
				МассивЧастейДаты.Добавить(ВременнаяСтрока);
			КонецЕсли;
			Если МассивЧастейДаты.Количество() = 3 Тогда
				Если СтрДлина(МассивЧастейДаты[0]) = 4 Тогда
					Результат = ПолучитьДату(МассивЧастейДаты[0], МассивЧастейДаты[1], МассивЧастейДаты[2]);
				ИначеЕсли СтрДлина(МассивЧастейДаты[2]) = 4 Тогда
					Результат = ПолучитьДату(МассивЧастейДаты[2], МассивЧастейДаты[1], МассивЧастейДаты[0]);
				Иначе
					Результат = ПолучитьДату("20" + МассивЧастейДаты[2], МассивЧастейДаты[1], МассивЧастейДаты[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
// Функция получает дату на основании переданных параметров
//
// Параметры:
//  Год   - Число - год даты
//  Месяц - Число - месяц даты
//  День  - Число - день даты
//
// Возвращаемое значение:
//  Дата
//
Функция ПолучитьДату(Год, Месяц, День)
	
	Попытка
		Результат = Дата(Год, Месяц, День);
	Исключение
		Результат = '00010101';
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
 
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополнение в запрос источников по дополнительным реквизитам номенклатуры.
//
// Параметры:
//   Запрос - Запрос - основной запрос сбора данных.
//
Процедура ДобавитьРеквизитыНоменклатурыВЗапрос(Запрос)
	
	БлокРеквизитовШаблон = "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	NULL,
	|	&Свойство,
	|	&Значение,
	|	"""",
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ОтборНоменклатуры КАК Товары
	|			ГДЕ
	|				Товары.Номенклатура = Номенклатура.Ссылка)";
	
	ДоступныеДляПубликацииРеквизиты = Новый Соответствие;
	ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ДоступныеДляПубликацииРеквизиты);
	
	МассивПодзапросов = Новый Массив;
	СчетчикРеквизитов = 0;
	Для каждого СвойстваРеквизита Из ДоступныеДляПубликацииРеквизиты Цикл
		
		Если Запрос.Параметры.ИсключенныеДополнительныеРеквизиты.Найти(СвойстваРеквизита.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСтрокой = XMLСтрока(СчетчикРеквизитов);
		ПутьКДанным   = СвойстваРеквизита.Значение.ПутьКДанным;
		СчетчикРеквизитов = СчетчикРеквизитов + 1;
		ТекстПодзапроса = БлокРеквизитовШаблон;
		
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Значение", ПутьКДанным);
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Свойство", "&Свойство" + ИндексСтрокой);
		
		Запрос.УстановитьПараметр("Свойство" + ИндексСтрокой, СвойстваРеквизита.Ключ);
		
		Если СвойстваРеквизита.Значение.Свойство("ПустоеЗначение") Тогда
			ТекстПодзапроса = ТекстПодзапроса + Символы.ПС
				+ "И НЕ "+ ПутьКДанным + " = &ПустоеЗначение" + ИндексСтрокой;
			Запрос.УстановитьПараметр("ПустоеЗначение" + ИндексСтрокой,
				СвойстваРеквизита.Значение.ПустоеЗначение);
		КонецЕсли;
		
		МассивПодзапросов.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	БлокРеквизитовПодстановка = СтрСоединить(МассивПодзапросов, Символы.ПС + Символы.ПС);
	
	// Если реквизиты не найдены, удалить БлокРеквизитовШаблон.
	Если ПустаяСтрока(БлокРеквизитовПодстановка) Тогда
		БлокРеквизитовПодстановка = "";
	КонецЕсли;
	
	Если СтрЧислоВхождений(Запрос.Текст, БлокРеквизитовШаблон) = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка компоновки запроса получения данных номенклатуры.'");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, БлокРеквизитовШаблон, БлокРеквизитовПодстановка);
	
КонецПроцедуры

#Область ПроцедурыПроверкиВыполненияОбработкиОбъектов
Функция ПризнакПредметаРасчетаЗаполнен(Параметры) Экспорт 
	Результат = Истина;
	ПризнакПредметаРасчета = Неопределено;
	НаименованиеППР = "ПризнакПредметаРасчета";
	НаименованиеТипаНоменклатуры = "ТипНоменклатуры";
	НаименованиеТипаНоменклатурыПоУмолчанию = "ТипНоменклатурыПоУмолчанию";
	Если ТипЗнч(Параметры.Данные) = Тип("СправочникСсылка.Номенклатура") Тогда
		ПереченьРеквизитов = "" + НаименованиеППР + ", " + НаименованиеТипаНоменклатуры;
		Данные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Данные, ПереченьРеквизитов);
	ИначеЕсли ТипЗнч(Параметры.Данные) = Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		НаименованиеТипаНоменклатуры = НаименованиеТипаНоменклатурыПоУмолчанию;
		ПереченьРеквизитов = "" + НаименованиеППР + ", " + НаименованиеТипаНоменклатуры;
		Данные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Данные, ПереченьРеквизитов);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры.Данные, НаименованиеТипаНоменклатуры) Тогда
		Данные = Параметры.Данные;
	Иначе                     
		НаименованиеТипаНоменклатуры = НаименованиеТипаНоменклатурыПоУмолчанию;
		Данные = Параметры.Данные; 
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры.Данные, НаименованиеТипаНоменклатуры)
		И Данные[НаименованиеТипаНоменклатуры] <> Перечисления.ТипыНоменклатуры.Операция
		И Данные[НаименованиеТипаНоменклатуры] <> Перечисления.ТипыНоменклатуры.ВидРабот 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры.Данные, НаименованиеППР) Тогда
		Результат = ЗначениеЗаполнено(Данные[НаименованиеППР]);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции		
#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

Процедура ОтраслевойПроизводительПоДаннымСервиса(ДанныеСервиса, Ссылка)
	
	Если Не ЗначениеЗаполнено(ДанныеСервиса.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ОтраслевойПроизводительВБазе(ДанныеСервиса, Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.ор_Производители.СоздатьЭлемент();
	НовыйОбъект.Наименование = СокрЛП(ДанныеСервиса.Наименование);
	
	Импортный = Ложь;
	Если ДанныеСервиса.Свойство("КодСтраны")
		И ЗначениеЗаполнено(ДанныеСервиса.КодСтраны) Тогда
		Импортный = СокрЛП(ДанныеСервиса.КодСтраны) <> "643";
	КонецЕсли;
	НовыйОбъект.Импортный = Импортный;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание производителя'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

Процедура ОтраслевойПроизводительВБазе(ДанныеСервиса, Ссылка)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Производители.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ор_Производители КАК Производители
	|ГДЕ
	|	Производители.Наименование = &Наименование
	|	И НЕ Производители.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(ДанныеСервиса.Наименование));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Ссылка = НайденнаяСсылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтранаПроисхожденияПоДаннымСервиса(ДанныеСервиса, Ссылка)
	
	Если Не ЗначениеЗаполнено(ДанныеСервиса) Тогда
		Возврат;
	КонецЕсли;
	
	СтранаПроисхожденияВБазе(ДанныеСервиса.КодСтраны, Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Создание элемента если не найдено.
	НовыйОбъект = Справочники.СтраныМира.СоздатьЭлемент();
	НовыйОбъект.Код = ДанныеСервиса.КодСтраны;
	
	ДанныеКлассификатора = УправлениеКонтактнойИнформацией.ДанныеКлассификатораСтранМираПоКоду(ДанныеСервиса.КодСтраны, "КодСтраны");
	Если НЕ ДанныеКлассификатора = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НовыйОбъект,ДанныеКлассификатора);
	КонецЕсли;
	
	Если ДанныеСервиса.Свойство("Наименование") Тогда
		НовыйОбъект.Наименование = ДанныеСервиса.Наименование;
	КонецЕсли;
	
	НовыйОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйОбъект.Записать();
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с номенклатурой. Создание стран мира'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Ссылка = НовыйОбъект.Ссылка;
	
КонецПроцедуры

Процедура СтранаПроисхожденияВБазе(КодСтраны, Ссылка)
	
	НайденнаяСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	СтраныМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	СтраныМира.Код = &КодСтраны
	|	И НЕ СтраныМира.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КодСтраны", СокрЛП(КодСтраны));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Ссылка = НайденнаяСсылка;
	КонецЕсли;
	
КонецПроцедуры

Функция СтрокиРазные(Первая, Вторая, ИспользоватьНрег = Истина)
	
	Если ИспользоватьНрег Тогда
		Возврат НРег(СокрЛП(Первая)) <> НРег(СокрЛП(Вторая));
	Иначе
		Возврат СокрЛП(Первая) <> СокрЛП(Вторая);
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьПредельныеОтпускныеЦены(ТаблицаЦен, ИдентификаторыНоменклатуры, Отказ, КодСостояния)
	
	ДанныеПоНоменклатуре = РаботаСНоменклатуройСлужебный.ПолучитьДанныеПоНоменклатуре(
		ИдентификаторыНоменклатуры,
		Ложь,
		Отказ,
		КодСостояния);
	
	Если Отказ
		Или ТипЗнч(ДанныеПоНоменклатуре) <> Тип("ТаблицаЗначений")
		Или ДанныеПоНоменклатуре.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСНоменклатуройПереопределяемый.ПриПолученииДанныхИзСервисаПоНоменклатуре(ДанныеПоНоменклатуре);
	
	Для Каждого СтрокаНоменклатуры Из ДанныеПоНоменклатуре Цикл
		
		ОтраслевыеРеквизиты = РаботаСНоменклатуройУНФ.ПолучитьОтраслевыеРеквизиты(СтрокаНоменклатуры);
		
		Для Каждого СтрокаЦен Из СтрокаНоменклатуры.ПредельныеОтпускныеЦены Цикл
			
			Если СтрокаЦен.ТипЦены <> "Предельная отпускная цена" Тогда
				Продолжить;
			КонецЕсли;
			
			Цена = СтрокаЦен.Цена;
			ДатаРегистрацииЦены = Неопределено;
			Для Каждого СтрокаСвойства Из СтрокаЦен.ДополнительныеРеквизиты Цикл
				Если СтрокаСвойства.Наименование = "reg_date" Тогда
					ДатаРегистрацииЦены = ПрочитатьДатуJSON(СтрокаСвойства.Значение, ФорматДатыJSON.ISO);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			НоваяСтрока = ТаблицаЦен.Добавить();
			НоваяСтрока.ИдРЛС = СтрокаНоменклатуры.Идентификатор;
			НоваяСтрока.Цена = Цена;
			НоваяСтрока.ДатаРегистрацииЦены = ДатаРегистрацииЦены;
			НоваяСтрока.НаименованиеПроизводителя = СтрокаНоменклатуры.НаименованиеПроизводителя;
			
			Если ОтраслевыеРеквизиты.Свойство("ор_МНН") Тогда
				НоваяСтрока.МНН = ОтраслевыеРеквизиты.ор_МНН.Наименование;
			КонецЕсли;
			
			НоваяСтрока.Наименование = СтрокаНоменклатуры.Наименование;
			НоваяСтрока.КоличествоВУпаковке = СтрокаНоменклатуры.КоличествоВУпаковке.Количество;
			
			Если СтрокаНоменклатуры.Штрихкоды.Количество() > 0 Тогда
				НоваяСтрока.ШтрихКод = СтрокаНоменклатуры.Штрихкоды[0];
			КонецЕсли;
			
			Если ОтраслевыеРеквизиты.Свойство("ор_ФормаВыпуска") Тогда
				НоваяСтрока.ФормаВыпускаПолное = ОтраслевыеРеквизиты.ор_ФормаВыпуска.Наименование;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторЖНВЛС()
	Возврат "31198";
КонецФункции

Функция ИдентификаторНаркотическоеСредство()
	Возврат "31199";
КонецФункции

#Область ИменаЗагружаемыхКлассификаторов

Функция ИмяКлассификатора_МНН() Экспорт
	
	Возврат "МНН";
	
КонецФункции

Функция ИмяКлассификатора_ФТГ() Экспорт
	
	Возврат "ESKLP_FTG";
	
КонецФункции

Функция ИмяКлассификатора_ЛекарственныеФормы() Экспорт
	
	Возврат "ESKLP_FORM";
	
КонецФункции

Функция ИмяКлассификатора_АТХ() Экспорт
	
	Возврат "ESKLP_ATC";
	
КонецФункции

Функция ИмяКлассификатора_ДВЛП() Экспорт
	
	Возврат "ESKLP_DVLP";
	
КонецФункции

Функция ИмяКлассификатора_ЕдиницыИзмерения() Экспорт
	
	Возврат "okei";
	
КонецФункции

Функция ИмяКлассификатора_ФормыВыпуска() Экспорт
	
	Возврат "ФормыВыпуска";
	
КонецФункции

Функция ИмяКлассификатора_СМНН() Экспорт
	
	Возврат "SMNN";
	
КонецФункции

#КонецОбласти // ИменаЗагружаемыхКлассификаторов

#КонецОбласти

#КонецОбласти