
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Пункт1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВЛичныйКабинетГИСМТ" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрШаблон("https://%1", РазрешительныйРежимМДЛПКлиентСервер.АдресСервера(Истина)));
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВСписокТокенов" Тогда
		
		СтандартнаяОбработка                   = Ложь;
		ИмяОткрываемойФормы = "РегистрСведений.ДанныеКлючаСессииМДЛП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации";
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Актуализация", Ложь);
		
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пункт2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВСписокСертификатов" Тогда
		
		ИмяОткрываемойФормы = "ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования";
		
		ОткрытьФорму(ИмяОткрываемойФормы,, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПодписатьТокен" Тогда
		
		ПараметрыАвторизации = РазрешительныйРежимМДЛПКлиент.ПараметрыЗапросаДанных();
		ПараметрыАвторизации.ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПодписанияТокенаАвторизации", ЭтотОбъект);
		
		РазрешительныйРежимМДЛПКлиент.АвторизацияГИСМТРозничныйТокен(ПараметрыАвторизации);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пункт3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "АктуализацияСпискаCDNПлощадок" Тогда
		
		ЗапуститьАктуализациюСпискаCDNПлощадок();
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьАктуализациюСпискаCDNПлощадок()
	
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеАктуализацииСпискаПлощадок", ЭтотОбъект);
	
	ПараметрыЗапроса                         = РазрешительныйРежимМДЛПКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = Новый Структура("ОбновлятьБезПроверкиДатыОбновления", Истина);
	
	РазрешительныйРежимМДЛПКлиент.АктуализацияСпискаCDNПлощадок(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАктуализацииСпискаПлощадок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки И ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		
	ИначеЕсли Результат.ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ОбновитьСписокCDNПлощадокПослеЗагрузки",, ЭтотОбъект);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодписанияТокенаАвторизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки И ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		
	ИначеЕсли Результат.ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьАктуализациюСпискаCDNПлощадок();
	
КонецПроцедуры

#КонецОбласти
