
#Область СлужебныеПроцедурыИФункции

// Открывает форму регистра сведений с отбором 
//
// Параметры:
//   ПолеОтбора 		- Строка - Поле, по которому происходит отбор
//	 ЗначениеОтбора		- Произвольный - Значение отбора
//   Форма              - Строка - Форма, которую необходимо открыть с отбором
//
Процедура ОткрытьРегистрСведенийСОтбором(ПолеОтбора, ЗначениеОтбора, Форма) Экспорт
	
	Отбор = Новый Структура(ПолеОтбора, ЗначениеОтбора);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму(Форма, ПараметрыФормы);

КонецПроцедуры

// Выполняет создание документа на основании 
//
// Параметры:
//   ДокументОснование - Ссылка на документ основание
//	 Форма			   - Форма нового объекта, которая заполняется на основании
//
Процедура СоздатьНаОснованииДокументаИзФормыСписка(ДокументОснование, Форма) Экспорт
	
	Если ДокументОснование <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Основание", ДокументОснование);
		ОткрытьФорму(Форма, ПараметрыФормы);	
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения(), НСтр("ru = 'Команда не может быть выполнена для указанного объекта!'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаКомандыПраваДоступа(Ссылка, Форма) Экспорт
	
	Если Ссылка = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
	
	Если ПараметрыРаботыКлиента.УпрощенныйИнтерфейсНастройкиПравДоступа Тогда
		ИмяФормы = "ОбщаяФорма.ПраваДоступаУпрощенно";
	Иначе
		ИмяФормы = "ОбщаяФорма.ПраваДоступа";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь", Ссылка);
	
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыФормы,
		Форма,
		Ложь);
	
КонецПроцедуры

#КонецОбласти
