
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьВидыЦен(Параметры.ВыбранныеВидыЦен);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗавершитьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЗавершитьВыбор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершитьВыбор()
	
	ТекущиеДанные = Элементы.ВидыЦен.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВидыЦен(МассивВидовЦен)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	СправочникВидыЦен.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.Статический)
	|			ТОГДА &Статический
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.Расширение)
	|			ТОГДА &Расширение
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ПроизвольныйЗапрос)
	|			ТОГДА &ПроизвольныйЗапрос
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ДинамическийПроцент)
	|			ТОГДА &Процент
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ДинамическийФормула)
	|			ТОГДА &Формула
	|	КОНЕЦ КАК ПредставлениеТипаВидаЦен,
	|	ВЫБОР
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.Статический)
	|			ТОГДА 0
	|		КОГДА (СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ДинамическийПроцент)
	|				ИЛИ СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ДинамическийФормула))
	|				И НЕ СправочникВидыЦен.РассчитыватьАвтоматически
	|			ТОГДА 1
	|		КОГДА СправочникВидыЦен.РассчитыватьАвтоматически
	|			ТОГДА 2
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.ПроизвольныйЗапрос)
	|			ТОГДА 3
	|		КОГДА СправочникВидыЦен.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.Расширение)
	|			ТОГДА 4
	|	КОНЕЦ КАК ИндексКартинки,
	|	СправочникВидыЦен.ИдентификаторФормул КАК ИдентификаторФормул
	|ИЗ
	|	Справочник.ВидыЦен КАК СправочникВидыЦен
	|ГДЕ
	|	СправочникВидыЦен.Ссылка В(&МассивВидовЦен)";
	
	Запрос.УстановитьПараметр("Статический", НСтр("ru = 'Статический'"));
	Запрос.УстановитьПараметр("ПроизвольныйЗапрос", НСтр("ru = 'Произвольный запрос'"));
	Запрос.УстановитьПараметр("Процент", НСтр("ru = 'Процент'"));
	Запрос.УстановитьПараметр("Формула", НСтр("ru = 'Формула'"));
	Запрос.УстановитьПараметр("Расширение", НСтр("ru = 'Расширение'"));
	Запрос.УстановитьПараметр("МассивВидовЦен", МассивВидовЦен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаВидаЦен = ВидыЦен.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВидаЦен, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
