
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлДанныхКлассификаторФТГНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ФайлНаДискеКлассификаторФТГ = Новый Файл(ФайлДанныхКлассификаторФТГ);
	Если НЕ ФайлНаДискеКлассификаторФТГ.Существует() ИЛИ ФайлНаДискеКлассификаторФТГ.ЭтоКаталог() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл данных с классификаторами ФТГ не существует'"),, НСтр("ru = 'Ошибка'"));
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ФайлДанных", ФайлДанныхКлассификаторФТГ));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриОткрытииЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	РасширениеРаботыСФайламиПодключено = Подключено;
	Если НЕ РасширениеРаботыСФайламиПодключено Тогда
		Элементы.ФайлДанныхКлассификаторФТГ.Видимость = Ложь;
		Элементы.ПредупреждениеЗагрузка.Видимость = Истина;
	Иначе
		Элементы.ФайлДанныхКлассификаторФТГ.Видимость = Истина;
		Элементы.ПредупреждениеЗагрузка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		
		ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами!'"));
		Возврат;
		
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДанныхКлассификаторФТГ;
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'ВЫБРАТЬ источник данных'");
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Документ XML'") + " (*.xml)|*.xml";
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения(
		"ФайлДанныхКлассификаторФТГНачалоВыбораЗавершение",
		ЭтотОбъект,
		Новый Структура("Диалог", ДиалогВыбораФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныхКлассификаторФТГНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.Диалог;
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДанныхКлассификаторФТГ = ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры

#КонецОбласти

