
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПередНачаломДобавления" таблицы "Список"
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПроверитьДоступностьРедактирования(Отказ);
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" таблицы "Список"
//
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ПроверитьДоступностьРедактирования(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "УдалитьВсе"
//
&НаКлиенте
Процедура УдалитьВсе(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект),
		НСтр("ru = 'Удалить все записи фасильфикатов?'"),
		РежимДиалогаВопрос.ДаНет)
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьУдалениеВсехЗаписей();
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ор_ФальсификатыЛекарственныхСредств"));
	
КонецПроцедуры

// Процедура - обработчик команды "СнятьПометки"
//
&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("СнятьПометкиЗавершение", ЭтотОбъект),
		НСтр("ru = 'Снять признак фальсифицированности у всех записей?'"),
		РежимДиалогаВопрос.ДаНет)
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьСнятиеФлагаФальсифицированности();
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ор_ФальсификатыЛекарственныхСредств"));
	
КонецПроцедуры

// Процедура - обработчик команды "ПоискФальсификатов"
//
&НаКлиенте
Процедура ПоискФальсификатов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокСерий", Новый СписокЗначений);
	
	ОткрытьФорму(
		"РегистрСведений.ор_ФальсификатыЛекарственныхСредств.Форма.ФормаСопоставленияФальсификатов",
		ПараметрыФормы,
		ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик команды "ЗагрузитьИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимЗагрузки", 3);
	ПараметрыФормы.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", Истина);
	ПараметрыФормы.Вставить("ИмяВидаРегистра", "ор_ФальсификатыЛекарственныхСредств");
	
	ОткрытьФорму(
		"Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПомощник",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ЗагрузитьИзФайлаОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗабракованныеРосздравнадзор(Команда)
	
	ОткрытьФорму("РегистрСведений.ор_ФальсификатыЛекарственныхСредств.Форма.ФормаЗагрузкаЗабракованныхРосздравнадзор",,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменяет доступность элементов
//
&НаСервере
Процедура УстановитьДоступностьЭлементовСервер()
	
	// Настройки доступности элементов
	РазрешитьРедактироватьФальсификатыВручную = Пользователи.РолиДоступны("ор_ПравоРазрешитьРедактироватьФальсификатыВручную");
	Если НЕ РазрешитьРедактироватьФальсификатыВручную Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Изменяет доступность элементов
//
&НаСервере
Процедура ПроверитьДоступностьРедактирования(Отказ)
	
	РазрешитьРедактироватьФальсификатыВручную = Пользователи.РолиДоступны("ор_ПравоРазрешитьРедактироватьФальсификатыВручную");
	Если НЕ РазрешитьРедактироватьФальсификатыВручную Тогда
		Сообщение = НСтр("ru = 'Нет прав на редактирование фальсификатов вручную!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Снимает флаг фальсифицированности для всех записей
//
&НаСервере
Процедура ВыполнитьСнятиеФлагаФальсифицированности()
	
	Набор = РегистрыСведений.ор_ФальсификатыЛекарственныхСредств.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого ТекЗапись Из Набор Цикл
		ТекЗапись.Фальсифицирован = Ложь;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

// Удаляет все записи регистра сведений
//
&НаСервере
Процедура ВыполнитьУдалениеВсехЗаписей()
	
	Набор = РегистрыСведений.ор_ФальсификатыЛекарственныхСредств.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
