///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при заполнении контактной информации о службе поддержки продукта
//
// Параметры:
//  ГрафикРаботы - Строка - график работы службы поддержки
//  Контакты     - Массив - Соответствие, где "Ключ" это заголовок поля
//  Сайты        - Массив - набор сайтов (строки или форматированные строки)
//
Процедура ПриПолученииКонтактовСлужбыПоддержки(ГрафикРаботы, Контакты, Сайты) Экспорт
	
	// Сведения о графике работы
	ГрафикРаботы = НСтр("ru='9:00 - 18:00, без перерывов,
	                        |кроме субботы и воскресенья'");
	
	// Сведения о контактах
	пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеКонтакта(Контакты, НСтр("ru = 'Телефон'"),   "+7 (495) 231-22-45");
	пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеКонтакта(Контакты, НСтр("ru = 'Эл. почта'"), "rs@rarus.ru");
	
	// Сведения о связанных информационных ресурсах
	Если НЕ ПустаяСтрока(Метаданные.АдресИнформацииОКонфигурации) Тогда
		пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеСайта(Сайты, Метаданные.АдресИнформацииОКонфигурации,
		    НСтр("ru = ' - описание возможностей программного продукта.'"));
	КонецЕсли;
	
	пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеСайта(Сайты, "https://rarus.ru/downloads", 
	    НСтр("ru = ' - материалы для скачивания.'"));
	
	пр_ПоддержкаОтраслевыхРешений.ДобавитьОписаниеСайта(Сайты, "https://rarus.ru/support/rarus-solutions",
	    НСтр("ru = ' - поддержка отраслевых решений «1С-Рарус».'"));
	
КонецПроцедуры // ПриПолученииКонтактовСлужбыПоддержки()

// Вызывается при идентификации бизнес-роли пользователя
//
// Параметры:
//  БизнесРольПользователя - Строка - Наименование бизнес-роли пользователя для передачи в службу поддержки.
//  Пользователь           - СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи - пользователь,
//      от имени которого выполняется текущий сеанс.
//
Процедура ПриПолученииБизнесРолиПользователя(БизнесРольПользователя, Пользователь) Экспорт
	
	
КонецПроцедуры // ПриПолученииБизнесРолиПользователя()

// Вызывается при расчете значения ключа данных замеров отраслевой бизнес статистики.
//
Процедура ПриПолученииКлючаДанныхЗамеровСтатистики(КлючДанных, ТипЗаписи, ИмяОперации, Параметры) Экспорт
	
	// Макисмальная длина строкового ключа данных - 100 символов,
	// как в измерении "Ключ" регистра сведений "ЗамерыСтатистики".
	// Формат ключа: <ПрефиксВидаКлюча> + <ДанныеКлюча>.
	// Длина ПрефиксВидаКлюча - 1 символ, ДанныеКлюча - до 99 символов.
	
	ПрефиксВидаКлюча = "0";
	
	// ПрефиксВидаКлюча = "0": данные ключа содержат до трех строк фиксированной длины 32 символа -
	// MD5 хешей или уникальных идентификаторов с удаленными дефисами.
	// Каждая из этих строк предваряется односимвольным префиксом, указывающими на тип передаваемых в строке данных.
	// Формат данных ключа: <ПрефиксТипа1> + <Строка1> [ + ПрефиксТипа2> + <Строка2> [ + <ПрефиксТипа3> + <Строка3>]]
	
	ПрефиксТипаДанных = "1";
	
	// ПрефиксТипаДанных = "0": передается идентификатор пользователя ИБ.
	// ПрефиксТипаДанных = "1": передается идентификатор бизнес роли пользователя.
	
КонецПроцедуры // ПриПолученииКлючаДанныхЗамеровСтатистики()

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - Форма контактов службы поддержки.
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры // ПриСозданииНаСервере()

// Вызывается при составлении перечня сервисов подключаемых через обращение.
//
// Параметры:
//  Сервисы - Массив - Набор описаний сервисов, доступных для подключения по зявке.
//
Процедура ПриПолученииСпискаПодключаемыхСервисов(Сервисы) Экспорт
	
	Подсказка = Новый ФорматированнаяСтрока(НСтр("ru = '>>> перейти на сайт'"),,,, "https://rarus.ru/instruments/");
	Демо1 = Новый Структура();
	Демо1.Вставить("Идентификатор", "demo");
	Демо1.Вставить("Заголовок",     НСтр("ru = 'Демо: Посетите сайт Инструменты 1С-Рарус'"));
	Демо1.Вставить("Подсказка",     Подсказка);
	Сервисы.Добавить(Демо1);
	
	Демо2 = Новый Структура();
	Демо2.Вставить("Идентификатор", "demo2");
	Демо2.Вставить("Заголовок",     НСтр("ru = 'Демо: Пример добавления сервиса без описания'"));
	Демо2.Вставить("Подсказка",     "");
	Сервисы.Добавить(Демо2);
	
	Демо3 = Новый Структура();
	Демо3.Вставить("Идентификатор", "demo3");
	Демо3.Вставить("Заголовок",     НСтр("ru = 'Демо: Пример сервиса с простой подсказкой'"));
	Демо3.Вставить("Подсказка",     "Описание демо сервиса");
	Сервисы.Добавить(Демо3);
	
КонецПроцедуры // ПриПолученииСпискаПодключаемыхСервисов()

// Вызывается при изменении вида из формы обращения.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма контактов службы поддержки.
//
Процедура ПриИзмененииВидаОбращения(Форма) Экспорт
	
	
КонецПроцедуры // ПриИзмененииВидаОбращения()

// Вызывается при изменении вида из формы обращения.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма контактов службы поддержки.
//
Процедура ПриИзмененииСервисаОбращения(Форма) Экспорт
	
	
КонецПроцедуры // ПриИзмененииСервисаОбращения()

// Вызывается при изменении дополнительного параметра сервиса в форме обращения.
//
// Параметры:
//  ИмяЭлемента - Строка - Имя измененного реквизита формы
//  Форма       - ФормаКлиентскогоПриложения - Форма контактов службы поддержки.
//
Процедура ПриИзмененииПараметраОбращения(ИмяЭлемента, Форма) Экспорт
	
	
КонецПроцедуры // ПриИзмененииПараметраОбращения()

// Вызывается из формы обращения перед его записью.
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - Форма контактов службы поддержки
//  Отказ        - Булево - Признак отказа от создания формы.
//
Процедура ПередЗаписьюОбращения(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
КонецПроцедуры // ПередЗаписьюОбращения()

#КонецОбласти
