

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстОшибки") Тогда
	    ТекстОшибки = Параметры.ТекстОшибки; 
	Иначе
		ТекстОшибки = "Не известная ошибка";
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокОкна") И СокрЛП(Параметры.ЗаголовокОкна)<>"" Тогда
	    Элементы.ТекстЗаголовка.Заголовок = Параметры.ЗаголовокОкна;
	КонецЕсли;  

	Если Параметры.Свойство("ВидДействия") Тогда
	    ВидДействия = Параметры.ВидДействия;
	КонецЕсли;  
	
	Если ВидДействия = "ОтменаЧекаВПроцессинге" Тогда
		Элементы.Закрыть.Видимость              = Истина;
		Элементы.ПолнаяОплата.Видимость         = Ложь;
		Элементы.ОтменаЧека.Видимость           = Ложь;
		Элементы.Закрыть.КнопкаПоУмолчанию      = Истина;
	Иначе	
		
		Элементы.Закрыть.Видимость              = Ложь;
		Элементы.ПолнаяОплата.Видимость         = Истина;
		Элементы.ОтменаЧека.Видимость           = Истина;
		Элементы.ПолнаяОплата.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы) 
	
	Результат = Новый Структура;
	Результат.Вставить("ВидДействия", ВидДействия);
	
	ОповеститьОВыборе(Результат); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаЧека(Команда)
	
	Если СтрНайти(ТекстОшибки,"6.0 Ошибка связи с процессингом Спасибо") > 0 ИЛИ  
		 СтрНайти(ТекстОшибки,"6.1 Ошибка связи с процессингом Спасибо") > 0 ИЛИ
		 СтрНайти(ТекстОшибки,"6.2 Ошибка связи с процессингом Спасибо") > 0 ИЛИ
		 СтрНайти(ТекстОшибки,"2.2 Запрет списания бонусов") > 0 Тогда
		ВидДействия = "ОтменаЧекаВБазе";
	Иначе
		ВидДействия = "ОтменаЧекаВПроцессинге";
	КонецЕсли;
	
	Закрыть(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПолнаяОплата(Команда)
	
	Если СтрНайти(ТекстОшибки,"6.0 Ошибка связи с процессингом Спасибо") > 0 ИЛИ
		 СтрНайти(ТекстОшибки,"6.1 Ошибка связи с процессингом Спасибо") > 0 Тогда
		ВидДействия = "ОплатаПлатежнойкартойСПодтверждением";
	Иначе
		ВидДействия = "ОплатаПлатежнойкартойОстаток";
	КонецЕсли;

	Закрыть(Ложь);
	
КонецПроцедуры


