
&После("ПриЗаписи")
Процедура эв_ПриЗаписи(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Статус <> Перечисления.СтатусыЧековККМ.Пробит Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = эв_РаспределеннаяФискализация.эв_ПоставитьВозвратАвансаБезОборудованияВОчередь(ЭтотОбъект);
	Если ПустаяСтрока(ТекстСообщения)
		Или ТекстСообщения = НСтр("ru = 'Чек возврата аванса уже пробит.'")
		Или ТекстСообщения = НСтр("ru = 'Возврат аванса уже находится в очереди фискализации.'") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры
