
#Область ПрограммныйИнтерфейс

// Выполняет программное изменение структуры формы
// (создание и изменение реквизитов, команд, элементов, условного оформления), связанное с отраслевой спецификой. 
//
// Параметры:
//   Форма - Форма клиентского приложения, структура которой изменяется 
//
Процедура СоздатьЭлементыФормы(Форма) Экспорт
	
	ТестПрограммногоСоздания = Ложь;
	Если Форма.Параметры.Свойство("ТестПрограммногоСоздания") Тогда
		ТестПрограммногоСоздания = Истина;
	КонецЕсли;
	
	// Проверка на повторный вызов процедуры создания элементов формы
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ор_ЭлементыСозданыПрограммно") Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодстрок 	= СтрРазделить(Форма.ИмяФормы, ".");
	
	// Минимизация длины наименования процедуры путем удаления слова "Форма"
	Если МассивПодстрок.Найти("Форма") <> Неопределено Тогда
		МассивПодстрок.Удалить(МассивПодстрок.Найти("Форма"));
	КонецЕсли;
	
	СокращенияИменМетаданных = ор_ПрограммноеСозданиеЭлементовФормПовтИсп.СформироватьСтруктуруСокращенийИменМетаданных();
	
	// Замена наименований типов объектов метаданных исходя из структуры сокращений
	Для Каждого Сокр Из СокращенияИменМетаданных Цикл
		Если МассивПодстрок.Найти(Сокр.Ключ) <> Неопределено Тогда
			МассивПодстрок[МассивПодстрок.Найти(Сокр.Ключ)] = Сокр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ИмяПроцедуры = "";
	
	// Формирование имени процедуры
	Для Каждого Подстрока Из МассивПодстрок Цикл
		ИмяПроцедуры = ИмяПроцедуры + Подстрока;
	КонецЦикла;
	
	Если ТестПрограммногоСоздания Тогда
		СписокОшибок = "";
		
		ор_ПрограммноеСозданиеЭлементовФормОБ.ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок);
		ор_ПрограммноеСозданиеЭлементовФормОР.ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок);
		ор_ПрограммноеСозданиеЭлементовФормОРМДЛП.ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок);
		
		Если ЗначениеЗаполнено(СписокОшибок) Тогда
			ВызватьИсключение СписокОшибок;
		КонецЕсли;
	Иначе
		Попытка
			
			СписокОшибок = "";
			
			ор_ПрограммноеСозданиеЭлементовФормОБ.ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок);
			ор_ПрограммноеСозданиеЭлементовФормОР.ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок);
			ор_ПрограммноеСозданиеЭлементовФормОРМДЛП.ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок);
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			НовыйРеквизит = Новый РеквизитФормы("ор_ЭлементыСозданыПрограммно", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			Форма.ор_ЭлементыСозданыПрограммно = Истина;
			
			Если ЗначениеЗаполнено(СписокОшибок) Тогда
				ОбщегоНазначения.СообщитьПользователю("Ошибка при изменении формы: " + Символы.ПС + СписокОшибок);
			КонецЕсли;
			
		Исключение
			
			ОбщегоНазначения.СообщитьПользователю("Ошибка при создании элементов формы: " + ОписаниеОшибки());
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменяет значение свойства элемента формы
//
// Параметры:
//   Форма 	 	  	  - ФормаКлиентскогоПриложения - Форма, 
//				   		в которой изменяется значение свойства элемента
// 	 ИмяЭлемента 	  - Строка - Имя элемента, который нужно изменить
// 	 ИмяСвойства 	  - Строка - Имя свойства, значение которого нужно поменять у элемента
// 	 ЗначениеСвойства - Произвольный - Измененное значение свойства
//   СписокОшибок     - Строка - Список ошибок при изменении формы
//
Процедура ИзменитьСвойствоЭлемента(Форма, ИмяЭлемента, ИмяСвойства, ЗначениеСвойства, СписокОшибок) Экспорт
		
	Элемент = Форма.Элементы.Найти(ИмяЭлемента);
	Если Элемент <> Неопределено Тогда
		Элемент[ИмяСвойства] = ЗначениеСвойства;
	Иначе
		СписокОшибок = СписокОшибок + "Элемент <" + ИмяЭлемента + "> отсутствует на форме и не может быть изменен." + Символы.ПС;  
	КонецЕсли;
		  	
КонецПроцедуры

// Изменяет значение свойства команды формы
//
// Параметры:
//   Форма    	  	  - ФормаКлиентскогоПриложения - Форма,
//					    в которой изменяется значение свойства команды
//   ИмяКоманды 	  - Строка - Имя команды, которую нужно изменить
//   ИмяСвойства      - Строка - Имя свойства, значение которого нужно поменять
//   ЗначениеСвойства - Произвольный - Измененное значение свойства
//   СписокОшибок     - Строка - Список ошибок при изменении формы
//
Процедура ИзменитьСвойствоКоманды(Форма, ИмяКоманды, ИмяСвойства, ЗначениеСвойства, СписокОшибок) Экспорт
	
	Команда = Форма.Команды.Найти(ИмяКоманды);
	Если Команда <> Неопределено Тогда
		  Команда[ИмяСвойства] = ЗначениеСвойства;
	Иначе
		  СписокОшибок = СписокОшибок + "Команда <" +  ИмяКоманды + "> отсутствует на форме и не может быть изменена." + Символы.ПС;  
	КонецЕсли;
		  				
КонецПроцедуры

// Изменяет обработчик события элемента формы
//
// Параметры:
//   Форма    	  	  - ФормаКлиентскогоПриложения - Форма,
//					    в которой изменяется значение обработчика события 
//   ИмяЭлемента 	  - Строка - Имя элемента, значения обработчика которого нужно изменить
//   ИмяСобытия       - Строка - Имя события, для которого устанавливается новое действие.
//   Действие 		  - Строка - Указывается имя обработчика.
//   Перезаписывать	  - Булево - Признак перезаписи значения обработчика
//   СписокОшибок     - Строка - Список ошибок при изменении формы
//
Процедура ИзменитьДействиеЭлемента(Форма, ИмяЭлемента, ИмяСобытия, Действие, Знач Перезаписывать = Ложь, СписокОшибок) Экспорт
				
	Элемент = Форма.Элементы.Найти(ИмяЭлемента);
	
	Если Элемент <> Неопределено Тогда
		
		ДействиеДоИзменения = Строка(Форма.Элементы[ИмяЭлемента].ПолучитьДействие(ИмяСобытия));
		
		Если Не ПустаяСтрока(ДействиеДоИзменения) И Не Перезаписывать Тогда
			Возврат;
		КонецЕсли;
			
		Элемент.УстановитьДействие(ИмяСобытия, Действие);
		
	Иначе
		
		СписокОшибок = СписокОшибок + "Элемент <" + ИмяЭлемента + "> отсутствует на форме и не может быть изменен." + Символы.ПС;  
 	 
	КонецЕсли;
			 				        		
КонецПроцедуры

// Изменяет обработчик события формы
//
// Параметры:
//   Форма    	  	  - ФормаКлиентскогоПриложения - Форма,
//					    в которой изменяется значение обработчика события 
//   ИмяСобытия       - Строка - Имя события, для которого устанавливается новое действие.
//   Действие 		  - Строка - Указывается имя обработчика.
//   Перезаписывать	  - Булево - Признак перезаписи значения обработчика
//   СписокОшибок 	  - Строка - Список ошибок при изменении формы
//
Процедура ИзменитьДействиеФормы(Форма, ИмяСобытия, Действие, Знач Перезаписывать = Ложь) Экспорт
						
	ДействиеДоИзменения = Строка(Форма.ПолучитьДействие(ИмяСобытия));
   
	Если Не ПустаяСтрока(ДействиеДоИзменения) И Не Перезаписывать Тогда
		Возврат;
	КонецЕсли;
	
	Форма.УстановитьДействие(ИмяСобытия, Действие);	  
			        		
КонецПроцедуры


Процедура ПроверкаНеобходимостиУстановкиПроизвольногоЗапроса(ДинамическийСписок) Экспорт
	
	Если Не ДинамическийСписок.ПроизвольныйЗапрос Тогда
	    ДинамическийСписок.ПроизвольныйЗапрос = Истина;
		ДинамическийСписок.ТекстЗапроса = "ВЫБРАТЬ * ИЗ " + ДинамическийСписок.ОсновнаяТаблица + "";	
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСхемуЗапроса(Запрос) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос);
	
	Возврат СхемаЗапроса;
			
КонецФункции

Процедура ДобавитьПолеВЗапросДинамическогоСписка(ПакетЗапроса, ДобавляемыеПоля) Экспорт
	
	Колонки = ПакетЗапроса.Колонки;
	Для Каждого Оператор Из ПакетЗапроса.Операторы Цикл
		Для Каждого Поле Из ДобавляемыеПоля Цикл
			Если Оператор.ВыбираемыеПоля.Найти(Поле.Ключ) = Неопределено Тогда
				Оператор.ВыбираемыеПоля.Добавить(Поле.Ключ);
				Псевдоним = Поле.Значение;
				Если Не ПустаяСтрока(Псевдоним) Тогда
					Если Колонки.Найти(Псевдоним) <> Неопределено Тогда
						Колонки.Найти(Псевдоним).Псевдоним = "Розница_" + Псевдоним;
					КонецЕсли;
					Колонки[Колонки.Количество() - 1].Псевдоним = Псевдоним;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

