
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоВариантуИспользования) Тогда
		
		// Установим отбор по варианту использования настройки
		ВариантИспользованияНастройки = Параметры.ПараметрОтборПоВариантуИспользования;
		
		// Установим текущую группу справочника
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.УстановитьТекущуюГруппуСправочника(Параметры, Элементы.Список);
		
		Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоТипуПрикладногоОбъекта) Тогда
			
			// Установим отбор по типу прикладного объекта
			ТипПрикладногоОбъекта = Параметры.ПараметрОтборПоТипуПрикладногоОбъекта;
			
			// ПараметрОтборПоМетаданным содержит полное имя метаданного
			Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоМетаданным) Тогда
				
				ОтборПоМетаданным = Метаданные.НайтиПоПолномуИмени(Параметры.ПараметрОтборПоМетаданным);
				
				// Установим отбор по метаданным объекта
				ИмяПрикладногоОбъекта = ОтборПоМетаданным.Имя;
				
				// ПараметрОтборПоМетаданнымТабличнойЧасти содержит имя ТЧ
				Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоМетаданнымТабличнойЧасти) Тогда
					
					// Проверим принадлежность ТЧ объекту
					Если НЕ ОтборПоМетаданным.ТабличныеЧасти.Найти(Параметры.ПараметрОтборПоМетаданнымТабличнойЧасти)=Неопределено Тогда
						
						// Установим отбор по ТЧ
						ИмяТабличнойЧасти = Параметры.ПараметрОтборПоМетаданнымТабличнойЧасти;
						
					КонецЕсли;
					
				КонецЕсли
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Установим отбор по контрагенту
	Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоКонтрагенту) Тогда
		Контрагент = Параметры.ПараметрОтборПоКонтрагенту;
	КонецЕсли;
	
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// В веб-клиенте редактирование справочника запрещено
	#Если ВебКлиент Тогда
		ТолькоПросмотр = Истина;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	УстановитьОтборДинамическихСписковПриИзмененииКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборДинамическихСписковПриИзмененииКлиент()
	
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписковПриИзмененииСервер()
	
	УстановитьОтборДинамическихСписков("ВариантИспользованияНастройки", ВариантИспользованияНастройки);
	УстановитьОтборДинамическихСписков("ТипПрикладногоОбъекта"        , ТипПрикладногоОбъекта);
	УстановитьОтборДинамическихСписков("ИмяПрикладногоОбъекта"        , ИмяПрикладногоОбъекта);
	УстановитьОтборДинамическихСписков("ИмяТабличнойЧасти"            , ИмяТабличнойЧасти);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		МассивПоКонтрагенту      = КритерииОтбора.ор_НастройкиКонтрагентов.Найти(Контрагент);
		МассивПоВсемКонтрагентам = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройкиДляВсехКонтрагентов();
		
		Для Каждого ЭлементПоКонтрагенту Из МассивПоКонтрагенту Цикл
			МассивПоВсемКонтрагентам.Добавить(ЭлементПоКонтрагенту);
		КонецЦикла;
		
		УстановитьОтборДинамическихСписков("Ссылка", МассивПоВсемКонтрагентам);
		
	Иначе
		УстановитьОтборДинамическихСписков("Ссылка", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков(ИмяРеквизита, ЗначениеРеквизита)
	
	Если ИмяРеквизита="Ссылка" Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		ИмяРеквизита,
		ЗначениеРеквизита,
		ВидСравненияОтбора,,
		ЗначениеЗаполнено(ЗначениеРеквизита));
	
КонецПроцедуры

#КонецОбласти
