
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Ссылка КАК Наименование
	|ИЗ
	|	Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента КАК ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента
	|ГДЕ
	|	НЕ ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Предопределенный
	|	И НЕ ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЭтоГруппа
	|	И ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ВариантИспользованияНастройки = ЗНАЧЕНИЕ(Перечисление.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Таблица.Загрузить(Результат.Выгрузить());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Актуализировать(Команда)
	Отбор = Новый Структура("Пометка", Истина);
	МассивСтрок = Таблица.НайтиСтроки(Отбор);
	
	ТекстСИзменениями = "";
	Если МассивСтрок.Количество() > 0 Тогда
		МассивНастроек = Новый Массив;
		Для Каждого Строка Из МассивСтрок Цикл
			МассивНастроек.Добавить(Строка.Наименование);
		КонецЦикла;
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ВыполнитьГрупповуюОбработкуНастроекЗагрузки(МассивНастроек, ТекстСИзменениями);
	Иначе
		ТекстСообщения = "Не выбрано ни одной настройки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если ТекстСИзменениями = "" Тогда
		ТекстСИзменениями = "Выбранные настройки Выгрузки/Загрузки данных обработаны успешно";
	КонецЕсли;
	
	Элементы.Таблица.Видимость = ЛОЖЬ;
	Элементы.ТекстИзменений.Видимость = ИСТИНА;
	Элементы.ФормаАктуализировать.Доступность = ЛОЖЬ;
	Элементы.УстановитьФлажки.Видимость = ЛОЖЬ;
	Элементы.СнятьФлажки.Видимость = ЛОЖЬ;
	
	ВывестиТекст(ТекстСИзменениями);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиТекст(Текст)
	ВыводимыйТекст = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетВыводаРезультатовАктуализацииНастроекЗагрузки").ПолучитьТекст();
	ТекстИзменений = СтрЗаменить(ВыводимыйТекст, "%РезультатАктуализации%", СтрЗаменить(Текст, Символы.ПС, "<BR>"));
КонецПроцедуры

#КонецОбласти
