
#Область ПрограммныйИнтерфейс

// Переопределяет запуск выполнения проверки КМ на форме документов библиотеки МДЛП или документов,
// имеющих структуру подобную документам библиотеки МДЛП.
//  (см. процедуру КонтрольКодовМаркировкиМДЛПКлиент.НачатьПроверкуКМНаФорме)
//  Для выполнения проверки КМ на форме объектов не имеющих структуру подобную документам библиотеки МДЛП
//  необходимо использовать процедуру
//  НачатьПроверкуКМСредствамиАПИМДЛП
//  или НачатьПроверкуКМСредствамиРВ
//  или НачатьПроверкуКМСредствамиККТ.
//
// Параметры:
//  Форма                   - ФормаКлиентскогоПриложения - форма объекта подключения механизма проверки КМ.
//  Объект                  - Любаяссылка - ссылка на документ.
//  ДанныеШтрихкодовПоТипам - Массив - переданные с ТСД штрихкоды; строки табличной части.
//  ОповещениеОЗавершении   - ОписаниеОповещения - обработка после завершения.
//  ЗагрузкаИзТСД           - Булево - признак загрузки данных из ТСД.
//  СтандартнаяОбработка    - Булево - признак отключения стандартной обработки.
//
Процедура НачатьПроверкуКМНаФорме(Форма, Объект, ДанныеШтрихкодовПоТипам, ОповещениеОЗавершении, ЗагрузкаИзТСД, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Переопределяет открытие формы выборочного контроля из формы владельца.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта подключения механизма проверки КМ.
//  СтандартнаяОбработка - Булево - при Истина, отключение стандартного механизма процедуры КонтрольКодовМаркировкиМДЛПКлиент.ОткрытьФормуВыборочногоКонтроляКМИзФормыВладельца.
//
Процедура ОткрытьФормуВыборочногоКонтроляКМИзФормыВладельца(Форма, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#Область КонтрольКМСредствамиАПИМДЛП

// Переопределяет запуск выполнения проверки КМ средствами АПИ МДЛП на форме объекта (см. процедуру КонтрольКодовМаркировкиСредствамиАПИМДЛПКлиент.НачатьПроверкуКМ).
// Результат будет возвращен в процедуру, указанную в параметре Параметры.ОповещениеОЗавершении (см. функцию КонтрольКодовМаркировкиСредствамиАПИМДЛПКлиент.ПараметрыПроверкиКМ).
// Процедура должна принимать следующие параметры:
//  * РезультатПроверкиКМ - Структура - результат проверки КМ средствами АПИ МДЛП (см. функцию РезультатПроверкиКМ):
//     ** ЕстьОшибки     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//     ** ДанныеПроверки - Соответствие - коллекция результатов проверки кодов маркировки.
//         * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМ и ЭлементДанныхДляПроверкиКМ).
//         * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию РезультатПроверкиКМЭлемента).
//            ** КодМаркировки       - SGTIN.
//            ** ПолныйКодМаркировки - полный код маркировки в формате Base64.
//            ** КонтрольПройден     - Булево - признак того, что КМ корректный или пользователь считает его корректным (в случае использования интерактивного режима).
//            ** РезультатПроверкиКМ - ФиксированнаяСтруктура - результат проверки конкретного кода маркировки средствами РВ
//                                     (см. РегистрыСведений.РезультатыПроверкиКМСредствамиАПИМДЛП.СвойстваРезультатаПроверкиКМ).
//            ** КодСтатусаПроверкиКМ       - Число - результат обработки значения РезультатПроверкиКМ, для отображения пользователю на форме.
//            ** ПояснениеСтатусаПроверкиКМ - Строка - результат обработки значения РезультатПроверкиКМ, для отображения пользователю на форме.
//  * ДополнительныеПараметры - дополнительные параметры описания оповещения.
//
// Параметры:
//  Параметры - Структура - см. функцию КонтрольКодовМаркировкиСредствамиАПИМДЛПКлиент.ПараметрыПроверкиКМ.
//  СтандартнаяОбработка - Булево - при Истина, отключение стандартного механизма процедуры КонтрольКодовМаркировкиСредствамиАПИМДЛПКлиент.НачатьПроверкуКМ.
//
Процедура НачатьПроверкуКМСредствамиАПИМДЛП(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольКМСредствамиРВ

// Переопределяет запуск выполнения проверки КМ средствами РВ на форме объекта (см. процедуру КонтрольКодовМаркировкиСредствамиРВМДЛПКлиент.НачатьПроверкуКМ).
// Результат будет возвращен в процедуру, указанную в параметре Параметры.ОповещениеОЗавершении (см. функцию КонтрольКодовМаркировкиСредствамиРВМДЛПКлиент.ПараметрыПроверкиКМ).
// Процедура должна принимать следующие параметры:
//  * РезультатПроверкиКМ - Структура - результат проверки КМ средствами РВ (см. функцию РезультатПроверкиКМ):
//     ** ЕстьОшибки     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//     ** ДанныеПроверки - Соответствие - коллекция результатов проверки кодов маркировки.
//         * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМ и ЭлементДанныхДляПроверкиКМ).
//         * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию РезультатПроверкиКМЭлемента).
//            ** КодМаркировки       - SGTIN.
//            ** ПолныйКодМаркировки - полный код маркировки в формате Base64.
//            ** КонтрольПройден     - Булево - признак того, что КМ корректный или пользователь считает его корректным (в случае использования интерактивного режима).
//            ** РезультатПроверкиКМ - ФиксированнаяСтруктура - результат проверки конкретного кода маркировки средствами РВ
//                                     (см. РегистрыСведений.РезультатыПроверкиКМСредствамиРВМДЛП.СвойстваРезультатаПроверкиКМ).
//            ** КодСтатусаПроверкиКМ       - Число - результат обработки значения РезультатПроверкиКМ, для отображения пользователю на форме.
//            ** ПояснениеСтатусаПроверкиКМ - Строка - результат обработки значения РезультатПроверкиКМ, для отображения пользователю на форме.
//  * ДополнительныеПараметры - дополнительные параметры описания оповещения.
//
// Параметры:
//  Параметры - Структура - см. функцию КонтрольКодовМаркировкиСредствамиРВМДЛПКлиент.ПараметрыПроверкиКМ.
//  СтандартнаяОбработка - Булево - при Истина, отключение стандартного механизма процедуры КонтрольКодовМаркировкиСредствамиРВМДЛПКлиент.НачатьПроверкуКМ.
//
Процедура НачатьПроверкуКМСредствамиРВ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольКМСредствамиККТ

// Переопределяет запуск выполнения проверки КМ средствами ККТ на форме объекта (см. процедуру КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.НачатьПроверкуКМ).
// Результат будет возвращен в процедуру, указанную в параметре Параметры.ОповещениеОЗавершении (см. функцию КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.ПараметрыПроверкиКМ).
// Процедура должна принимать следующие параметры:
//  * РезультатПроверкиКМ - Структура - результат проверки КМ средствами ККТ (см. функцию РезультатПроверкиКМ):
//     ** ЕстьОшибки     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//     ** ДанныеПроверки - Соответствие - коллекция результатов проверки кодов маркировки.
//         * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМ и ЭлементДанныхДляПроверкиКМ).
//         * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию РезультатПроверкиКМЭлемента).
//            ** КодМаркировки       - SGTIN.
//            ** ПолныйКодМаркировки - полный код маркировки в формате Base64.
//            ** КонтрольПройден     - Булево - признак того, что КМ корректный или пользователь считает его корректным (в случае использования интерактивного режима).
//            ** РезультатПроверкиКМ - ФиксированнаяСтруктура - результат проверки конкретного кода маркировки средствами ККТ
//                                     (см. РегистрыСведений.РезультатыПроверкиКМСредствамиККТМДЛП.СвойстваРезультатаПроверкиКМ).
//            ** КодСтатусаПроверкиКМ       - Число - результат обработки значения РезультатПроверкиКМ, для отображения пользователю на форме.
//            ** ПояснениеСтатусаПроверкиКМ - Строка - результат обработки значения РезультатПроверкиКМ, для отображения пользователю на форме.
//  * ДополнительныеПараметры - дополнительные параметры описания оповещения.
//
// Параметры:
//  Параметры - Структура - см. функцию КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.ПараметрыПроверкиКМ.
//  СтандартнаяОбработка - Булево - при Истина, отключение стандартного механизма процедуры КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.НачатьПроверкуКМ.
//
Процедура НачатьПроверкуКМСредствамиККТ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
