#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверка, что организация является резидентом.
//
// Параметры:
//  Организация - СправочникСсылка.ОрганизацииМДЛП - организация.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ОрганизацияРезидент(Организация) Экспорт
	
	Возврат ЗначениеЗаполнено(Организация) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Резидент") = Истина;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
