#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	КодЕСКЛП                     = "";
	УникальныйИдентификаторЕСКЛП = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ОбновлениеИнформационнойБазы
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ОбновлениеИнформационнойБазы
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ
		И ДополнительныеСвойства.Свойство("ПерезаполнитьНоменклатуру")
		И ДополнительныеСвойства.ПерезаполнитьНоменклатуру Тогда
		ПерезаполнитьНоменклатуруПоСМНН();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерезаполнитьНоменклатуруПоСМНН()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ор_СМНН = &СМНН";
	
	Запрос.УстановитьПараметр("СМНН", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НоменклатураОбъект.ор_ЖНВЛС        = ЖНВЛП;
		НоменклатураОбъект.ор_МНН          = ДействующиеВеществаМНН;
		НоменклатураОбъект.ор_ФТГ          = ФармакоТерапевтическаяГруппа;
		НоменклатураОбъект.ор_ФормаВыпуска = ФормаВыпуска;
		
		НоменклатураОбъект.ор_АТХКлассификация.Загрузить(АТХКлассификация.Выгрузить());
		
		Попытка
			НоменклатураОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обновить номенклатуру %1 по причине:
				|%2'"),
				Выборка.Ссылка,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли