

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОтобраннаяНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытаИзФормыПодбораПоДокументу") Тогда
		ОткрытаИзФормыПодбораПоДокументу = Параметры.ОткрытаИзФормыПодбораПоДокументу;
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаДанных") Тогда
		Для Каждого ТекСтрока Из Параметры.ТаблицаДанных Цикл
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Поиск(Команда)
	
	Если СтрокаПоиска = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задана строка поиска!");
		Возврат;
	КонецЕсли;
	
	ПоискСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработкаВыбора();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбора()
	
	ТекЭлементСписка = Элементы.ОтобраннаяНоменклатура.ТекущиеДанные;
	Если ТекЭлементСписка <> Неопределено Тогда
		Закрыть(ТекЭлементСписка.Значение);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана номенклатура!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоискСервер()
	
	Если НЕ ОткрытаИзФормыПодбораПоДокументу Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование ПОДОБНО &ПараметрПоиска
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Наименование";
		
		Если ТипПоиска = 0 Тогда
			ПараметрПоиска = "";
		Иначе
			ПараметрПоиска = "%";
		КонецЕсли;
		ПараметрПоиска = ПараметрПоиска + СтрокаПоиска + "%";
		Запрос.УстановитьПараметр("ПараметрПоиска", ПараметрПоиска);
		
		РезультатМассив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		ОтобраннаяНоменклатура.ЗагрузитьЗначения(РезультатМассив);
		
	Иначе
		
		// открыли форму из формы подбора по документу
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Наименование КАК НаименованиеВТаблице
		|ПОМЕСТИТЬ Таблица
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|ГДЕ
		|	ТаблицаДанных.Наименование ПОДОБНО &ПараметрПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.НаименованиеВТаблице
		|ИЗ
		|	Таблица КАК Таблица";
		Если ТипПоиска = 0 Тогда
			ПараметрПоиска = "";
		Иначе
			ПараметрПоиска = "%";
		КонецЕсли;
		ПараметрПоиска = ПараметрПоиска + СтрокаПоиска + "%";
		Запрос.УстановитьПараметр("ПараметрПоиска", ПараметрПоиска);
		Запрос.УстановитьПараметр("ТаблицаДанных", РеквизитФормыВЗначение("ТаблицаДанных", Тип("ТаблицаЗначений")));
		РезультатМассив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НаименованиеВТаблице");
		ОтобраннаяНоменклатура.ЗагрузитьЗначения(РезультатМассив);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



