
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	УправлениеФормой();
	УстановитьЗаголовкиКомандВЗависимостиОтОпций();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда 
		Прочитать();
		УстановитьЗаголовкиКомандВЗависимостиОтОпций();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьХранилищеШаблонов(Команда)
	Если ИспользоватьСтаруюОбработкуПечатиЦенников Тогда
		ОткрытьФорму("Справочник.ХранилищеШаблонов.ФормаСписка", , ЭтотОбъект); 
	Иначе
		ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенниковБПО.ФормаСписка", , ЭтотОбъект);
	КонецЕсли;;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтраслевойРегистрСведенийОткрытьСписок(Команда)
	
	Если ПустаяСтрока(Команда.Имя)
		Или Не ОтраслевойРегистрСведенийСущесвует(Команда.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений." + Команда.Имя + ".ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтраслевойСправочникОткрытьСписок(Команда)
	
	Если ПустаяСтрока(Команда.Имя)
		Или Не ОтраслевойСправочникСущесвует(Команда.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник." + Команда.Имя + ".ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	УстановитьЗаголовкиКомандВЗависимостиОтОпций();
	Элементы.РазделПроизводство.Видимость = Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить();
	Элементы.РазделРаботы.Видимость = Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить();
	Элементы.РазделПерсонал.Видимость = Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить();
	ИспользоватьСтаруюОбработкуПечатиЦенников = ПолучитьФункциональнуюОпцию("ИспользоватьСтаруюОбработкуПечатиЦенников");
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиКомандВЗависимостиОтОпций()
	
	Если НаборКонстант.ФункциональнаяОпцияИспользоватьПодсистемуРаботы Тогда
		ЗаголовокСостоянияСобытий = НСтр("ru='Состояния событий и заданий'");
	Иначе
		ЗаголовокСостоянияСобытий = НСтр("ru='Состояния событий'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СправочникСостоянияСобытийОткрытьСписок", 
			"Заголовок",
			ЗаголовокСостоянияСобытий);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СправочникСостоянияСобытийОткрытьСписок1", 
			"Заголовок",
			ЗаголовокСостоянияСобытий);		

	
	Если НаборКонстант.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности Тогда
		ЗаголовокНаправленияДеятельности = НСтр("ru='Направления деятельности'");
	Иначе
		ЗаголовокНаправленияДеятельности = НСтр("ru='Направление деятельности'");
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СправочникНаправленияДеятельностиОткрытьСписок", 
			"Заголовок",
			ЗаголовокНаправленияДеятельности);
	
	Если НаборКонстант.ИспользоватьПодсистемуCRM Тогда
		ЗаголовокГруппыCRM = НСтр("ru='CRM'");
	Иначе
		ЗаголовокГруппыCRM = НСтр("ru='Покупатели'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"РазделCRM", 
			"Заголовок",
			ЗаголовокГруппыCRM);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтраслевойРегистрСведенийСущесвует(ИмяРегистраСведений)
	
	Возврат Метаданные.РегистрыСведений.Найти(ИмяРегистраСведений) <> Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтраслевойСправочникСущесвует(ИмяСправочника)
	
	Возврат Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено;
	
КонецФункции

#КонецОбласти