
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Параметры номенклатуры
	ПравилоКраткогоНаименования = Параметры.ПравилоКраткоеНоменклатуры;
	ПравилоПолногоНаименования  = Параметры.ПравилоПолноеНоменклатуры;
	СтруктураДанныеПоставщика   = Параметры.СтруктураДанныеПоставщика;
	
	// Приоритет у правила Полного Наименования
	// Значение правила краткого наименования перезатираются полным.
	Если ЗначениеЗаполнено(ПравилоПолногоНаименования) Тогда
		РеквизитыНоменклатуры.Загрузить(ПравилоКраткогоНаименования.ор_РеквизитыДляЗаполнения.Выгрузить());
		Для Каждого Строка Из ПравилоПолногоНаименования.ор_РеквизитыДляЗаполнения Цикл
			НайденныеСтроки = РеквизитыНоменклатуры.НайтиСтроки(Новый Структура("Реквизит", Строка.Реквизит));
			Если НайденныеСтроки.Количество() = 0 Тогда 
				НоваяСтрока = РеквизитыНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			Иначе
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0],Строка);
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеРеквизитыНоменклатуры.Загрузить(ПравилоКраткогоНаименования.ор_ДополнительныеРеквизиты.Выгрузить());
		Для Каждого Строка Из ПравилоПолногоНаименования.ор_ДополнительныеРеквизиты Цикл
			НайденныеСтроки = ДополнительныеРеквизитыНоменклатуры.НайтиСтроки(Новый Структура("Реквизит", Строка.Реквизит));
			Если НайденныеСтроки.Количество() = 0 Тогда 
				НоваяСтрока = ДополнительныеРеквизитыНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			Иначе
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0],Строка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		РеквизитыНоменклатуры.Загрузить(ПравилоКраткогоНаименования.ор_РеквизитыДляЗаполнения.Выгрузить());
		ДополнительныеРеквизитыНоменклатуры.Загрузить(ПравилоКраткогоНаименования.ор_ДополнительныеРеквизиты.Выгрузить());
	КонецЕсли;
	
	СоздатьСоответсвиеРеквизитовШаблонов();
	
	// Параметры характеристики
	ПравилоХарактеристики = Параметры.ПравилоХарактеристики;
	
	МассивПараметровНоменклатуры = Новый Массив;
	ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
		МассивПараметровНоменклатуры,
		СтруктураДанныеПоставщика.КатегорияНоменклатуры,
		ПравилоКраткогоНаименования,,
		Истина);
	Если ЗначениеЗаполнено(ПравилоПолногоНаименования) Тогда
		ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
			МассивПараметровНоменклатуры,
			СтруктураДанныеПоставщика.КатегорияНоменклатуры,
			ПравилоПолногоНаименования,,
			Истина);
	КонецЕсли;
	
	ШаблоныНаименований.ДобавитьРеквизитыИЭлементыНаФорму(
		ЭтотОбъект,
		Элементы.ГруппаРеквизитыНоменклатуры,
		МассивПараметровНоменклатуры);
	
	Для каждого Строка Из ПараметрыПравилаИменования Цикл
		Строка.ДляНоменклатуры = Истина;
	КонецЦикла;
	
	// Характеристики
	Если ЗначениеЗаполнено(ПравилоХарактеристики) Тогда
		СоздаватьХарактеристику = Истина;
	Иначе
		СоздаватьХарактеристику = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиСозданияХарактеристик.Видимость = СоздаватьХарактеристику;
	
	Если СоздаватьХарактеристику Тогда
		
		МассивПараметровХарактеристик = Новый Массив;
		ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
			МассивПараметровХарактеристик,
			СтруктураДанныеПоставщика.КатегорияНоменклатуры,
			ПравилоХарактеристики,,
			Истина);
		
		Если Параметры.Свойство("ПравилоХарактеристикиДляПечати", ПравилоХарактеристикиДляПечати)
			И ЗначениеЗаполнено(ПравилоХарактеристикиДляПечати) Тогда
			ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
				МассивПараметровХарактеристик,
				СтруктураДанныеПоставщика.КатегорияНоменклатуры,
				ПравилоХарактеристикиДляПечати,,
				Истина);
		КонецЕсли;
		ШаблоныНаименований.ДобавитьРеквизитыИЭлементыНаФорму(
			ЭтотОбъект,
			Элементы.ГруппаРеквизитыХарактеристики,
			МассивПараметровХарактеристик);
		
		РеквизитыХарактеристики.Загрузить(ПравилоХарактеристики.ор_РеквизитыДляЗаполнения.Выгрузить());
		ДополнительныеРеквизитыХарактеристики.Загрузить(ПравилоХарактеристики.ор_ДополнительныеРеквизиты.Выгрузить());
		Если ЗначениеЗаполнено(ПравилоХарактеристикиДляПечати) Тогда
			Для Каждого Строка Из ПравилоХарактеристикиДляПечати.ор_РеквизитыДляЗаполнения Цикл
				НайденныеСтроки = РеквизитыХарактеристики.НайтиСтроки(Новый Структура("Реквизит", Строка.Реквизит));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = РеквизитыХарактеристики.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				Иначе
					ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Строка);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Строка Из ПравилоХарактеристикиДляПечати.ор_ДополнительныеРеквизиты Цикл
				НайденныеСтроки = ДополнительныеРеквизитыХарактеристики.НайтиСтроки(Новый Структура("Реквизит", Строка.Реквизит));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ДополнительныеРеквизитыХарактеристики.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				Иначе
					ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Строка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// При добавлении параметров характеристик затераются параметры номенклатуры 
		Для каждого СтрокаПараметр Из МассивПараметровНоменклатуры Цикл
			НоваяСтрока = ПараметрыПравилаИменования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаПараметр);
			НоваяСтрока.ДляНоменклатуры = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ПараметрыПравилаИменования.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("ДанныеПараметраСтрокой,ИмяПараметра,ИмяЭлемента,ПутьКДанным",
		СтруктураДанныеПоставщика.КатегорияНоменклатуры,
		"Категория номенклатуры",
		"КатегорияНоменклатуры",
		"КатегорияНоменклатуры"));
	
	ОткорректироватьРеквизитыНоменклатуры();
	СоздатьРеквизитыСправочников();
	ДобавитьДополнительныеРеквизитыСправочников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьСправочник(Команда)
	
	Отказ = Ложь;
	ПроверитьЗаполнениеПолей(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СписокНоменклатуры = НайтиНомеклатуруНаСервере();
	
	Если СписокНоменклатуры.Количество() > 0 Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("СписокНоменклатуры", СписокНоменклатуры);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСоздаватьНоменклатуруЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Уже существует номенклатура с такими же параметрами.
			|Использовать её?'"),
			РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	КонецЕсли;
	
	СоздатьСправочникЗавершение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОткорректироватьРеквизитыНоменклатуры()
	
	НайденныеСтроки = ПараметрыПравилаИменования.НайтиСтроки(Новый Структура("ИмяПараметра", "ор_НаименованиеПоставщика"));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для Каждого Элемент Из НайденныеСтроки Цикл
			Элемент.ДанныеПараметраСтрокой = СтруктураДанныеПоставщика.НаименованиеПоставщика;
			ЭтотОбъект[Элемент.ПутьКданным] = СтруктураДанныеПоставщика.НаименованиеПоставщика;
		КонецЦикла;
	КонецЕсли;
	
	// Номенклатура
	// Удаление реквизитов правил из реквизитов номенклатуры
	Для каждого Реквизит Из ПараметрыПравилаИменования Цикл
		//НайденнаяСтрока = РеквизитыНоменклатуры.НайтиСтроки(Новый Структура("Реквизит,Представление",Реквизит.ПутьКДанным,Реквизит.ИмяПараметра));
		НайденнаяСтрока = РеквизитыНоменклатуры.НайтиСтроки(Новый Структура("Представление",Реквизит.ИмяПараметра));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			Реквизит.ДанныеПараметраСтрокой = НайденнаяСтрока[0].Значение;
			ЭтотОбъект[Реквизит.ПутьКДанным] = НайденнаяСтрока[0].Значение;
			РеквизитыНоменклатуры.Удалить(НайденнаяСтрока[0]);
		КонецЕсли;
		
		//НайденнаяСтрока = ДополнительныеРеквизитыНоменклатуры.НайтиСтроки(Новый Структура("Реквизит,Представление",Реквизит.ПутьКДанным,Реквизит.ИмяПараметра));
		НайденнаяСтрока = ДополнительныеРеквизитыНоменклатуры.НайтиСтроки(Новый Структура("Представление",Реквизит.ИмяПараметра));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			Реквизит.ДанныеПараметраСтрокой		= НайденнаяСтрока[0].Значение;
			ЭтотОбъект[Реквизит.ПутьКДанным]	= НайденнаяСтрока[0].Значение;
			ДополнительныеРеквизитыНоменклатуры.Удалить(НайденнаяСтрока[0]);
		КонецЕсли;
	КонецЦикла;
	
	// Характеристики
	// Удаление реквизитов правил из реквизитов номенклатуры
	Для каждого Реквизит Из ПараметрыПравилаИменования Цикл
		НайденнаяСтрока = РеквизитыХарактеристики.НайтиСтроки(Новый Структура("Представление",Реквизит.ИмяПараметра));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			Реквизит.ДанныеПараметраСтрокой = НайденнаяСтрока[0].Значение;
			ЭтотОбъект[Реквизит.ПутьКДанным] = НайденнаяСтрока[0].Значение;
			РеквизитыХарактеристики.Удалить(НайденнаяСтрока[0]);
		КонецЕсли;
		
		НайденнаяСтрока = ДополнительныеРеквизитыХарактеристики.НайтиСтроки(Новый Структура("Представление",Реквизит.ИмяПараметра));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			Реквизит.ДанныеПараметраСтрокой		= НайденнаяСтрока[0].Значение;
			ЭтотОбъект[Реквизит.ПутьКДанным]	= НайденнаяСтрока[0].Значение;
			ДополнительныеРеквизитыХарактеристики.Удалить(НайденнаяСтрока[0]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыСправочников()
	
	Для Каждого ТекРеквизит Из РеквизитыНоменклатуры Цикл
		
		// Добавим реквизит
		ИмяЭлемента = "Номенклатура" + ТекРеквизит.Реквизит;
		ТипОписание = Новый ОписаниеТипов(Метаданные.Справочники.Номенклатура.Реквизиты[ТекРеквизит.Реквизит].Тип);
		Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭтотОбъект[ИмяЭлемента] = ТекРеквизит.Значение;
		
		Если Не ЗначениеЗаполнено(ТекРеквизит.Значение) Или ТипЗнч(ТекРеквизит.Значение) = Тип("Булево") Тогда
			// Если значение не заполнено, добавим поле для заполнения.
			НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаРеквизитыНоменклатуры);
			НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
			НовыйЭлемент.Заголовок   = ТекРеквизит.Представление;
			НовыйЭлемент.АвтоОтметкаНезаполненного = Метаданные.Справочники.Номенклатура.Реквизиты[ТекРеквизит.Реквизит].ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку;
		КонецЕсли;
		
	КонецЦикла;
	
	Сч=0;
	Для Каждого ТекРеквизит Из ДанныеПоставщикаНоменклатура Цикл
		
		Если ЗначениеЗаполнено(СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра]) Тогда
			Если ТекРеквизит.ЭтоДополнительныйРеквизит Тогда
				// Добавим реквизит
				ИмяЭлемента = "ДополнительныйРеквизитРегистр" + Сч;
				ТипОписание = СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра].ТипЗначения;
				Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
				ДобавляемыеРеквизиты = Новый Массив;
				ДобавляемыеРеквизиты.Добавить(Реквизит);
				ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				ЭтотОбъект[ИмяЭлемента] = СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра];
				
				// Добавим строку с описанием дополнительного реквизита в таблицу значений.
				НоваяСтрока = ДополнительныеРеквизитыНоменклатурыОписание.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекРеквизит);
				НоваяСтрока.ИмяРеквизитаНаФорме = ИмяЭлемента;
				Сч = Сч+1;
			Иначе
				// Добавим реквизит
				ИмяЭлемента = "Номенклатура" + ТекРеквизит.РеквизитСправочника;
				МестоположениеРеквизита=?(ТекРеквизит.ЭтоСтандартныйРеквизит,"СтандартныеРеквизиты", "Реквизиты");
				ТипОписание = Новый ОписаниеТипов(Метаданные.Справочники.Номенклатура[МестоположениеРеквизита][ТекРеквизит.РеквизитСправочника].Тип);
				Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
				ДобавляемыеРеквизиты = Новый Массив;
				ДобавляемыеРеквизиты.Добавить(Реквизит);
				ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				ЭтотОбъект[ИмяЭлемента] = СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра];
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если СоздаватьХарактеристику Тогда
		
		Для Каждого ТекРеквизит Из РеквизитыХарактеристики Цикл
			
			// Добавим реквизит
			ИмяЭлемента = "Характеристика" + ТекРеквизит.Реквизит;
			ТипОписание = Новый ОписаниеТипов(Метаданные.Справочники.ХарактеристикиНоменклатуры.Реквизиты[ТекРеквизит.Реквизит].Тип);
			Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(Реквизит);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			ЭтотОбъект[ИмяЭлемента] = ТекРеквизит.Значение;
			
			Если Не ЗначениеЗаполнено(ТекРеквизит.Значение) Или ТипЗнч(ТекРеквизит.Значение) = Тип("Булево") Тогда
				// Если значение не заполнено, добавим поле для заполнения.
				НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаРеквизитыХарактеристики);
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
				НовыйЭлемент.Заголовок = ТекРеквизит.Представление;
				НовыйЭлемент.АвтоОтметкаНезаполненного =
				Метаданные.Справочники.ХарактеристикиНоменклатуры.Реквизиты[ТекРеквизит.Реквизит].ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекРеквизит Из ДанныеПоставщикаХарактеристика Цикл
			
			Если ЗначениеЗаполнено(СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра]) Тогда
				Если ТекРеквизит.ЭтоДополнительныйРеквизит Тогда
					// Добавим реквизит
					ИмяЭлемента = "ДополнительныйРеквизитРегистр" + Сч;
					ТипОписание = ТипЗнч(СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра]);
					МассивТипов = Новый Массив;
					МассивТипов.Добавить(ТипОписание);
					Реквизит = Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов(МассивТипов));
					ДобавляемыеРеквизиты = Новый Массив;
					ДобавляемыеРеквизиты.Добавить(Реквизит);
					ИзменитьРеквизиты(ДобавляемыеРеквизиты);
					ЭтотОбъект[ИмяЭлемента] = СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра];
					// Добавим строку с описанием дополнительного реквизита в таблицу значений.
					НоваяСтрока = ДополнительныеРеквизитыХарактеристикиОписание.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекРеквизит);
					НоваяСтрока.ИмяРеквизитаНаФорме = ИмяЭлемента;
					НоваяСтрока.Реквизит = ТекРеквизит.РеквизитСправочника;
					Сч = Сч+1;
				Иначе
					// Добавим реквизит
					ИмяЭлемента = "Характеристика" + ТекРеквизит.РеквизитНоменклатуры;
					МестоположениеРеквизита=?(ТекРеквизит.ЭтоСтандартныйРеквизит,"СтандартныеРеквизиты", "Реквизиты");
					ТипОписание = Новый ОписаниеТипов(Метаданные.Справочники.ХарактеристикиНоменклатуры[МестоположениеРеквизита][ТекРеквизит.РеквизитСправочника].Тип);
					Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
					ДобавляемыеРеквизиты = Новый Массив;
					ДобавляемыеРеквизиты.Добавить(Реквизит);
					ИзменитьРеквизиты(ДобавляемыеРеквизиты);
					ЭтотОбъект[ИмяЭлемента] = СтруктураДанныеПоставщика[ТекРеквизит.РеквизитРегистра];
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеРеквизитыСправочников()
	
	Сч=0;
	Для Каждого ТекРеквизит Из ДополнительныеРеквизитыНоменклатуры Цикл
		
		// Добавим реквизит
		ИмяЭлемента = "ДополнительныйРеквизит" + Сч;
		ТипОписание = ТекРеквизит.Реквизит.ТипЗначения;
		Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭтотОбъект[ИмяЭлемента] = ТекРеквизит.Значение;
		
		// Добавим строку с описанием дополнительного реквизита в таблицу значений.
		НоваяСтрока = ДополнительныеРеквизитыНоменклатурыОписание.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекРеквизит);
		НоваяСтрока.ИмяРеквизитаНаФорме = ИмяЭлемента;
		
		Если Не ЗначениеЗаполнено(ТекРеквизит.Значение) Или ТипЗнч(ТекРеквизит.Значение) = Тип("Булево") Тогда
			// Если значение не заполнено, добавим поле для заполнения.
			ИмяЭлемента = "ДополнительныйРеквизит" + Сч;
			НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаДополнительныеРеквизитыНоменклатуры);      
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
			НовыйЭлемент.Заголовок = ТекРеквизит.Представление;
			НовыйЭлемент.АвтоОтметкаНезаполненного = ТекРеквизит.Реквизит.заполнятьОбязательно;
			
			// Добавим поле-родитель для отбора.
			ИмяЭлемента = "ПВХ" + Сч;
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
			Реквизит = Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов(МассивТипов));
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(Реквизит);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			ЭтотОбъект[ИмяЭлемента] = ТекРеквизит.Реквизит;
			
			НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", ИмяЭлемента);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НоваяСвязь);
			НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
			НовыйЭлемент.СвязиПараметровВыбора = НовыеСвязи;
			
		КонецЕсли;
		
		Сч = Сч+1;
	КонецЦикла;
	
	Если СоздаватьХарактеристику Тогда
		
		Для Каждого ТекРеквизит Из ДополнительныеРеквизитыХарактеристики Цикл
			
			// Добавим реквизит
			ИмяЭлемента = "ДополнительныйРеквизит" + Сч;
			ТипОписание = ТекРеквизит.Реквизит.ТипЗначения;
			Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипОписание);
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(Реквизит);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			ЭтотОбъект[ИмяЭлемента] = ТекРеквизит.Значение;
			
			// Добавим строку с описанием дополнительного реквизита в таблицу значений.
			НоваяСтрока = ДополнительныеРеквизитыХарактеристикиОписание.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекРеквизит);
			НоваяСтрока.ИмяРеквизитаНаФорме = ИмяЭлемента;
			
			Если Не ЗначениеЗаполнено(ТекРеквизит.Значение) Или ТипЗнч(ТекРеквизит.Значение) = Тип("Булево") Тогда
				// Если значение не заполнено, добавим поле для заполнения.
				ИмяЭлемента = "ДополнительныйРеквизит" + Сч;
				НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаДополнительныеРеквизитыХарактеристики);      
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
				НовыйЭлемент.Заголовок = ТекРеквизит.Представление;
				НовыйЭлемент.АвтоОтметкаНезаполненного = ТекРеквизит.Реквизит.ЗаполнятьОбязательно;
				
				// Добавим поле-родитель для отбора.
				ИмяЭлемента = "ПВХ" + Сч;
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
				Реквизит = Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов(МассивТипов));
				ДобавляемыеРеквизиты = Новый Массив;
				ДобавляемыеРеквизиты.Добавить(Реквизит);
				ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				ЭтотОбъект[ИмяЭлемента] = ТекРеквизит.Реквизит;
				
				НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", ИмяЭлемента);
				НовыйМассив = Новый Массив();
				НовыйМассив.Добавить(НоваяСвязь);
				НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
				НовыйЭлемент.СвязиПараметровВыбора = НовыеСвязи;
			КонецЕсли;
			
			Сч = Сч+1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьСправочникНаСервере(Номенклатура, ТекстСообщения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Номенклатура = Неопределено Тогда
		СозданнаяНоменклатура = СоздатьНомеклатуруНаСервере(ТекстСообщения);
		Если СозданнаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		СозданнаяНоменклатура = Номенклатура;
	КонецЕсли;
	
	Если СоздаватьХарактеристику Тогда
		
		НачатьТранзакцию();
		
		НовыйЭлементХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		
		Для Каждого ТекРеквизит Из РеквизитыХарактеристики Цикл
			ИмяРеквизита = ТекРеквизит.Реквизит;
			НовыйЭлементХарактеристика[ИмяРеквизита] = ЭтотОбъект["Характеристика"+ИмяРеквизита];
		КонецЦикла;
		Для Каждого ТекРеквизит Из ДанныеПоставщикаХарактеристика Цикл
			Если НЕ ТекРеквизит.ЭтоДополнительныйРеквизит Тогда
				ИмяРеквизита = ТекРеквизит.РеквизитРегистра;
				НовыйЭлементХарактеристика[ТекРеквизит.РеквизитСправочника] = ЭтотОбъект["Характеристика"+ ИмяРеквизита];
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекРеквизит Из ПараметрыПравилаИменования Цикл
			ИмяРеквизита = ТекРеквизит.ПутьКДанным;
			Если ИмяРеквизита = "КатегорияНоменклатуры" ИЛИ ТекРеквизит.ДляНоменклатуры Тогда 
				Продолжить;
			КонецЕсли;
			
			Если НЕ ТекРеквизит.ЭтоДопСведение И НЕ ТекРеквизит.ЭтоДопРеквизит Тогда
				ИмяРеквизитаСправочника = Прав(ИмяРеквизита,СтрДлина(ИмяРеквизита)-15);
				НовыйЭлементХарактеристика[ИмяРеквизитаСправочника] = ЭтотОбъект[ИмяРеквизита];
			ИначеЕсли ТекРеквизит.ЭтоДопРеквизит Тогда
				НоваяСтрока = НовыйЭлементХарактеристика.ДополнительныеРеквизиты.Добавить();
				НоваяСтрока.Свойство = ТекРеквизит.Свойство;
				НоваяСтрока.Значение = ЭтотОбъект[ТекРеквизит.ПутьКДанным];
			КонецЕсли;
		КонецЦикла;
		
		// Добавим дополнительные реквизиты номенклатуры
		СоздатьДополнительныеРеквизитыСправочника("ДополнительныеРеквизитыХарактеристикиОписание", НовыйЭлементХарактеристика);
		
		СписокПараметров = ПолучитьСписокПараметровДляШаблона(Истина);
		НовыйЭлементХарактеристика.Наименование = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
			СписокПараметров,
			ПравилоХарактеристики.ШаблонДляФормирования);
		Если ЗначениеЗаполнено(ПравилоХарактеристикиДляПечати) Тогда
			НовыйЭлементХарактеристика.НаименованиеДляПечати = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
				СписокПараметров,
				ПравилоХарактеристикиДляПечати.ШаблонДляФормирования);
		КонецЕсли;
		Если ПустаяСтрока(НовыйЭлементХарактеристика.НаименованиеДляПечати) Тогда
			НовыйЭлементХарактеристика.НаименованиеДляПечати = НовыйЭлементХарактеристика.Наименование;
		КонецЕсли;
		
		НовыйЭлементХарактеристика.Владелец = ?(ГдеСоздаемХарактеристики = 1, СозданнаяНоменклатура.КатегорияНоменклатуры, СозданнаяНоменклатура);
		
		Попытка
			НовыйЭлементХарактеристика.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ТекстСообщения = "Не удалось записать элемент справочника" + ОписаниеОшибки();
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
		
		СозданнаяХарактеристика = НовыйЭлементХарактеристика.Ссылка;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номенклатура", СозданнаяНоменклатура);
	СтруктураПараметров.Вставить("ТипНоменклатуры", СозданнаяНоменклатура.ТипНоменклатуры);
	СтруктураПараметров.Вставить("Характеристика",  СозданнаяХарактеристика);
	СтруктураПараметров.Вставить("ХарактеристикиИспользуются",  СозданнаяНоменклатура.КатегорияНоменклатуры.ИспользоватьХарактеристики);
	СтруктураПараметров.Вставить("ДоговорКонтрагента", СозданнаяНоменклатура.Договор);

	Возврат Истина;
	
КонецФункции

&НаСервере
Функция НайтиНомеклатуруНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование";
	
	Запрос = Новый Запрос;
	
	СписокОтборов = Новый Массив;
	СписокОтборов.Добавить("Наименование");
	СписокОтборов.Добавить("НаименованиеПолное");
	
	Для Каждого ТекРеквизит Из РеквизитыНоменклатуры Цикл
		
		ИмяРеквизита = ТекРеквизит.Реквизит;
		Если СписокОтборов.Найти(ИмяРеквизита) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СписокОтборов.Добавить(ИмяРеквизита);
		
		ТекстЗапроса = СтрШаблон(
			"%1
			|	И Номенклатура.%2 = &%2",
			ТекстЗапроса,
			ИмяРеквизита);
		Запрос.УстановитьПараметр(ИмяРеквизита, ЭтотОбъект["Номенклатура" + ИмяРеквизита]);
		
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из ДанныеПоставщикаНоменклатура Цикл
		Если ТекРеквизит.ЭтоДополнительныйРеквизит Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ТекРеквизит.РеквизитСправочника;
		Если СписокОтборов.Найти(ИмяРеквизита) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СписокОтборов.Добавить(ИмяРеквизита);
		
		ТекстЗапроса = СтрШаблон(
			"%1
			|	И Номенклатура.%2 = &%2",
			ТекстЗапроса,
			ИмяРеквизита);
		Запрос.УстановитьПараметр(ИмяРеквизита, ЭтотОбъект["Номенклатура" + ИмяРеквизита]);
		
	КонецЦикла;
	
	// В таблице ПараметрыПравилаИменования лежат реквизиты номенклатуры и характеристики - отличительная особеность флаг "ДляНоменклатуры" 
	Для Каждого ТекРеквизит Из ПараметрыПравилаИменования Цикл
		
		ИмяРеквизита = ТекРеквизит.ПутьКДанным;
		Если ИмяРеквизита = "КатегорияНоменклатуры"
			Или Не ТекРеквизит.ДляНоменклатуры
			Или (ТекРеквизит.ЭтоДопСведение Или ТекРеквизит.ЭтоДопРеквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизитаСправочника = Прав(ИмяРеквизита,СтрДлина(ИмяРеквизита)-13);
		Если СписокОтборов.Найти(ИмяРеквизитаСправочника) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СписокОтборов.Добавить(ИмяРеквизитаСправочника);
		
		ТекстЗапроса = СтрШаблон(
			"%1
			|	И Номенклатура.%2 = &%2",
			ТекстЗапроса,
			ИмяРеквизитаСправочника);
		Запрос.УстановитьПараметр(ИмяРеквизитаСправочника, ЭтотОбъект[ИмяРеквизита]);
		
		ТекРеквизит.ДанныеПараметраСтрокой = Формат(ЭтотОбъект[ИмяРеквизита],"ДЛФ=Д; БЛ='Ложь'; БИ='" + ТекРеквизит.ИмяПараметра + "'");
		
	КонецЦикла;
	
	СписокПараметров = ПолучитьСписокПараметровДляШаблона();
	Запрос.УстановитьПараметр("Наименование", ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
		СписокПараметров,
		ПравилоКраткогоНаименования.ШаблонДляФормирования));
	
	// Корректируем значения которые могут браться из Категории номенклатуры.
	ТекКатегорияНоменклатуры = Неопределено;
	Если Запрос.Параметры.Свойство("КатегорияНоменклатуры", ТекКатегорияНоменклатуры) Тогда
		ЗначенияПоУмолчанию = ПолучитьЗначенияПоУмолчаниюДляКатегорииНоменклатуры(ТекКатегорияНоменклатуры);
		Для Каждого ТекРеквизит Из ЗначенияПоУмолчанию Цикл
			ИмяРеквизита = ТекРеквизит.Ключ;
			Если Запрос.Параметры.Свойство(ИмяРеквизита)
				И Не ЗначениеЗаполнено(Запрос.Параметры[ИмяРеквизита]) Тогда
				Запрос.Параметры[ИмяРеквизита] = ТекРеквизит.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	СписокНоменклатуры = Новый Массив;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокНоменклатуры.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
	
КонецФункции

&НаСервере
Функция СоздатьНомеклатуруНаСервере(ТекстСообщения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
	
	НовыйЭлемент.КатегорияНоменклатуры = СтруктураДанныеПоставщика.КатегорияНоменклатуры;
	ЗаполнитьЗначенияНоменклатурыПоУмолчанию(НовыйЭлемент);
	КатегорииНоменклатурыСервер.ЗаполнитьСвойстваНоменклатурыПоКатегории(НовыйЭлемент, Истина);
	
	НовыйЭлемент.ИспользоватьХарактеристики = СоздаватьХарактеристику;
	
	Для Каждого ТекРеквизит Из РеквизитыНоменклатуры Цикл
		ИмяРеквизита = ТекРеквизит.Реквизит;
		НовыйЭлемент[ИмяРеквизита] = ЭтотОбъект["Номенклатура"+ ИмяРеквизита];
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из ДанныеПоставщикаНоменклатура Цикл
		Если НЕ ТекРеквизит.ЭтоДополнительныйРеквизит Тогда
			ИмяРеквизита = ТекРеквизит.РеквизитСправочника;
			НовыйЭлемент[ТекРеквизит.РеквизитСправочника] = ЭтотОбъект["Номенклатура"+ ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	// В таблице ПараметрыПравилаИменования лежат реквизиты номенклатуры и характеристики - отличительная особеность флаг "ДляНоменклатуры" 
	Для Каждого ТекРеквизит Из ПараметрыПравилаИменования Цикл
		ИмяРеквизита = ТекРеквизит.ПутьКДанным;
		Если ИмяРеквизита = "КатегорияНоменклатуры" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТекРеквизит.ДляНоменклатуры Тогда
			Если НЕ ТекРеквизит.ЭтоДопСведение И НЕ ТекРеквизит.ЭтоДопРеквизит Тогда
				ИмяРеквизитаСправочника = Прав(ИмяРеквизита,СтрДлина(ИмяРеквизита)-13);
				НовыйЭлемент[ИмяРеквизитаСправочника] = ЭтотОбъект[ИмяРеквизита];
			ИначеЕсли ТекРеквизит.ЭтоДопРеквизит Тогда
				НоваяСтрока = НовыйЭлемент.ДополнительныеРеквизиты.Добавить();
				НоваяСтрока.Свойство = ТекРеквизит.Свойство;
				НоваяСтрока.Значение = ЭтотОбъект[ТекРеквизит.ПутьКДанным];
			КонецЕсли;
		КонецЕсли;
		ТекРеквизит.ДанныеПараметраСтрокой = Формат(ЭтотОбъект[ИмяРеквизита],"ДЛФ=Д; БЛ='Ложь'; БИ='" + ТекРеквизит.ИмяПараметра + "'");
	КонецЦикла;
	
	КлючВидовПродукции = Неопределено;
	ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(НовыйЭлемент.КатегорияНоменклатуры)[НовыйЭлемент.КатегорияНоменклатуры];
	Если Не ОписаниеНоменклатуры = Неопределено Тогда
		КлючВидовПродукции = ОписаниеНоменклатуры.КлючВидовПродукции;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КлючВидовПродукции) Тогда
		НовыйЭлемент.ПризнакПредметаРасчета = РозничныеПродажиСервер.ПолучитьОжидаемыйПризнакПредметаРасчета(
			НовыйЭлемент.ТипНоменклатуры,
			КлючВидовПродукции,
			НовыйЭлемент.ВидМаркировки,
			НовыйЭлемент.ПодакцизныйТовар,
			НовыйЭлемент.ПродаетсяВРозлив);
		
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияВЕТИС(КлючВидовПродукции)
			И Не НовыйЭлемент.ПодконтрольнаяПродукцияВЕТИС Тогда
			НовыйЭлемент.ПодконтрольнаяПродукцияВЕТИС = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Добавим дополнительные реквизиты номенклатуры
	СоздатьДополнительныеРеквизитыСправочника("ДополнительныеРеквизитыНоменклатурыОписание", НовыйЭлемент);
	
	СписокПараметров = ПолучитьСписокПараметровДляШаблона();
	НовыйЭлемент.Наименование = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
		СписокПараметров,
		ПравилоКраткогоНаименования.ШаблонДляФормирования);
	
	НовыйЭлемент.НаименованиеПолное = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
		СписокПараметров,
		ПравилоПолногоНаименования.ШаблонДляФормирования);
	
	Если ПустаяСтрока(НовыйЭлемент.НаименованиеПолное) Тогда
		НовыйЭлемент.НаименованиеПолное = НовыйЭлемент.Наименование;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		НовыйЭлемент.Записать();
		// ИнтеграцияГосИС
		// Если произойдет ошибка при создании настройки маркируемой продукции,
		// то не уходим в отказ, так как номенклатура уже создана,
		// а сообщение об ошибке выводиться во вложенных функциях.
		ЕстьОшибки = Ложь;
		СобытияФормИСУНФ.ПриЗаписиНаСервере(ЭтотОбъект, НовыйЭлемент, ЕстьОшибки);
		// Конец ИнтеграцияГосИС
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось записать элемент справочника. %1'"),
									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Процедура СоздатьДополнительныеРеквизитыСправочника(ИмяТЧ, СправочникОбъект)
	
	Для Каждого ТекРеквизит Из ЭтотОбъект[ИмяТЧ] Цикл
		
		Если Не ПроверитьЗаполнениеРеквизита(ТекРеквизит.Значение) Тогда
			ТекРеквизит.Значение = ЭтотОбъект[ТекРеквизит.ИмяРеквизитаНаФорме];
		КонецЕсли;
		
		СтрокаРеквизита = СправочникОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаРеквизита.Свойство = ТекРеквизит.Реквизит;
		СтрокаРеквизита.Значение = ТекРеквизит.Значение;
		
		// Поддержка строк неограниченной длины.
		ИспользоватьНеограниченнуюСтроку = УправлениеСвойствамиСлужебный.ИспользоватьНеограниченнуюСтроку(
		ТекРеквизит.Реквизит.ТипЗначения, ТекРеквизит.Реквизит.МногострочноеПолеВвода);
		
		Если ИспользоватьНеограниченнуюСтроку Тогда
			СтрокаРеквизита.ТекстоваяСтрока = ТекРеквизит.Значение;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеПолей(Отказ)
	Для Каждого ТекЭлемент Из Элементы Цикл
		
		Если ТипЗнч(ТекЭлемент) <> Тип("ПолеФормы")
			Или ТекЭлемент.Имя = "ГдеСоздаемХарактеристики" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлемент.ОтметкаНезаполненного = Истина тогда
			ИмяРеквизита = ПолучитьПутьКДанным(ТекЭлемент.Имя);
			Если Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизита """ + ТекЭлемент.Заголовок + """" ,,
				ТекЭлемент.Имя,ПолучитьПутьКДанным(ТекЭлемент.Имя),Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПолучитьПутьКДанным(ИмяПолеФормы)
	Возврат Элементы[ИмяПолеФормы].ПутьКДанным;
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизита(Реквизит)
	
	Если ТипЗнч(Реквизит) = Тип("Дата") Тогда
		Возврат Реквизит = Дата(1,1,1);
	Иначе 
		Возврат ЗначениеЗаполнено(Реквизит); 
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СоздатьСоответсвиеРеквизитовШаблонов()
	
	// Хранит соотвеетствие рекизитов номенклатуры и реквизитов регистра номенлкатуры поставщиков 
	СтрокаДанных = ДанныеПоставщикаНоменклатура.Добавить();
	СтрокаДанных.РеквизитРегистра          = "КатегорияНоменклатуры";
	СтрокаДанных.РеквизитСправочника       = "КатегорияНоменклатуры";
	СтрокаДанных.ЭтоСтандартныйРеквизит    = Ложь;
	СтрокаДанных.ЭтоДополнительныйРеквизит = Ложь;
	
	СтрокаДанных = ДанныеПоставщикаНоменклатура.Добавить();
	СтрокаДанных.РеквизитРегистра          = "НаименованиеПоставщика";
	СтрокаДанных.РеквизитСправочника       = "Наименование";
	СтрокаДанных.ЭтоСтандартныйРеквизит    = Истина;
	СтрокаДанных.ЭтоДополнительныйРеквизит = Ложь;
	
	// + ОР
	// Хранит соотвеетствие рекизитов характеристики и реквизитов регистра номенлкатуры поставщиков 
	// - ОР
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСоздаватьНоменклатуруЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.СписокНоменклатуры.Количество() = 1 Тогда
			СоздатьСправочникЗавершение(ДополнительныеПараметры.СписокНоменклатуры[0]);
		Иначе
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборНоменклатурыЗавершение", ЭтотОбъект);
			
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.ЗагрузитьЗначения(ДополнительныеПараметры.СписокНоменклатуры);
			ПоказатьВыборИзСписка(
				ОписаниеОповещения,
				СписокЗначений);
			
		КонецЕсли;
	Иначе
		СоздатьСправочникЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНоменклатурыЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьСправочникЗавершение(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСправочникЗавершение(Номенклатура = Неопределено)
	
	ТекстСообщения = "";
	Если СоздатьСправочникНаСервере(Номенклатура, ТекстСообщения) Тогда
		Закрыть(СтруктураПараметров);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияПоУмолчаниюДляКатегорииНоменклатуры(КатегорияНоменклатуры)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КатегорииНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КатегорииНоменклатуры.ВидСтавкиНДС КАК ВидСтавкиНДС,
	|	КатегорииНоменклатуры.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	КатегорииНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	КатегорииНоменклатуры.Производитель КАК Производитель
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	КатегорииНоменклатуры.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", КатегорияНоменклатуры);
	Результат = Запрос.Выполнить();
	
	СтруктураПараметров = Новый Структура;
	Для Каждого ТекущаяКолонка Из Результат.Колонки Цикл
		СтруктураПараметров.Вставить(ТекущаяКолонка.Имя, Неопределено);
	КонецЦикла;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ВидСтавкиНДС) Тогда
		СтруктураПараметров.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ЕдиницаИзмерения) Тогда
		СтруктураПараметров.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("796");
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьЗначенияНоменклатурыПоУмолчанию(Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура.КатегорияНоменклатуры) Тогда
		Номенклатура.ВидСтавкиНДС = Номенклатура.КатегорияНоменклатуры.ВидСтавкиНДС;
		Номенклатура.ТипНоменклатуры = Номенклатура.КатегорияНоменклатуры.ТипНоменклатурыПоУмолчанию;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура.ВидСтавкиНДС) Тогда
		Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура.ТипНоменклатуры) Тогда
		Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура.ЕдиницаИзмерения) Тогда
		Номенклатура.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
	КонецЕсли;
	
	Номенклатура.СпособПополнения = Перечисления.СпособыПополненияЗапасов.Закупка;
	Номенклатура.МетодОценки      = Перечисления.МетодОценкиЗапасов.ПоСредней;
	Номенклатура.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	
	Номенклатура.СчетУчетаЗапасов = Справочники.Номенклатура.СчетУчетаЗапасов();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство") Тогда
		Номенклатура.СчетУчетаЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.НезавершенноеПроизводство");
	Иначе
		Номенклатура.СчетУчетаЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.КоммерческиеРасходы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметровДляШаблона(ДляХарактеристики = Ложь)
	
	СписокПараметров = Новый СписокЗначений;
	
	Для Каждого ТекущиеДанные Из ПараметрыПравилаИменования Цикл
		Если Не ДляХарактеристики И ТекущиеДанные.ДляНоменклатуры
			Или ДляХарактеристики И Не ТекущиеДанные.ДляНоменклатуры Тогда
			СписокПараметров.Добавить(ТекущиеДанные.ИмяПараметра, ТекущиеДанные.ДанныеПараметраСтрокой);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПараметров;
	
КонецФункции

#КонецОбласти

