
#Область ПрограммныйИнтерфейс

// Проверка, подлежит ли продукция обязательной онлайн-проверке перед розничной продажей.
// 
// Возвращаемое значение:
//  Булево - Продукция подлежит обязательной онлайн проверке перед розничной продажей.
Функция ИспользуетсяОбязательнаяОнлайнПроверкаПередРозничнойПродажей() Экспорт
	
	ПродукцияПодлежитПроверке = Ложь;
	
	Если Не ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		Возврат ПродукцияПодлежитПроверке;
	КонецЕсли;
	
	ПродукцияПодлежитПроверке = ТекущаяДатаСеанса() >= ор_ИнтеграцияМДЛП.ПолучитьДатуНачалаРазрешительногоРежима();
	
	Возврат ПродукцияПодлежитПроверке;
	
КонецФункции

// Получить дату начала разрешительного режима МДЛП.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаРазрешительногоРежима() Экспорт
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьДатуНачалаРазрешительногоРежима();
	
КонецФункции

// Получить дату начала работы с локальным модулем разрешительного режима МДЛП.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаОфлайнРазрешительногоРежима() Экспорт
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьДатуНачалаОфлайнРазрешительногоРежима();
	
КонецФункции

// Получить дату начала работы разрешительного режима МДЛП с помощью ТС ПИоТ.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаДействияТСПИоТ() Экспорт
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьДатуНачалаДействияТСПИоТ();
	
КонецФункции

// Получить признак ведения учета МДЛП.
// 
// Возвращаемое значение:
//   - Булево.
//
Функция ПолучитьПризнакВеденияУчетаМаркировки() Экспорт
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки();
	
КонецФункции

// Функция определяет, включён ли режим проверки кодов маркировки (КМ) при сканировании на контрольно‑кассовой технике (ККТ).
// 
// Возвращаемое значение:
//   - Булево - результат функции.
//
Функция РежимПроверкиКМПриСканировании() Экспорт
	
	Возврат ор_ИнтеграцияМДЛП.ПолучитьРежимКонтроляКМНаККТ() = 0;
	
КонецФункции

#КонецОбласти