
#Область ОписаниеПеременных

&НаКлиенте
Перем мСтраницы; // Соответствие страниц и и их номеров.

&НаКлиенте
Перем СтрокаНастройкиЗагрузкиНоменклатуры; // Строка настройки загрузки номенклатуры.

&НаКлиенте
Перем НастройкиЗагрузкиНоменклатурыИскатьПо; // Значение реквизита "ИскатьПо" строки настройки загрузки номенклатуры.

&НаКлиенте
Перем ИзмененаРучнаяНумерацияКолонок;

&НаКлиенте
Перем РазвернутТабличныйДокумент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если НЕ Параметры.Свойство("РежимЗагрузки") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
	Объект.РучнаяНумерацияКолонокТабличногоДокумента = Параметры.РучнаяНумерацияКолонокТабличногоДокумента;
	Объект.РежимЗагрузки                             = Параметры.РежимЗагрузки;
	
	Если Параметры.Свойство("ТабличнаяЧастьИсточника") Тогда
		Объект.ТабличнаяЧастьИсточника = Параметры.ТабличнаяЧастьИсточника;
		Объект.СсылкаИсточника         = Параметры.СсылкаИсточника;
		Контрагент = Параметры.Контрагент;
	ИначеЕсли Параметры.Свойство("ИмяВидаРегистра") Тогда
		Объект.ИмяВидаРегистра = Параметры.ИмяВидаРегистра;
	КонецЕсли;
	
	мТекущийНомерСтраницы = 0;
	
	// + ОР РежимВыбораИзСписка
	Элементы.КодировкаЗагрузка.КнопкаВыбора = Истина;
	// - ОР РежимВыбораИзСписка
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если НЕ ВебКлиент Тогда
		
		// Инициализация переменных управления страницами и кнопками перехода
		мСтраницы = Новый Соответствие;
		мСтраницы.Вставить(0, Элементы.СтраницаВыборНастройки);
		мСтраницы.Вставить(1, Элементы.СтраницаИсточникДанных);
		мСтраницы.Вставить(2, Элементы.СтраницаСоответствияНоменклатуры);
		мСтраницы.Вставить(3, Элементы.СтраницаРезультат);
		мСтраницы.Вставить(4, Элементы.СтраницаХодЗагрузки);
		
		ПодготовитьРезультатРаботы();
		
	#Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Загрузка данных из внешних файлов не поддерживается в веб-клиенте.'"));
		Отказ = ИСТИНА;
		Возврат;
		
	#КонецЕсли
	
	ИзмененаРучнаяНумерацияКолонок = Ложь;
	РазвернутТабличныйДокумент = Ложь;
	ОтображениеНастроекЗагрузки = Ложь;
	УстановитьВидимостьНастроекЗагрузки();
	
	Элементы.флПоискПоПрайсуПоставщика.Видимость 										= ПустаяСтрока(Объект.ИмяСправочника) И ПустаяСтрока(Объект.ИмяВидаРегистра);
	Элементы.ЗапретСозданияНовыхЭлементов.Видимость 									= Не ПустаяСтрока(Объект.ИмяСправочника);
	Элементы.ЗапретОбновленияСуществующихЭлементов.Видимость 							= Не ПустаяСтрока(Объект.ИмяСправочника);
	Элементы.ТаблицаЗагружаемыхРеквизитовДополнительныеПараметрыЗагрузки.Доступность 	= ПустаяСтрока(Объект.ИмяСправочника) И ПустаяСтрока(Объект.ИмяВидаРегистра);
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "НачалоВыбора" поля формы "ФайлДанных"
//
&НаКлиенте
Процедура ФайлДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДанных;
	ДиалогВыбораФайла.Заголовок = "Выбрать источник данных";
	ДиалогВыбораФайла.Фильтр = "Все форматы (*.dbf;*.xls;*.xlsx;*.txt;*.mxl;*.mdb;*.sst;*.mmo;*.xml)|*.dbf;*.xls;*.xlsx;*.txt;*.mxl;*.mdb;*.sst;*.mmo;*.xml|dBase III (*.dbf)|*.dbf|Лист Excel (*.xls)|*.xls|Лист Excel 2007 (*.xlsx)|*.xlsx|Бинарная рабочая книга Excel (*.xlsb)|*.xlsb|Лист Excel с поддержкой макросов (*.xlsm)|*.xlsm|Текстовый документ (*.txt)|*.txt|Табличный документ (*.mxl)|*.mxl|Microsoft Access(*.mdb)|*.mdb|Формат sst (*.sst)|*.sst|Формат mmo (*.mmo)|*.mmo|Формат xml (*.xml)|*.xml |Формат OpenOffice (*.ods)|*.ods|";
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДанных = ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля формы "НастройкаЗагрузки"
//
&НаКлиенте
Процедура НастройкаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = СформироватьСтруктуруОтбораДляВыбораНастройки();
	
	ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ФормаВыбора", СтруктураПараметров, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик события "СохранитьСоответствияВПрайсЛистеПоставщикаПриИзменении"
//
&НаКлиенте
Процедура СохранитьСоответствияВПрайсЛистеПоставщикаПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ПрайсЛистКонтрагента".
//
&НаКлиенте
Процедура ПрайсЛистКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбораПрайса = ПолучитьФорму("Справочник.ор_ПрайсЛистыПоставщиков.ФормаВыбора");
	УправлениеНебольшойФирмойКлиент.УстановитьЭлементОтбораСписка(
		ФормаВыбораПрайса.Список,
		"Владелец",
		Контрагент,
		ВидСравненияКомпоновкиДанных.Равно);
		
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.УстановитьОтборПрайсаПоМониторингу(ФормаВыбораПрайса.Список);
	
	ФормаВыбораПрайса.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПрайсЛистКонтрагентаОткрытьФормуЗавершение", ЭтотОбъект);
	
	// Выбираем прайс-лист контрагента
	ФормаВыбораПрайса.Открыть();
	
КонецПроцедуры

// Процедура - обработчик события "ПриСменеСтраницы" элемента "ГруппаСтраницыНастройкиЗагрузки"
//
&НаКлиенте
Процедура ГруппаСтраницыНастройкиЗагрузкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЗаполнитьМассивКнопок();
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	Иначе
		ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	КонецЕсли;
	
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриАктивизацииОбласти" поля "ТабличныйДокумент"
//
&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	Если Объект.ТабличныйДокумент.ТекущаяОбласть <> Неопределено Тогда
		НомерКолонки = Объект.ТабличныйДокумент.ТекущаяОбласть.Лево;
	Иначе
		НомерКолонки = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерКолонки) Тогда
		РасставитьПометкиНаКнопках(НомерКолонки);
	КонецЕсли;
    ПодсветитьВыбраннуюКолонку(Неопределено);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистКонтрагентаОчистка(Элемент, СтандартнаяОбработка)
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистКонтрагентаПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоответствиеНоменклатуры

// Процедура - обработчик события "ПриИзменении" реквизита "Загружать" таблицы формы "СоответствиеНоменклатуры"
//
&НаКлиенте
Процедура СоответствиеНоменклатурыЗагружатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И ТекущиеДанные.Загружать Тогда
		ТекущиеДанные.Загружать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" реквизита "Номенклатура" таблицы формы "СоответствиеНоменклатуры"
//
&НаКлиенте
Процедура СоответствиеНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И (ТекущиеДанные.Загружать) Тогда
		ТекущиеДанные.Загружать = Ложь
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И (НЕ ТекущиеДанные.Загружать) Тогда
		ТекущиеДанные.Загружать = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаЗагружаемыхРеквизитов

// Обработчик события "ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитов.Индекс(Элемент.ТекущиеДанные);
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элемент.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		//СписокВыбора = ЗаполнитьСпискиВыбора(Элемент.ТекущаяСтрока, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		СписокВыбора = ЗаполнитьСпискиВыбора(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
		Элемент.ТекущийЭлемент.ТолькоПросмотр = СписокВыбора.Количество() = 0 ИЛИ НЕ РежимЗагрузкиИскать;
	КонецЕсли;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры

// Обработчик события "ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбора".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовВыражениеОткрытьФормуЗавершение", ЭтотОбъект);
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещенияОВыборе, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТаблицаЗагружаемыхРеквизитовНомерКолонки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовНомерКолонкиПриИзменении(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "ПриАктивизацииСтроки"  табличного поля "ТаблицаЗагружаемыхРеквизитов"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПриАктивизацииСтроки(Элемент)
	
	// Проверка необходима для корректной работы при принудительном обновлении формы
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Иначе
		Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
	КонецЕсли;
	
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Обработчик события "ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиНачалоВыбора".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовРежимПоиска"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СтандартнаяОбработка = ВозможностьУстановкиРежима;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовИскатьПоПриИзменении(Элемент)
	
	СтрокаНастройкиЗагрузкиНоменклатуры=Неопределено;
	ОтборСтрок = Новый Структура("ПредставлениеРеквизита", "Номенклатура");
	СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
	Если СтрокиТаблицы.Количество() > 0 Тогда
		СтрокаНастройкиЗагрузкиНоменклатуры = СтрокиТаблицы[0];
		Если НЕ СтрокаНастройкиЗагрузкиНоменклатуры.Пометка ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.РежимЗагрузки = "Искать" И СтрокаНастройкиЗагрузкиНоменклатуры.НомерКолонки=0) Тогда
			СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаНастройкиЗагрузкиНоменклатуры=Неопределено Тогда
		Элементы.НомерКолонкиНаименованиеТабличногоДокумента.Видимость = Ложь;
	Иначе
		НастройкиЗагрузкиНоменклатурыИскатьПо = СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо;
		Элементы.НомерКолонкиНаименованиеТабличногоДокумента.Видимость = НЕ НастройкиЗагрузкиНоменклатурыИскатьПо="Наименование";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЭтоШапка = СтрНачинаетсяС(Элемент.Имя, "ТаблицаЗагружаемыхРеквизитовШапки");
	Если ЭтоШапка Тогда
		ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	КонецЕсли;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЗначениеПоУмолчанию = Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТекДанные.ДоступноеОписаниеТипов.Типы());
		ВыбранныйТип = Ждать СписокТипов.ВыбратьЭлементАсинх(НСтр("ru = 'Выбор типа данных'"));
		
		Если ВыбранныйТип <> Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ВыбранныйТип.Значение);
			ОписаниеВыбранныйТип = Новый ОписаниеТипов(МассивТипов);
			ТекДанные.ЗначениеПоУмолчанию = ОписаниеВыбранныйТип.ПривестиЗначение(ТекДанные.ЗначениеПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтоШапка И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		ФормаВыбора = ПолучитьФормуВыбораОбъектаМетаданных(ТипЗнч(ТекДанные.ЗначениеПоУмолчанию));
		Если ФормаВыбора <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ОткрытьФорму(ФормаВыбора, ПараметрыФормы, Элемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	Если СтрНачинаетсяС(Элемент.Имя, "ТаблицаЗагружаемыхРеквизитовШапки") Тогда
		ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекДанные <> Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные.ЗначениеПоУмолчанию = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		
		ДанныеВыбораРодителя = ПолучитьДанныеВыбораРодителя(ТипЗнч(ТекДанные.ЗначениеПоУмолчанию), ПараметрыПолученияДанных, СтандартнаяОбработка);
		Если Не СтандартнаяОбработка Тогда
			ДанныеВыбора = ДанныеВыбораРодителя;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРодителя(Тип, ПараметрыПолученияДанных, СтандартнаяОбработка = Истина)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Не ОбъектМетаданных.Иерархический
		Или ОбъектМетаданных.ВидИерархии <> Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(ПараметрыПолученияДанных.СтрокаПоиска) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Таблица
		|ГДЕ
		|	Таблица.ЭтоГруппа");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура", ОбъектМетаданных.Имя);
		Выборка = Запрос.Выполнить().Выбрать();
		ДанныеВыбора = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ЭтоГруппа", Истина);
		
		ПараметрыПолученияДанных.Отбор = ПараметрыОтбора;
		ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		
		ДанныеВыбора = Справочники[ОбъектМетаданных.Имя].ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаЗагружаемыхРеквизитовШапки

// Процедура - обработчик события "ПриАктивизацииСтроки" табличного поля "ТаблицаЗагружаемыхРеквизитовШапки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиПриАктивизацииСтроки(Элемент)
	
	// Проверка необходима для корректной работы при принудительном обновлении формы
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиТабличнойЧасти Тогда
		Возврат;
	КонецЕсли;
	
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "ПередНачаломИзменения" табличного поля "ТаблицаЗагружаемыхРеквизитовШапки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиПередНачаломИзменения(Элемент, Отказ)
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитовШапки.Индекс(Элемент.ТекущиеДанные);
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элемент.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоТипу" Тогда
		СписокВыбора = ЗаполнитьСпискиВыбораШапки(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
		Элемент.ТекущийЭлемент.ТолькоПросмотр = СписокВыбора.Количество() = 0 ИЛИ НЕ РежимЗагрузкиИскать;
	КонецЕсли;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовШапкиРежимЗагрузки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонкиПриИзменении(Элемент)
	
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовШапкиВыражение"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	
	ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовШапкиВыражениеОткрытьФормуЗавершение", ЭтотОбъект);
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещенияВыбора, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовШапкиРежимПоиска"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СтандартнаяОбработка = ВозможностьУстановкиРежима;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект), "Записать измененные настройки?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьКолонку"
//
&НаКлиенте
Процедура УстановитьКолонку(Команда)
	
	Если Объект.ТабличныйДокумент.ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерКолонки = Объект.ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ТекСтрока = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
		ЭтоСтраницаШапки = Истина;
	Иначе
		ТекСтрока = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
		ЭтоСтраницаШапки = Ложь;
	КонецЕсли;

	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.НомерКолонки = НомерКолонки Тогда
		Возврат;
	ИначеЕсли ТекСтрока.НомерКолонки<>0 Тогда
		ТекстВопроса = "Для текущего реквизита """+СокрЛП(ТекСтрока.ПредставлениеРеквизита)+""" уже установлен номер колонки "+ТекСтрока.НомерКолонки+". Изменить его на номер "+НомерКолонки+"?";
		ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("УстановитьКолонкуОбработкаВопроса", ЭтотОбъект, Новый Структура("ТекСтрока, НомерКолонки, ЭтоСтраницаШапки", ТекСтрока, НомерКолонки, ЭтоСтраницаШапки));
		ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	УстановитьКолонкуЗавершение(Новый Структура("ТекСтрока, НомерКолонки, ЭтоСтраницаШапки", ТекСтрока, НомерКолонки, ЭтоСтраницаШапки));
	
КонецПроцедуры

// Процедура - обработчик команды "События"
//
&НаКлиенте
Процедура События(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПередЗаписьюОбъекта",   Объект.ПередЗаписьюОбъекта);
	ПараметрыФормы.Вставить("ПриЗаписиОбъекта",      Объект.ПриЗаписиОбъекта);
	ПараметрыФормы.Вставить("ПослеДобавленияСтроки", Объект.ПослеДобавленияСтроки);
	ПараметрыФормы.Вставить("РежимЗагрузки",         Объект.РежимЗагрузки);
	
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаРедактированияСобытий",
		Новый Структура("ПараметрыФормы", ПараметрыФормы),
		ЭтотОбъект,
		,,,
		Новый ОписаниеОповещения("СобытияОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажки"
//
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажки"
//
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик команды "РучнаяНумерацияКолонокТабличногоДокумента"
//
&НаКлиенте
Процедура РучнаяНумерацияКолонокТабличногоДокумента(Команда)
	
	УстановитьРучнаяНумерацияКолонок();
	Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	
КонецПроцедуры

// Процедура - обработчик команды "ПоказатьНастройки"
//
&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	УстановитьВидимостьНастроекЗагрузки();
	ОбновитьОтображениеДанных();
	ЗаполнитьМассивКнопок();
	ПодсветитьВыбраннуюКолонку(Неопределено);
КонецПроцедуры

// Процедура - обработчик команды "ПодключаемыеКнопкиНажатие"
//
&НаКлиенте
Процедура ПодключаемыеКнопкиНажатие(Команда)
	
	НомерКолонки = Объект.ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитовШапки;
		ЭтоСтраницаШапки = Истина;
	Иначе
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитов;
		ЭтоСтраницаШапки = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТек Из ТекущаяТаблица Цикл
		Если Команда.Имя = "ПодключаемаяКнопка_"+СтрокаТек.ИмяРеквизита Тогда
			Если Элементы[Команда.Имя].Пометка Тогда
				СтрокаТек.НомерКолонки = 0;
			Иначе
				СтрокаТек.НомерКолонки = НомерКолонки;
				Если Не СтрокаТек.Пометка Тогда
					СтрокаТек.Пометка = Истина;
				КонецЕсли;
				Если НЕ Объект.РучнаяНумерацияКолонокТабличногоДокумента Тогда
					Объект.РучнаяНумерацияКолонокТабличногоДокумента = Истина;
					Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
					Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
					Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
				ИначеЕсли НЕ Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки И ЭтоСтраницаШапки Тогда
					Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки = Истина;
					Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
					Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
					Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
				КонецЕсли;
			КонецЕсли;
			РасставитьПометкиНаКнопках(НомерКолонки);
			РазобратьсяСОформлениемСтрок();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - обработчик команды "ПеренумероватьКолонки"
//
&НаКлиенте
Процедура ПеренумероватьКолонки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитов;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "Далее"
//
&НаКлиенте
Процедура КомандаДалее(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаВыборНастройки Тогда
		
		Инкремент = 1;
		
		ОписаниеОшибок = "";
		Если НЕ ЗначениеЗаполнено(ФайлДанных) Тогда
			ОписаниеОшибок = ОписаниеОшибок+"Файл данных не указан"+Символы.ПС;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
			ОписаниеОшибок = ОписаниеОшибок+"Настройка загрузки не указана"+Символы.ПС;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ОписаниеОшибок) Тогда
			ПоказатьПредупреждение(,Лев(ОписаниеОшибок,СтрДлина(ОписаниеОшибок)-СтрДлина(Символы.ПС)),,"Ошибка");
			Возврат;
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХодЗагрузки;
		Элементы.ИнформацияЗагрузки.Заголовок = НСтр("ru = 'Выполняется загрузка данных из файла.
		|Операция может занять несколько минут...'");
		УстановитьДоступностьКнопок();
		
		// Подключение настройки загрузки
		Попытка
			Если ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
				Настройки = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройкуИзХранилища(НастройкаЗагрузки);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		ЗаполнитьНастройкиКолонок(Настройки);
		
		СтрокаНастройкиЗагрузкиНоменклатуры=Неопределено;
		ОтборСтрок = Новый Структура("ПредставлениеРеквизита", "Номенклатура");
		СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
		Если СтрокиТаблицы.Количество() > 0 Тогда
			СтрокаНастройкиЗагрузкиНоменклатуры = СтрокиТаблицы[0];
			Если НЕ СтрокаНастройкиЗагрузкиНоменклатуры.Пометка ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.РежимЗагрузки = "Искать" И СтрокаНастройкиЗагрузкиНоменклатуры.НомерКолонки=0) Тогда
				СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка настройки загрузки
		ОтборСтрок = Новый Структура("Пометка", Истина);
		СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
		Если СтрокиТаблицы.Количество() = 0 Тогда
			ПоказатьПредупреждение(,"В настройке загрузки не отмечен ни один загружаемый реквизит");
			Возврат;
		КонецЕсли;
		
		// Загрузка данных из файла
		ФайлНаДиске = Новый Файл(ФайлДанных);
		Если НЕ ФайлНаДиске.Существует() ИЛИ ФайлНаДиске.ЭтоКаталог() Тогда
			ПоказатьПредупреждение(,"Файл данных не существует",,"Ошибка");
			Возврат;
		КонецЕсли;
		Если Объект.ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(Объект.ОбработкаПреобразования) Тогда
			ПоказатьПредупреждение(,"В настройке загрузки указано, что файл преобразовывается в табличный документ внешней обработкой, но обработка не указана!",,"Ошибка");
			Возврат;
		КонецЕсли;
		
		
		ОписаниеОповещенияПомещениеФайлов = Новый ОписаниеОповещения("КомандаДалееЗагрузкаФайлаЗавершение", ЭтотОбъект, Новый Структура("Инкремент, ФайлНаДиске", Инкремент, ФайлНаДиске));
		НачатьПомещениеФайлов(ОписаниеОповещенияПомещениеФайлов,, ФайлДанных, Ложь, УникальныйИдентификатор);
		Возврат;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаИсточникДанных Тогда
		
		Инкремент = 1;
		
		КоличествоЭлементов = Объект.ТабличныйДокумент.ВысотаТаблицы - Объект.ПерваяСтрокаДанныхТабличногоДокумента + 1;
		Если КоличествоЭлементов <= 0 Тогда
			ПоказатьПредупреждение(,"Нет данных для загрузки");
			Возврат;
		КонецЕсли;
		
		Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана первая строка данных табличного документа");
			Возврат;
		КонецЕсли;
		
		Если Объект.ПерваяСтрокаДанныхШапки = 0 И ЕстьОтмеченныеСтрокиВНастройкахШапки() Тогда
			ТекстСообщения = "Не указана строка для загрузки данных шапки документа!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,"ПерваяСтрокаДанныхШапки");
			Возврат;
		КонецЕсли;
		
		СтрокаНастройкиЗагрузкиНоменклатуры=Неопределено;
		ОтборСтрок = Новый Структура("ПредставлениеРеквизита", "Номенклатура");
		СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
		Если СтрокиТаблицы.Количество() > 0 Тогда
			СтрокаНастройкиЗагрузкиНоменклатуры = СтрокиТаблицы[0];
			Если НЕ СтрокаНастройкиЗагрузкиНоменклатуры.Пометка ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.РежимЗагрузки = "Искать" И СтрокаНастройкиЗагрузкиНоменклатуры.НомерКолонки=0) Тогда
				СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		// Проверим - необходимо ли показать страницу "СоответствиеНоменклатуры" 
		Если СтрокаНастройкиЗагрузкиНоменклатуры=Неопределено ИЛИ СтрокаНастройкиЗагрузкиНоменклатуры.РежимЗагрузки<>"Искать" Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХодЗагрузки;
			Элементы.ИнформацияЗагрузки.Заголовок = НСтр("ru = 'Выполняется обработка данных.
			|Операция может занять несколько минут...'");
			УстановитьДоступностьКнопок();
			ЗагрузитьДанныеВФорме(Объект.ТабличныйДокумент, ОписаниеОшибок, "");
			// выполним действия с файлом после загрузки
			Попытка
				Файл = Новый Файл(ФайлДанных);
				Если Объект.ДействиеСЗагружаемымФайлом = 0 Тогда
					КаталогАрхиваПеремещаемыхФайлов = Объект.КаталогАрхиваЗагруженныхФайлов+"\"+Строка(Формат(ТекущаяДата(),"ДФ=""дд-ММ-гггг"""));
					СоздатьКаталог(КаталогАрхиваПеремещаемыхФайлов);
					ПереместитьФайл(ФайлДанных, КаталогАрхиваПеремещаемыхФайлов+"\"+Файл.Имя);
				ИначеЕсли Объект.ДействиеСЗагружаемымФайлом = 1 Тогда
					УдалитьФайлы(Файл.ПолноеИмя);
				КонецЕсли;
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				СтрокаОшибки ="Ошибка при выполнении действий с файлом после загрузки"+Символы.ПС+Символы.ПС;
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
				Пока ИнформацияОбОшибке<>Неопределено Цикл
					СтрокаОшибки = СтрокаОшибки+"   "+ИнформацияОбОшибке.Описание+Символы.ПС;
					ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
				КонецЦикла;
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки); //Загрузку все равно произвели, можно закрывать форму
			КонецПопытки;
			ЗаполнитьРезультатРаботы(ОписаниеОшибок);
			Инкремент = 2;
		Иначе
			
			ОтборСтрок = Новый Структура("ИмяРеквизита", "Наименование товара");
			СтрокиТаблицы = ТаблицаДополнительныхПараметров.НайтиСтроки(ОтборСтрок);
			Если СтрокиТаблицы.Количество() > 0 Тогда
				СтрокаНастройки = СтрокиТаблицы[0];
				Если СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо<>"Наименование"
					И СтрокаНастройки.НомерКолонки=0 Тогда
					ПоказатьПредупреждение(,"Не указан номер колонки наименования номенклатуры в табличном документе.");
					Возврат;
				КонецЕсли;
				НастройкиЗагрузкиНоменклатурыИскатьПо = СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо;
				Элементы.СоответствиеНоменклатурыНаименование.Видимость = НЕ НастройкиЗагрузкиНоменклатурыИскатьПо="Наименование";
			КонецЕсли;
			
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХодЗагрузки;
			Элементы.ИнформацияЗагрузки.Заголовок = НСтр("ru = 'Выполняется обработка данных.
			|Операция может занять несколько минут...'");
			УстановитьДоступностьКнопок();
			УправлениеДиалогом();
			
			// Пользователь первый раз перешел на эту страницу
			Если Объект.СоответствиеНоменклатуры.Количество()=0 Тогда
				Результат = ЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент);
				Если НЕ Результат Тогда
					Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаИсточникДанных;
					УстановитьДоступностьКнопок();
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаСоответствияНоменклатуры Тогда
		
		Инкремент = 1;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХодЗагрузки;
		Элементы.ИнформацияЗагрузки.Заголовок = НСтр("ru = 'Выполняется обработка данных.
		|Операция может занять несколько минут...'");
		УстановитьДоступностьКнопок();
		
		ЗагрузитьДанныеВФорме(Объект.ТабличныйДокумент, ОписаниеОшибок, НастройкиЗагрузкиНоменклатурыИскатьПо);
		// выполним действия с файлом после загрузки
		Попытка
			Файл = Новый Файл(ФайлДанных);
			Если Объект.ДействиеСЗагружаемымФайлом = 0 Тогда
				КаталогАрхиваПеремещаемыхФайлов = Объект.КаталогАрхиваЗагруженныхФайлов+"\"+Строка(Формат(ТекущаяДата(),"ДФ=""дд-ММ-гггг"""));
				СоздатьКаталог(КаталогАрхиваПеремещаемыхФайлов);
				ПереместитьФайл(ФайлДанных, КаталогАрхиваПеремещаемыхФайлов+"\"+Файл.Имя);
			ИначеЕсли Объект.ДействиеСЗагружаемымФайлом = 1 Тогда
				УдалитьФайлы(Файл.ПолноеИмя);
			КонецЕсли;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			СтрокаОшибки ="Ошибка при выполнении действий с файлом после загрузки"+Символы.ПС+Символы.ПС;
			ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			Пока ИнформацияОбОшибке<>Неопределено Цикл
				СтрокаОшибки = СтрокаОшибки+"   "+ИнформацияОбОшибке.Описание+Символы.ПС;
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			КонецЦикла;
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки); //Загрузку все равно произвели, можно закрывать форму
		КонецПопытки;
		ЗаполнитьРезультатРаботы(ОписаниеОшибок);
		

	Иначе
		Инкремент = 1;
	КонецЕсли;
	
	КомандаДалееЗавершение(Новый Структура("Инкремент", Инкремент));
	
КонецПроцедуры // КомандаДалее()

// Процедура - обработчик команды "Назад"
//
&НаКлиенте
Процедура КомандаНазад(Команда)
	
	//Если Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаСоответствияНоменклатуры Тогда
	//	мТекущийНомерСтраницы = 0;
	//	Инкремент = 0;
	//Иначе
		Инкремент = -1;
	//КонецЕсли;
	
	ПодготовитьРезультатРаботы();
	
	мТекущийНомерСтраницы = ?((мТекущийНомерСтраницы + Инкремент)<0, 0, мТекущийНомерСтраницы + Инкремент);
	Элементы.Страницы.ТекущаяСтраница = мСтраницы[мТекущийНомерСтраницы];
	Если (СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено ИЛИ СтрокаНастройкиЗагрузкиНоменклатуры.РежимЗагрузки<>"Искать") И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСоответствияНоменклатуры Тогда
		КомандаНазад(Неопределено);
	КонецЕсли;
	УстановитьДоступностьКнопок();
	
КонецПроцедуры // КомандаНазад()

// Процедура - обработчик команды "СнятьФлажкиНастройкиШапки"
//
&НаКлиенте
Процедура СнятьФлажкиНастройкиШапки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитовШапки);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажкиНастройкиШапки"
//
&НаКлиенте
Процедура УстановитьФлажкиНастройкиШапки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитовШапки);
	
КонецПроцедуры

// Процедура - обработчик команды "РучнаяНумерацияКолонокНастройкиШапки"
//
&НаКлиенте
Процедура РучнаяНумерацияКолонокНастройкиШапки(Команда)
	
	УстановитьРучнаяНумерацияКолонокНастройкиШапки();
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	
КонецПроцедуры

// Процедура - обработчик команды "ПеренумероватьКолонкиНастройкиШапки"
//
&НаКлиенте
Процедура ПеренумероватьКолонкиНастройкиШапки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитовШапки;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "СохранитьВФайл"
//
&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.СохранитьВФайл(Неопределено, Объект.ТабличныйДокумент);
	
КонецПроцедуры

// Процедура - обработчик команды "КонтрольЗаполнения"
//
&НаКлиенте
Процедура КонтрольЗаполнения(Команда)
	
	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана первая строка данных табличного документа");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПерваяСтрокаДанныхШапки = 0 И ЕстьОтмеченныеСтрокиВНастройкахШапки() Тогда
		ТекстСообщения = "Не указана строка для загрузки данных шапки документа!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,"ПерваяСтрокаДанныхШапки");
		Возврат;
	КонецЕсли;
	
	флКонтрольЗаполнения = Истина;
	КонтрольЗаполненияНаСервере(Объект.ТабличныйДокумент);

КонецПроцедуры

// Процедура - обработчик команды "ЗаполнитьСоответствиеНоменклатуры"
//
&НаКлиенте
Процедура ЗаполнитьСоответствиеНоменклатуры(Команда)

	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана первая строка данных табличного документа");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажкиСоответствия"
//
&НаКлиенте
Процедура УстановитьФлажкиСоответствия(Команда)
	
	УстановитьФлагТаблицыСоответствий(Истина);
	
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажкиСоответствия"
//
&НаКлиенте
Процедура СнятьФлажкиСоответствия(Команда)
	
	УстановитьФлагТаблицыСоответствий(Ложь);
	
КонецПроцедуры

// Процедура - обработчик команды "СформироватьНоменклатуру"
//
&НаКлиенте
Процедура СформироватьНоменклатуру(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Таблица соответствий пуста'"));
		Возврат;
	КонецЕсли;
	
	ОтмеченныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Загружать", Истина));
	Если ОтмеченныеСтроки.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не выбраны позиции, которые необходимо добавить'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьНоменклатуруОбработкаВопроса",ЭтотОбъект),НСтр("ru= 'Добавить выбранные позиции в справочник номенклатуры?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Процедура - обработчик команды "СформироватьНоменклатуру"
//
&НаКлиенте
Процедура СформироватьНоменклатуруПоНастройке(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Таблица соответствий пуста'"));
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("ПредставлениеРеквизита", "Номенклатура"));
	Если НайденнаяСтрока.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не найдено в настройках поле ""Номенклатура""'"));
		Возврат;
	Иначе
		НайденнаяСтрока = НайденнаяСтрока[0];
	КонецЕсли;
	
	Если НЕ НайденнаяСтрока.Пометка ИЛИ НайденнаяСтрока.НомерКолонки=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'В настройках поле ""Номенклатура"" не используется'"));
		Возврат;
	КонецЕсли;
	
	ОтмеченныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Загружать", Истина));
	Если ОтмеченныеСтроки.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не выбраны позиции, которые необходимо добавить'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СформироватьНоменклатуруПоНастройкеОбработкаВопроса", ЭтотОбъект, Новый Структура("НайденнаяСтрока", НайденнаяСтрока));
	ПоказатьВопрос(ОписаниеОповещенияВопрос, НСтр("ru= 'Добавить выбранные позиции в справочник номенклатуры?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Процедура - обработчик команды "ДополнительныеПараметрыЗагрузки"
//
&НаКлиенте
Процедура ДополнительныеПараметрыЗагрузки(Команда)
	Рез = Неопределено;
	ДопПараметры = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.УстановитьДополнительныеПараметрыЗагрузки(ЭтотОбъект, Объект, Рез);
	ОткрытьФорму(ДопПараметры.ФормаИмя, ДопПараметры.ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("УстановитьДополнительныеПараметрыЗагрузкиЗавершение", этотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеПоПохожимНаименованиям(Команда)
	
	ПараметрыФормы = Новый Структура("КоллекцияСтрок", Объект.СоответствиеНоменклатуры);
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораНоменклатурыПоСхожести", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораНоменклатурыПоСхожести", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеПоШтрихкоду(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Произвести точное сопоставление отмеченной номенклатуры по штрихкоду?";
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСопоставлениеПоШтрихкоду", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеПоНаименованию(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Произвести точное сопоставление отмеченной номенклатуры по наименованию?";
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСопоставлениеПоНаименованию", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеИзСписка(Команда)
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.Загружать И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для текущей строки соответствие уже установлено!");
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораНоменклатуры", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораНоменклатуры", Новый Структура,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставитьПоЗаказуПоставщику(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Предварительный контроль наличия данных для обработки
	ЕстьДанныеДляОбработки = Ложь;
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ЕстьДанныеДляОбработки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДанныеДляОбработки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Незаполненных данных для сопоставления не найдено.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Обработчик = Новый ОписаниеОповещения("ОбработатьНоменклатурыДокумента", ЭтотОбъект);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрыФормы, , , , , Обработчик, РежимОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставитьПоЗаказуНаПеремещение(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Предварительный контроль наличия данных для обработки
	ЕстьДанныеДляОбработки = Ложь;
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ЕстьДанныеДляОбработки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДанныеДляОбработки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Незаполненных данных для сопоставления не найдено.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Обработчик = Новый ОписаниеОповещения("ОбработатьНоменклатурыДокумента", ЭтотОбъект);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Документ.ЗаказНаПеремещение.ФормаВыбора", ПараметрыФормы, , , , , Обработчик, РежимОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает метаданные источника данных
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   ОбъектМетаданныхТабличнаяЧасть	- Объект метаданных
//
&НаСервере
Функция ПолучитьМетаданныеИсточникаИзВременногоХранилища()
	
	Если НастройкаЗагрузки.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		ОбъектМетаданныхСправочник = Метаданные.Справочники.Найти(НастройкаЗагрузки.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхСправочник<>Неопределено Тогда
			Возврат ОбъектМетаданныхСправочник;
		КонецЕсли;
		
	ИначеЕсли НастройкаЗагрузки.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		ОбъектМетаданныхДокумент = Метаданные.Документы.Найти(НастройкаЗагрузки.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхДокумент<>Неопределено Тогда
			ОбъектМетаданныхТабличнаяЧасть = ОбъектМетаданныхДокумент.ТабличныеЧасти.Найти(НастройкаЗагрузки.ИмяТабличнойЧасти);
			Если ОбъектМетаданныхТабличнаяЧасть<>Неопределено Тогда
				Возврат ОбъектМетаданныхТабличнаяЧасть;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НастройкаЗагрузки.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка Тогда
		ОбъектМетаданныхОбработка = Метаданные.Обработки.Найти(НастройкаЗагрузки.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхОбработка<>Неопределено Тогда
			Возврат ОбъектМетаданныхОбработка;
		КонецЕсли;
		
	ИначеЕсли НастройкаЗагрузки.ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
		ОбъектМетаданныхРегистр = Метаданные.РегистрыСведений.Найти(НастройкаЗагрузки.ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхРегистр<>Неопределено Тогда
			Возврат ОбъектМетаданныхРегистр;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьМетаданныеИсточника()

// Процедура установки нумерации
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонок()
	
	Объект.РучнаяНумерацияКолонокТабличногоДокумента = НЕ Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	
КонецПроцедуры

// Процедура, устанавливает видимость настроек загрузки
//
&НаКлиенте
Процедура УстановитьВидимостьНастроекЗагрузки()
	Если ОтображениеНастроекЗагрузки Тогда
		Элементы.ПоказатьНастройки.Заголовок="Свернуть настройки";
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Истина;
		Элементы.УстановитьКолонку.Доступность = Истина;
		РазвернутТабличныйДокумент = Истина;
		Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
			ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитовШапки);
		Иначе
			ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
		КонецЕсли;
	Иначе
		Элементы.ПоказатьНастройки.Заголовок="Развернуть настройки";
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Ложь;
		Элементы.УстановитьКолонку.Доступность = Ложь;
	КонецЕсли; 
	ОтображениеНастроекЗагрузки = НЕ ОтображениеНастроекЗагрузки;
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура расстановки пометок на кнопках контекстного меню табличного документа
//
&НаСервере
Процедура РасставитьПометкиНаКнопках(НомерКолонки)
	
	Если ОтображениеНастроекЗагрузки Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПомеченныхКолонок = Новый Массив;
	
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		СтрокиТЧ = ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("НомерКолонки", НомерКолонки));
	Иначе
		СтрокиТЧ = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("НомерКолонки", НомерКолонки));
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		ИменаПомеченныхКолонок.Добавить("ПодключаемаяКнопка_"+СокрЛП(СтрокаТЧ.ИмяРеквизита));
	КонецЦикла;
	
	Для Каждого Кнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		Кнопка.Пометка = ИменаПомеченныхКолонок.Найти(Кнопка.Имя)<>Неопределено;
	КонецЦикла;
	//
КонецПроцедуры

// Процедура установки условного оформления строк таблицы
//
&НаКлиенте
Процедура РазобратьсяСОформлениемСтрок()
	
	Если Объект.ТабличныйДокумент.ТекущаяОбласть <> Неопределено Тогда
		НомерКолонки = Объект.ТабличныйДокумент.ТекущаяОбласть.Лево;
	КонецЕсли;
	
	Если ЭтотОбъект.ТекущийЭлемент <> Элементы.ТабличныйДокумент
		ИЛИ Объект.ТабличныйДокумент.ТекущаяОбласть = Неопределено Тогда
		НомерКолонки = 0;
	КонецЕсли;
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
			СтрокаТаблицы.ПодсвечиватьСтроку = ?(НомерКолонки = 0, Ложь, НомерКолонки = СтрокаТаблицы.НомерКолонки);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицаЗагружаемыхРеквизитов Цикл
			СтрокаТаблицы.ПодсвечиватьСтроку = ?(НомерКолонки = 0, Ложь, НомерКолонки = СтрокаТаблицы.НомерКолонки);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура выделения цветом нужной колонки табличного документа
//
&НаКлиенте
Процедура ПодсветитьВыбраннуюКолонку(ТекТаблицаФормы)
	
	ТипЛинииРамки 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1, 0);

	ЦветРамки = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаКнопки");
	
	ТекОбласть 				= Объект.ТабличныйДокумент.Область(1,1,Объект.ТабличныйДокумент.ВысотаТаблицы,Объект.ТабличныйДокумент.ШиринаТаблицы);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаПоля");
	
	Если НЕ Элементы.ГруппаНастройкиЗагрузки.Видимость Тогда
		Объект.ТабличныйДокумент.ОтображатьСетку = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекТаблицаФормы = Неопределено И (ИзмененаРучнаяНумерацияКолонок ИЛИ РазвернутТабличныйДокумент) И Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные<>Неопределено Тогда
		РазвернутТабличныйДокумент = Ложь;
		ИзмененаРучнаяНумерацияКолонок = Ложь;
		ТекТаблицаФормы = Элементы.ТаблицаЗагружаемыхРеквизитов;
	КонецЕсли;
	
	Если ТекТаблицаФормы = Неопределено Тогда
		
		// Позиционировались на колонке
		Если Объект.ТабличныйДокумент.ТекущаяОбласть <> Неопределено Тогда
			НомерКолонкиПодсветки = Объект.ТабличныйДокумент.ТекущаяОбласть.Лево;
		Иначе
			НомерКолонкиПодсветки = 0;
		КонецЕсли;
		
	Иначе
		ТекСтрока 		= ТекТаблицаФормы.ТекущиеДанные;
		Если ТекСтрока = Неопределено ИЛИ ТекСтрока.НомерКолонки = 0 Тогда
			Возврат;
		КонецЕсли;
		НомерКолонкиПодсветки = ТекСтрока.НомерКолонки;
	КонецЕсли;
	
	ТекОбласть = Объект.ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, Объект.ТабличныйДокумент.ВысотаТаблицы, НомерКолонкиПодсветки);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаШапкиОтчета");
	
	Если ТекТаблицаФормы<>Неопределено Тогда
		Объект.ТабличныйДокумент.ТекущаяОбласть = Объект.ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, 1, НомерКолонкиПодсветки);
	КонецЕсли;
	Объект.ТабличныйДокумент.ОтображатьСетку = Истина;
	
КонецПроцедуры

// Функция определить возможность установки режима поиска для текущих данных
//
&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

// Функция определить возможность установки режима загрузки для текущих данных
//
&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбора(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитов[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Процедура заполнения контекстного меню табличного документа
//
&НаСервере
Процедура ЗаполнитьМассивКнопок()
	
	МассивКнопокДляУдаления = Новый Массив;
	Для Каждого СуществующаяКнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		МассивКнопокДляУдаления.Добавить(СуществующаяКнопка);
	КонецЦикла;
	
	Для Каждого Кнопка Из МассивКнопокДляУдаления Цикл
	   	Попытка
			Команды.Удалить(Кнопка.Имя);
		Исключение
		КонецПопытки;
		Попытка
			Элементы.Удалить(Кнопка);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если ОтображениеНастроекЗагрузки Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДействия = "ПодключаемыеКнопкиНажатие";
		
	Если Элементы.ГруппаСтраницыНастройкиЗагрузки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиШапки Тогда
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитовШапки;
		ЭтоСтраницаШапки = Истина;
	Иначе
		ТекущаяТаблица = ТаблицаЗагружаемыхРеквизитов;
		ЭтоСтраницаШапки = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТекущаяТаблица Цикл
		
		ИмяКнопки = "ПодключаемаяКнопка_"+СокрЛП(СтрокаТЧ.ИмяРеквизита);
		Команда = Команды.Найти(ИмяКнопки);
		
		Если Команда = Неопределено Тогда
			Команда = Команды.Добавить(ИмяКнопки);
		КонецЕсли;
		
		Кнопка = Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"), Элементы.ТабличныйДокументКонтекстноеМеню);
		Команда.Действие = ИмяДействия;
		Кнопка.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), СтрокаТЧ.ПредставлениеРеквизита);
		Кнопка.ИмяКоманды = ИмяКнопки;
	КонецЦикла;

КонецПроцедуры

// Процедура управления доступностью кнопок
//
&НаКлиенте
Процедура УстановитьДоступностьКнопок()
	
	Элементы.Справка.Доступность = ИСТИНА;
	Элементы.Назад  .Доступность = (мТекущийНомерСтраницы<>0);
	Элементы.Далее  .Доступность = (мТекущийНомерСтраницы<>4);
	Элементы.Отмена .Доступность = ИСТИНА;
	Элементы.Далее  .Заголовок   = ?(мТекущийНомерСтраницы=3, "Готово", "Далее");
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХодЗагрузки Тогда
		Элементы.Справка.Доступность = ЛОЖЬ;
		Элементы.Назад  .Доступность = ЛОЖЬ;
		Элементы.Далее  .Доступность = ЛОЖЬ;
		Элементы.Отмена .Доступность = ИСТИНА;
		Элементы.Отмена .Заголовок   = "Отмена";
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьКнопок()

// Процедура управления доступностью
//
&НаКлиенте
Процедура УправлениеДиалогом()
	
	Элементы.СохранитьСоответствияВПрайсЛистеПоставщика.Доступность = Истина;
	Элементы.ПрайсЛистКонтрагента.Доступность = СохранитьСоответствияВПрайсЛистеПоставщика;
	Если СохранитьСоответствияВПрайсЛистеПоставщика Тогда
		Элементы.ПрайсЛистКонтрагента.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ПрайсЛистКонтрагента);
	Иначе
		Элементы.ПрайсЛистКонтрагента.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогом()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Процедура КонтрольЗаполненияНаСервере(ТабличныйДокумент)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	// получим метаданные источника
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов = ТаблицаЗагружаемыхРеквизитов.Выгрузить();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить();
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов.Скопировать());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 					ОбработкаОбъект.СоответствиеНоменклатуры.Выгрузить());
	СтруктураПараметров.Вставить("РежимЗагрузки", 								ОбработкаОбъект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника", 							ОбработкаОбъект.СсылкаИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",								ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",								ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ТЧДокумента",		 							?(ОбработкаОбъект.ТЧДокумента=Неопределено, Неопределено, ОбработкаОбъект.ТЧДокумента.Выгрузить()));
	СтруктураПараметров.Вставить("флКонтрольЗаполнения", 						Истина);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",					ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ВладелецСерии",								Неопределено);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						ОбработкаОбъект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",							ОбработкаОбъект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",							ОбработкаОбъект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",		ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",				ОбработкаОбъект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",						ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",						ОбработкаОбъект.ПослеДобавленияСтроки);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,ОбработкаОбъект);
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруОтраслевыеФлаги(СтруктураПараметров,ОбработкаОбъект);
    ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.КонтрольЗаполнения(ТабличныйДокумент, СтруктураПараметров);
	
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураПараметров);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры // мКонтрольЗаполнения()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Функция ЗагрузитьСоответствиеНоменклатуры(ТабличныйДокумент, СохранятьПроставленные = Ложь)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 			ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 				ОбработкаОбъект.СоответствиеНоменклатуры.Выгрузить());
	СтруктураПараметров.Вставить("РежимЗагрузки",							ОбработкаОбъект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника",							ОбработкаОбъект.СсылкаИсточника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",					ОбработкаОбъект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",							ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",							ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("Поставщик", 								Контрагент);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",	ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",					ОбработкаОбъект.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",				ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ТЧДокумента",								ОбработкаОбъект.ТЧДокумента);
	СтруктураПараметров.Вставить("флКонтрольЗаполнения",					Истина);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",				ОбработкаОбъект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("СохранятьПроставленные", 					СохранятьПроставленные);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки", ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",           ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",			ОбработкаОбъект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",			ОбработкаОбъект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",					ОбработкаОбъект.ЗагружатьGTINДляСерии);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,ОбработкаОбъект);
	
	НомерКолонкиНаимен = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьНомерКолонкиНаименованияСФормы(ЭтотОбъект);
	
	Результат = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗагрузитьСоответствиеНоменклатуры(ТабличныйДокумент, СтруктураПараметров, НомерКолонкиНаимен);
	
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураПараметров);
	ОбработкаОбъект.СоответствиеНоменклатуры.Загрузить(СтруктураПараметров.СоответствиеНоменклатуры.Скопировать());
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

	Возврат Результат;

КонецФункции // мЗагрузитьСоответствиеНоменклатуры()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Функция ЗагрузитьДанныеНаСервере(ТабличныйДокумент, ОписаниеОшибок)
	
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("флКонтрольЗаполнения", 						Ложь);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	СтруктураПараметров.Вставить("ТЧДокумента", 								?(ЗначениеЗаполнено(Объект.ТабличнаяЧастьИсточника), Объект.СсылкаИсточника[Объект.ТабличнаяЧастьИсточника].Выгрузить(), Неопределено));
	СтруктураПараметров.Вставить("ОписаниеОшибок", 								"");
	СтруктураПараметров.Вставить("ДопПараметры", 								Новый Структура());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	Объект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("РежимЗагрузки", 								Объект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника", 							Объект.СсылкаИсточника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",	 					Объект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 							Объект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника", 								Объект.ИмяСправочника);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		Объект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",				Объект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("ВладелецСерии", 								Неопределено);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 					Объект.ЗапретСозданияНовыхЭлементов);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы", 			Объект.ЗапретОбновленияСуществующихЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 					Объект.ЗамещатьСуществующиеЗаписи);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 						Объект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 							Объект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 						Объект.ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					Объект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии", 				Объект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 					Объект.СоответствиеНоменклатуры.Выгрузить());
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						Объект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("Поставщик",									Контрагент);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения", 				Объект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии", 				Объект.ЗагружатьGTINДляСерии);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           Объект.ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("РеквизитыШапкиДокумента",                           Новый Структура);
	
	Если Объект.РежимЗагрузки = 3 И Объект.ИмяВидаРегистра = "" И Объект.ИмяСправочника = "" Тогда
		СтруктураПараметров.Вставить("РеквизитыШапкиДокумента", СформироватьСтруктуруРеквизитовШапкиДокумента(Объект.СсылкаИсточника));
	КонецЕсли;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,Объект);
	СтруктураРезультата = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗагрузитьДанные(ТабличныйДокумент,СтруктураПараметров);
	
	Возврат СтруктураРезультата;
	
КонецФункции // мЗагрузитьДанные()

// Процедура заполнения результата выполнения мастера результатами работы и возникших ошибок
//
&НаКлиенте
Процедура ЗаполнитьРезультатРаботы(РезультатРаботыТекст="")
	
	РезультатРаботы = СтрЗаменить(РезультатРаботы, "%РезультатРаботы%", СтрЗаменить(РезультатРаботыТекст, Символы.ПС, "<BR>"));
	
КонецПроцедуры // ЗаполнитьРезультатРаботы()

// Процедура очищает поле HTML результата работы путем получения текста из макета
//
&НаСервере
Процедура ПодготовитьРезультатРаботы()
	
	РезультатРаботы = Обработки.ор_ЗагрузкаДанныхИзТабличногоДокумента.ПолучитьМакет("Макет").ПолучитьТекст();
	
КонецПроцедуры // ПодготовитьРезультатРаботы()

// Процедура выполняет непосредственную загрузку данных в документ, отображает ход выполнения процесса
&НаСервере
Процедура ЗагрузитьДанныеВФорме(ТабличныйДокумент, ОписаниеОшибок ="", НастройкиЗагрузкиНоменклатурыИскатьПо = "")
	
	// Проверим оставшиеся реквизиты формы
	СохранитьСоответсвия = Ложь;
	Если Элементы.СохранитьСоответствияВПрайсЛистеПоставщика.Доступность И СохранитьСоответствияВПрайсЛистеПоставщика Тогда
		Если НЕ ЗначениеЗаполнено(ПрайсЛистКонтрагента) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не указан прайс-лист поставщика"); 
			Возврат;
		КонецЕсли;
		СохранитьСоответсвия = Истина;
	КонецЕсли;
	
	Если Объект.ТабличнаяЧастьИсточника=Неопределено И НЕ Объект.ИмяВидаРегистра="" Тогда
		Объект.РежимЗагрузки = 2;
	КонецЕсли;
	
	// Выполним загрузку
	флКонтрольЗаполнения = Ложь;
	
	Результат = ЗагрузитьДанныеНаСервере(ТабличныйДокумент, ОписаниеОшибок);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ОписаниеОшибок = Результат.ОписаниеОшибок;
		АдресТаблицаЗагрузкаИЗФайлаВХранилище = ПоместитьВоВременноеХранилище(Результат.ТЧДокумента, УникальныйИдентификатор);
		АдресСтруктураРеквизитовЗагрузкаИЗФайлаВХранилище = ПоместитьВоВременноеХранилище(Результат.РеквизитыШапкиДокумента, УникальныйИдентификатор);
	КонецЕсли;
	
	// Сохраним соответствие в прайс-лист контрагента
	
	Если СохранитьСоответсвия Тогда
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.СохранитьТаблицуСоответствия(ПрайсЛистКонтрагента, НастройкиЗагрузкиНоменклатурыИскатьПо, ТаблицаЗагружаемыхРеквизитов.Выгрузить(), Объект.СоответствиеНоменклатуры.Выгрузить(), ТаблицаДополнительныхПараметров.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьДанныеВФорме()

// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  СтруктураУмолчаний - Структура - Структура настройки колонок по умолчанию
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонок(Настройки)
	
	ТаблицаЗагружаемыхРеквизитов.Очистить();
	ТаблицаЗагружаемыхРеквизитовШапки.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов    = ТаблицаЗагружаемыхРеквизитов.Выгрузить().СкопироватьКолонки();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить().СкопироватьКолонки();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СсылкаИсточника", 							ОбработкаОбъект.СсылкаИсточника);
	СтруктураПараметров.Вставить("РежимЗагрузки", 								ОбработкаОбъект.РежимЗагрузки);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника", 					ОбработкаОбъект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 							ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника", 								ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьДокументаОбъекта",				ОбработкаОбъект.ТабличнаяЧастьДокументаОбъекта);
	СтруктураПараметров.Вставить("ТЧДокумента",									ОбработкаОбъект.ТЧДокумента);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов",					ОбработкаОбъект.ЗапретСозданияНовыхЭлементов);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",				ОбработкаОбъект.ЗапретОбновленияСуществующихЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи",					ОбработкаОбъект.ЗамещатьСуществующиеЗаписи);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",	ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",		ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						ОбработкаОбъект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",					ОбработкаОбъект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом",					ОбработкаОбъект.ДействиеСЗагружаемымФайлом);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",					ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов",				ОбработкаОбъект.КаталогАрхиваЗагруженныхФайлов);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",						ОбработкаОбъект.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",ОбработкаОбъект.ИспользоватьВнешнийМодульПреобразованияФайла);
	СтруктураПараметров.Вставить("ОбработкаПреобразования",						ОбработкаОбъект.ОбработкаПреобразования);
	СтруктураПараметров.Вставить("Кодировка",									ОбработкаОбъект.Кодировка);
	СтруктураПараметров.Вставить("Табуляция",									ОбработкаОбъект.Табуляция);
	СтруктураПараметров.Вставить("ИмяТаблицы",									ОбработкаОбъект.ИмяТаблицы);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",							ОбработкаОбъект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",							ОбработкаОбъект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",						ОбработкаОбъект.ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов",				ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов.Скопировать());
	СтруктураПараметров.Вставить("ИмяВидаРегистра",								ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",								ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",	ОбработкаОбъект.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Скопировать());
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	ОбработкаОбъект.ЗагружатьДополнительныеРеквизитыИСведения);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	ОбработкаОбъект.ДополнительныеРеквизитыИСведенияТолькоОбщие);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",				ОбработкаОбъект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",						ОбработкаОбъект.ЗагружатьGTINДляСерии);
	
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок", 			ОбработкаОбъект.КоличествоНеОбрабатываемыхСтрок);
	
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать());

	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект, ОбработкаОбъект, Истина);

	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьНастройкиКолонок(Настройки, СтруктураПараметров);
	
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураПараметров);
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Скопировать();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать();
	ТаблицаЗагружаемыхРеквизитов.Загрузить(ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов);
	ТаблицаЗагружаемыхРеквизитовШапки.Загрузить(ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки);

	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПеренестиДопПараметрыВОбъектИНаФорму(СтруктураПараметров, ЭтотОбъект, ОбработкаОбъект);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры // ЗаполнитьНастройкиКолонок()

// Функция создания номенклатуры по настройке
//
&НаСервере
Функция СоздатьНоменклатуруПоНастройкеНаСервере(ТабличныйДокументОбъекта, Настройка, НомерКолонкиНоменклатуры)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.СоздатьНоменклатуруПоНастройке(ТабличныйДокументОбъекта,
																				Настройка, 
																				НомерКолонкиНоменклатуры, 
																				Объект.СоответствиеНоменклатуры.Выгрузить(), 
																				ЭтотОбъект,
																				Объект.ПерваяСтрокаДанныхТабличногоДокумента);
КонецФункции

// Функция формирования структуры параметров для установки отбора в форме выбора настроек
//
&НаСервере
Функция СформироватьСтруктуруОтбораДляВыбораНастройки(ДляФормированияНоменклатуры=Ложь)
	
	СтруктураРеквизитов = Новый Структура("РежимЗагрузки,СсылкаИсточника,ТабличнаяЧастьИсточника,ИмяВидаРегистра,ИмяСправочника",
							Объект.РежимЗагрузки,
							Объект.СсылкаИсточника,
							Объект.ТабличнаяЧастьИсточника,
							Объект.ИмяВидаРегистра,
							Объект.ИмяСправочника);
	
	ПараметрОтборПоМетаданнымТабличнойЧасти = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьМетаданныеИсточника(СтруктураРеквизитов);
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("ПараметрОтборПоВариантуИспользования", Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных);
	
	Если ДляФормированияНоменклатуры Тогда
		
		СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
		СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"            , Метаданные.Справочники.Номенклатура.ПолноеИмя());
		СтруктураПараметров.Вставить("ПараметрОтборПоКонтрагенту"           , Контрагент);
		
	Иначе
		
		Если Метаданные.Справочники.Содержит(ПараметрОтборПоМетаданнымТабличнойЧасти) Тогда
			// Это справочник
			СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"            , ПараметрОтборПоМетаданнымТабличнойЧасти.ПолноеИмя());
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(ПараметрОтборПоМетаданнымТабличнойЧасти) Тогда
			// Это регистр сведений
			СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений);
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"            , ПараметрОтборПоМетаданнымТабличнойЧасти.ПолноеИмя());
			
		Иначе
			// Это ТЧ, надо только выяснить чья
			Если Метаданные.Документы.Содержит(ПараметрОтборПоМетаданнымТабличнойЧасти.Родитель()) Тогда
				СтруктураПараметров.Вставить("ПараметрОтборПоКонтрагенту", Контрагент);
				СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Документ);
			Иначе
				СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
			КонецЕсли;
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"              , ?(ПараметрОтборПоМетаданнымТабличнойЧасти = Неопределено, "", ПараметрОтборПоМетаданнымТабличнойЧасти.Родитель().ПолноеИмя()));
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданнымТабличнойЧасти", ПараметрОтборПоМетаданнымТабличнойЧасти.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Функция СохранитьИзмененныеНастройкиНаСервере()
	Попытка
		НастройкаЗагрузкиОбъект = НастройкаЗагрузки.ПолучитьОбъект();
		МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МетаданныеИсточникаИзСправочника", МетаданныеИсточника);
		Если Метаданные.Справочники.Содержит(МетаданныеИсточника) Тогда
			ТекРежимЗагрузки                             = 0;
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
			ТекРежимЗагрузки                             = 2;
		Иначе
			ТекРежимЗагрузки                             = 1;	
		КонецЕсли;
		СтруктураПараметров.Вставить("РежимЗагрузки", 								ТекРежимЗагрузки);
		СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 					Объект.ЗапретСозданияНовыхЭлементов);
		СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 					Ложь);
		СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	Объект.РучнаяНумерацияКолонокТабличногоДокумента);
		СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		Объект.ПерваяСтрокаДанныхТабличногоДокумента);
		СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",				Объект.КоличествоНеОбрабатываемыхСтрок);
		СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом", 					Объект.ДействиеСЗагружаемымФайлом);
		СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					Объект.флПоискПоПрайсуПоставщика);
		СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов", 				Объект.КаталогАрхиваЗагруженныхФайлов);
		СтруктураПараметров.Вставить("Табуляция", 									Объект.Табуляция);
		СтруктураПараметров.Вставить("Кодировка", 									Объект.Кодировка);
		СтруктураПараметров.Вставить("ИмяТаблицы", 									Объект.ИмяТаблицы);
		СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы", 			Объект.ЗапретОбновленияСуществующихЭлементов);
		СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", Объект.ИспользоватьВнешнийМодульПреобразованияФайла);
		СтруктураПараметров.Вставить("ОбработкаПреобразования", 					Объект.ОбработкаПреобразования);
		СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ТаблицаЗагружаемыхРеквизитов.Выгрузить());
		СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 						Объект.ПередЗаписьюОбъекта);
		СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 							Объект.ПриЗаписиОбъекта);
		СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 						Объект.ПослеДобавленияСтроки);
		СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	Ложь);
		СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	Ложь);
		СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",	Новый СписокЗначений);
		
		СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
		СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           Объект.ПерваяСтрокаДанныхШапки);
		СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
		
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьСтруктуруПараметровЗаполнитьТабличныйДокументИзНастроекПомощника(СтруктураПараметров, Объект, ТаблицаДополнительныхПараметров.Выгрузить());
		
		НастройкаЗагрузкиОбъект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройки(СтруктураПараметров));
		НастройкаЗагрузкиОбъект.Записать();
		Возврат "";
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
КонецФункции

// Функция формирует структуру, хранящую значения реквизитов шапки документа
//
Функция СформироватьСтруктуруРеквизитовШапкиДокумента(Источник)
	
	СтруктураРеквизитов = Новый Структура;
	Для Каждого Реквизит ИЗ Источник.Метаданные().Реквизиты Цикл
		СтруктураРеквизитов.Вставить(Реквизит.Имя, Источник[Реквизит.Имя]);
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Процедура изменения настройки ручной нумерации колонок настроек загрузки шапки документа
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонокНастройкиШапки()
	
	Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки = НЕ Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	
КонецПроцедуры

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбораШапки(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитовШапки[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиИскатьПо" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитовШапки);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоТипу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитовШапки);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Проверяет наличие отмеченных чтрок в таблице настроек шапки
//
&НаСервере
Функция ЕстьОтмеченныеСтрокиВНастройкахШапки()
	
	Результат = ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() <> 0;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КомандаДалееЗагрузкаФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Инкремент   = ДополнительныеПараметры.Инкремент;
	ФайлНаДиске = ДополнительныеПараметры.ФайлНаДиске;
	
	Если Результат <> Неопределено Тогда
		АдресВоВременномХранилище = Результат[0].Хранение;
		
		Если Объект.ИспользоватьВнешнийМодульПреобразованияФайла И ЗначениеЗаполнено(Объект.ОбработкаПреобразования) Тогда
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьТабличныйДокументИзXMLСервер(ФайлДанных, Объект.ОбработкаПреобразования, Объект.ТабличныйДокумент, АдресВоВременномХранилище);
		Иначе
			ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПрочитатьТабличныйДокумент(Объект.ТабличныйДокумент, ФайлНаДиске.Расширение, ФайлНаДиске.ИмяБезРасширения, АдресВоВременномХранилище, Объект.Табуляция, Объект.Кодировка);
		КонецЕсли;
		
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.НастроитьВидимостьЭлементовФормыПомощника(СтрокаНастройкиЗагрузкиНоменклатуры, Элементы,НастройкиЗагрузкиНоменклатурыИскатьПо);
		
		ЗаполнитьМассивКнопок();
		
		Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
		Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
		Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
		
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
		
		Если Объект.РежимЗагрузки = 3 И (НЕ Объект.ИмяВидаРегистра = "" ИЛИ НЕ Объект.ИмяСправочника = "") Тогда 
			Элементы.ГруппаСтраницаНастройкиШапки.Видимость = Ложь;
		КонецЕсли;
		
		КомандаДалееЗавершение(ДополнительныеПараметры);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru= 'В ходе работы мастера возникли ошибки! Неудалось загрузить файл данных!'"),,НСтр("ru= 'Ошибка загрузки данных'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалееЗавершение(ДополнительныеПараметры)
	
	Инкремент = ДополнительныеПараметры.Инкремент;
	
	Если Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаРезультат Тогда
		// Первое условие МОЖЕТ выполниться только в случае РежимЗагрузки = 3
		Если ЗначениеЗаполнено(АдресТаблицаЗагрузкаИЗФайлаВХранилище) И ЗначениеЗаполнено(АдресСтруктураРеквизитовЗагрузкаИЗФайлаВХранилище) Тогда
			Структура = Новый Структура("АдресТаблицаЗагрузкаИЗФайлаВХранилище, АдресСтруктураРеквизитовЗагрузкаИЗФайлаВХранилище", АдресТаблицаЗагрузкаИЗФайлаВХранилище, АдресСтруктураРеквизитовЗагрузкаИЗФайлаВХранилище);
			ОповеститьОВыборе(Структура);
		// Остальные режимы загрузки предполагают закрытие формы
		ИначеЕсли Объект.РежимЗагрузки <> 3 Тогда
			Закрыть();			
		Иначе
			ПоказатьПредупреждение(,НСтр("ru= 'В ходе работы мастера возникли ошибки! Невозможно выполнить загрузку в документ!'"),,НСтр("ru= 'Ошибка загрузки в документ'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	мТекущийНомерСтраницы = ?((мТекущийНомерСтраницы + Инкремент)>4, 4, мТекущийНомерСтраницы + Инкремент);
	Элементы.Страницы.ТекущаяСтраница = мСтраницы[мТекущийНомерСтраницы];
	УстановитьДоступностьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагТаблицыСоответствий(ЗначениеФлага)
	
	ТаблицаСоответствия = Объект.СоответствиеНоменклатуры.Выгрузить();
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.УстановитьФлагТаблицыСоответствий(ЗначениеФлага, ТаблицаСоответствия);
	Объект.СоответствиеНоменклатуры.Загрузить(ТаблицаСоответствия);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДополнительныеПараметрыЗагрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ШКЯвляетсяПолемПоискаНоменклатуры = Результат.ШКЯвляетсяПолемПоискаНоменклатуры;
	Объект.СоздаватьОбщиеХарактеристики      = Результат.СоздаватьОбщиеХарактеристики;
	
	Объект.ВсегдаФормироватьНовыеСерии  = Результат.ВсегдаФормироватьНовыеСерии;
	Объект.СоздаватьПроизводителя       = Результат.СоздаватьПроизводителя;
	Объект.ФорматДатыСрокаГодности      = Результат.ФорматДатыСрокаГодности;
	Объект.НеФормироватьДопНомерСерии   = Результат.НеФормироватьДопНомерСерии;
	Объект.ЗагружатьШК                  = Результат.ЗагружатьШК;
	Объект.СоздаватьСтрануПроисхождения = Результат.СоздаватьСтрануПроисхождения;
	Объект.ЗагружатьGTINДляСерии        = Результат.ЗагружатьGTINДляСерии;
	
	ЗагрузитьДопТаблицу(Результат) 

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДопТаблицу(Рез)
	Если Рез<>Неопределено Тогда
		ТаблицаДополнительныхПараметров.Загрузить(Рез.ТаблицаДополнительныхПараметров.Выгрузить());
		Объект.ТаблицаДополнительныхПараметров.Загрузить(Рез.ТаблицаДополнительныхПараметров.Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Рез = СохранитьИзмененныеНастройкиНаСервере();
	Если ПустаяСтрока(Рез) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Настройка успешно сохранена");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("При сохранении настройки возникли ошибки: "+Рез);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонкуОбработкаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьКолонкуЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонкуЗавершение(ДополнительныеПараметры)
	
	НомерКолонки     = ДополнительныеПараметры.НомерКолонки;
	ЭтоСтраницаШапки = ДополнительныеПараметры.ЭтоСтраницаШапки;
	ТекСтрока        = ДополнительныеПараметры.ТекСтрока;
	
	ТекСтрока.НомерКолонки = НомерКолонки;
	ТекСтрока.Пометка = Истина;
	
	Если Не Объект.РучнаяНумерацияКолонокТабличногоДокумента И НЕ ЭтоСтраницаШапки  Тогда
		Объект.РучнаяНумерацияКолонокТабличногоДокумента = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
		Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
		Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	ИначеЕсли Не Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки И ЭтоСтраницаШапки Тогда
		Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
		Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	КонецЕсли;
	
	РасставитьПометкиНаКнопках(НомерКолонки);
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого РезультирующееЗначение Из Результат Цикл
		Объект[РезультирующееЗначение.Ключ] = РезультирующееЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруОбработкаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("СоответствиеНоменклатуры", Объект.СоответствиеНоменклатуры);
	
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаДобавленияНоменклатуры",
		СтруктураПараметров,
		ЭтотОбъект,
		,,,
		Новый ОписаниеОповещения("СформироватьНоменклатуруОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат=Неопределено Тогда
		ОбновитьСоответствиеНоменклатуры(Результат.СоответствиеНоменклатуры);
		ЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруПоНастройкеОбработкаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// Выберем настройку, по которой будем загружать
	СтруктураПараметров = СформироватьСтруктуруОтбораДляВыбораНастройки(Истина);
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("СформироватьНоменклатуруПоНастройкеОткрытьФормуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ФормаВыбора", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещенияОВыборе, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруПоНастройкеОткрытьФормуЗавершение(Настройка, ДополнительныеПараметры) Экспорт
	
	ЕстьЧтоЗагружать = Ложь;
	НайденнаяСтрока  = ДополнительныеПараметры.НайденнаяСтрока;
	
	Если Настройка <> Неопределено Тогда
		
		ЕстьЧтоЗагружать = СоздатьНоменклатуруПоНастройкеНаСервере(Объект.ТабличныйДокумент,
																				Настройка, 
																				НайденнаяСтрока.НомерКолонки);
		
	КонецЕсли;
	
	Если ЕстьЧтоЗагружать Тогда
		ЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистКонтрагентаОткрытьФормуЗавершение(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ПрайсЛистКонтрагента = ЗначениеВыбора;
		УправлениеДиалогом();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ЭтотОбъект[Элемент.Имя] = СокрЛП(Результат);
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиВыражениеОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФормуВыбораОбъектаМетаданных(Тип)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбъектМетаданных.Иерархический
		И ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			Возврат ОбъектМетаданных.ПолноеИмя() + ".ФормаВыбораГруппы";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьСоответствиеНоменклатуры(СоответствиеНоменклатуры)
	Объект.СоответствиеНоменклатуры.Загрузить(СоответствиеНоменклатуры.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораНоменклатурыПоСхожести(ТаблицаДанных, ДополнительныеПараметры) Экспорт
	
	Если ТаблицаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		Если СтрокаТаблицыДанных.Загружать Тогда
			
			СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаТаблицыДанных.НомерСтроки))[0];
			СтрокаСоответствия.Номенклатура = СтрокаТаблицыДанных.Номенклатура;
			
			Если ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (СтрокаСоответствия.Загружать) Тогда
				СтрокаСоответствия.Загружать = Ложь
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (НЕ СтрокаСоответствия.Загружать) Тогда
				СтрокаСоответствия.Загружать = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСопоставлениеПоШтрихкоду(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьСопоставлениеПоШтрихкодуСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСопоставлениеПоШтрихкодуСервер()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
	
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСТрока.Штрихкод) Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВрТаблица
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаблица.НомерСтроки КАК НомерСтроки,
	|	ВрТаблица.ШтрихКод КАК ШтрихКод,
	|	ШтрихКоды.Номенклатура КАК СопоставляемаяНоменклатура
	|ИЗ
	|	ВрТаблица КАК ВрТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
	|		ПО ВрТаблица.ШтрихКод = ШтрихКоды.Штрихкод
	|ГДЕ
	|	НЕ ШтрихКоды.Номенклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки))[0];
		СтрокаСоответствия.Номенклатура = Выборка.СопоставляемаяНоменклатура;
		
		Если ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Ложь
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (НЕ СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСопоставлениеПоНаименованию(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьСопоставлениеПоНаименованиюСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСопоставлениеПоНаименованиюСервер()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСТрока.Наименование) Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.НомерСтроки,
	|	ТаблицаДанных.Наименование
	|ПОМЕСТИТЬ ВрТаблица
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаблица.НомерСтроки,
	|	ВрТаблица.Наименование,
	|	СпрНоменклатура.Ссылка КАК СопоставляемаяНоменклатура
	|ИЗ
	|	ВрТаблица КАК ВрТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВрТаблица.Наименование = СпрНоменклатура.Наименование
	|ГДЕ
	|	НЕ СпрНоменклатура.Ссылка ЕСТЬ NULL 
	|	И НЕ СпрНоменклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки))[0];
		СтрокаСоответствия.Номенклатура = Выборка.СопоставляемаяНоменклатура;
		
		Если ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Ложь
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (НЕ СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.Номенклатура = Результат;
	ТекущиеДанные.Загружать = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНоменклатурыДокумента(Документ, ДополнительныеПараметры) Экспорт
	
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьНесопоставленнаяНоменклатураДокумента(Документ) Тогда
		
		ПараметрыФормы = Новый Структура("КоллекцияСтрок, Документ", Объект.СоответствиеНоменклатуры, Документ);
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораПоДокументу", ЭтотОбъект);
		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораПоДокументу", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе  <"+Документ+"> не обнаружено несопоставленных номенклатур.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораПоДокументу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Для Каждого ТекСтрока Из Результат Цикл
			
			СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", ТекСтрока.НомерСтроки))[0];
			СтрокаСоответствия.Номенклатура = ТекСтрока.Номенклатура;
			СтрокаСоответствия.Загружать = Ложь
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьНесопоставленнаяНоменклатураДокумента(Документ)
	
	НоменклатурыЗаказа = Документ.Товары.ВыгрузитьКолонку("Номенклатура");
	
	Результат = Ложь;
	Для Каждого Номенклатура Из НоменклатурыЗаказа Цикл
		НаденныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Если НаденныеСтроки.Количество() = 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
