
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Элементы.Организация.Видимость   = ИспользоватьНесколькоОрганизаций;
	
	Если Не ИспользоватьНесколькоОрганизаций 
		И Не ЗначениеЗаполнено(Параметры.Ключ.Организация) Тогда
		
		// Установим организации по умолчанию.
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации");
		
		Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", "ОсновнаяОрганизация");
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				Запись.Организация = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
			Элементы.Организация.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Токен)
		И ЗначениеЗаполнено(ВремяЖизниВМинутах) Тогда
		ор_ОбменСАптекаРУВызовСервера.ЗаполнитьПараметрыСеанса(Запись.Организация, Токен, ВремяЖизниВМинутах);
	Иначе
		РезультатЗапроса = ор_ОбменСАптекаРУВызовСервера.ЗапроситьТокенАвторизацииИзСервиса(ТекущийОбъект.Логин, ТекущийОбъект.Пароль);
		ор_ОбменСАптекаРУВызовСервера.ЗаполнитьПараметрыСеанса(Запись.Организация, РезультатЗапроса.Токен, РезультатЗапроса.ВремяЖизниВМинутах);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ор_ОбменСАптекаРУКлиент.ЗапроситьТокенАвторизацииИзСервиса(Запись.Логин, Запись.Пароль);
	Если Не ЗначениеЗаполнено(РезультатЗапроса.ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Подключение выполнено'"));
		Токен = РезультатЗапроса.Токен;
		ВремяЖизниВМинутах = РезультатЗапроса.ВремяЖизниВМинутах;
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1.'"), РезультатЗапроса.ТекстОшибки));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



