#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЭлементКлассификатора(ПараметрыДанных) Экспорт
	
	РезультатВозврат = Новый Структура;
	РезультатВозврат.Вставить("ВсеЭлементы", Новый Соответствие);
	РезультатВозврат.Вставить("КоличествоНовыхЭлементов", 0);
	РезультатВозврат.Вставить("КоличествоОбновленныхЭлементов", 0);
	РезультатВозврат.Вставить("МассивНовыхЭлементов", Новый Массив);
	
	МассивНовыхЭлементов = Новый Массив;
	КоличествоОбновленныхЭлементов = 0;
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ТаблицаЗначений"           , Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ПоискПоНаименованию"       , Истина);
	ПараметрыПолучения.Вставить("ПоискПоНаименованиюПодобно", Ложь);
	ПараметрыПолучения.Вставить("Дерево"                    , Новый ДеревоЗначений);
	ПараметрыПолучения.Вставить("ОбновлятьСуществующие"     , Ложь);
	
	Если ПараметрыДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыДанных);
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Количество() = 0 Тогда
		Возврат РезультатВозврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.НаименованиеПолное КАК НаименованиеПолное
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.НаименованиеПолное КАК НаименованиеПолное,
	|	ЕСТЬNULL(Спр.Ссылка, ЗНАЧЕНИЕ(Справочник.ор_ФТГ.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	Таб КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_ФТГ КАК Спр
	|		ПО (&ПоискПоНаименованию
	|					И Таб.НаименованиеПолное = Спр.НаименованиеПолное
	|				ИЛИ &ПоискПоНаименованиюПодобно
	|					И Спр.НаименованиеПолное ПОДОБНО ""%"" + Таб.НаименованиеПолное + ""%"")");
	
	Запрос.УстановитьПараметр("Таблица", ПараметрыПолучения.ТаблицаЗначений);
	Запрос.УстановитьПараметр("ПоискПоНаименованию", ПараметрыПолучения.ПоискПоНаименованию);
	Запрос.УстановитьПараметр("ПоискПоНаименованиюПодобно", ПараметрыПолучения.ПоискПоНаименованиюПодобно);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбновлятьСуществующие = ПараметрыПолучения.ОбновлятьСуществующие;
	
	СоответсвиеЭлементов = Новый Соответствие;
	НайденыВсеЭлементы = Истина;
	Пока Выборка.Следующий() Цикл
		СоответсвиеЭлементов.Вставить(Выборка.НаименованиеПолное, Выборка.Ссылка);
		Если Выборка.Ссылка.Пустая() Тогда
			НайденыВсеЭлементы = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Если не обновляем существующие и нет новых элементов, то выходим.
	Если НайденыВсеЭлементы И НЕ ОбновлятьСуществующие Тогда 
		РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
		РезультатВозврат.КоличествоНовыхЭлементов = МассивНовыхЭлементов.Количество();
		РезультатВозврат.КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов;
		РезультатВозврат.МассивНовыхЭлементов = МассивНовыхЭлементов;
		Возврат РезультатВозврат;
	КонецЕсли;
	
	// Формирование структуры реквизитов справочника.
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("НаименованиеПолное");
	
	Для Каждого Реквизит Из Метаданные.Справочники.ор_ФТГ.Реквизиты Цикл
		СтруктураДанных.Вставить(Реквизит.Имя);
		Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти(Реквизит.Имя) = Неопределено Тогда
			ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ИзменяемыеЭлементы = ОбщегоНазначения.СкопироватьРекурсивно(СоответсвиеЭлементов);
	Для Каждого ТекущийЭлемент Из ИзменяемыеЭлементы Цикл
		СправочникСсылка = ТекущийЭлемент.Значение;
		
		Если НЕ СправочникСсылка.Пустая()
			И НЕ ОбновлятьСуществующие Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("НаименованиеПолное", ТекущийЭлемент.Ключ);
		НайденныеСтроки = ПараметрыПолучения.Дерево.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
		Иначе
			НайденныеСтроки = ПараметрыПолучения.ТаблицаЗначений.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если СправочникСсылка.Пустая() Тогда
			СсылкаСправочника = СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие);
			СоответсвиеЭлементов.Вставить(ТекущийЭлемент.Ключ, СсылкаСправочника);
			
			МассивНовыхЭлементов.Добавить(СсылкаСправочника);
		Иначе
			СоздатьЭлементСлужебный(СтруктураДанных, СправочникСсылка, ОбновлятьСуществующие);
			КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
	РезультатВозврат.КоличествоНовыхЭлементов = МассивНовыхЭлементов.Количество();
	РезультатВозврат.КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов;
	РезультатВозврат.МассивНовыхЭлементов = МассивНовыхЭлементов;
	
	Возврат РезультатВозврат;
	
КонецФункции

Функция СоздатьЭлементСлужебный(Данные, СправочникСсылка, ОбновлятьСуществующие)
	
	Если СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.ор_ФТГ.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект, Данные);
	СправочникОбъект.Наименование = Данные.НаименованиеПолное;
	
	Попытка
		СправочникОбъект.Записать();
		_Возврат = СправочникОбъект.Ссылка;
	Исключение
		_Возврат = Справочники.ор_ФТГ.ПустаяСсылка();
	КонецПопытки;
	
	Возврат _Возврат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
