#Область ПрограммныйИнтерфейс

&Вместо("ЗагрузитьДанныеФискализацииИзXML")
Функция эв_ЗагрузитьДанныеФискализацииИзXML(ДанныеXML, ДанныхМаркировки = Истина) Экспорт
	
	Возврат ПродолжитьВызов(эв_ДанныеXMLССистемойНалогообложения(ДанныеXML), ДанныхМаркировки);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция эв_ДанныеXMLССистемойНалогообложения(ДанныеXML)
	
	Если Не ЗначениеЗаполнено(ДанныеXML)
		Или СтрНайти(ДанныеXML, "<Parameters") = 0 Тогда
		Возврат ДанныеXML;
	КонецЕсли;
	
	ДанныеXML = СтрЗаменить(ДанныеXML, "TaxVariant=""""", "TaxVariant=""0""");
	ДанныеXML = СтрЗаменить(ДанныеXML, "TaxationSystem=""""", "TaxationSystem=""0""");
	
	Если СтрНайти(ДанныеXML, "TaxVariant") > 0
		Или СтрНайти(ДанныеXML, "TaxationSystem") > 0 Тогда
		Возврат ДанныеXML;
	КонецЕсли;
	
	Возврат СтрЗаменить(ДанныеXML, "<Parameters", "<Parameters TaxVariant=""0""");
	
КонецФункции

#КонецОбласти
