
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДиапазонСобытий();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СократитьЖурнал(Команда)
	
	Если ДатаУдаления = '00010101' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата, до которой будут удалены записи");
		Возврат;
	КонецЕсли;
	
	СократитьЖурналСервер();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры // СократитьЖурнал()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура формирует и заполняет текущий диапазон зарегистрированных событий
// в журнале касс ККМ
//
&НаСервере
Процедура ЗаполнитьДиапазонСобытий()
	
	// Определим диапазон событий журнала по датам первой и последней записей
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияЗагрузки.ДатаЗагрузки КАК Дата
	|ПОМЕСТИТЬ НачПериода
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачПериода.Дата КАК НачалоПериода,
	|	ИсторияЗагрузки.ДатаЗагрузки КАК КонецПериода
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки,
	|	НачПериода КАК НачПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонецПериода УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Элементы.ДекорацияЗначениеДиапазонаСобытий.Заголовок = "... - ...";
	Иначе
		Диапазон = РезультатЗапроса.Выгрузить();
		Элементы.ДекорацияЗначениеДиапазонаСобытий.Заголовок = Формат(Диапазон[0].НачалоПериода,"ДФ=dd.MM.yyyy")+" - "+Формат(Диапазон[0].КонецПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	

КонецПроцедуры // ЗаполнитьДиапазонСобытий()

// Процедура выполняет сокращение журнала событий касс ККМ
//
&НаСервере
Процедура СократитьЖурналСервер()
	
	// Сформируем текст запроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИсторияЗагрузки.НастройкаЗагрузки,
	|	ИсторияЗагрузки.ДатаЗагрузки,
	|	ИсторияЗагрузки.ИмяЗагружаемогоФайла,
	|	ИсторияЗагрузки.СтатусОшибки,
	|	ИсторияЗагрузки.Объект,
	|	ИсторияЗагрузки.ФоноваяЗагрузка,
	|	ИсторияЗагрузки.Контрагент,
	|	ИсторияЗагрузки.ДатаНачалаЗагрузки,
	|	ИсторияЗагрузки.НумераторСообщений,
	|	ИсторияЗагрузки.Каталог,
	|	ИсторияЗагрузки.Сообщение
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки
	|ГДЕ
	|	ИсторияЗагрузки.ДатаЗагрузки > &Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаУдаления));
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Попытка
		НаборЗаписей = РегистрыСведений.ор_ИсторияЗагрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(ТаблицаДанных);
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить записи");
	КонецПопытки;
	
КонецПроцедуры // СократитьЖурналСервер()

#КонецОбласти
