
#Область ПрограммныйИнтерфейс

// Функция - Получить параметры HTTPСоединения
// 
// Возвращаемое значение:
//  Структура - структура параметров HTTP соединения
//
Функция ПолучитьПараметрыHTTPСоединения() Экспорт
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Сервер"              , "pharmapi.apteka.ru");
	СтруктураПараметров.Вставить("Порт"                , 443);
	СтруктураПараметров.Вставить("Таймаут"             , 10);
	СтруктураПараметров.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Функция - Получить соответствие адресов сервиса
// 
// Возвращаемое значение:
//  Соответствие - соответствие адресов сервиса по действию
//
Функция ПолучитьСоответствиеАдресовСервиса() Экспорт
	
	СоответствиеАдресов = Новый Соответствие();
	СоответствиеАдресов.Вставить("ПередатьДанныеОПривезенномЗаказе"      , "/Orders/Arrived");
	СоответствиеАдресов.Вставить("ПередатьДанныеОГотовностиКВыдачеЗаказа", "/Orders/ReadyForSale");
	СоответствиеАдресов.Вставить("ПередатьДанныеОВыкупленномЗаказе"      , "/Orders/Sold");
	СоответствиеАдресов.Вставить("ПередатьДанныеОВозвращенномЗаказе"     , "/Orders/NotSold");
	
	Возврат СоответствиеАдресов;
	
КонецФункции

// Функция - Получить соответствие заголовков HTTPСоединения
// 
// Возвращаемое значение:
//  Соответствие - заголовки HTTP соединения
//
Функция ПолучитьСоответствиеЗаголовковHTTPСоединения() Экспорт
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type"   , "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Connection"     , "keep-alive");
	ЗаголовокHTTP.Вставить("Accept-Charset" , "utf-8");
	
	Возврат ЗаголовокHTTP;
	
КонецФункции

#КонецОбласти