
#Область ОписаниеПеременных

&НаКлиенте
Перем ВебКамера; // Экземпляр работы с камерой.

&НаКлиенте
Перем ДанныеИзменены; // Флаг, характеризующий изменение данных на этапе формы.

&НаКлиенте
Перем ПутьКВременномуФайлу; // Путь к файлу созданном на диске при фото с камерты.

&НаКлиенте
Перем ВременныйАдрес; // Путь к файлу, изпользуется на время создания изображения.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	Если НЕ Параметры.Свойство("СозданиеХарактеристики") Тогда
		ПередаваемыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	Иначе
		ПередаваемыйОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		Если Параметры.Свойство("ТекущаяНоменклатура") Тогда
			ПередаваемыйОбъект.Владелец = Параметры.ТекущаяНоменклатура;
		КонецЕсли;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("Объект", ПередаваемыйОбъект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Элементы.ГруппаИспользованияХарактеристик.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	// Инициализация реквизитов
	ТекущееДействие = "ВыборРежима";
	ВебКамера       = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	
	ИспользоватьОтраслевогоПроизводителя = Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ор_Производитель") <> Неопределено;
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	ИспользованиеВебКамеры               = ИспользоватьПодключаемоеОборудование И ЗначениеЗаполнено(ВебКамера);
	
	// Инициализация отраслевых реквизитов
	ПриСозданииНаСервереОтраслевой();
	
	// Создание реквизитов и элементов формы
	СформироватьПараметрыИСоздатьРеквизиты();
	
	// Заполнение реквизитов по полученым параметрам
	Параметры.Свойство("Склад",                      Склад);
	Параметры.Свойство("Магазин",                    Магазин);
	Параметры.Свойство("ВызовИзСписка",              ВызовИзСписка);
	// ПоказыватьПолеВидЦены - При вызове обработки из документа "Установка цен номенклатуры"
	Параметры.Свойство("ПоказыватьПолеВидЦены",      ПоказыватьПолеВидЦены);
	Параметры.Свойство("ИмяТЧ",                      ИмяТЧ);
	Параметры.Свойство("ТекущаяНоменклатура",        ЭтотОбъект.Номенклатура);
	Параметры.Свойство("СозданиеТолькоНоменклатуры", СозданиеТолькоНоменклатуры);
	
	// Настройка элементов
	Элементы.ВидЦены.Видимость = ПоказыватьПолеВидЦены;
	
	Если ПоказыватьПолеВидЦены Тогда
		Элементы.ВидЦены.СписокВыбора.Очистить();
		Для Каждого Цена Из Параметры.ВидыЦен Цикл
			ИспользуемыеВидыЦен.Добавить(Цена.Ссылка,Цена.Наименование);
		КонецЦикла;
	КонецЕсли;
	
	// Обработка дополнительных параметров, при вызовах не из списка
	Если СозданиеТолькоНоменклатуры Тогда
		РежимСоздания = 0;
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда 
		РежимСоздания = 1;
		
		// Для создания характеристики необязательно выполнять инициализацию всех параметров
		// поэтому устанавливаем только КатегорияНоменклатуры
		ЭтотОбъект.КатегорияНоменклатуры = ЭтотОбъект.Номенклатура.КатегорияНоменклатуры;
		ИспользуютсяХарактеристики = ИспользуютсяХарактеристикиНоменклатуры(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры);
		ПроверятьЗаполнениеХарактеристики = ПроверятьЗаполнениеХарактеристики(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры);
		Если ИспользуютсяХарактеристики Тогда
			ТекущееДействие = "СозданиеНоменклатуры";
			Элементы.СтраницыЭтапов.ТекущаяСтраница = Элементы.СтраницаСозданиеНоменклатуры;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДанныеИзменены = Ложь;
	
	Если СозданиеТолькоНоменклатуры ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		Далее(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование
	Если ИспользованиеВебКамеры Тогда
		
		Описание = Новый ОписаниеОповещения("ОтключениеВидеокамерыЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоИдентификатору(Описание, ЭтотОбъект.УникальныйИдентификатор, ВебКамера);
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="Запись_Файл" Тогда		
		СсылкаНаФайл = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
		Если ВыборИзображения Тогда
			ЗаписатьКартинкуНоменклатуры(СсылкаНаФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если НЕ ЭтотОбъект.Свойства_ИспользоватьСвойства
		ИЛИ НЕ ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСправочника = "";
	Если ТекущееДействие = "СозданиеНоменклатуры" Тогда
		ИмяСправочника = "Номенклатура";
	ИначеЕсли ТекущееДействие = "СозданиеХарактеристики" Тогда
		ИмяСправочника = "ХарактеристикиНоменклатуры";
	КонецЕсли;

	Если ПустаяСтрока(ИмяСправочника) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОбъекта = СтруктураОбъектаМетаданных(ИмяСправочника);
	Префикс          = ?(ИмяСправочника = "ХарактеристикиНоменклатуры","Характеристика",ИмяСправочника);
	ЗаполнитьСтруктуруОбъекта(СтруктураОбъекта, Префикс);
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект,СтруктураОбъекта);
	ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ИспользуемыеВидыЦен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенникаПриИзменении(Элемент)
	
	Если НЕ Объект.ПечатьЦенника Тогда
		ОчиститьПараметрыПечати();
	КонецЕсли;
	УстановитьДоступностьПараметровПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранятьЗначениеПриИзменении(Элемент, ИзмененоПользователем = Истина)
	
	ИмяРеквизита = СтрЗаменить(Элемент.Имя, "СохранятьЗначение", "");
	ЭлементРеквизита = Элементы[ИмяРеквизита];
	
	ЗначениеСохранения = ЭтотОбъект[Элемент.Имя];
	ЭлементРеквизита.ПропускатьПриВводе = ЗначениеСохранения;
	
	Если ИзмененоПользователем Тогда
		Если СохраненныеПользователемЭлементы.НайтиПоЗначению(ИмяРеквизита) = Неопределено Тогда
			СохраненныеПользователемЭлементы.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыВыбраннойНоменклатуры();
	НастроитьЭлементыПоЗаполненнымЗначениям();
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНоменклатурыПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыВыбранногоКатегорииНоменклатуры();
	НастроитьЭлементыПоЗаполненнымЗначениям();
	ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.КатегорииНоменклатуры.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита(Элемент)
	
	Если ПриИзмененииРеквизитаНаСервере(Элемент.Имя) Тогда
		СохранятьЗначениеПриИзменении(Элементы["СохранятьЗначение" + Элемент.Имя], Ложь);
	КонецЕсли;
	
	ДанныеИзменены = Истина;
	ЭтотОбъект.Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаНаСервере(ИмяЭлемента)
	
	ОбновитьПараметрПравилНаименования(ИмяЭлемента);
	
	Возврат ОбновитьЗначениеСохранения(ИмяЭлемента);
	
КонецФункции

&НаКлиенте
Процедура ор_ПравилоНаименованияПриИзменении(Элемент)
	
	ор_ПравилоНаименованияПриИзмененииНаСервере(Элемент.Имя);
	УстановитьВидимостьНаименования();
	ПриИзмененииРеквизита(Элемент);
	ОбновитьАвтоОтметкуНеЗаполненногоВПараметрахПравил();
	
КонецПроцедуры

&НаСервере
Процедура ор_ПравилоНаименованияПриИзмененииНаСервере(ИмяЭлемента)
	
	СоздатьРеквизитыИПоляФормыПравила(ЭтоШаблонНаименованияХарактеристики(ИмяЭлемента));
	ЗаполнитьПараметрыПравилаИменованияСервер();
	ОбновитьЗначенияПравилНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ор_ПравилоНаименованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДляХарактеристики = ЭтоШаблонНаименованияХарактеристики(Элемент.Имя);
	Если ДляХарактеристики Тогда
		Объект.НаборСвойств = ПолучитьНаборСвойствХарактеристик(ЭтотОбъект.КатегорияНоменклатуры);
	Иначе
		Объект.НаборСвойств = ПолучитьНаборСвойств(ЭтотОбъект.КатегорияНоменклатуры);
	КонецЕсли;
	ВидНаименования = ВидНаименованияШаблонаНаименований(Элемент.Имя);
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	СтруктураОтбора.Вставить("КатегорияНоменклатуры", ЭтотОбъект.КатегорияНоменклатуры);
	СтруктураОтбора.Вставить("ДляХарактеристики", ДляХарактеристики);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("НаборСвойств", Объект.НаборСвойств);
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", ЭтотОбъект[Элемент.Имя]);
	ПараметрыОткрытия.Вставить("ВидНаименования", ВидНаименования);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораПравилЗавершение", ЭтотОбъект, Элемент.Имя);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ор_ПравилоНаименованияСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметровОповещения = Новый Структура;
	СтруктураПараметровОповещения.Вставить("ИмяЭлемента", Элемент.Имя);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КатегорияНоменклатуры", ЭтотОбъект.КатегорияНоменклатуры);
	ПараметрыОткрытия.Вставить("ВидНаименования", ВидНаименованияШаблонаНаименований(Элемент.Имя));
	ПараметрыОткрытия.Свойство("ДляХарактеристики", ЭтоШаблонНаименованияХарактеристики(Элемент.Имя));
	
	ОткрытьФорму(
		"Справочник.ШаблоныНаименований.Форма.ФормаЭлемента",
		ПараметрыОткрытия,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеИспользоватьХарактеристикиПриИзменении(Элемент)
	
	Если Не ИспользуютсяХарактеристики Тогда
		ПроверятьЗаполнениеХарактеристики = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПолеПроверятьЗаполнениеХарактеристики",
		"Доступность",
		ИспользуютсяХарактеристики);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖНВЛППриИзменении(Элемент)
	
	ПриИзмененииРеквизита(Элемент);
	
	ПроверитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзготовленияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаИзготовления) Тогда
		ЭтотОбъект.СрокХранения = 0;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) И ЭтотОбъект.ДатаИзготовления > ЭтотОбъект.СрокГодности Тогда
		Сообщение = НСтр("ru = 'Срок годности не может быть больше даты изготовления!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		ЭтотОбъект.СрокХранения = 0;
		ЭтотОбъект.СрокГодности = НачалоДня(ЭтотОбъект.ДатаИзготовления + ЭтотОбъект.СрокХранения * 86400);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) И ЗначениеЗаполнено(ЭтотОбъект.СрокХранения) Тогда
		ЭтотОбъект.СрокХранения = Цел((ЭтотОбъект.СрокГодности-НачалоДня(ЭтотОбъект.ДатаИзготовления)) / 86400);
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) Тогда
		ЭтотОбъект.СрокХранения = Цел((ЭтотОбъект.СрокГодности-НачалоДня(ЭтотОбъект.ДатаИзготовления)) / 86400);
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СрокХранения) Тогда
		ЭтотОбъект.СрокГодности=НачалоДня(ЭтотОбъект.ДатаИзготовления + ЭтотОбъект.СрокХранения * 86400);
	КонецЕсли;
	
	ПриИзмененииРеквизита(Элемент);
	ПриИзмененииРеквизита(Элементы.СрокГодности);
	
	Элементы.СрокГодности.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ЭтотОбъект.СрокГодности);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокХраненияПриИзменении(Элемент)
	
	ПриИзмененииРеквизита(Элемент);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИзготовления) И ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) Тогда
		ЭтотОбъект.СрокГодности=НачалоДня(ЭтотОбъект.ДатаИзготовления + ЭтотОбъект.СрокХранения * 86400);
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДатаИзготовления) Тогда
		ЭтотОбъект.СрокГодности=НачалоДня(ЭтотОбъект.ДатаИзготовления + ЭтотОбъект.СрокХранения * 86400);
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) Тогда
		ЭтотОбъект.ДатаИзготовления=НачалоДня(ЭтотОбъект.СрокГодности - ЭтотОбъект.СрокХранения * 86400);
	Иначе
		ЭтотОбъект.СрокХранения = 0;
	КонецЕсли;
	
	ПриИзмененииРеквизита(Элементы.СрокГодности);
	Элементы.СрокГодности.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ЭтотОбъект.СрокГодности);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокГодностиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) Тогда
		ЭтотОбъект.СрокХранения = 0;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИзготовления) И ЭтотОбъект.ДатаИзготовления > ЭтотОбъект.СрокГодности Тогда
		Сообщение = НСтр("ru = 'Срок годности не может быть больше даты изготовления!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		ЭтотОбъект.СрокХранения = 0;
		ЭтотОбъект.СрокГодности = НачалоДня(ЭтотОбъект.ДатаИзготовления + ЭтотОбъект.СрокХранения * 86400);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИзготовления) И ЗначениеЗаполнено(ЭтотОбъект.СрокХранения) Тогда
		ЭтотОбъект.СрокХранения = Цел((ЭтотОбъект.СрокГодности-НачалоДня(ЭтотОбъект.ДатаИзготовления))/86400);
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДатаИзготовления) Тогда
		ЭтотОбъект.СрокХранения = Цел((ЭтотОбъект.СрокГодности-НачалоДня(ЭтотОбъект.ДатаИзготовления))/86400);
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.СрокХранения) Тогда
		ЭтотОбъект.ДатаИзготовления=НачалоДня(ЭтотОбъект.СрокГодности-ЭтотОбъект.СрокХранения*86400);
	КонецЕсли;
	
	Если ЭтотОбъект.СрокГодности < НачалоДня(ТекущаяДата()) Тогда
		Сообщение = НСтр("ru = '" + "Срок годности истек: " + Формат(ЭтотОбъект.СрокГодности,"ДФ=dd.MM.yyyy") + "'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	КонецЕсли;
	
	ПриИзмененииРеквизита(Элемент);
	
	Элементы.СрокГодности.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ЭтотОбъект.СрокГодности);
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПроизводителяПриИзменении(Элемент)
	
	ПриИзмененииРеквизита(Элемент);
	Элементы.СерияПроизводителя.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ЭтотОбъект.СерияПроизводителя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	ОчиститьСообщения();
	РежимОдиночногоСоздания     = РежимСоздания = 0;
	РежимВыбораНоменклатуры     = РежимСоздания = 1;
	РежимМножественногоСоздания = РежимСоздания = 2;
	
	Если ТекущееДействие = "ВыборРежима" Тогда
		Если Объект.ПечатьЦенника И НЕ ЗначениеЗаполнено(Шаблон) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран шаблон печати",, "Шаблон");
			Возврат;
		КонецЕсли;
		
		ТекущееДействие = "СозданиеНоменклатуры";
		
	ИначеЕсли ТекущееДействие = "СозданиеНоменклатуры" Тогда
		
		Если РежимВыбораНоменклатуры Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана номенклатура",, "Номенклатура");
				Возврат;
			КонецЕсли;
			
			Если Не ИспользуютсяХарактеристики Тогда
				ПоказатьПредупреждение(,"Для данной номенклатуры не используются характеристики.",,
					"Ошибка выполнения");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если СоздаватьИзображения И ЕстьОшибкиПараметровНоменклатуры() Тогда
			Возврат;
		КонецЕсли;
		
		Если Не РежимВыбораНоменклатуры И Не СоздаватьИзображения Тогда
			НоменклатураСоздана = СоздатьНоменклатуру();
			
			Если Не НоменклатураСоздана Тогда
				Возврат;
			КонецЕсли;
			
			ТекстСообщения = НСтр(СтрШаблон("ru = 'Номенклатура <%1> успешно создана!'", ЭтотОбъект.Номенклатура));
			ПоказатьОповещениеПользователя("Создание номенклатуры",,ТекстСообщения);
		КонецЕсли;
		
		Если Не РежимВыбораНоменклатуры И СоздаватьИзображения Тогда
			ТекущееДействие = "СозданиеИзображения";
		Иначе
			ПереходССозданияНоменклатуры();
		КонецЕсли;
		
	ИначеЕсли ТекущееДействие = "СозданиеИзображения" Тогда
		
		Если Не СоздатьНоменклатуру() Тогда
			ПослеЗакрытияВопросаНазад(,);
			Возврат;
		КонецЕсли;
		
		ТекстСообщения = НСтр(СтрШаблон("ru = 'Номенклатура <%1> успешно создана!'", ЭтотОбъект.Номенклатура));
		ПоказатьОповещениеПользователя("Создание номенклатуры",, ТекстСообщения);
	
		Если ЗначениеЗаполнено(АдресИзображения) И ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
			ДобавитьИзображениеВХранилище();
			ИзображениеОчистить(Истина);
		КонецЕсли;
		
		ПереходССозданияНоменклатуры();
		
	ИначеЕсли ТекущееДействие = "СозданиеХарактеристики" Тогда
		Если СоздатьХарактеристику() Тогда
			ТекстСообщения = НСтр(СтрШаблон("ru = 'Характеристика <%1> успешно создана!'", ЭтотОбъект.Характеристика));
			ПоказатьОповещениеПользователя("Создание характеристики",,ТекстСообщения);
			
			ОчиститьРеквизитыИОбновитьПравила();
			ОбновитьАвтоОтметкуНеЗаполненногоВПараметрахПравил();
			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеИзменены = Ложь;
	НастроитьЭлементыПоШагу();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если ТекущееДействие <> "СозданиеИзображения" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНазад", ЭтотОбъект);
		ПоказатьВопросИзмененныхДанных(Оповещение);
	Иначе
		ПослеЗакрытияВопросаНазад(,);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаНазад(Результат, Параметры) Экспорт
	
	ДанныеИзменены = Ложь;
	РежимМножественногоСоздания = РежимСоздания = 2;
	Если РежимМножественногоСоздания И ТекущееДействие = "СозданиеХарактеристики" Тогда
		
		ТекущееДействие = "СозданиеНоменклатуры";
		ОчиститьРеквизитыИПерезаписатьПравила(Истина, Ложь, Истина, Ложь, Истина);
		ОбновитьАвтоОтметкуНеЗаполненногоВПараметрахПравил();
		
	ИначеЕсли ТекущееДействие = "СозданиеИзображения" Тогда
		
		ТекущееДействие = "СозданиеНоменклатуры";
		
	Иначе
		
		ТекущееДействие = "ВыборРежима";
		
		ОчиститьРеквизитыИОбновитьПравила(Истина);
		СохраненныеПользователемЭлементы.Очистить();
		
	КонецЕсли;
	
	НастроитьЭлементыПоШагу();
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаГотово", ЭтотОбъект);
	ПоказатьВопросИзмененныхДанных(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаГотово(Результат, Параметры) Экспорт
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеОткрытьНаДиске(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = "";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите изображение для загрузки";
	Диалог.Фильтр = РаботаСФайламиУНФКлиентСервер.ФильтрФайловИзображений();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
	//    ИзображениеПосмотреть(Неопределено);
	// Иначе
	ИзображениеОткрытьНаДиске(Неопределено);
	// КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеОчистить(Команда)
	
	Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		УдалитьИзВременногоХранилища(АдресИзображения);
	КонецЕсли;
	АдресИзображения = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПолучитьСКамеры(Команда)
	
	#Если ВебКлиент Тогда
		ОписаниеОшибки = НСтр("ru='Система  управления оборудование не поддерживает работу в режиме Web-клиента.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	#КонецЕсли
	
	// ToDo:
	// Убрать когда появитсья интеграция камеры.
	Возврат;
	Если ИспользованиеВебКамеры Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("Форма", ЭтотОбъект);
		Контекст.Вставить("АдресФото", "");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПолучениеФотоЗавершение", ЭтотОбъект, Контекст);
		
		//ор_ФотоВидеофиксацияКлиент.НачатьПолучениеФото(ОписаниеОповещения, ЭтотОбъект.УникальныйИдентификатор, Ложь);
	Иначе
		
		ОписаниеОшибки = НСтр("ru='Укажите веб-камеру для фото номенклатуры.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
		
	КонецЕсли;
	
	Попытка
		Если Не ПустаяСтрока(Контекст.АдресФото) Тогда
			АдресИзображения = Контекст.АдресФото;
		КонецЕсли;
	Исключение
		ПоказатьПредупреждение(,НСтр("ru = 'Не удалось получить изображение!'"));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПосмотреть(Команда)
	
	Если ЗначениеЗаполнено(АдресИзображения) И ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("Обработка.ор_СозданиеНоменклатуры.Форма.ФормаПросмотраИзображения",, ЭтотОбъект,,,,,Режим);
	Иначе
		ТекстСообщения = НСтр("ru='""Файл картинки отсутствует"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СозданиеРеквизитовИЭлементов

// Процедура - Создать реквизиты и поля к ним по заданным параметрам
//
// Параметры:
//  МассивРеквизитов - Массив из Структура - Массив структур свойств реквизитов.
//                     Стандартную структуру можно получить в "ПолучитьШаблонСтандартногоРеквизита" 
//
&НаСервере
Процедура СоздатьРеквизитыИПоляФормы(МассивРеквизитов)
	
	// Пакетное создание реквизитов
	СоздаваемыеРеквизиты = Новый Массив;
	Для Каждого НовыйРеквизит Из МассивРеквизитов Цикл
		
		Реквизит = Новый РеквизитФормы(НовыйРеквизит.ИмяРеквизита, НовыйРеквизит.ТипРеквизита, , НовыйРеквизит.Заголовок, Истина);
		СоздаваемыеРеквизиты.Добавить(Реквизит);
		
		Если НовыйРеквизит.Сохраняемыйреквизит Тогда
			Реквизит = Новый РеквизитФормы("СохранятьЗначение" + НовыйРеквизит.ИмяРеквизита, Новый ОписаниеТипов("Булево"), , НовыйРеквизит.Заголовок, Истина);
			СоздаваемыеРеквизиты.Добавить(Реквизит);
		КонецЕсли;
		
		Если НовыйРеквизит.ЭтоПравилоНаименования Тогда
			Реквизит = Новый РеквизитФормы("ЗначениеНаименования" + НовыйРеквизит.ИмяРеквизита, Новый ОписаниеТипов("Строка"), , "", Истина); 
			СоздаваемыеРеквизиты.Добавить(Реквизит);
		КонецЕсли;
		
	КонецЦикла;
	ИзменитьРеквизиты(СоздаваемыеРеквизиты);
	
	Для Каждого НовыйРеквизит Из МассивРеквизитов Цикл
		
		Если Не НовыйРеквизит.СоздаватьЭлементНаФорме Тогда
			Продолжить;
		КонецЕсли;
		
		Если НовыйРеквизит.Сохраняемыйреквизит Тогда
			ГруппаСохранения = СоздатьЭлементыФормыСохраненияДанных(НовыйРеквизит.ИмяРеквизита, НовыйРеквизит.Группа);
			Элемент = Элементы.Вставить(НовыйРеквизит.ИмяРеквизита, Тип(НовыйРеквизит.ТипЭлемента), ГруппаСохранения, ГруппаСохранения.ПодчиненныеЭлементы[0]);
		Иначе
			Элемент = Элементы.Добавить(НовыйРеквизит.ИмяРеквизита, Тип(НовыйРеквизит.ТипЭлемента), НовыйРеквизит.Группа);
		КонецЕсли;
		
		// Создадим элемент формы связанный с созданным реквизитом, укажим его свойства.
		Если НовыйРеквизит.ЭтоПолеФлажка Тогда
			Элемент.Вид       = ВидПоляФормы.ПолеФлажка;
			Элемент.ВидФлажка = ВидФлажка.Выключатель;
		Иначе
			Элемент.Вид                      = ВидПоляФормы.ПолеВвода;
			Элемент.РастягиватьПоГоризонтали = Истина;
			Элемент.АвтоМаксимальнаяШирина   = Ложь;
			Элемент.КнопкаОткрытия           = НовыйРеквизит.КнопкаОткрытия;
			Элемент.КнопкаОчистки            = НовыйРеквизит.КнопкаОчистки;
			Элемент.КнопкаВыпадающегоСписка  = НовыйРеквизит.КнопкаВыпадающегоСписка;
			Элемент.КнопкаСпискаВыбора       = НовыйРеквизит.КнопкаСпискаВыбора;
			Элемент.КнопкаВыбора             = НовыйРеквизит.КнопкаВыбора;
			Элемент.ВыборГруппИЭлементов     = НовыйРеквизит.ВыборГруппИЭлементов;
			Элемент.ОтметкаНезаполненного    = НовыйРеквизит.ОтметкаНезаполненного;
			Элемент.РедактированиеТекста     = НовыйРеквизит.РедактированиеТекста;
		КонецЕсли;
		
		Элемент.Доступность          = НовыйРеквизит.Доступность;
		Элемент.Подсказка            = НовыйРеквизит.Подсказка;
		Элемент.ОтображениеПодсказки = НовыйРеквизит.ОтображениеПодсказки;
		Элемент.ПутьКДанным          = НовыйРеквизит.ИмяРеквизита;
		Элемент.ПропускатьПриВводе   = НовыйРеквизит.ПропускатьПриВводе;
		
		// Установим обработчики событий элемента, по указанным в настройках соответствиям.
		Для Каждого Событие Из НовыйРеквизит.ОбрабатываемыеСобытия Цикл
			Элемент.УстановитьДействие(Событие.Ключ,Событие.Значение);
		КонецЦикла;
		
		Если НовыйРеквизит.ЭтоПравилоНаименования Тогда
			ГруппаЗначения = Элементы.Добавить("ГруппаЗначение" + НовыйРеквизит.ИмяРеквизита, Тип("ГруппаФормы"), НовыйРеквизит.Группа);
			ГруппаЗначения.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЗначения.ОтображатьЗаголовок = Ложь;
			ГруппаЗначения.Объединенная        = Ложь;
			ГруппаЗначения.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			
			ИмяРеквизитаЗначения = "ЗначениеНаименования" + НовыйРеквизит.ИмяРеквизита;
			
			Элемент = Элементы.Добавить(ИмяРеквизитаЗначения, Тип("ПолеФормы"), ГруппаЗначения);
			Элемент.Вид                      = ВидПоляФормы.ПолеНадписи;
			Элемент.Доступность              = Истина;
			Элемент.Видимость                = Ложь;
			Элемент.РастягиватьПоГоризонтали = Истина;
			Элемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.АвтоМаксимальнаяШирина   = Ложь;
			Элемент.ПутьКДанным              = ИмяРеквизитаЗначения;
			Элемент.ЦветТекста               = ЦветаСтиля.ЦветТекстаФормы;
			Элемент.Шрифт                    = Новый Шрифт(, 8, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить структуру стандартного реквизита для передачи в "СоздатьРеквизитыИПоляФормы" 
// 
// Возвращаемое значение:
// Структура - Структура стандартного реквизита
//
&НаСервере
Функция ПолучитьШаблонСтандартногоРеквизита()
	
	ПараметрыРеквизита = Новый Структура();
	ПараметрыРеквизита.Вставить("ИмяРеквизита",            "");
	ПараметрыРеквизита.Вставить("ПропускатьПриВводе",      Ложь);
	ПараметрыРеквизита.Вставить("Заголовок",               "");                           // Заголовок создаваемого реквизита, при создании элемента на форме будет отображен указанный заголовок
	ПараметрыРеквизита.Вставить("Подсказка",               "");
	ПараметрыРеквизита.Вставить("ОтображениеПодсказки",    ОтображениеПодсказки.Нет);
	ПараметрыРеквизита.Вставить("ВыборГруппИЭлементов",    ГруппыИЭлементы.Авто);         // Вид отображания и выбора(Элементы, группы, группы и элементы, авто)
	ПараметрыРеквизита.Вставить("Доступность",             Истина);
	ПараметрыРеквизита.Вставить("ТипРеквизита",            Новый ОписаниеТипов("Строка"));// Указывается тип создаваемого реквизита
	ПараметрыРеквизита.Вставить("Группа",                  ЭтотОбъект);                     // Группа(родитель), в которую будет помещен новый элемент.
	ПараметрыРеквизита.Вставить("РедактированиеТекста",    Истина);                       // Разрешение на ввод текста с клавиатуры в данном элементе
	ПараметрыРеквизита.Вставить("КнопкаОчистки",           Истина);
	ПараметрыРеквизита.Вставить("КнопкаВыпадающегоСписка", Истина);
	ПараметрыРеквизита.Вставить("КнопкаОткрытия",          Ложь);
	ПараметрыРеквизита.Вставить("КнопкаВыбора",            Истина);
	ПараметрыРеквизита.Вставить("КнопкаСпискаВыбора",      Ложь);
	ПараметрыРеквизита.Вставить("ОтметкаНезаполненного",   Ложь);
	ПараметрыРеквизита.Вставить("ОбрабатываемыеСобытия",   Новый Соответствие());          // Соответствие обрабатываемых событий элемента и их обработчиков
	ПараметрыРеквизита.Вставить("ТипЭлемента",             "ПолеФормы");                   // Тип элемента создаваемого на форме
	ПараметрыРеквизита.Вставить("СохраняемыйРеквизит",     Истина);                        // При указании данного флага, будет созданна подгруппа, в которую будет помещен создаваемый элемент и булево значение с префиксом "СохранятьЗначение"+имя реквизита. В дальнейшем используется для пропуска заполненных полей
	ПараметрыРеквизита.Вставить("СоздаватьЭлементНаФорме", Истина);                        // Используется, если требуется создать ТОЛЬКО реквизит, без его отображения на форме и флага сохранения.
	ПараметрыРеквизита.Вставить("ЭтоПравилоНаименования",  Ложь);
	ПараметрыРеквизита.Вставить("ЭтоПолеФлажка",           Ложь);
	
	Возврат ПараметрыРеквизита;
	
КонецФункции

&НаСервере
Процедура СформироватьПараметрыИСоздатьРеквизиты()
	
	// !СозданиеРеквизитов
	// Массив, в который добавляются шаблоны создаваемых реквизитов
	ПараметрыСоздаваемыхРеквизитов = Новый Массив();

	СформироватьСтандартныеРевизиты(ПараметрыСоздаваемыхРеквизитов);
	СформироватьОтраслевыеРеквизиты(ПараметрыСоздаваемыхРеквизитов);
	
	// Создадим реквизиты и элементы по заполненным настройкам.
	СоздатьРеквизитыИПоляФормы(ПараметрыСоздаваемыхРеквизитов);
	
	СоздатьДополнительныеСтандартныеЭлементы();
	СоздатьДополнительныеОтраслевыеЭлементы();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтандартныеРевизиты(ПараметрыРеквизитов)
	
	#Область РеквизитыНоменклатуры
	
	// Реквизиты номенклатуры следует помещать в две группы столбцов ГруппаОсновныеПараметры
	// Формируем стандартный набор настроек создания реквизитов
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "КатегорияНоменклатуры";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Категория номенклатуры'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Указывается категория, к которой следует отнести данную позицию номенклатуры.'");
	// Группа, в которую будет помещен новый элемент. !!!Группы создаются вручную!!!
	НовыйРеквизит.Группа       = Элементы.ГруппаОсновныеПараметрыЛевыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.КатегорииНоменклатуры"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОтметкаНезаполненного = Истина;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "КатегорияНоменклатурыПриИзменении");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("НачалоВыбора", "КатегорияНоменклатурыНачалоВыбора");
	// Добавляем настройку в массив, для последующего создания реквизита и элементов
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ЕдиницаИзмерения";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Единица измерения'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Единица измерения по классификатору, в которой осуществляется учет и хранение позиции номенклатуры.'");
	НовыйРеквизит.Группа       = Элементы.ГруппаОсновныеПараметрыЛевыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОтметкаНезаполненного = Истина;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ГруппаНоменклатуры";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Группа номенклатуры'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Группа, в которую входит данная позиция номенклатуры.'");
	НовыйРеквизит.Группа       = Элементы.ГруппаОсновныеПараметрыПравыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита   = "ЦеноваяГруппа";
	НовыйРеквизит.Заголовок      = НСтр("ru = 'Ценовая группа'");
	НовыйРеквизит.Подсказка      = НСтр("ru = 'Определяет ценовую группу, к которой относится номенклатурная позиция.'");
	НовыйРеквизит.КнопкаОткрытия = Истина;
	НовыйРеквизит.КнопкаОчистки  = Ложь;
	НовыйРеквизит.Группа         = Элементы.ГруппаОсновныеПараметрыПравыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ЦеновыеГруппы"));
	НовыйРеквизит.ТипРеквизита   = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита  = "Артикул";
	НовыйРеквизит.Заголовок     = НСтр("ru = 'Артикул'");
	НовыйРеквизит.Подсказка     = НСтр("ru = 'Артикул номенклатуры.'");
	НовыйРеквизит.Группа        = Элементы.ГруппаДополнительныеПараметрыЛевыйСтолбец;
	НовыйРеквизит.КнопкаОчистки = Ложь;
	НовыйРеквизит.КнопкаВыбора  = Ложь;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Строка"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов,,,,Новый КвалификаторыСтроки(25));
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ВидЦены";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Вид цены'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Вид цены товара'");
	НовыйРеквизит.Группа       = Элементы.ГруппаДополнительныеПараметрыПравыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыЦен"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаСпискаВыбора      = Истина;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Истина;
	НовыйРеквизит.СохраняемыйРеквизит     = Ложь;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("НачалоВыбора", "ВидЦеныНачалоВыбора");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "Цена";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Цена'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Общая цена'");
	НовыйРеквизит.Группа       = Элементы.ГруппаДополнительныеПараметрыПравыйСтолбец;
	НовыйРеквизит.КнопкаВыбора = Истина;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Число"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов,,,Новый КвалификаторыЧисла(15,2));
	НовыйРеквизит.КнопкаОчистки           = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.СохраняемыйРеквизит     = Ложь;
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ЦенаХарактеристики";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Цена'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Цена характеристики'");
	НовыйРеквизит.Группа       = Элементы.ГруппаПараметрыХарактеристикиПравыйСтолбец;
	НовыйРеквизит.КнопкаВыбора = Истина;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Число"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов,,,Новый КвалификаторыЧисла(15,2));
	НовыйРеквизит.КнопкаОчистки           = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.СохраняемыйРеквизит     = Ложь;
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "Номенклатура";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Номенклатура'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Существующая номенклатура для выбора.'");
	НовыйРеквизит.Группа       = ЭтотОбъект.Элементы.ГруппаНоменклатураВыбора;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаСпискаВыбора  = Истина;
	НовыйРеквизит.КнопкаОткрытия      = Истина;
	НовыйРеквизит.КнопкаОчистки       = Ложь;
	НовыйРеквизит.СохраняемыйРеквизит = Ложь;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "НоменклатураПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ор_ПравилоКраткогоНаименования";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Шаблон краткого наименования'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Доступные для выбора правила зависят от выбранной категории номенклатуры'");
	НовыйРеквизит.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйРеквизит.Группа       = Элементы.ГруппаПравилоКраткогоНаименования;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ШаблоныНаименований"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаСпискаВыбора      = Истина;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Истина;
	НовыйРеквизит.СохраняемыйРеквизит     = Истина;
	НовыйРеквизит.ПропускатьПриВводе      = Истина;
	НовыйРеквизит.ЭтоПравилоНаименования  = Истина;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("НачалоВыбора", "ор_ПравилоНаименованияНачалоВыбора");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("Создание", "ор_ПравилоНаименованияСоздание");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ор_ПравилоНаименованияПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ор_ПравилоПолногоНаименования";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Шаблон полного наименования'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Доступные для выбора правила зависят от выбранной категории номенклатуры'");
	НовыйРеквизит.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйРеквизит.Группа       = Элементы.ГруппаПравилоПолногоНаименования;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ШаблоныНаименований"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаСпискаВыбора      = Истина;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Истина;
	НовыйРеквизит.СохраняемыйРеквизит     = Истина;
	НовыйРеквизит.ПропускатьПриВводе      = Истина;
	НовыйРеквизит.ЭтоПравилоНаименования  = Истина;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("НачалоВыбора", "ор_ПравилоНаименованияНачалоВыбора");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("Создание", "ор_ПравилоНаименованияСоздание");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ор_ПравилоНаименованияПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ор_ПравилоНаименованияХарактеристики";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Шаблон наименования характеристики'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Доступные для выбора правила зависят от выбранной категории номенклатуры'");
	НовыйРеквизит.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйРеквизит.Группа       = Элементы.ГруппаПравилоНаименованиеХарактеристики;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ШаблоныНаименований"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаСпискаВыбора      = Истина;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Истина;
	НовыйРеквизит.СохраняемыйРеквизит     = Истина;
	НовыйРеквизит.ПропускатьПриВводе      = Истина;
	НовыйРеквизит.ЭтоПравилоНаименования  = Истина;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("НачалоВыбора", "ор_ПравилоНаименованияНачалоВыбора");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("Создание", "ор_ПравилоНаименованияСоздание");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ор_ПравилоНаименованияПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ор_ПравилоНаименованияХарактеристикиДляПечати";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Шаблон наименования характеристики для печати'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Доступные для выбора правила зависят от выбранной категории номенклатуры'");
	НовыйРеквизит.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйРеквизит.Группа       = Элементы.ГруппаПравилоНаименованиеХарактеристики;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ШаблоныНаименований"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаСпискаВыбора      = Истина;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Истина;
	НовыйРеквизит.СохраняемыйРеквизит     = Истина;
	НовыйРеквизит.ПропускатьПриВводе      = Истина;
	НовыйРеквизит.ЭтоПравилоНаименования  = Истина;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("НачалоВыбора", "ор_ПравилоНаименованияНачалоВыбора");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("Создание", "ор_ПравилоНаименованияСоздание");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ор_ПравилоНаименованияПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	Элементы.ГруппаПравилаНаименования.ОтображатьЗаголовок = Ложь;
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "Наименование";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Наименование'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Наименование'");
	НовыйРеквизит.Группа       = Элементы.ГруппаНаименования;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Строка"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.КнопкаВыбора            = Ложь;
	НовыйРеквизит.СохраняемыйРеквизит     = Ложь;
	НовыйРеквизит.КнопкаСпискаВыбора      = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ПропускатьПриВводе      = Ложь;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	Элементы.ГруппаПравилоНаименованиеХарактеристики.ОтображатьЗаголовок = Ложь;
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "НаименованиеХарактеристики";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Наименование'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Наименование характеристики'");
	НовыйРеквизит.Группа       = Элементы.ГруппаПравилоНаименованиеХарактеристики;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Строка"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.СохраняемыйРеквизит     = Ложь;
	НовыйРеквизит.КнопкаВыбора            = Ложь;
	НовыйРеквизит.КнопкаСпискаВыбора      = Ложь;
	НовыйРеквизит.КнопкаСпискаВыбора      = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ПропускатьПриВводе      = Ложь;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	#КонецОбласти
	
	#Область СлужебныеРеквизиты
	
	// Создадим неотображаемые реквизиты
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "Характеристика";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Характеристика'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Если у выбранной номенклатуры используются характеристики, то необходимо выбрать характеристику номенклатуры.'");
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ПропускатьПриВводе      = Истина;
	НовыйРеквизит.СоздаватьЭлементНаФорме = Ложь;
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДополнительныеСтандартныеЭлементы()
	
	ПервыйЭлемент = Элементы.СтраницаСозданиеХарактеристик.ПодчиненныеЭлементы[0];
	
	ПолеНоменклатуры = Элементы.Вставить(
		"ВыбраннаяНоменклатура",
		Тип("ПолеФормы"),
		Элементы.СтраницаСозданиеХарактеристик,
		ПервыйЭлемент);
	ПолеНоменклатуры.ПутьКДанным              = "Номенклатура";
	ПолеНоменклатуры.Вид                      = ВидПоляФормы.ПолеВвода;
	ПолеНоменклатуры.ТолькоПросмотр           = Истина;
	ПолеНоменклатуры.Заголовок                = НСтр("ru = 'Номенклатура'");
	ПолеНоменклатуры.Подсказка                = НСтр("ru = 'Номенклатура, для которой создаются характеристики'");
	ПолеНоменклатуры.АвтоМаксимальнаяШирина   = Ложь;
	ПолеНоменклатуры.РастягиватьПоГоризонтали = Истина;
	
	// Настройка созданных элементов
	Элементы.КатегорияНоменклатуры.АвтоОтметкаНезаполненного = Истина;
	Элементы.ЕдиницаИзмерения.АвтоОтметкаНезаполненного = Истина;
	
КонецПроцедуры

// Функция - Создать элементы формы сохранения данных. 
//           Внимание! Для оптимизации, реквизит для сохранения данных должен быть создан заранее.
//           Имя созданного реквизита сохранения должно быть получено из функции ПолучитьИмяСохраненияЗначения
//
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита для которого создаётся пометка сохранения данных. 
// 	Родитель     - ГруппаФормы, СтаницаФормы - Родительская группа или страница для создания элементов.
//
// Возвращаемое значение:
//  ГруппаФормы - Группа для вставки элемента реквизита.
//
&НаСервере
Функция СоздатьЭлементыФормыСохраненияДанных(ИмяРеквизита, Родитель)
	
	// Создадим новую группу в родительской, и переназначим указанную в настройках группу на новосозданную.
	Группа = Элементы.Добавить("Группа" + ИмяРеквизита, Тип("ГруппаФормы"), Родитель);
	Группа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Объединенная        = Ложь;
	Группа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	// Добавляем поле флага, соответствующего созданному реквизиту
	Элемент = Элементы.Добавить("СохранятьЗначение" + ИмяРеквизита, Тип("ПолеФормы"), Группа);
	Элемент.Вид                             = ВидПоляФормы.ПолеФлажка;
	Элемент.ВидФлажка                       = ВидФлажка.Выключатель;
	Элемент.ПоложениеЗаголовка              = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.ГоризонтальноеПоложениеВГруппе	= ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ПутьКДанным                     = "СохранятьЗначение" + ИмяРеквизита;
	Элемент.Подсказка                       = НСтр("ru = 'Сохранить значения поля для создания следующего элемента.'");
	
	// Флаги заполняются автоматически при заполнении соответствующих им полей. Если требуется, пользователь снимает флаг вручную.
	Элемент.ПропускатьПриВводе = Истина;
	
	// Стандартный обработчик для всех флагов сохранения, используемый в механизме сохранения настроек шаблона.
	Элемент.УстановитьДействие("ПриИзменении","СохранятьЗначениеПриИзменении");
	
	Возврат Группа;
	
КонецФункции

#КонецОбласти

#Область НастройкаЭлементовФормы

// Процедура - Настроить свойства элементов формы в зависимости от текущего шага
//
&НаКлиенте
Процедура НастроитьЭлементыПоШагу()
	
	РежимВыбораНоменклатуры     = РежимСоздания = 1;
	РежимМножественногоСоздания = РежимСоздания = 2;
	
	СозданиеНоменклатуры   = ТекущееДействие = "СозданиеНоменклатуры";
	СозданиеХарактеристики = ТекущееДействие = "СозданиеХарактеристики";
	ВыборРежима            = ТекущееДействие = "ВыборРежима";
	СозданиеИзображения    = ТекущееДействие = "СозданиеИзображения";
	
	// Дополнительные реквизиты
	ОбновитьЭлементыДополнительныхРеквизитов();
	
	Элементы.Готово.Видимость = Истина;
	Элементы.Справка.Видимость = ВыборРежима;
	Если ВыборРежима Тогда
	   	Элементы.Назад.Видимость = Ложь;
		
		Элементы.Далее.Заголовок = НСтр("ru = 'Продолжить'");
		Элементы.Далее.Видимость = Истина;
		Элементы.Далее.Отображение = ОтображениеКнопки.Текст;
		
		Элементы.Готово.Заголовок = НСтр("ru = 'Отмена'");
		
		Элементы.ДекорацияЭтап.Заголовок = НСтр("ru = 'Шаг 1 из 3. Предварительная настройка'");
		
		Элементы.СтраницыЭтапов.ТекущаяСтраница = Элементы.СтраницаВыборРежима;
		
	ИначеЕсли СозданиеНоменклатуры Тогда
		Если РежимВыбораНоменклатуры Тогда
			Элементы.ДекорацияЭтап.Заголовок = НСтр("ru = 'Шаг 2 из 3. Выбор номенклатуры'");
		Иначе
			Элементы.ДекорацияЭтап.Заголовок = НСтр("ru = 'Шаг 2 из 3. Создание номенклатуры'");
		КонецЕсли;
		
		Элементы.Готово.Заголовок = НСтр("ru = 'Завершить'");
		
		Элементы.Назад.Заголовок   = НСтр("ru = 'Назад'");
		Элементы.Назад.Видимость   = НЕ СозданиеТолькоНоменклатуры;
		
		Элементы.Далее.Заголовок   = НСтр("ru = 'Создать и продолжить'");
		Элементы.Далее.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы.Далее.Видимость   = НЕ СозданиеТолькоНоменклатуры;
		
		Если Элементы.ГруппаПараметрыНоменклатуры.ТолькоПросмотр <> РежимВыбораНоменклатуры Тогда
			Элементы.ГруппаПараметрыНоменклатуры.ТолькоПросмотр = РежимВыбораНоменклатуры;
		КонецЕсли;
		
		Элементы.Номенклатура.Видимость = РежимВыбораНоменклатуры;
		
		Элементы.СтраницыЭтапов.ТекущаяСтраница = Элементы.СтраницаСозданиеНоменклатуры;
		
		УстановитьВидимостьСохранитьЗначение(РежимМножественногоСоздания);
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры) Тогда
			Элементы.ЕдиницаИзмерения.ТолькоПросмотр = Ложь;
			Элементы.СохранятьЗначениеЕдиницаИзмерения.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
	ИначеЕсли СозданиеИзображения Тогда
		Элементы.СтраницыЭтапов.ТекущаяСтраница = Элементы.СтраницаСозданияИзображения;
		
	ИначеЕсли СозданиеХарактеристики Тогда
		Элементы.Далее.Заголовок = НСтр("ru = 'Создать и продолжить'");
		
		Если РежимМножественногоСоздания Тогда
			Элементы.Назад.Заголовок = НСтр("ru = 'Следующая номенклатура'");
		КонецЕсли;
		
		ХарактеристикиТолькоДляНоменклатуры = ИспользуютсяХарактеристики
			И Не ХарактеристикиИспользуютсяВКатегорииНоменклатуры(ЭтотОбъект.КатегорияНоменклатуры);
		Элементы.ГдеСоздаемХарактеристики.Доступность = Не ХарактеристикиТолькоДляНоменклатуры;
		Если ХарактеристикиТолькоДляНоменклатуры Тогда
			ГдеСоздаемХарактеристики = 0;
		КонецЕсли;
		
		Элементы.Готово.Заголовок = НСтр("ru = 'Завершить'");
		
		Элементы.ДекорацияЭтап.Заголовок = НСтр("ru = 'Шаг 3 из 3. Создание характеристик'");
		
		Элементы.СтраницыЭтапов.ТекущаяСтраница = Элементы.СтраницаСозданиеХарактеристик;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПолеПроверятьЗаполнениеХарактеристики",
		"Доступность",
		ИспользуютсяХарактеристики);
	
	НастроитьОтраслевыеЭлементыПоШагу();
	НастроитьЭлементыПоЗаполненнымЗначениям();
	УстановитьФокусировкуНаЭлемент();
	ОбновитьАвтоОтметкуНеЗаполненногоВПараметрахПравил();
	
КонецПроцедуры

// Процедура - Настроить свойства элементов формы в зависимости от заполненных данных
//
&НаКлиенте
Процедура НастроитьЭлементыПоЗаполненнымЗначениям()
	
	РежимОдиночногоСоздания = РежимСоздания = 0;
	РежимВыбораНоменклатуры = РежимСоздания = 1;
	
	СозданиеНоменклатуры    = ТекущееДействие = "СозданиеНоменклатуры";
	СозданиеИзображения     = ТекущееДействие = "СозданиеИзображения";
	
	КатегорияНоменклатурыВыбран = ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры);
	
	УстановитьВидимостьНаименования();
	
	ТипНоменклатуры = ПолучитьТипНоменклатурыПоУмолчанию(ЭтотОбъект.КатегорияНоменклатуры);
	Если Не ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас")
		И Не ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
		И Не ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
		Элементы.ПолеИспользоватьХарактеристики.Доступность = Ложь;
	Иначе
		Элементы.ПолеИспользоватьХарактеристики.Доступность = Истина;
	КонецЕсли;
	
	Если СозданиеНоменклатуры Тогда
		Элементы.Группаор_ПравилоКраткогоНаименования.Доступность = КатегорияНоменклатурыВыбран;
		Элементы.Группаор_ПравилоПолногоНаименования.Доступность  = КатегорияНоменклатурыВыбран;
		
		Элементы.ЗначениеНаименованияор_ПравилоКраткогоНаименования.Видимость = 
			ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоКраткогоНаименования);
		Элементы.ЗначениеНаименованияор_ПравилоПолногоНаименования.Видимость  =
			ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоПолногоНаименования);
		
	КонецЕсли;
	
	Если (СозданиеНоменклатуры ИЛИ СозданиеИзображения) Тогда
		
		Если РежимВыбораНоменклатуры ИЛИ (СозданиеНоменклатуры И СоздаватьИзображения) Тогда
			ЗаголовокДалее = НСтр("ru = 'Продолжить'");
		ИначеЕсли КатегорияНоменклатурыВыбран И РежимОдиночногоСоздания 
			И (НЕ ИспользуютсяХарактеристики ИЛИ СозданиеТолькоНоменклатуры)
			И (НЕ СоздаватьИзображения ИЛИ СозданиеИзображения) Тогда
			ЗаголовокДалее = НСтр("ru = 'Создать и завершить'");
		Иначе
			ЗаголовокДалее = НСтр("ru = 'Создать и продолжить'");
		КонецЕсли;
		
		Элементы.Далее.Заголовок = ЗаголовокДалее;
	КонецЕсли;
	
	УстановитьВидимостьОтраслевыхРеквизитовНаСервере();
	
КонецПроцедуры

// Процедура - Установить видимость чек-боксам с сохранением значений
//
// Параметры:
//  Видимость	 - Булево - Требуемая видимость 
//
&НаКлиенте
Процедура УстановитьВидимостьСохранитьЗначение(Видимость)
	
	// В данном случае видимость этого элемента устанавивается только данной процедурой
	// и с целью оптимизации, выполняется проверка одного из элементов на совпадении видимости
	Если Элементы.СохранятьЗначениеКатегорияНоменклатуры.Видимость = Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Очередь = Новый Массив;
	Очередь.Добавить(Элементы.СтраницаСозданиеНоменклатуры);
	// Очередь.Добавить(Элементы.СтраницаСозданиеХарактеристик);
	Для Каждого Элемент Из Очередь Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("ГруппаФормы") Тогда
			Для Каждого Потомок Из Элемент.ПодчиненныеЭлементы Цикл
				Очередь.Добавить(Потомок);
			КонецЦикла;
		ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда
			Если СтрНайти(Элемент.Имя, "СохранятьЗначение") Тогда
				Элемент.Видимость = Видимость;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ТекущееДействие = "СозданиеНоменклатуры" Тогда 
		Если ЭтотОбъект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			// Создание фейкового объекта
			ПередаваемыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ПередаваемыйОбъект.КатегорияНоменклатуры = ЭтотОбъект["КатегорияНоменклатуры"];
		Иначе
			ПередаваемыйОбъект = ЭтотОбъект.Номенклатура.ПолучитьОбъект();
		КонецЕсли
	Иначе
		ПередаваемыйОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		
		ПередаваемыйОбъект.Владелец = ?(ГдеСоздаемХарактеристики = 1, ЭтотОбъект.КатегорияНоменклатуры, ЭтотОбъект.Номенклатура);
	КонецЕсли;
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект,ПередаваемыйОбъект,Истина);
	
	ЭлементыПеремещения = Новый Массив;
	ШрифтЗаголовка = Новый Шрифт("ШрифтЗаголовка", 10, Истина);
	Для Каждого Элемент Из Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			Элемент.ШрифтЗаголовка = ШрифтЗаголовка;
			Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаФормы;
		КонецЕсли;
		
		Если ТекущееДействие = "СозданиеХарактеристики" Тогда
			ЭлементыПеремещения.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из ЭлементыПеремещения Цикл
		Элементы.Переместить(Элемент, Элементы.ГруппаДополнительныеРеквизитыХарактеристики);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПравилаИменования

&НаКлиенте
Процедура ОткрытьФормуВыбораПравилЗавершение(Результат, ИмяЭлемента) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЭтотОбъект[ИмяЭлемента] = Результат;
		ор_ПравилоНаименованияПриИзменении(Элементы[ИмяЭлемента]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоШаблонНаименованияХарактеристики(ИмяЭлемента)
	Возврат СтрНайти(НРег(ИмяЭлемента), "характеристики") > 0;
КонецФункции

&НаКлиенте
Функция ВидНаименованияШаблонаНаименований(ИмяЭлемента)
	
	ВидНаименования = ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.НоменклатураРабочее");
	Если ИмяЭлемента = "ор_ПравилоНаименованияХарактеристики" 
		Или ИмяЭлемента = "ор_ПравилоНаименованияХарактеристикиДляПечати" Тогда
		ВидНаименования = ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.ХарактеристикаРабочее");
	КонецЕсли;
	
	Возврат ВидНаименования;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьПараметрПравилНаименования(СтрокаПараметраПравила, Значение)
	
	СтрокаПараметраПравила.ДанныеПараметраСтрокой = Формат(Значение,"ДЛФ=Д; БЛ='Ложь'; БИ='" + СтрокаПараметраПравила.ИмяПараметра + "'");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПравилаИменованияСервер()
	
	// По умолчанию вид номенклатуры не добавляется
	ПоискКатегорииНоменклатуры = ПараметрыПравилаИменования.НайтиСтроки(Новый Структура("ИмяЭлемента,ПутьКДанным","КатегорияНоменклатуры","КатегорияНоменклатуры"));
	Если ПоискКатегорииНоменклатуры.Количество() = 0 Тогда 
		НоваяСтрока = ПараметрыПравилаИменования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Новый Структура("ДанныеПараметраСтрокой,ИмяПараметра,ИмяЭлемента,ПутьКДанным,ДляНоменклатуры",
			ЭтотОбъект.КатегорияНоменклатуры,
			"Категория номенклатуры",
			"КатегорияНоменклатуры",
			"КатегорияНоменклатуры"));
	КонецЕсли;
	
	Для Каждого СтрокаПараметр Из ПараметрыПравилаИменования Цикл
		НазваниеРеквизита = НайтиНазваниеРеквизитаПравилаНаименования(СтрокаПараметр.ПутьКДанным);
		Если НазваниеРеквизита <> Неопределено Тогда
			УстановитьПараметрПравилНаименования(СтрокаПараметр, ЭтотОбъект[НазваниеРеквизита]);
		Иначе
			СтрокаПараметр.ДанныеПараметраСтрокой = " ";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьПараметрПравилНаименования(ИмяЭлемента)
	
	ПолеПравила = НайтиПараметрПравилаНаименования(ИмяЭлемента);
	Если ПолеПравила <> Неопределено Тогда
		ПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
		УстановитьПараметрПравилНаименования(ПолеПравила, ЭтотОбъект[ПутьКДанным]);
		ОбновитьЗначенияПравилНаименования();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПравилНаименования()
	
	НазванияРеквизитовПравил = Новый Массив;
	Если ТекущееДействие = "СозданиеНоменклатуры" Тогда
		СписокПараметров = ПолучитьСписокПараметровДляШаблона();
		
		НазванияРеквизитовПравил.Добавить("ор_ПравилоКраткогоНаименования");
		НазванияРеквизитовПравил.Добавить("ор_ПравилоПолногоНаименования");
	Иначе
		СписокПараметров = ПолучитьСписокПараметровДляШаблона(Истина);
		
		НазванияРеквизитовПравил.Добавить("ор_ПравилоНаименованияХарактеристики");
		НазванияРеквизитовПравил.Добавить("ор_ПравилоНаименованияХарактеристикиДляПечати");
	КонецЕсли;
	
	Для Каждого НазваниеРеквизита Из НазванияРеквизитовПравил Цикл
		НазваниеРевизитаЗначения = "ЗначениеНаименования" + НазваниеРеквизита;
		ЗначениеПравила = ЭтотОбъект[НазваниеРеквизита];
		Если Не ЗначениеЗаполнено(ЗначениеПравила) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры) Тогда
			Элементы[НазваниеРевизитаЗначения].Видимость = Ложь;
		Иначе
			Элементы[НазваниеРевизитаЗначения].Видимость = Истина;
			ЭтотОбъект[НазваниеРевизитаЗначения] = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
				СписокПараметров,
				ЗначениеПравила.ШаблонДляФормирования);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметровДляШаблона(ДляХарактеристики = Ложь)
	
	СписокПараметров = Новый СписокЗначений;
	
	Для Каждого ТекущиеДанные Из ПараметрыПравилаИменования Цикл
		Если Не ДляХарактеристики И ТекущиеДанные.ДляНоменклатуры
			Или ДляХарактеристики И Не ТекущиеДанные.ДляНоменклатуры Тогда
			СписокПараметров.Добавить(ТекущиеДанные.ИмяПараметра, ТекущиеДанные.ДанныеПараметраСтрокой);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПараметров;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПравилаНаименованияПоКатегорииНоменклатуры(ДляХарактеристик = Ложь)
	
	СтруктураОтборов = Новый Структура;
	
	СтруктураОтборов.Вставить("ДляХарактеристики", ДляХарактеристик);
	
	Если Не ДляХарактеристик Тогда
		СтруктураОтборов.Вставить("ВидНаименования", Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее);
		ТаблицаШаблонов = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегорииПоОтборам(ЭтотОбъект.КатегорияНоменклатуры, СтруктураОтборов);
		Если ТаблицаШаблонов.Количество() = 1 Тогда
			ЭтотОбъект.СохранятьЗначениеор_ПравилоКраткогоНаименования = Истина;
			ЭтотОбъект.ор_ПравилоКраткогоНаименования = ТаблицаШаблонов[0].Ссылка;
		Иначе
			ЭтотОбъект.СохранятьЗначениеор_ПравилоКраткогоНаименования = Ложь;
			ЭтотОбъект.ор_ПравилоКраткогоНаименования = Неопределено;
		КонецЕсли;
		
		СтруктураОтборов.Вставить("ВидНаименования", Перечисления.ВидыНаименованийОбъектов.НоменклатураДляПечати);
		ТаблицаШаблонов = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегорииПоОтборам(ЭтотОбъект.КатегорияНоменклатуры, СтруктураОтборов);
		Если ТаблицаШаблонов.Количество() = 1 Тогда
			ЭтотОбъект.СохранятьЗначениеор_ПравилоПолногоНаименования = Истина;
			ЭтотОбъект.ор_ПравилоПолногоНаименования = ТаблицаШаблонов[0].Ссылка;
		Иначе
			ЭтотОбъект.СохранятьЗначениеор_ПравилоПолногоНаименования = Ложь;
			ЭтотОбъект.ор_ПравилоПолногоНаименования = Неопределено;
		КонецЕсли;
	Иначе
		СтруктураОтборов.Вставить("ВидНаименования", Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее);
		ТаблицаШаблонов = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегорииПоОтборам(ЭтотОбъект.КатегорияНоменклатуры, СтруктураОтборов);
		Если ТаблицаШаблонов.Количество() = 1 Тогда
			ЭтотОбъект.СохранятьЗначениеор_ПравилоНаименованияХарактеристики = Истина;
			ЭтотОбъект.ор_ПравилоНаименованияХарактеристики = ТаблицаШаблонов[0].Ссылка;
		Иначе
			ЭтотОбъект.СохранятьЗначениеор_ПравилоНаименованияХарактеристики = Ложь;
			ЭтотОбъект.ор_ПравилоНаименованияХарактеристики = Неопределено;
		КонецЕсли;
		
		СтруктураОтборов.Вставить("ВидНаименования", Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати);
		ТаблицаШаблонов = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегорииПоОтборам(ЭтотОбъект.КатегорияНоменклатуры, СтруктураОтборов);
		Если ТаблицаШаблонов.Количество() = 1 Тогда
			ЭтотОбъект.СохранятьЗначениеор_ПравилоНаименованияХарактеристикиДляПечати = Истина;
			ЭтотОбъект.ор_ПравилоНаименованияХарактеристикиДляПечати = ТаблицаШаблонов[0].Ссылка;
		Иначе
			ЭтотОбъект.СохранятьЗначениеор_ПравилоНаименованияХарактеристикиДляПечати = Ложь;
			ЭтотОбъект.ор_ПравилоНаименованияХарактеристикиДляПечати = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеПараметровПравил()
	
	Результат = ПолучитьНезаполненныеПравилаНаименования();
	Для Каждого Элемент Из Результат.СписокДанных Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для правил наименования требуется заполнение поля ""%1"".", Элемент.ИмяПараметра),,
			Элемент.ИмяРеквизита);
	КонецЦикла;
	
	Возврат Результат.ЕстьНезаполненные;
	
КонецФункции

&НаСервере
Функция ПолучитьНезаполненныеПравилаНаименования() 
	
	Результат = Новый Структура("ЕстьНезаполненные, СписокДанных", Ложь, Новый Массив);
	Для Каждого ТекСтрока Из ПараметрыПравилаИменования Цикл
		
		// Проверка заполнения.
		Если НЕ (СозданиеНоменклатуры = ТекСтрока.ДляНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(ТекСтрока.ПутьКданным, "ор_НаименованиеПоставщика") > 0 Тогда
			ТекСтрока.ДанныеПараметраСтрокой = " ";
		КонецЕсли;
		
		ТекЭлементФормы = Элементы.Найти(ТекСтрока.ИмяЭлемента);
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДанныеПараметраСтрокой) И ТекСтрока.ДанныеПараметраСтрокой <> " " Тогда
			
			// Переопределение имени отраслевым именем
			ИмяРеквизита = НайтиНазваниеРеквизитаПравилаНаименования(ТекСтрока.ПутьКДанным);
			
			Если ИмяРеквизита <> Неопределено Тогда
				Результат.СписокДанных.Добавить(Новый Структура("ИмяРеквизита, ИмяПараметра", 
					ИмяРеквизита, ТекСтрока.ИмяПараметра));
				Результат.ЕстьНезаполненные = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекСтрока.ДанныеПараметраСтрокой = " " Тогда
			ТекСтрока.ДанныеПараметраСтрокой = "";
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
Конецфункции

&НаСервереБезКонтекста
Функция ПолучитьНаборСвойств(КатегорияНоменклатуры)
	
	Возврат КатегорияНоменклатуры.НаборСвойств;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаборСвойствХарактеристик(КатегорияНоменклатуры)
	
	Возврат КатегорияНоменклатуры.НаборСвойствХарактеристики;
	
КонецФункции

&НаСервере
Процедура СоздатьРеквизитыИПоляФормыПравила(ЭтоПараметрыДляХарактеристики = Ложь, ЭтоПереход = Ложь, СохранитьЗначения = Ложь)
	РежимМножественногоСоздания = РежимСоздания = 2;
	
	// Сохранение значений реквизитов перед удалением.
	Если СохранитьЗначения ИЛИ (РежимМножественногоСоздания И ЭтоПереход И ЭтоПараметрыДляХарактеристики) Тогда
		Для Каждого СтрокаПараметр Из ПараметрыПравилаИменования Цикл
			Если СтрокаПараметр.ПутьКДанным = "КатегорияНоменклатуры" Тогда 
				Продолжить;
			КонецЕсли;
			
			ИмяНаФорме = НайтиНазваниеРеквизитаПравилаНаименования(СтрокаПараметр.ПутьКДанным);
			ИмяНаФорме = ?(ИмяНаФорме = Неопределено, СтрокаПараметр.ПутьКДанным, ИмяНаФорме);
			ИмяФлагаЭлемента = ?(РеквизитСуществует("СохранятьЗначение" + ИмяНаФорме), ИмяНаФорме, СтрокаПараметр.ИмяЭлемента);
			Если РеквизитСуществует(ИмяНаФорме) 
				И РеквизитСуществует("СохранятьЗначение" + ИмяФлагаЭлемента)
				И ЭтотОбъект["СохранятьЗначение" + ИмяФлагаЭлемента] Тогда
				СписокВременныхПараметров.Добавить(ЭтотОбъект[ИмяНаФорме], ИмяНаФорме);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущаяКатегорияНоменклатуры = ?(ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры),
		ЭтотОбъект.КатегорияНоменклатуры,
		ЭтотОбъект.Номенклатура.КатегорияНоменклатуры);
	
	МассивПараметров = Новый Массив();
	// В шаблоне наименований не используються доп. свойства, а только доп. реквизиты.
	ТекущиеОписаниеДопРеквизитов = ?(ЭтотОбъект.Свойства_ИспользоватьСвойства, ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов, Неопределено);
	Если НЕ ЭтоПараметрыДляХарактеристики Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоКраткогоНаименования) Тогда
			ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
				МассивПараметров,
				ТекущаяКатегорияНоменклатуры,
				ЭтотОбъект.ор_ПравилоКраткогоНаименования,
				ТекущиеОписаниеДопРеквизитов);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоПолногоНаименования) Тогда
			ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
				МассивПараметров,
				ТекущаяКатегорияНоменклатуры,
				ЭтотОбъект.ор_ПравилоПолногоНаименования,
				ТекущиеОписаниеДопРеквизитов);
		КонецЕсли;
		
		ЛеваяГруппа  = Элементы.ГруппаПараметрыПравилаНаименованияЛевыйСтолбец;
		ПраваяГруппа = Элементы.ГруппаПараметрыПравилаНаименованияПравыйСтолбец;
	Иначе
		Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоНаименованияХарактеристики) Тогда
			ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
				МассивПараметров,
				ТекущаяКатегорияНоменклатуры,
				ЭтотОбъект.ор_ПравилоНаименованияХарактеристики,
				ТекущиеОписаниеДопРеквизитов);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоНаименованияХарактеристикиДляПечати) Тогда
			ШаблоныНаименований.ЗаполнитьМассивПараметровШаблонаНаименования(
				МассивПараметров,
				ТекущаяКатегорияНоменклатуры,
				ЭтотОбъект.ор_ПравилоНаименованияХарактеристикиДляПечати,
				ТекущиеОписаниеДопРеквизитов);
		КонецЕсли;
		
		ЛеваяГруппа  = Элементы.ГруппаПараметрыНаименованияХарактеристикиЛевыйСтолбец;
		ПраваяГруппа = Элементы.ГруппаПараметрыНаименованияХарактеристикиПравыйСтолбец;
	КонецЕсли;
	
	// Удаление старых реквизитов и элементов
	УдалитьРеквизитыИЭлементыПравилНаименования();
	
	// Создание новых реквизитов и элементов
	ШаблоныНаименований.ДобавитьРеквизитыИЭлементыНаФорму(ЭтотОбъект, ЛеваяГруппа, МассивПараметров);
	
	ЗаполнитьРеквизитыПравилаИменованияИзКэша();
	
	// Проверка на наличие дублей уже существующих элементов отраслевых реквизитов
	Для Каждого СтрокаПараметр Из ПараметрыПравилаИменования Цикл
		Если СтрокаПараметр.ПутьКДанным = "КатегорияНоменклатуры" Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеНазванийПравилоКОтраслевому = ПолучитьСоответствиеРеквизитовПравилоКОтраслевому();
		Если СоответствиеНазванийПравилоКОтраслевому.Получить(СтрокаПараметр.ПутьКДанным) <> Неопределено Тогда
			Элемент = Элементы.Найти(СтрокаПараметр.ИмяЭлемента);
			Если Элемент <> Неопределено Тогда
				Элементы.Удалить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Создание реквизитов сохранять значение
	МассивКСозданию = Новый Массив;
	Для Каждого Элемент Из ЛеваяГруппа.ПодчиненныеЭлементы Цикл
		Реквизит = Новый РеквизитФормы("СохранятьЗначение" + Элемент.Имя, Новый ОписаниеТипов("Булево"), , "", Истина);
		МассивКСозданию.Добавить(Реквизит);
	КонецЦикла;
	ИзменитьРеквизиты(МассивКСозданию);
	
	// Создание элементов сохранять значение
	МассивКПеремещению = Новый Массив;
	Для Каждого Элемент Из ЛеваяГруппа.ПодчиненныеЭлементы Цикл 
		
		Группа = СоздатьЭлементыФормыСохраненияДанных(Элемент.Имя, ПраваяГруппа);
		
		Элемент.РастягиватьПоГоризонтали = Истина;
		Элемент.МаксимальнаяШирина = 0;

		Элемент.УстановитьДействие("ПриИзменении", "ПриИзмененииРеквизита");
		
		ЭлементФлажка = Группа.ПодчиненныеЭлементы[0];
		Если РежимСоздания <> 2 И РежимСоздания <> 1 Тогда
			ЭлементФлажка.Видимость = Ложь;
		КонецЕсли;
		
		МассивКПеремещению.Добавить(Новый Структура("НовыйЭлемент, Элемент, Родитель", Элемент, ЭлементФлажка, Группа));
	КонецЦикла;
	
	// Перемещение элементов правил в группы с сохранением значения
	Для Каждого Данные Из МассивКПеремещению Цикл
		Элементы.Переместить(Данные.НовыйЭлемент, Данные.Родитель, Данные.Элемент);
	КонецЦикла;
	
	// Балансировка элементов на обоих столбцах
	Если ПраваяГруппа.ПодчиненныеЭлементы.Количество() > 1 Тогда
		ПереместитьТекущий = Ложь;
		ЭлементыКПеремещению = Новый Массив;
		Для Каждого Элемент из ПраваяГруппа.ПодчиненныеЭлементы Цикл
			
			Если ПереместитьТекущий Тогда
				ЭлементыКПеремещению.Добавить(Элемент);
			КонецЕсли;
			Элемент.РастягиватьПоГоризонтали = Истина;
			
			ПереместитьТекущий = Не ПереместитьТекущий;
		КонецЦикла;
		
		Для Каждого Элемент Из ЭлементыКПеремещению Цикл
			Элементы.Переместить(Элемент, ЛеваяГруппа);
		КонецЦикла;
	ИначеЕсли ПраваяГруппа.ПодчиненныеЭлементы.Количество() = 1 Тогда
		Элемент = ПраваяГруппа.ПодчиненныеЭлементы[0];
		Элементы.Переместить(Элемент, ЛеваяГруппа);
	КонецЕсли;
	
	// Запись запомненных значений реквизитов
	Если СохранитьЗначения ИЛИ (РежимМножественногоСоздания И ЭтоПереход И Не ЭтоПараметрыДляХарактеристики) Тогда
		Для Каждого ЭлементСписка Из СписокВременныхПараметров Цикл
			ЕстьРеквизитПараметра = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ЭлементСписка.Представление);
			Если ЕстьРеквизитПараметра Тогда
				ЭтотОбъект[ЭлементСписка.Представление] = ЭлементСписка.Значение;
				Результат = ПараметрыПравилаИменования.НайтиСтроки(Новый Структура("ПутьКДанным", ЭлементСписка.Представление));
				Если Результат.Количество() > 0 Тогда
					ИмяЭлемента = Результат[0].ИмяЭлемента;
					ИмяФлагаСохранения = "СохранятьЗначение" + ИмяЭлемента;
					
					ЭтотОбъект[ИмяФлагаСохранения] = Истина;
					Элементы[ИмяЭлемента].ПропускатьПриВводе = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СписокВременныхПараметров.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПравилаИменованияИзКэша()
	
	Для Каждого ЭлементКэша Из КэшЗначенийРеквизитовПравилНаименования Цикл
		РеквизитОпределен = РеквизитСуществует(ЭлементКэша.ПутьКДанным);
		Если РеквизитОпределен Тогда
			ЭтотОбъект[ЭлементКэша.ПутьКДанным] = ЭлементКэша.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УдалитьРеквизитыИЭлементыПравилНаименования()
	
	КэшЗначенийРеквизитовПравилНаименования.Очистить();
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для Каждого СтрокаПараметр Из ПараметрыПравилаИменования Цикл
		
		Если СтрокаПараметр.ПутьКДанным = "КатегорияНоменклатуры" Тогда 
			Продолжить;
		КонецЕсли;
		
		РеквизитОпределен = РеквизитСуществует(СтрокаПараметр.ПутьКДанным);
		
		УдаляемыйЭлемент = Элементы.Найти(СтрокаПараметр.ИмяЭлемента);
		Если РеквизитОпределен И УдаляемыйЭлемент <> Неопределено Тогда
			МассивУдаляемыхРеквизитов.Добавить(СтрокаПараметр.ПутьКДанным);
			МассивУдаляемыхРеквизитов.Добавить("СохранятьЗначение" + СтрокаПараметр.ИмяЭлемента); 
			Элементы.Удалить(Элементы["Группа" + СтрокаПараметр.ИмяЭлемента]);
			
			Если ЗначениеЗаполнено(ЭтотОбъект[СтрокаПараметр.ПутьКДанным]) Тогда
				СтрокаКэша = КэшЗначенийРеквизитовПравилНаименования.Добавить();
				СтрокаКэша.ПутьКДанным 	= СтрокаПараметр.ПутьКДанным;
				СтрокаКэша.Значение 	= ЭтотОбъект[СтрокаПараметр.ПутьКДанным];
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	ПараметрыПравилаИменования.Очистить();
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеРеквизитовПравилоКОтраслевому()
	
	// Устанавливаем соответствие названий реквизитов данной формы и реквизитов в правиле решений.
	ПравилоКОтраслевому = Новый Соответствие;
	
	ПравилоКОтраслевому.Вставить("Номенклатура_Артикул", "Артикул");
	ПравилоКОтраслевому.Вставить("Номенклатура_ЦеноваяГруппа", "ЦеноваяГруппа");
	ПравилоКОтраслевому.Вставить("Номенклатура_ЕдиницаИзмерения", "ЕдиницаИзмерения");
	ПравилоКОтраслевому.Вставить("Номенклатура_Производитель", "Производитель");
	
	ДобавитьСоответствиеОтраслевыхРеквизитовПравилоКОтраслевому(ПравилоКОтраслевому);
	
	Возврат ПравилоКОтраслевому;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеРеквизитовОтраслевойКПравилу()
	
	// Устанавливаем соответствие названий реквизитов данной формы и реквизитов в правиле решений.
	ОтраслевыеНазванияРеквизитов = Новый Соответствие;
	
	ОтраслевыеНазванияРеквизитов.Вставить("Артикул", "Номенклатура_Артикул");
	ОтраслевыеНазванияРеквизитов.Вставить("ЦеноваяГруппа", "Номенклатура_ЦеноваяГруппа");
	ОтраслевыеНазванияРеквизитов.Вставить("ЕдиницаИзмерения", "Номенклатура_ЕдиницаИзмерения");
	ОтраслевыеНазванияРеквизитов.Вставить("Производитель", "Номенклатура_Производитель");
	
	ДобавитьСоответствиеОтраслевыхРеквизитовОтраслевойКПравилу(ОтраслевыеНазванияРеквизитов);
	
	Возврат ОтраслевыеНазванияРеквизитов;
	
КонецФункции

&НаСервере
Функция НайтиНазваниеРеквизитаПравилаНаименования(НазваниеРеквизита)
	
	СоответствиеНазванийПравилоКОтраслевому = ПолучитьСоответствиеРеквизитовПравилоКОтраслевому();
	ОтраслевоеНазвание = СоответствиеНазванийПравилоКОтраслевому.Получить(НазваниеРеквизита);
	Если ОтраслевоеНазвание <> Неопределено И РеквизитСуществует(ОтраслевоеНазвание) Тогда
		Возврат ОтраслевоеНазвание;
	ИначеЕсли РеквизитСуществует(НазваниеРеквизита) Тогда
		Возврат НазваниеРеквизита;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция НайтиПараметрПравилаНаименования(ИмяЭлементаФормы)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	СоответствиеНазванийОтраслевойКПравилу = ПолучитьСоответствиеРеквизитовОтраслевойКПравилу();
	ПутьКДанным = СоответствиеНазванийОтраслевойКПравилу.Получить(ЭлементФормы.ПутьКДанным);
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = ЭлементФормы.ПутьКДанным;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ПутьКДанным", ПутьКДанным);
	Результат = ПараметрыПравилаИменования.НайтиСтроки(ПараметрыОтбора);
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПерезаписатьПравилаНаименования(ЭтоПараметрыДляХарактеристики = Ложь, ЭтоПереход = Ложь, 
											ЗаполнятьПоКатегории = Истина, ЗаполнитьПараметры = Ложь, СохранитьЗначения = Ложь)
	
	Если ЗаполнятьПоКатегории Тогда
		ЗаполнитьПравилаНаименованияПоКатегорииНоменклатуры(ЭтоПараметрыДляХарактеристики);
	КонецЕсли;
	
	СоздатьРеквизитыИПоляФормыПравила(ЭтоПараметрыДляХарактеристики, ЭтоПереход, СохранитьЗначения);

	Если ЗаполнитьПараметры Тогда
		ЗаполнитьПараметрыПравилаИменованияСервер();
	КонецЕсли;
	
	ОбновитьЗначенияПравилНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНаименования()
	
	// Если правило краткого наименования не заполнено, тогда наименование заполняется из правила полного наименования.
	// Иначе наименование заполняется из поля "Наименование".
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоКраткогоНаименования)
		ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоКраткогоНаименования) И ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоПолногоНаименования) Тогда
		ЭтотОбъект.Наименование = "";
		Элементы.Наименование.Видимость = Ложь;
	Иначе
		Элементы.Наименование.Видимость = Истина;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоНаименованияХарактеристики) Тогда
		ЭтотОбъект.НаименованиеХарактеристики = "";
		Элементы.НаименованиеХарактеристики.Видимость = Ложь;
	Иначе
		Элементы.НаименованиеХарактеристики.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СозданиеНоменклатурыИХарактеристики

&НаКлиенте
Функция СоздатьНоменклатуру()
	
	Если ЕстьОшибкиПараметровНоменклатуры() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СоздатьНоменклатуруНаСервере() Тогда
		Если Объект.ПечатьЦенника Тогда
			Печать();
		КонецЕсли;
		
		Если Не ВызовИзСписка Тогда
			ДобавитьВДокумент();
		КонецЕсли;
		
		Оповестить("Запись_Номенклатура", ЭтотОбъект.Номенклатура);
		
	Иначе
		Возврат Ложь;
		ПоказатьПредупреждение(,"Произошли ошибки при создании данных!");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Создание номенклатуры по заполненым реквизитам
&НаСервере
Функция СоздатьНоменклатуруНаСервере()
	
	Результат = Истина;
	
	ЭтотОбъект.Характеристика = Неопределено;
	// !СозданиеНоменклатуры
	// Первичная запись номенклатуры
	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	
	НоваяНоменклатура.КатегорияНоменклатуры = ЭтотОбъект.КатегорияНоменклатуры;
	Если ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры) Тогда
		НоваяНоменклатура.ТипНоменклатуры = ЭтотОбъект.КатегорияНоменклатуры.ТипНоменклатурыПоУмолчанию;
	Иначе
		НоваяНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
	КонецЕсли;
	КатегорииНоменклатурыСервер.ЗаполнитьСвойстваНоменклатурыПоКатегории(НоваяНоменклатура, Истина);
	ЗаполнитьЗначенияНоменклатурыПоУмолчанию(НоваяНоменклатура);
	
	НоваяНоменклатура.ИспользоватьХарактеристики        = ИспользуютсяХарактеристики;
	НоваяНоменклатура.ПроверятьЗаполнениеХарактеристики = ПроверятьЗаполнениеХарактеристики;
	
	НоваяНоменклатура.Родитель         = ЭтотОбъект.ГруппаНоменклатуры;
	НоваяНоменклатура.ЦеноваяГруппа    = ЭтотОбъект.ЦеноваяГруппа;
	НоваяНоменклатура.Артикул          = ЭтотОбъект.Артикул;
	НоваяНоменклатура.ЕдиницаИзмерения = ЭтотОбъект.ЕдиницаИзмерения;
	
	// Ставка НДС
	Если Не ЗначениеЗаполнено(НоваяНоменклатура.ВидСтавкиНДС) Тогда
		НоваяНоменклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	КонецЕсли;
	
	КлючВидовПродукции = Неопределено;
	ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(НоваяНоменклатура.КатегорияНоменклатуры)[НоваяНоменклатура.КатегорияНоменклатуры];
	Если Не ОписаниеНоменклатуры = Неопределено Тогда
		КлючВидовПродукции = ОписаниеНоменклатуры.КлючВидовПродукции;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КлючВидовПродукции) Тогда
		НоваяНоменклатура.ПризнакПредметаРасчета = РозничныеПродажиСервер.ПолучитьОжидаемыйПризнакПредметаРасчета(
			НоваяНоменклатура.ТипНоменклатуры,
			КлючВидовПродукции,
			НоваяНоменклатура.ВидМаркировки,
			НоваяНоменклатура.ПодакцизныйТовар,
			НоваяНоменклатура.ПродаетсяВРозлив);
		
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияВЕТИС(КлючВидовПродукции)
			И Не НоваяНоменклатура.ПодконтрольнаяПродукцияВЕТИС Тогда
			НоваяНоменклатура.ПодконтрольнаяПродукцияВЕТИС = Истина;
		КонецЕсли;
	КонецЕсли;
	
	НоваяНоменклатура.УстановитьНовыйКод();
	
	ЗаполнитьНоменклатуруОтраслевымиРеквизитамиПередЗаписью(НоваяНоменклатура);
	
	// Запись реквизитов из правила именования
	Для Каждого ТекРеквизит Из ПараметрыПравилаИменования Цикл
		ИмяРеквизита = ТекРеквизит.ПутьКДанным;
		Если ИмяРеквизита = "КатегорияНоменклатуры"
			 ИЛИ НЕ ТекРеквизит.ДляНоменклатуры
			 ИЛИ ТекРеквизит.ЭтоДопСведение
			 ИЛИ ТекРеквизит.ЭтоДопРеквизит Тогда
			// Доп реквизиты и сведения обрабатывае ниже
			Продолжить;
		КонецЕсли;
		
		ИмяНаФорме = НайтиНазваниеРеквизитаПравилаНаименования(ИмяРеквизита);
		ИмяНаФорме = ?(ИмяНаФорме = Неопределено, ИмяРеквизита, ИмяНаФорме);
		
		ИмяРеквизитаСправочника = СтрЗаменить(ИмяРеквизита, "Номенклатура_", "");
		
		НоваяНоменклатура[ИмяРеквизитаСправочника] = ЭтотОбъект[ИмяНаФорме];
		
	КонецЦикла;
	
	// Заполнение данных предопределенных в категории номенклатуры
	// Записаны только те реквизиты, что не были заполнены ранее
	СписокИменРеквизитовКатегории = Новый Массив;
	СписокИменРеквизитовКатегории.Добавить("СтранаПроисхождения");
	Для Каждого ИмяРеквизита Из СписокИменРеквизитовКатегории Цикл
		Если Не ЗначениеЗаполнено(НоваяНоменклатура[ИмяРеквизита])
				И ЗначениеЗаполнено(НоваяНоменклатура.КатегорияНоменклатуры[ИмяРеквизита]) Тогда
			НоваяНоменклатура[ИмяРеквизита] = НоваяНоменклатура.КатегорияНоменклатуры[ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	// Заполнение Доп Реквизитов
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, НоваяНоменклатура);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Получение наименований
	Если ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры) Тогда
		
		СписокПараметров = ПолучитьСписокПараметровДляШаблона();
		
		НоваяНоменклатура.НаименованиеПолное = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
			СписокПараметров,
			ЭтотОбъект.ор_ПравилоПолногоНаименования.ШаблонДляФормирования);
		НоваяНоменклатура.Наименование = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
			СписокПараметров,
			ЭтотОбъект.ор_ПравилоКраткогоНаименования.ШаблонДляФормирования);
		
		Если Не ЗначениеЗаполнено(НоваяНоменклатура.Наименование) Тогда 
			Если ЗначениеЗаполнено(НоваяНоменклатура.НаименованиеПолное) Тогда
				НоваяНоменклатура.Наименование = НоваяНоменклатура.НаименованиеПолное;
			Иначе
				НоваяНоменклатура.Наименование = ЭтотОбъект["Наименование"];
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		НоваяНоменклатура.Наименование = ЭтотОбъект["Наименование"];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоваяНоменклатура.НаименованиеПолное) Тогда
		НоваяНоменклатура.НаименованиеПолное = НоваяНоменклатура.Наименование;
	КонецЕсли;
	
	Попытка
		// Перед записью доп сведений и вставок необходимо записать элемент.
		НоваяНоменклатура.Записать();
		// ИнтеграцияГосИС
		// Если произойдет ошибка при создании настройки маркируемой продукции,
		// то не уходим в отказ, так как номенклатура уже создана,
		// а сообщение об ошибке выводиться во вложенных функциях.
		ЕстьОшибки = Ложь;
		СобытияФормИСУНФ.ПриЗаписиНаСервере(ЭтотОбъект, НоваяНоменклатура, ЕстьОшибки);
		// Конец ИнтеграцияГосИ
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании номенклатуры: " +Символы.ПС+ОписаниеОшибки());
		Результат = Ложь;
		// Если не создана номенклатура - продолжать нет смысла.
		Возврат Результат;
	КонецПопытки;
	
	ЗаполнитьНоменклатуруОтраслевымиРеквизитамиПослеЗаписи(НоваяНоменклатура);
	
	Если Не ХарактеристикиИспользуютсяВКатегорииНоменклатуры(ЭтотОбъект.КатегорияНоменклатуры) Тогда
		
		// Формирование штрихкода
		ТекЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		ТекЗапись.Номенклатура = НоваяНоменклатура.Ссылка;
		ТекЗапись.Штрихкод     = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
		
		Попытка
			ТекЗапись.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи штрихкода: " +Символы.ПС+ОписаниеОшибки());
			Результат = Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	ЭтотОбъект.Номенклатура = НоваяНоменклатура.Ссылка;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьЗначенияНоменклатурыПоУмолчанию(Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура.КатегорияНоменклатуры) Тогда
		Номенклатура.ВидСтавкиНДС = Номенклатура.КатегорияНоменклатуры.ВидСтавкиНДС;
	Иначе
		Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура.СпособПополнения) Тогда
		Номенклатура.СпособПополнения = Перечисления.СпособыПополненияЗапасов.Закупка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура.МетодОценки) Тогда
		Номенклатура.МетодОценки = Перечисления.МетодОценкиЗапасов.ПоСредней;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура.НаправлениеДеятельности) Тогда
		Номенклатура.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	КонецЕсли;

	Номенклатура.СчетУчетаЗапасов = Справочники.Номенклатура.СчетУчетаЗапасов();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство") Тогда
		Номенклатура.СчетУчетаЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.НезавершенноеПроизводство");
	Иначе
		Номенклатура.СчетУчетаЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.КоммерческиеРасходы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьХарактеристику()
	
	ЕстьОшибки = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоНаименованияХарактеристики) Тогда
		Если ПроверитьЗаполнениеПараметровПравил() Тогда
			ЕстьОшибки = Истина;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект["НаименованиеХарактеристики"]) Тогда
			ЕстьОшибки = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование характеристики не заполнено.",, "ЭтотОбъект.НаименованиеХарактеристики");
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ХарактеристикаСоздана = СоздатьХарактеристикуНаСервере();
	Если ХарактеристикаСоздана Тогда
		
		Если Объект.ПечатьЦенника Тогда
			Печать();
		КонецЕсли;
		
		Если Не ВызовИзСписка Тогда
			ДобавитьВДокумент();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ХарактеристикаСоздана;
	
КонецФункции

// Создание характеристики для созданной\выбранной номенклатуры
&НаСервере
Функция СоздатьХарактеристикуНаСервере()
	
	Результат = Истина;
	Если ИспользуютсяХарактеристикиНоменклатуры(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры) Тогда
		
		// Первичная запись номенклатуры
		НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НоваяХарактеристика.Владелец = ?(ГдеСоздаемХарактеристики = 1, ЭтотОбъект.КатегорияНоменклатуры, ЭтотОбъект.Номенклатура);
		
		Если НЕ ЗаполнитьХарактеристикуОтраслевымиРеквизитамиПередЗаписью(НоваяХарактеристика) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Запись реквизитов из правила именования
		Для Каждого ТекРеквизит Из ПараметрыПравилаИменования Цикл
			ИмяРеквизита = ТекРеквизит.ПутьКДанным;
			Если ИмяРеквизита = "КатегорияНоменклатуры"
				 ИЛИ ИмяРеквизита = "Характеристика_ор_Вставка"
				 ИЛИ ТекРеквизит.ДляНоменклатуры
				 ИЛИ ТекРеквизит.ЭтоДопСведение
				 ИЛИ ТекРеквизит.ЭтоДопРеквизит Тогда
				// Доп реквизиты и сведения обрабатывае ниже
				Продолжить;
			КонецЕсли;
			
			ИмяНаФорме = НайтиНазваниеРеквизитаПравилаНаименования(ИмяРеквизита);
			ИмяНаФорме = ?(ИмяНаФорме = Неопределено,ИмяРеквизита,ИмяНаФорме);
			
			ИмяРеквизитаСправочника = СтрЗаменить(ИмяРеквизита, "Характеристика_","");
			
			НоваяХарактеристика[ИмяРеквизитаСправочника] = ЭтотОбъект[ИмяНаФорме];
		КонецЦикла;
		
		// Заполнение Доп Реквизитов
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, НоваяХарактеристика);
		// Конец СтандартныеПодсистемы.Свойства
		
		Попытка
			НачатьТранзакцию();
			// Первичная запись номенклатуры
			НоваяХарактеристика.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании характеристики: " +Символы.ПС+ОписаниеОшибки());
			Результат = Ложь;
			// Если не создана номенклатура - продолжать нет смысла.
			Возврат Результат;
		КонецПопытки;
		
		Если НЕ ЗаполнитьХарактеристикуОтраслевымиРеквизитамиПослеЗаписи(НоваяХарактеристика) Тогда
			Результат = Ложь;
		КонецЕсли;
		
		СписокПараметров = ПолучитьСписокПараметровДляШаблона(Истина);
		Если ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры) И ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоНаименованияХарактеристики) Тогда
			СтрокаНаименованиеХарактеристики = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
				СписокПараметров,
				ЭтотОбъект.ор_ПравилоНаименованияХарактеристики.ШаблонДляФормирования);
			НоваяХарактеристика.Наименование = СтрокаНаименованиеХарактеристики;
		Иначе
			НоваяХарактеристика.Наименование = ЭтотОбъект["НаименованиеХарактеристики"];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоНаименованияХарактеристикиДляПечати) Тогда
			НоваяХарактеристика.НаименованиеДляПечати = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(
				СписокПараметров,
				ЭтотОбъект.ор_ПравилоНаименованияХарактеристикиДляПечати.ШаблонДляФормирования);
		КонецЕсли;
		
		Если ПустаяСтрока(НоваяХарактеристика.НаименованиеДляПечати) Тогда
			НоваяХарактеристика.НаименованиеДляПечати = НоваяХарактеристика.Наименование;
		КонецЕсли;
		
		Попытка
			НоваяХарактеристика.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании характеристики: " +Символы.ПС+ОписаниеОшибки());
			Результат = Ложь;
			ОтменитьТранзакцию();
		КонецПопытки;
		
		// Формирование штрихкода
		ТекЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		ТекЗапись.Номенклатура   = ЭтотОбъект.Номенклатура;
		ТекЗапись.Характеристика = НоваяХарактеристика.Ссылка;
		ТекЗапись.Штрихкод       = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
		
		Попытка
			ТекЗапись.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи штрихкода: " +Символы.ПС+ОписаниеОшибки());
			Результат = Ложь;
		КонецПопытки;
		
		ЭтотОбъект.Характеристика = НоваяХарактеристика.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСИзображением

// Запись полученной картинки в текущую номенклатуру
//
&НаСервере
Процедура ЗаписатьКартинкуНоменклатуры(Файл)
	
	НоменклатураОбъект              = ЭтотОбъект.Номенклатура.ПолучитьОбъект();
	НоменклатураОбъект.ФайлКартинки = Файл;
	НоменклатураОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеВХранилище()
	
	АдресВременногоХранилищаТекста = "";
	РасширениеБезТочки             = "jpg";
	
	ИмяСоздания = ПолучитьНаименованиеКартинки(ЭтотОбъект.Номенклатура);
	
	Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		#Если Не ВебКлиент Тогда
		ДанныеКартинки = ПолучитьИзВременногоХранилища(АдресИзображения);
		АдресВременногоФайла = ПолучитьИмяВременногоФайла(".jpg");
		ДанныеКартинки.Записать(АдресВременногоФайла);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВладелецФайла",                           ЭтотОбъект.Номенклатура);
		ДополнительныеПараметры.Вставить("ИдентификаторФормы",                      Новый УникальныйИдентификатор);
		ДополнительныеПараметры.Вставить("Фильтр",                                  "");
		ДополнительныеПараметры.Вставить("ГруппаФайлов",                            Неопределено);
		ДополнительныеПараметры.Вставить("ПолноеИмяФайла",                          АдресВременногоФайла);
		ДополнительныеПараметры.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла", Истина);
		ДополнительныеПараметры.Вставить("ИмяСоздаваемогоФайла",                    ИмяСоздания);
		
		ВыборИзображения = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьФайлыРасширениеПредложено", РаботаСФайламиСлужебныйКлиент, ДополнительныеПараметры);
		РаботаСФайламиСлужебныйКлиент.ПоказатьВопросОбУстановкеРасширения1СПредприятия(ОписаниеОповещения);
		ВыборИзображения = Ложь;
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеКартинки(Номенклатура)
	
	ДатаВАдресе = СтрЗаменить(ТекущаяДата(),":","_");
	Возврат Номенклатура.Наименование + ДатаВАдресе;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайлаЗавершение(ВыбранныеФайлы, ДопПараметр) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзображениеОчистить(Неопределено);
	
	ОповещениеПомещения = Новый ОписаниеОповещения("НачатьПомещениеФайлаЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОповещениеПомещения,, ВыбранныеФайлы[0], Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПомещениеФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	
	Если Не Результат Тогда
		ПоказатьПредупреждение(, "Ошибка загрузки изображения в временное хранилище!");
		Возврат;	
	КонецЕсли;
	
	АдресИзображения = Адрес;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Функция - Запрос дополнения товаров для печати
// 
// Возвращаемое значение:
//   Результат - текст запроса дополнения исходных данных.
//
&НаСервере
Функция ЗапросДополненияТоваровДляПечати()
	
	Результат = Новый Запрос(
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Партия КАК Партия,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Партия КАК Партия,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО Товары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И Товары.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|			И Товары.Партия = ШтрихкодыНоменклатуры.Партия
	|			И Товары.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.ЕдиницаИзмерения");
	
	Возврат Результат;


КонецФункции

// Процедура - Печать на сервере
//
&НаСервере
Процедура ДополнитьТоварыДляПечати()
	
	Товары = Новый ТаблицаЗначений();
	Товары.Колонки.Добавить("Номенклатура",         Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика",       Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("Партия",               Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры"));
	Товары.Колонки.Добавить("ЕдиницаИзмерения",     Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	
	НовыйТовар = Товары.Добавить();
	НовыйТовар.Номенклатура        = ЭтотОбъект.Номенклатура;
	НовыйТовар.Характеристика      = ЭтотОбъект.Характеристика;
	НовыйТовар.Партия              = Справочники.ПартииНоменклатуры.ПустаяСсылка();
	НовыйТовар.ЕдиницаИзмерения    = ЭтотОбъект.ЕдиницаИзмерения;
	
	Запрос = ЗапросДополненияТоваровДляПечати();
	Запрос.УстановитьПараметр("Товары", Товары);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТоварыСоШтрихкодом = РезультатЗапроса[1].Выгрузить();
	
	Для Каждого Товар Из ТаблицаТоваровБПОДляПечати Цикл
		
		РезультатПоиска = ТоварыСоШтрихкодом.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Партия",
			Товар.НоменклатураБПО, Товар.ХарактеристикаБПО, Товар.Партия));
		Если РезультатПоиска.Количество() > 0 Тогда
			Товар.Штрихкод = РезультатПоиска[0].Штрихкод;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура осуществляет печать по выбранному шаблону.
//
&НаКлиенте
Процедура Печать()
	
	ХарактеристикиНеИспользуются = Не ИспользуютсяХарактеристикиНоменклатуры(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры);
	СоздаетсяНоменклатура        = ТекущееДействие = "СозданиеНоменклатуры";
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Если (ХарактеристикиНеИспользуются И СоздаетсяНоменклатура) Или Не СоздаетсяНоменклатура Тогда
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШаблоныЭтикетокИЦенниковБПО.ПустаяСсылка"));
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТорговыйОбъект",        МагазинДляПечати);
		ПараметрыПечати.Вставить("МассивСтруктурТоваров", ПодготовитьТоварыДляПечати());
		ПараметрыПечати.Вставить("ВидЦены",               ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
		ПараметрыПечати.Вставить("ВидЦеныАкционный",      ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")); 
		ПараметрыПечати.Вставить("ЦеныНаДату",            ТекущаяДата());
		
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ор_СозданиеНоменклатуры", "Ценники", ПараметрКоманды, ЭтотОбъект, ПараметрыПечати);
	
	КонецЕсли;
	
КонецПроцедуры

// Очистка значений реквизитов параметров печати
//
&НаСервере
Процедура ОчиститьПараметрыПечати()
	
	МагазинДляПечати     = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	ОрганизацияДляПечати = Справочники.Организации.ПустаяСсылка();
	Шаблон               = Справочники.ХранилищеШаблонов.ПустаяСсылка();
	
КонецПроцедуры

// Установка доступности элементов управления, отвечающих за настройку печати.
//
&НаКлиенте
Процедура УстановитьДоступностьПараметровПечати()
	
	Элементы.ПечатьМагазин.Доступность     = Объект.ПечатьЦенника;
	Элементы.ПечатьОрганизация.Доступность = Объект.ПечатьЦенника;
	Элементы.ПечатьШаблон.Доступность      = Объект.ПечатьЦенника;
	
КонецПроцедуры // УстановитьДоступностьПараметровПечати()

#КонецОбласти

// Создает структуру из реквизитов и общих реквизитов объекта метаданных - справочника или документа.
//  Примечание: табличные части в структуру не попадут.
//
// Параметры:
//  ИмяОбъекта	 - Строка - Имя объекта метаданных структуру которого необходимо получить.
// 
// Возвращаемое значение:
//  Структура - структура объекта метаданных, или пустая структура если объект найти не удалось.
//
&НаСервереБезКонтекста
Функция СтруктураОбъектаМетаданных(ИмяОбъекта)
	
	СтруктураОбъекта = Новый Структура;
	
	ОбъектМетаданных = Метаданные.Справочники.Найти(ИмяОбъекта);
	Если ОбъектМетаданных = Неопределено Тогда 
		ОбъектМетаданных = Метаданные.Документы.Найти(ИмяОбъекта);
	КонецЕсли;
	
	Если ОбъектМетаданных <> Неопределено Тогда 
		Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			СтруктураОбъекта.Вставить(Реквизит.Имя);
		КонецЦикла;
		
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			СтруктураОбъекта.Вставить(Реквизит.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьАвтоОтметкуНеЗаполненногоВПараметрахПравил()
	
	Результат = ПолучитьНезаполненныеПравилаНаименования();
	Для Каждого Элемент Из Результат.СписокДанных Цикл
		Если Элементы.Найти(Элемент.ИмяРеквизита) <> Неопределено Тогда
			Элементы[Элемент.ИмяРеквизита].АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет структуру объекта метаданных по данным формы, выполняет заполнение значений свойств,
// и поиск автогенерированных реквизитов с префиксом.
//
// Параметры:
//  СтруктураОбъекта - Структура	 - структура объекта метаданных.
//  Префикс			 - Строка	 - префикс автогенерированных реквизитов объекта.
//
&НаКлиенте
Процедура ЗаполнитьСтруктуруОбъекта(СтруктураОбъекта, Префикс)
	
	ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ЭтотОбъект);
	Для Каждого КлючИЗначение Из СтруктураОбъекта Цикл
		ИмяРеквизитаСПрефиксом = Префикс + "_" + КлючИЗначение.Ключ;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизитаСПрефиксом) Тогда 
			СтруктураОбъекта[КлючИЗначение.Ключ]= ЭтотОбъект[ИмяРеквизитаСПрефиксом];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выполнение оповещения документа владелеца о записи номенклатуры
//
&НаКлиенте
Процедура ДобавитьВДокумент()
	
	ХарактеристикиНеИспользуются = Не ИспользуютсяХарактеристикиНоменклатуры(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры);
	
	СоздаетсяНоменклатура = ТекущееДействие = "СозданиеНоменклатуры" Или ТекущееДействие = "СозданиеИзображения";
	
	СписокПараметрыСоздания = Новый СписокЗначений;
	СписокПараметрыСоздания.Добавить(ЭтотОбъект.Номенклатура);
	СписокПараметрыСоздания.Добавить(?(ХарактеристикиНеИспользуются, Неопределено, ЭтотОбъект.Характеристика));
	СписокПараметрыСоздания.Добавить(?(ЗначениеЗаполнено(ЭтотОбъект.ЦенаХарактеристики), ЭтотОбъект.ЦенаХарактеристики, ЭтотОбъект.Цена));
	СписокПараметрыСоздания.Добавить(ЭтотОбъект.ВидЦены);
	СписокПараметрыСоздания.Добавить(ИмяТЧ);
	
	Если (ХарактеристикиНеИспользуются И СоздаетсяНоменклатура) ИЛИ НЕ СоздаетсяНоменклатура Тогда
		ОповеститьОЗаписиНового(СписокПараметрыСоздания);
	КонецЕсли;
	
КонецПроцедуры

// Заполнение реквизитов для выбранной номенклатуры
//
&НаСервере
Процедура ЗаполнитьРеквизитыВыбраннойНоменклатуры()
	
	ЭтотОбъект.ГруппаНоменклатуры    = ЭтотОбъект.Номенклатура.Родитель;
	ЭтотОбъект.Артикул               = ЭтотОбъект.Номенклатура.Артикул;
	ЭтотОбъект.КатегорияНоменклатуры = ЭтотОбъект.Номенклатура.КатегорияНоменклатуры;
	ЭтотОбъект.Наименование          = ЭтотОбъект.Номенклатура.Наименование;
	ЭтотОбъект.ЕдиницаИзмерения      = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
	ЭтотОбъект.ЦеноваяГруппа         = ЭтотОбъект.Номенклатура.ЦеноваяГруппа;
	
	ИспользуютсяХарактеристики = ИспользуютсяХарактеристикиНоменклатуры(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры);
	ПроверятьЗаполнениеХарактеристики = ПроверятьЗаполнениеХарактеристики(ЭтотОбъект.Номенклатура, ЭтотОбъект.КатегорияНоменклатуры);
	
	ЗаполнитьРеквизитыВыбраннойНоменклатурыОтраслевые();
	
	ОбновитьЭлементыДополнительныхРеквизитов();
	
	ЗаполнитьПравилаНаименованияПоКатегорииНоменклатуры();
	СоздатьРеквизитыИПоляФормыПравила();
	ЗаполнитьРеквизитыПравилВыбраннойНоменклатуры();
	ЗаполнитьПараметрыПравилаИменованияСервер();
	ОбновитьЗначенияПравилНаименования();
	
КонецПроцедуры

&НаСервере
// Процедура - Заполняет данные реквизитов созданных из правил наименования
//
Процедура ЗаполнитьРеквизитыПравилВыбраннойНоменклатуры()
	
	Для Каждого ТекСтрока Из ПараметрыПравилаИменования Цикл
		
		// Исключение - "Наименование поставщика","КатегорияНоменклатуры" - значения всегда по умолчанию
		Если ТекСтрока.ПутьКДанным = "КатегорияНоменклатуры" 
			ИЛИ ТекСтрока.ИмяПараметра = "ор_НаименованиеПоставщика" Тогда
			Продолжить;
		КонецЕсли;
		
		// Выполняем поиск программно созданнных элементов.
		ТекЭлемент = Элементы.Найти(ТекСтрока.ИмяЭлемента);
		Если ТекЭлемент <> Неопределено Тогда
			НазваниеРеквизитаНоменклатуры = СтрЗаменить(ТекЭлемент.ПутьКДанным, "Номенклатура_", "");
			ЭтотОбъект[ТекСтрока.ПутьКДанным] = ЭтотОбъект.Номенклатура[НазваниеРеквизитаНоменклатуры];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыВыбранногоКатегорииНоменклатуры()
	
	ИменаРеквизитовДляОбновления = ЗаполнитьРеквизитыВыбранногоКатегорииНоменклатурыНаСервере();
	Для Каждого ИмяРеквизита Из ИменаРеквизитовДляОбновления Цикл
		СохранятьЗначениеПриИзменении(Элементы["СохранятьЗначение" + ИмяРеквизита], Ложь);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Заполняет реквизиты связанные с текущим видом номенклатуры
//
&НаСервере
Функция ЗаполнитьРеквизитыВыбранногоКатегорииНоменклатурыНаСервере()
	
	МассивРеквизитовДляОбновления = Новый Массив;
	ТекущаяКатегорияНоменклатуры = ЭтотОбъект.КатегорияНоменклатуры;
	
	Если ЗначениеЗаполнено(ТекущаяКатегорияНоменклатуры.ЕдиницаИзмерения) Тогда
		ЭтотОбъект.ЕдиницаИзмерения = ТекущаяКатегорияНоменклатуры.ЕдиницаИзмерения;
		МассивРеквизитовДляОбновления.Добавить("ЕдиницаИзмерения");
	КонецЕсли;
	
	ЭтотОбъект.СохранятьЗначениеЕдиницаИзмерения = Истина;
	
	Если ЗначениеЗаполнено(ТекущаяКатегорияНоменклатуры.ЦеноваяГруппа) Тогда
		ЭтотОбъект.ЦеноваяГруппа = ТекущаяКатегорияНоменклатуры.ЦеноваяГруппа;
		МассивРеквизитовДляОбновления.Добавить("ЦеноваяГруппа");
	КонецЕсли;
	
	ЗаполнитьРеквизитыВыбранногоКатегорииНоменклатурыОтраслевые(МассивРеквизитовДляОбновления);
	
	// Дополнительные реквизиты
	ОбновитьЭлементыДополнительныхРеквизитов();
	ИспользуютсяХарактеристики = ТекущаяКатегорияНоменклатуры.ИспользоватьХарактеристики;
	ПроверятьЗаполнениеХарактеристики = ТекущаяКатегорияНоменклатуры.ПроверятьЗаполнениеХарактеристики;
	
	// Очистка правил, реквизитов и элеменотов
	ЗаполнитьПравилаНаименованияПоКатегорииНоменклатуры();
	СоздатьРеквизитыИПоляФормыПравила();
	ЗаполнитьПараметрыПравилаИменованияСервер();
	
	МассивОбновленных = Новый Массив;
	Для Каждого ИмяРеквизита Из МассивРеквизитовДляОбновления Цикл
		Если ОбновитьЗначениеСохранения(ИмяРеквизита) Тогда
			МассивОбновленных.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОбновленных;
	
КонецФункции

&НаСервере
Функция ОбновитьЗначениеСохранения(ИмяЭлемента)
	
	ЭлементФормы = Элементы.Найти("СохранятьЗначение" + ИмяЭлемента);
	Элемент = Элементы[ИмяЭлемента];
	
	ТребуетсяОбновление = ЭлементФормы <> Неопределено 
		И СохраненныеПользователемЭлементы.НайтиПоЗначению(ИмяЭлемента) = Неопределено;
	Если ТребуетсяОбновление Тогда
		НазваниеРеквизита = Элементы[ИмяЭлемента].ПутьКДанным;
		ЭтотОбъект["СохранятьЗначение" + ИмяЭлемента] = ЗначениеЗаполнено(ЭтотОбъект[НазваниеРеквизита]);
	КонецЕсли;
	
	Возврат ТребуетсяОбновление;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИспользуютсяХарактеристикиНоменклатуры(Номенклатура, КатегорияНоменклатуры)
	
	Возврат Номенклатура.ИспользоватьХарактеристики Или КатегорияНоменклатуры.ИспользоватьХарактеристики;
	
КонецФункции

&НаСервереБезКонтекста
Функция ХарактеристикиИспользуютсяВКатегорииНоменклатуры(КатегорияНоменклатуры)
	
	Возврат КатегорияНоменклатуры.ИспользоватьХарактеристики;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверятьЗаполнениеХарактеристики(Номенклатура, КатегорияНоменклатуры)
	
	Возврат Номенклатура.ПроверятьЗаполнениеХарактеристики Или КатегорияНоменклатуры.ПроверятьЗаполнениеХарактеристики;
	
КонецФункции

// Функция - Узнать сущетвует ли реквизит с данным названием.
//
// Параметры:
//  Название - Строка - Название реквизита 
// 
// Возвращаемое значение:
//  Булево - Существует реквизит
//
&НаСервере
Функция РеквизитСуществует(Название)
	
	Попытка
		НайденныйРеквизитОбъекта = ЭтотОбъект[Название];
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Процедура - Выполнить очистку реквизитов текущей страницы
//
// Параметры:
//  ТолькоНеСохраненные	 - Булево - Очищать только элементы без установленного сохранения
//
&НаСервере
Процедура ОчиститьРеквизитыТекущейСтраницы(ТолькоНеСохраненные=Ложь)
	
	Очередь = Новый Массив;
	Если ТекущееДействие <> "СозданиеНоменклатуры" Тогда
		Очередь.Добавить(Элементы.СтраницаСозданиеХарактеристик);
	КонецЕсли;
	
	Если ТекущееДействие <> "СозданиеХарактеристики" Тогда
		Очередь.Добавить(Элементы.СтраницаСозданиеНоменклатуры);
	КонецЕсли;
	
	Для Каждого Элемент Из Очередь Цикл		
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("ГруппаФормы") Тогда
			Для Каждого Потомок Из Элемент.ПодчиненныеЭлементы Цикл
				Очередь.Добавить(Потомок);
			КонецЦикла;
		ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда
			Если ТолькоНеСохраненные Тогда
				Если Элемент.ПутьКДанным = "Номенклатура"
					Или Элемент.ПутьКДанным = "ИспользуютсяХарактеристики"
					Или Элемент.ПутьКДанным = "ПроверятьЗаполнениеХарактеристики" Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрНайти(Элемент.Имя, "СохранятьЗначение") Тогда
					Продолжить;
				КонецЕсли;
				
				ПометкаСуществует = РеквизитСуществует("СохранятьЗначение" + Элемент.Имя);
				Если ПометкаСуществует И ЭтотОбъект["СохранятьЗначение" + Элемент.Имя] Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ЭтотОбъект[Элемент.ПутьКДанным] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция - Установить фокусировку первый доступный элемент текущей страницы без свойства "ПропускатьПриВводе"
//
// Параметры:
//  Родитель - ГруппаФормы, СтраницаФормы - Группа или страница у которой 
//                                          требуется сфоркусировать на первом элементе.
//                                          По умолчанию будет выбрана текущая страница.
// 
// Возвращаемое значение:
//  Булево - Успешность операции
//
&НаКлиенте
Функция УстановитьФокусировкуНаЭлемент(Родитель=Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = Элементы.СтраницыЭтапов.ТекущаяСтраница;
	КонецЕсли;
	
	Для Каждого Элемент Из Родитель.ПодчиненныеЭлементы Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("ГруппаФормы") Тогда
			// Требуется проход в глубину, поэтому выбран рекурсивный вариант
			Если УстановитьФокусировкуНаЭлемент(Элемент) Тогда
				Возврат Истина;
			КонецЕсли;
		ИначеЕсли ТипЭлемента = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			Если Элемент.ПропускатьПриВводе = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Элемент.Видимость И Элемент.Доступность И НЕ Элемент.ПропускатьПриВводе Тогда
				ЭтотОбъект.ТекущийЭлемент = Элемент;
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросИзмененныхДанных(Оповещение)
	
	Если ТекущееДействие <> "ВыборРежима" И ДанныеИзменены Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ПоказатьВопросПодтвержденияВыходаЗавершение", ЭтотОбъект, Оповещение);
		НазваниеОбъекта = ?(ТекущееДействие = "СозданиеХарактеристики", "характеристики", "номенклатуры");
		ПоказатьВопрос(ОповещениеЗакрытия, НСтр(СтрШаблон("ru = 'Незаписанные изменения параметров %1 будут утрачены, продолжить?'", НазваниеОбъекта)), Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПодтвержденияВыходаЗавершение(Результат, Оповещение) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьОбработкуОповещения(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиПараметровНоменклатуры()
	
	ЕстьОшибки = Ложь;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.КатегорияНоменклатуры) Тогда
		ЕстьОшибки = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед записью необходимо заполнить ""Категорию номенклатуры""!",,"КатегорияНоменклатуры"); 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЕдиницаИзмерения) Тогда
		ЕстьОшибки = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед записью необходимо заполнить ""Единицу измерения""!",,"ЕдиницаИзмерения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоКраткогоНаименования)
		Или ЗначениеЗаполнено(ЭтотОбъект.ор_ПравилоПолногоНаименования) Тогда
		Если ПроверитьЗаполнениеПараметровПравил() Тогда
			ЕстьОшибки = Истина;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект["Наименование"]) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование номенклатуры не заполнено.",,"Наименование");
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПереходССозданияНоменклатуры()
	
	РежимМножественногоСоздания = РежимСоздания = 2;
	
	ПереходНаХарактеристики = Истина;
	ЗаполнитьПараметрыПравилаИменования = Ложь;
	Если ИспользуютсяХарактеристики И Не СозданиеТолькоНоменклатуры Тогда
		ТекущееДействие	= "СозданиеХарактеристики";
		ЗаполнитьПараметрыПравилаИменования = Истина;
	ИначеЕсли РежимМножественногоСоздания Тогда
		ТекущееДействие = "СозданиеНоменклатуры";
		ПереходНаХарактеристики = Ложь;
		ЗаполнитьПараметрыПравилаИменования = Истина;
	Иначе
		Закрыть();
	КонецЕсли;
	
	ОчиститьРеквизитыИПерезаписатьПравила(Истина,
		ПереходНаХарактеристики, ПереходНаХарактеристики,
		ПереходНаХарактеристики, ЗаполнитьПараметрыПравилаИменования, Не ПереходНаХарактеристики);
		
	ОбновитьАвтоОтметкуНеЗаполненногоВПараметрахПравил();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыИПерезаписатьПравила(ОчиститьТолькоНеСохранённые = Ложь,
												ЭтоПараметрыДляХарактеристики = Ложь, ЭтоПереход = Ложь,
												ЗаполнятьПоКатегории = Истина, ЗаполнитьПараметры = Ложь,
												СохранитьЗначения = Ложь)
	
	ОчиститьРеквизитыТекущейСтраницы(ОчиститьТолькоНеСохранённые);
	
	Если ЭтоПереход Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	
	ПерезаписатьПравилаНаименования(ЭтоПараметрыДляХарактеристики, ЭтоПереход,
			ЗаполнятьПоКатегории, ЗаполнитьПараметры, СохранитьЗначения);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыИОбновитьПравила(УдалитьПравила = Ложь)
	
	ОчиститьРеквизитыТекущейСтраницы(Не УдалитьПравила);
	
	Если УдалитьПравила Тогда
		УдалитьРеквизитыИЭлементыПравилНаименования();
	Иначе
		ОбновитьЗначенияПравилНаименования();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипНоменклатурыПоУмолчанию(КатегорияСсылка)
	Возврат КатегорияСсылка.ТипНоменклатурыПоУмолчанию;
КонецФункции

#Область РаботаСВебкамерой

&НаКлиенте
Процедура НачатьПолучениеФотоЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ИзображениеОчистить(Неопределено);
		
		Если ЗначениеЗаполнено(ПутьКВременномуФайлу) Тогда
			ОтключитьОбработчикОжидания("ПолучениеИзменениеНовогоФотоНоменклатуры");
			УдалитьКартинкуИзВременныхФайлов(РезультатВыполнения.АдресФото);
		Иначе
			УстановитьНовоеВременноеФото(РезультатВыполнения.АдресФото);
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовоеВременноеФото(АдресФото)
	
	ПутьКВременномуФайлу = АдресФото;
	ВременныйАдрес       = АдресФото;
	
	// Ожидание пока пользователь сделает фото с камеры
	ПодключитьОбработчикОжидания("ПолучениеИзменениеНовогоФотоНоменклатуры", 1.5, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключениеВидеокамерыЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		УдалитьКартинкуИзВременныхФайлов();
	Иначе
		ТекстСообщения = НСтр("ru='""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеИзменениеНовогоФотоНоменклатуры()
	
	Попытка
		Файл = Новый Файл(ВременныйАдрес);
		
		// Проверим существование файла
		Если Файл.Существует() Тогда
			ОповещениеПомещения = Новый ОписаниеОповещения("НачатьПомещениеФайлаЗавершение", ЭтотОбъект);
			НачатьПомещениеФайла(ОповещениеПомещения,, ВременныйАдрес, Ложь, УникальныйИдентификатор);
			ВременныйАдрес = Неопределено;
			
			ТекстСообщения = НСтр("ru='""Файл картинки получен"".'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКартинкуИзВременныхФайлов(АдресНовогоФото=Неопределено)
	
	Если ПутьКВременномуФайлу <> Неопределено Тогда
		НовыйФайлКартинки = Новый Файл(ПутьКВременномуФайлу);
		
		Оповещение = Новый ОписаниеОповещения("НачатьПроверкуСуществованияЗавершение", ЭтотОбъект, АдресНовогоФото);
		НовыйФайлКартинки.НачатьПроверкуСуществования(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуСуществованияЗавершение(Существует, АдресНовогоФото) Экспорт
	
	Если Существует Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьУдалениеФайловЗавершение", ЭтотОбъект, АдресНовогоФото);
		НачатьУдалениеФайлов(ОписаниеОповещения, ПутьКВременномуФайлу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеФайловЗавершение(АдресНовогоФото) Экспорт
	
	ПутьКВременномуФайлу = Неопределено;
	Если АдресНовогоФото <> Неопределено Тогда
		УстановитьНовоеВременноеФото(АдресНовогоФото);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

#Область СозданиеРеквизитовИПолейФормы

&НаСервере
Процедура СформироватьОтраслевыеРеквизиты(ПараметрыРеквизитов)
	
	#Область СтандартныеРеквизиты
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "Производитель";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Производитель'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Производитель товара.'");
	НовыйРеквизит.Группа       = Элементы.ГруппаДополнительныеПараметрыПравыйСтолбец;
	
	МассивТипов = Новый Массив();
	Если ИспользоватьОтраслевогоПроизводителя Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.ор_Производители"));
	Иначе
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	КонецЕсли;
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита  = "ЖНВЛП";
	НовыйРеквизит.Заголовок     = НСтр("ru = 'ЖНВЛП'");
	НовыйРеквизит.Подсказка     = НСтр("ru = 'Жизненно необходимый лекарственный препарат'");
	НовыйРеквизит.Группа        = Элементы.ГруппаОсновныеПараметрыПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки = Ложь;
	НовыйРеквизит.КнопкаВыбора  = Ложь;
	НовыйРеквизит.ТипРеквизита  = Новый ОписаниеТипов("Булево");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ЖНВЛППриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита  = "Яд";
	НовыйРеквизит.Заголовок     = НСтр("ru = 'Яд'");
	НовыйРеквизит.Подсказка     = НСтр("ru = 'Признак того, что товар является ядом'");
	НовыйРеквизит.Группа        = Элементы.ГруппаОсновныеПараметрыПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки = Ложь;
	НовыйРеквизит.КнопкаВыбора  = Ложь;
	НовыйРеквизит.ТипРеквизита  = Новый ОписаниеТипов("Булево");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита  = "НаркотическоеСредство";
	НовыйРеквизит.Заголовок     = НСтр("ru = 'Наркотическое средство'");
	НовыйРеквизит.Подсказка     = НСтр("ru = 'Признак того, что товар является наркотическим средством'");
	НовыйРеквизит.Группа        = Элементы.ГруппаОсновныеПараметрыПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки = Ложь;
	НовыйРеквизит.КнопкаВыбора  = Ложь;
	НовыйРеквизит.ТипРеквизита  = Новый ОписаниеТипов("Булево");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "МНН";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'МНН'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Международное непатентованное наименование'");
	НовыйРеквизит.Группа       = Элементы.ГруппаДополнительныеПараметрыЛевыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ор_МНН"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "СМНН";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'СМНН'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Справочник международных непатентованных наименований (СМНН)'");
	НовыйРеквизит.Группа       = Элементы.ГруппаДополнительныеПараметрыЛевыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ор_СМНН"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "ЕГК";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'ЕГК'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Единый государственный классификатор лекарственных средств'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаДополнительныеПараметрыЛевыйСтолбец;
	НовыйРеквизит.КнопкаОчистки           = Ложь;
	НовыйРеквизит.КнопкаВыбора            = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20));
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ФормаВыпуска";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Форма выпуска'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Форма выпуска препарата'");
	НовыйРеквизит.Группа       = Элементы.ГруппаДополнительныеПараметрыЛевыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ор_ФормыВыпуска"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "КодРосздравнадзора";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'Код Росздравнадзора'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Код препарата, согласно данных Росздравнадзора'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаДополнительныеПараметрыПравыйСтолбец;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0));
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита  = "ЗарегистрированВСистемеМониторингаЦен";
	НовыйРеквизит.Заголовок     = НСтр("ru = 'Зарегистрирован в системе мониторинга цен'");
	НовыйРеквизит.Подсказка     = НСтр("ru = 'Признак регистрации в системе мониторинга цен'");
	НовыйРеквизит.Группа        = Элементы.ГруппаДополнительныеПараметрыПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки = Ложь;
	НовыйРеквизит.КнопкаВыбора  = Ложь;
	НовыйРеквизит.ТипРеквизита  = Новый ОписаниеТипов("Булево");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита  = "ОтпускПоРецепту";
	НовыйРеквизит.Заголовок     = НСтр("ru = 'Отпуск по рецепту'");
	НовыйРеквизит.Подсказка     = НСтр("ru = 'Признак отпуска по рецепту'");
	НовыйРеквизит.Группа        = Элементы.ГруппаДополнительныеПараметрыПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки = Ложь;
	НовыйРеквизит.КнопкаВыбора  = Ложь;
	НовыйРеквизит.ТипРеквизита  = Новый ОписаниеТипов("Булево");
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	#КонецОбласти
	
	#Область РеквизитыХарактеристик
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "ДатаИзготовления";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'Дата изготовления'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Дата изготовления серии номенклатуры'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаПараметрыХарактеристикиЛевыйСтолбец;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ДатаИзготовленияПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "СрокХранения";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'Срок хранения'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Срок хранения'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаПараметрыХарактеристикиЛевыйСтолбец;
	НовыйРеквизит.КнопкаВыбора            = Истина;
	НовыйРеквизит.КнопкаОчистки           = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0));
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "СрокХраненияПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "СрокГодности";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'Срок годности'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Срок годности серии'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаПараметрыХарактеристикиЛевыйСтолбец;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ОтметкаНезаполненного   = Истина;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "СрокГодностиПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "СерияПроизводителя";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'Серия производителя'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Серия производителя товара'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаПараметрыХарактеристикиПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки           = Ложь;
	НовыйРеквизит.КнопкаВыбора            = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ОтметкаНезаполненного   = Истина;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50));
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "СерияПроизводителяПриИзменении");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита            = "СертификатСтрока";
	НовыйРеквизит.Заголовок               = НСтр("ru = 'Сертификат'");
	НовыйРеквизит.Подсказка               = НСтр("ru = 'Представление сертификата'");
	НовыйРеквизит.Группа                  = Элементы.ГруппаПараметрыХарактеристикиПравыйСтолбец;
	НовыйРеквизит.КнопкаОчистки           = Ложь;
	НовыйРеквизит.КнопкаВыбора            = Ложь;
	НовыйРеквизит.КнопкаВыпадающегоСписка = Ложь;
	НовыйРеквизит.ТипРеквизита            = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250));
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = ПолучитьШаблонСтандартногоРеквизита();
	НовыйРеквизит.ИмяРеквизита = "ПроизводительСерии";
	НовыйРеквизит.Заголовок    = НСтр("ru = 'Производитель'");
	НовыйРеквизит.Подсказка    = НСтр("ru = 'Производитель серии'");
	НовыйРеквизит.Группа       = Элементы.ГруппаПараметрыХарактеристикиПравыйСтолбец;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ор_Производители"));
	НовыйРеквизит.ТипРеквизита = Новый ОписаниеТипов(МассивТипов);
	НовыйРеквизит.ОбрабатываемыеСобытия.Вставить("ПриИзменении", "ПриИзмененииРеквизита");
	ПараметрыРеквизитов.Добавить(НовыйРеквизит);
	
	#КонецОбласти
	
	#Область СлужебныеРеквизиты
	// Служебные реквизиты, которые как правило не имеют отображения на форме и создаются
	// с целью хранения отраслевой информации
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДополнительныеОтраслевыеЭлементы()
	// Заполняется дополнительным созданием или настройкой элементов форм.
	// Вызов происходит после СформироватьОтраслевыеРеквизиты и необходим для пост обработки элементов.
	Элементы.ЦеноваяГруппа.БыстрыйВыбор = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ЗаполениеДанныхНоменклатурыИХарактеристик

// Процедура - Вызывается при заполнении данных номенклатуры перед записью.
//  Используется для записи отраслевых данных в номенклатуру, переданную в параметрах.
//
// Параметры:
//  Номенклатура - Справочники.Номенклатура	 - Новый объект номенклатуры. Отраслевые данные записываются в данный параметр.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
&НаСервере
Процедура ЗаполнитьНоменклатуруОтраслевымиРеквизитамиПередЗаписью(Номенклатура)
	
	Номенклатура.ор_Производитель                         = ЭтотОбъект.Производитель;
	Номенклатура.ор_ЖНВЛС                                 = ЭтотОбъект.ЖНВЛП;
	Номенклатура.ор_Яд                                    = ЭтотОбъект.Яд;
	Номенклатура.ор_НаркотическоеСредство                 = ЭтотОбъект.НаркотическоеСредство;
	Номенклатура.ор_МНН                                   = ЭтотОбъект.МНН;
	Номенклатура.ор_СМНН                                  = ЭтотОбъект.СМНН;
	Номенклатура.ор_ЕГК                                   = ЭтотОбъект.ЕГК;
	Номенклатура.ор_ФормаВыпуска                          = ЭтотОбъект.ФормаВыпуска;
	Номенклатура.ор_КодРосздравнадзора                    = ЭтотОбъект.КодРосздравнадзора;
	Номенклатура.ор_ЗарегистрированВСистемеМониторингаЦен = ЭтотОбъект.ЗарегистрированВСистемеМониторингаЦен;
	Номенклатура.ор_ОтпускПоРецепту                       = ЭтотОбъект.ОтпускПоРецепту;
	Номенклатура.ор_ЛекарственнаяФорма                    = ЭтотОбъект.КатегорияНоменклатуры.ор_ЛекарственнаяФорма;
	
КонецПроцедуры

// Процедура - Вызывается после успешной записи номенклатуры.
//  Используется для создания отраслевых данных зависящих от номенклатуры,
//  но хранящихся в отдельных справочниках, например Ячейка или Вставка.
//
// Параметры:
//  Номенклатура - Справочники.Номенклатура	 - Созданная номенклатура.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
&НаСервере
Процедура ЗаполнитьНоменклатуруОтраслевымиРеквизитамиПослеЗаписи(Номенклатура)
	
	// Установка отраслевых реквизитов для номенклатуры
	
КонецПроцедуры

// Процедура - Вызывается при заполнении данных характеристики перед записью.
//  Используется для записи отраслевых данных в характеристику, переданную в параметрах.
//
// Параметры:
//  Характеристика	 - Справочники.Характеристики	 - Новый объект характеристики. Отраслевые данные записываются в данный параметр.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
&НаСервере
Функция ЗаполнитьХарактеристикуОтраслевымиРеквизитамиПередЗаписью(Характеристика)
	
	// Установка отраслевых реквизитов для характеристики
	ИспользуютсяСерии =  ПолучитьФлагСерийногоУчета();
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СрокГодности) И ИспользуютсяСерии Тогда
		Сообщение = НСтр("ru = 'Срок годности не заполнен!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СерияПроизводителя) И ИспользуютсяСерии Тогда
		Сообщение = НСтр("ru = 'Серия производителя не заполнена!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат Ложь;
	КонецЕсли;
	
	Характеристика.ор_СерияПроизводителя = ЭтотОбъект.СерияПроизводителя;
	Характеристика.ор_ДатаИзготовления   = ЭтотОбъект.ДатаИзготовления;
	Характеристика.ор_СрокГодности       = ЭтотОбъект.СрокГодности;
	Характеристика.ор_СертификатСтрока   = ЭтотОбъект.СертификатСтрока;
	Характеристика.ор_Производитель      = ЭтотОбъект.ПроизводительСерии;
	
	Если ор_ИнтеграцияМДЛП.ПолучитьФлагМаркируемогоТовара(Характеристика.Владелец) Тогда
		Характеристика.ор_МаркируемыйТовар = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Процедура - Вызывается после успешной записи характеристики.
//  Используется для создания отраслевых данных зависящих от характериситики,
//  но хранящихся в отдельных справочниках, например Ячейка или Вставка.
//
// Параметры:
//  Характеристика	 - Справочники.Характеристики	 - Созданная характеристика.
// 
// Возвращаемое значение:
//  Булево - Результат выполнения функции.
//
&НаСервере
Функция ЗаполнитьХарактеристикуОтраслевымиРеквизитамиПослеЗаписи(Характеристика)
	
	// Установка отраслевых реквизитов для характеристики
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СобытияФормы

// Процедура - Вызывается при создании формы на сервере, создан для заполнения отраслевых данных 
//
&НаСервере
Процедура ПриСозданииНаСервереОтраслевой()
	
	// Установка отраслевых параметров при создании формы на сервере
	// В частности может происходить создание служебных отраслевых реквизитов, 
	// требующихся при старте формы
	
КонецПроцедуры

#КонецОбласти

#Область ПравилаНаименования

&НаСервере
Процедура ДобавитьСоответствиеОтраслевыхРеквизитовПравилоКОтраслевому(СоответствиеРеквизитов)
	
	// Происходит заполнение объекта СоответствиеРеквизитов для заполнения
	// наименований реквизитов формы и реквизитов правил наименования
	// К примеру 
	// СоответствиеРеквизитов.Вставить("Номенклатура_ор_ОКПД2", "ОКПД2");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_Производитель", "Производитель");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_ЖНВЛС", "ЖНВЛП");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_Яд", "Яд");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_НаркотическоеСредство", "НаркотическоеСредство");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_МНН", "МНН");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_СМНН", "СМНН");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_ЕГК", "ЕГК");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_ФормаВыпуска", "ФормаВыпуска");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_КодРосздравнадзора", "КодРосздравнадзора");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_ЗарегистрированВСистемеМониторингаЦен", "ЗарегистрированВСистемеМониторингаЦен");
	СоответствиеРеквизитов.Вставить("Номенклатура_ор_ОтпускПоРецепту", "ОтпускПоРецепту");
	
	СоответствиеРеквизитов.Вставить("Характеристика_ор_СерияПроизводителя", "СерияПроизводителя");
	СоответствиеРеквизитов.Вставить("Характеристика_ор_ДатаИзготовления"  , "ДатаИзготовления");
	СоответствиеРеквизитов.Вставить("Характеристика_ор_СрокГодности"      , "СрокГодности");
	СоответствиеРеквизитов.Вставить("Характеристика_ор_СертификатСтрока"  , "СертификатСтрока");
	СоответствиеРеквизитов.Вставить("Характеристика_ор_Производитель"     , "ПроизводительСерии");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСоответствиеОтраслевыхРеквизитовОтраслевойКПравилу(СоответствиеРеквизитов)
	
	// Происходит заполнение объекта СоответствиеРеквизитов для заполнения
	// наименований реквизитов формы и реквизитов правил наименования
	// К примеру 
	// СоответствиеРеквизитов.Вставить("ОКПД2", "Номенклатура_ор_ОКПД2");
	
	Если ТекущееДействие = "СозданиеНоменклатуры" Тогда
		
		СоответствиеРеквизитов.Вставить("Производитель", "Номенклатура_ор_Производитель");
		СоответствиеРеквизитов.Вставить("ЖНВЛП", "Номенклатура_ор_ЖНВЛС");
		СоответствиеРеквизитов.Вставить("Яд", "Номенклатура_ор_Яд");
		СоответствиеРеквизитов.Вставить("НаркотическоеСредство", "Номенклатура_ор_НаркотическоеСредство");
		СоответствиеРеквизитов.Вставить("МНН", "Номенклатура_ор_МНН");
		СоответствиеРеквизитов.Вставить("СМНН", "Номенклатура_ор_СМНН");
		СоответствиеРеквизитов.Вставить("ЕГК", "Номенклатура_ор_ЕГК");
		СоответствиеРеквизитов.Вставить("ФормаВыпуска", "Номенклатура_ор_ФормаВыпуска");
		СоответствиеРеквизитов.Вставить("КодРосздравнадзора", "Номенклатура_ор_КодРосздравнадзора");
		СоответствиеРеквизитов.Вставить("ЗарегистрированВСистемеМониторингаЦен", "Номенклатура_ор_ЗарегистрированВСистемеМониторингаЦен");
		СоответствиеРеквизитов.Вставить("ОтпускПоРецепту", "Номенклатура_ор_ОтпускПоРецепту");
		
	Иначе
		
		СоответствиеРеквизитов.Вставить("СерияПроизводителя", "Характеристика_ор_СерияПроизводителя");
		СоответствиеРеквизитов.Вставить("ДатаИзготовления"  , "Характеристика_ор_ДатаИзготовления");
		СоответствиеРеквизитов.Вставить("СрокГодности"      , "Характеристика_ор_СрокГодности");
		СоответствиеРеквизитов.Вставить("СертификатСтрока"  , "Характеристика_ор_СертификатСтрока");
		СоответствиеРеквизитов.Вставить("ПроизводительСерии", "Характеристика_ор_Производитель");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьОтраслевыеЭлементыПоШагу()
	СозданиеНоменклатуры   = ТекущееДействие = "СозданиеНоменклатуры";
	СозданиеХарактеристики = ТекущееДействие = "СозданиеХарактеристики";
	
	// Происходит настройка видимости отраслевых элементов форм в зависимости от текущего действия
	Если СозданиеНоменклатуры Тогда
		Элементы.ЗарегистрированВСистемеМониторингаЦен.Доступность = ЭтотОбъект.ЖНВЛП;
	ИначеЕсли СозданиеХарактеристики Тогда
		ИспользуютсяСерии = ПолучитьФлагСерийногоУчета();
		Элементы.ГруппаПараметрыХарактеристики.Видимость = ИспользуютсяСерии;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыВыбраннойНоменклатурыОтраслевые()
	
	// Происходит заполнение реквизитов при изменении значения номенклатуры (только в режиме "ВыбораНоменклатуры")
	Если ИспользоватьОтраслевогоПроизводителя Тогда
		ЭтотОбъект.Производитель = ЭтотОбъект.Номенклатура.ор_Производитель;
	Иначе
		ЭтотОбъект.Производитель = ЭтотОбъект.Номенклатура.Производитель;
	КонецЕсли;
	
	ЭтотОбъект.ЖНВЛП                                 = ЭтотОбъект.Номенклатура.ор_ЖНВЛС;
	ЭтотОбъект.Яд                                    = ЭтотОбъект.Номенклатура.ор_Яд;
	ЭтотОбъект.НаркотическоеСредство                 = ЭтотОбъект.Номенклатура.ор_НаркотическоеСредство;
	ЭтотОбъект.МНН                                   = ЭтотОбъект.Номенклатура.ор_МНН;
	ЭтотОбъект.СМНН                                  = ЭтотОбъект.Номенклатура.ор_СМНН;
	ЭтотОбъект.ЕГК                                   = ЭтотОбъект.Номенклатура.ор_ЕГК;
	ЭтотОбъект.ФормаВыпуска                          = ЭтотОбъект.Номенклатура.ор_ФормаВыпуска;
	ЭтотОбъект.КодРосздравнадзора                    = ЭтотОбъект.Номенклатура.ор_КодРосздравнадзора;
	ЭтотОбъект.ЗарегистрированВСистемеМониторингаЦен = ЭтотОбъект.Номенклатура.ор_ЗарегистрированВСистемеМониторингаЦен;
	ЭтотОбъект.ОтпускПоРецепту                       = ЭтотОбъект.Номенклатура.ор_ОтпускПоРецепту;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыВыбранногоКатегорииНоменклатурыОтраслевые(МассивРеквизитовДляОбновления)
	
	// Происходит заполнение реквизитов связанных с видом номенклатуры, при её изменении
	// Названия изменённых реквизитов записываются в МассивРеквизитовДляОбновления
	// для дальнейшей настройки флажков "Сохранения значений"
	ИмяРеквизита = "Производитель";
	Если ИспользоватьОтраслевогоПроизводителя Тогда
		ИмяРеквизита = "ор_" + ИмяРеквизита;
	КонецЕсли;
	
	ЗначениеРеквизита = ЭтотОбъект.КатегорияНоменклатуры[ИмяРеквизита];
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ЭтотОбъект.Производитель = ЗначениеРеквизита;
		МассивРеквизитовДляОбновления.Добавить("Производитель");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Шаблон = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФлагСерийногоУчета()
	
	Возврат ор_ОбщегоНазначенияКлиентСервер.ПолучитьФлагСерийногоУчета(ЭтотОбъект.Номенклатура);
	
КонецФункции

Процедура ПроверитьЭлементыФормы()
	
	Элементы.ЗарегистрированВСистемеМониторингаЦен.Доступность = ЭтотОбъект.ЖНВЛП;
	Элементы.ЗарегистрированВСистемеМониторингаЦен.Видимость   = ЭтотОбъект.ЖНВЛП;
	Элементы.СохранятьЗначениеЗарегистрированВСистемеМониторингаЦен.Доступность = ЭтотОбъект.ЖНВЛП;
	Элементы.СохранятьЗначениеЗарегистрированВСистемеМониторингаЦен.Видимость = ЭтотОбъект.ЖНВЛП;
	Если НЕ ЭтотОбъект.ЖНВЛП Тогда
		ЭтотОбъект.ЗарегистрированВСистемеМониторингаЦен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийИПолейФормы

&НаКлиенте
Процедура ПечатьШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ШаблонЭтикеткиНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенниковБПО.ФормаВыбора",,
															ЭтотОбъект,,,,
															ОбработчикОповещения,
															РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьВидимостьОтраслевыхРеквизитовНаСервере()
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьТоварыДляПечати()
	
	СтрокаТовара = ТаблицаТоваровБПОДляПечати.Добавить();
	СтрокаТовара.Выбран                 = Истина;
	СтрокаТовара.НоменклатураБПО        = ЭтотОбъект.Номенклатура;
	СтрокаТовара.ХарактеристикаБПО      = ЭтотОбъект.Характеристика;
	СтрокаТовара.ОрганизацияБПО         = ЭтотОбъект.ОрганизацияДляПечати;
	СтрокаТовара.ШаблонЦенникаЭтикетки  = Шаблон;
	СтрокаТовара.Количество             = 1;
	СтрокаТовара.УпаковкаБПО            = ЭтотОбъект.ЕдиницаИзмерения;
	СтрокаТовара.Цена                   = ?(ЗначениеЗаполнено(ЭтотОбъект.ЦенаХарактеристики), ЭтотОбъект.ЦенаХарактеристики, ЭтотОбъект.Цена);
	
	ДополнитьТоварыДляПечати();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваровБПОДляПечати.Выгрузить());
	
КонецФункции

#КонецОбласти

#КонецОбласти
