
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Выдать подарок %1?'"), Параметры.Номенклатура);
	
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ВидЦены", Параметры.РозничныйВидЦены);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("ТорговыйОбъект", Параметры.ТорговыйОбъект);
	СписокХарактеристик.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
	
	Параметры.Свойство("ПоказыватьТолькоХарактеристикиПодарковВНаличии", ПоказыватьТолькоХарактеристикиПодарковВНаличии);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокХарактеристик,
		"Доступно",
		0,
		ВидСравненияКомпоновкиДанных.Больше,,
		ПоказыватьТолькоХарактеристикиПодарковВНаличии);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьТолькоХарактеристикиПодарковВНаличииПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокХарактеристик,
		"Доступно",
		0,
		ВидСравненияКомпоновкиДанных.Больше,,
		ПоказыватьТолькоХарактеристикиПодарковВНаличии);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗафиксироватьВыбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЗафиксироватьВыбор();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьВыбор()
	
	ТекущиеДанные = Элементы.СписокХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	СтруктураСтроки.Вставить("Цена", ТекущиеДанные.Цена);
	
	Закрыть(СтруктураСтроки);
	
КонецПроцедуры

#КонецОбласти