
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет сохранение табличного документа в файл
//
// Параметры:
//  КаталогЗагружаемогоФайла - путь к каталогу, в который необходимо записать файл
//  ТабличныйДокумент        - ТабличныйДокумент - табличный документ для сохранения в файл
//
Процедура СохранитьВФайл(КаталогЗагружаемогоФайла, ТабличныйДокумент) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьВФайлОповещение", ЭтотОбъект, ДополнительныеПараметры);
	Диалог     = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Если КаталогЗагружаемогоФайла <> Неопределено Тогда
		Диалог.Каталог = КаталогЗагружаемогоФайла;
	КонецЕсли;

	Диалог.Заголовок = НСтр("ru = 'Сохранить табличный документ в файл'");
	Диалог.Фильтр    = "Формат sst (*.sst)|*.sst|Лист Excel (*.xls)|*.xls|Лист Excel 2007 (*.xlsx)|*.xlsx|Текстовый документ (*.txt)|*.txt|Табличный документ (*.mxl)|*.mxl|";
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

Процедура СохранитьВФайлОповещение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент          = ДополнительныеПараметры.ТабличныйДокумент;
	ИмяФайла                   = Результат[0];
	ФайлНаДиске                = Новый Файл(ИмяФайла);
	РасширениеФайла            = НРег(ФайлНаДиске.Расширение);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьВФайл_Завершение", ЭтотОбъект);
	
	Если РасширениеФайла = ".mxl" Тогда
		ТабличныйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяФайла, ТипФайлаТабличногоДокумента.MXL);
	ИначеЕсли РасширениеФайла = ".xls" Тогда
		ТабличныйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	ИначеЕсли РасширениеФайла = ".xlsx" Тогда
		ТабличныйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	ИначеЕсли РасширениеФайла = ".txt" 
		Или РасширениеФайла = ".sst" Тогда
		ТабличныйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяФайла, ТипФайлаТабличногоДокумента.TXT);
	КонецЕсли;

КонецПроцедуры

Процедура СохранитьВФайл_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось записать файл.'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Файл записан успешно.'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

// Процедура устанавливает флаг таблицы
//
Процедура УстановитьФлагТаблицы(ЗначениеФлага, ТаблицаРеквизитов) Экспорт
	
	Для Каждого Элемент Из ТаблицаРеквизитов Цикл
			Элемент.Пометка = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

