

&После("ПриСозданииНаСервере")
&НаСервере
Процедура эв_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предоплата.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПредоплата", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗачтенаПредоплата", "Видимость", Истина);
	
КонецПроцедуры

&После("ПослеЗаписи")
&НаКлиенте
Процедура эв_ПослеЗаписи(ПараметрыЗаписи)
	
	Если Не КассаККМИспользоватьБезПодключенияОборудования Тогда
		Возврат;
	КонецЕсли;
	
	эв_ПоставитьЧекБезОборудованияВОчередьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура эв_ПоставитьЧекБезОборудованияВОчередьНаСервере()
	
	эв_РаспределеннаяФискализация.эв_ПоставитьЧекБезОборудованияВОчередь(РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры
