
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресВоВременномХранилище) Тогда
		ТекстСообщения = НСтр("ru='Предусмотрено открытие формы только из документов.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЗапрещенВводНесколькихУпаковок = Параметры.Свойство("ЗапрещенВводНесколькихУпаковок");
	ВыполнятьПроверкуКМНаККТ = Параметры.Свойство("ВыполнятьПроверкуКМНаККТ");
	
	КоличествоДоПересчета = Параметры.Количество;
	Если КоличествоДоПересчета > 0 И ЗапрещенВводНесколькихУпаковок Тогда
		КоличествоДоПересчета = 1;
	КонецЕсли;
	
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
	
	ИспользоватьТранспортныеУпаковки = Параметры.ИспользоватьТранспортныеУпаковки;
	
	Если Параметры.Свойство("ДатаРегистрацииРецепта") Тогда
		НомерСерииРецепта = Параметры.НомерСерииРецепта;
		НомерРецепта = Параметры.НомерРецепта;
		ДатаРегистрацииРецепта = Параметры.ДатаРегистрацииРецепта;
	КонецЕсли;
	
	Элементы.НомерСерииРецепта.Видимость = ЗапрещенВводНесколькихУпаковок;
	Элементы.НомерРецепта.Видимость = ЗапрещенВводНесколькихУпаковок;
	Элементы.ДатаРегистрацииРецепта.Видимость = ЗапрещенВводНесколькихУпаковок;
	
	АдресВоВременномХранилище = Параметры.АдресВоВременномХранилище;
	
	СтруктураТаблиц = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	НомераУпаковок.Загрузить(СтруктураТаблиц.ТаблицаНомеров);
	Если ИспользоватьТранспортныеУпаковки Тогда
		ТранспортныеУпаковки.Загрузить(СтруктураТаблиц.ТранспортныеУпаковки);
	КонецЕсли;
	
	ОбновитьПодвалНаСервере();
	
	Если НомераУпаковок.Количество() > 0 Тогда
		GTIN = Лев(НомераУпаковок[0].НомерКИЗ, 14);
		GTINПередИзменением = GTIN;
	КонецЕсли;
	
	Если GTIN = "" Тогда
		РезультатПоиска = ор_ИнтеграцияМДЛП.НайтиGTINПоНоменклатре(Номенклатура, Характеристика);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			GTIN = РезультатПоиска;
			GTINПередИзменением = GTIN;
			GTINИзРегистра = GTIN;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр <> Неопределено И Параметры.ТолькоПросмотр Тогда
		Элементы.НомераУпаковок.ТолькоПросмотр            = Истина;
		Элементы.GTIN.ТолькоПросмотр                      = Истина;
		Элементы.ДатаРегистрацииРецепта.ТолькоПросмотр    = Истина;
		Элементы.НомерСерииРецепта.ТолькоПросмотр         = Истина;
		Элементы.НомерРецепта.ТолькоПросмотр              = Истина;
		Элементы.ЗавершитьВвод.Доступность                = Ложь;
		Элементы.НомераУпаковокДобавить.Доступность       = Ложь;
		Элементы.НомераУпаковокИзменить.Доступность       = Ложь;
		Элементы.НомераУпаковокУдалить.Доступность        = Ложь;
		Элементы.ТранспортныеУпаковки.ТолькоПросмотр      = Истина;
		Элементы.ТранспортныеУпаковкиДобавить.Доступность = Ложь;
		Элементы.ТранспортныеУпаковкиУдалить.Доступность  = Ложь;
	КонецЕсли;
	
	Если НЕ ИспользоватьТранспортныеУпаковки Тогда
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКизы;
	КонецЕсли;
	
	ПараметрыСобытийПО = Новый Структура;
	МассивКомандПО = Новый Массив;
	МассивКомандПО.Добавить("ЗагрузитьДанныеИзТСД");
	ИнтеграцияМДЛППереопределяемый.НастроитьПодключаемоеОборудование(ЭтаФорма, МассивКомандПО);
	
	РегистрироватьGTINПриПодбореНомеровУпаковок = ор_ИнтеграцияМДЛП.ПолучитьПризнакРегистрироватьGTINПриПодбореНомеровУпаковок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			
			Если ИмяСобытия = "ScanData" Тогда
				Если Параметр[1] = Неопределено Тогда
					Штрихкод = Параметр[0];
				Иначе
					Штрихкод = Параметр[1][1];
				КонецЕсли;
				
				ОбработатьШтрихкод(Штрихкод);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомераУпаковокПослеУдаления(Элемент)
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура НомераУпаковокПриИзменении(Элемент)
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура GTINПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(GTINПередИзменением)
		И GTINПередИзменением <> GTIN
		И НомераУпаковок.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'При изменении GTIN список номеров упаковок будет очищен.
							|Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьGTINЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	GTINПриИзмененииПродолжить();
	
КонецПроцедуры

&НаКлиенте
Процедура НомераУпаковокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗапрещенВводНесколькихУпаковок И НомераУпаковок.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Можно ввести только 1 номер упаковки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераУпаковокНомерКИЗПриИзменении(Элемент)
	
	ТекСтрока = Элементы.НомераУпаковок.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.ПолныйКодМаркировки = "";
	
	НедопустимыеСимволы = "";
	Если НЕ ор_ИнтеграцияМДЛПКлиентСервер.КодСоответствуетАлфавитуSGTIN(ТекСтрока.НомерКИЗ, НедопустимыеСимволы) Тогда
		ТекстСообщения = НСтр("ru = 'Некорректный номер упаковки %Киз%: номер упаковки содержит недопустимые символы ""%Символы%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Киз%", ТекСтрока.НомерКИЗ);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Символы%", НедопустимыеСимволы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПослеУдаления(Элемент)
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПриИзменении(Элемент)
	
	ОбновитьПодвал();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьВвод(Команда)
	
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	ВыполнитьПроверкуПередСохранением(ЕстьОшибки);
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличестувоВведеноНЕкорректно() Тогда
		ТекстСообщения = НСтр("ru = 'Количество номеров упаковок введено больше необходимого. При продолжении в документе количество будет заполнено по количеству введенных номеров упаковок. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаКоличестваЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗавершитьВводПродолжить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	
	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ПолучитьДанныеИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийПодключаемогоОборудования

// Обработка результата загрузки данных из ТСД.
//
// Параметры:
//  СтруктураРезультат - Структура - структура результата выполнения операции.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ПолучитьДанныеИзТСДЗавершение(СтруктураРезультат, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультат.Результат Тогда
		Для Каждого ДанныеШтрихкода Из СтруктураРезультат.ТаблицаТоваров Цикл
			ОбработатьШтрихкод(ДанныеШтрихкода.Штрихкод);
		КонецЦикла
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Обработка результата вопроса изменения GTIN.
//
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ИзменитьGTINЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НомераУпаковок.Очистить();
		ОбновитьПодвал();
		GTINПриИзмененииПродолжить();
	Иначе
		GTIN = GTINПередИзменением;
	КонецЕсли;
	
КонецПроцедуры

// Обработка результата вопроса проверки GTIN.
//
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ПроверкаGTINЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РегистрацияGTINПродолжить(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Обработка результата вопроса выбора варианта регистрации GTIN.
//
// Параметры:
//  РезультатВопроса - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ВыборРегистрацииGTINЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено ИЛИ РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = "ДляХарактеристики" Тогда
		ДополнительныеПараметры.ДляХарактеристики = Истина;
	КонецЕсли;
	РегистрацияGTINПродолжить(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКоличестваЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗавершитьВводПродолжить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводПродолжить()
	
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	СохранитьВводСервер(ЕстьОшибки);
	Если Не Модифицированность И НЕ ЕстьОшибки Тогда
		
		РегистрироватьGTIN = Истина;
		Если ЗначениеЗаполнено(GTINИзРегистра) И GTINИзРегистра = GTIN Тогда
			РегистрироватьGTIN = Ложь;
		КонецЕсли;
		
		Если РегистрироватьGTIN И РегистрироватьGTINПриПодбореНомеровУпаковок Тогда
			
			РезультатПроверки = ПроверитьGTINПоРегиструШК();
			
			Если РезультатПроверки.РегистрироватьНовыйGTIN И РезультатПроверки.Свойство("ТекстПредупреждения") И РезультатПроверки.Свойство("НовыйGTIN") Тогда
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборРегистрацииGTINЗавершение", ЭтотОбъект, РезультатПроверки);
				
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить("ДляНоменклатуры"  , НСтр("ru = 'Для номенклатуры'"));
				СписокКнопок.Добавить("ДляХарактеристики", НСтр("ru = 'Для характеристики'"));
				СписокКнопок.Добавить("Отмена"           , НСтр("ru = 'Отмена'"));
				
				ПоказатьВопрос(ОписаниеОповещения, РезультатПроверки.ТекстПредупреждения, СписокКнопок,,,НСтр("ru = 'Регистрация GTIN.'"));
				
			ИначеЕсли РезультатПроверки.РегистрироватьНовыйGTIN И РезультатПроверки.Свойство("ТекстПредупреждения") Тогда
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаGTINЗавершение", ЭтотОбъект, РезультатПроверки);
				ПоказатьВопрос(ОписаниеОповещения, РезультатПроверки.ТекстПредупреждения, РежимДиалогаВопрос.ДаНет,,,НСтр("ru = 'Регистрация GTIN.'"));
				
			ИначеЕсли РезультатПроверки.РегистрироватьНовыйGTIN Тогда
				РегистрацияGTINПродолжить(РезультатПроверки);
			Иначе
				ЗавершитьВводЗавершение();
			КонецЕсли;
		Иначе
			ЗавершитьВводЗавершение();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КоличестувоВведеноНЕкорректно()
	
	Если КоличествоДоПересчета > 0 И Количество > КоличествоДоПересчета Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура РегистрацияGTINПродолжить(РезультатПроверки)
	
	ЕстьОшибки = Ложь;
	
	ЗарегистрироватьGTIN(РезультатПроверки, ЕстьОшибки);
	
	Если НЕ ЕстьОшибки Тогда
		ЗавершитьВводЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура GTINПриИзмененииПродолжить()
	
	Если ЗначениеЗаполнено(GTIN)
		И (СтрДлина(GTIN) <> 14
		Или Не МенеджерОборудованияКлиентСервер.ПроверитьКорректностьGTIN(GTIN)) Тогда
		GTIN = Неопределено;
		ТекстСообщения = НСтр("ru = 'Неверный GTIN.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	GTINПередИзменением = GTIN;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЗавершение()
	
	ВладелецФормы.Модифицированность = МодифицированностьВладельца;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	СтруктураВозврата.Вставить("Количество", Количество);
	СтруктураВозврата.Вставить("КоличествоДоПересчета", КоличествоДоПересчета);
	СтруктураВозврата.Вставить("GTIN", GTIN);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)
	
	
	ЭтоНомерУпаковки = Ложь;
	ЭтоНомерТранспортнойУпаковки = Ложь;
	
	СтруктураМаркировки = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(Штрихкод);
	
	Если СтруктураМаркировки.Свойство("МаркированныйТовар") Тогда
		ЭтоНомерУпаковки = Истина;
	ИначеЕсли ИспользоватьТранспортныеУпаковки И СтруктураМаркировки.Свойство("ГрупповаяУпаковка") Тогда
		ЭтоНомерТранспортнойУпаковки = Истина;
	КонецЕсли;
	
	Если НЕ (ЭтоНомерУпаковки ИЛИ ЭтоНомерТранспортнойУпаковки ) Тогда
		
		Если ИспользоватьТранспортныеУпаковки Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Штрихкод %1 не являются номером упаковки или SSCC.'"), Штрихкод);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Штрихкод %1 не являются номером упаковки.'"), Штрихкод);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоНомерУпаковки Тогда
		ДанныеМаркировкиМДЛП = СтруктураМаркировки.Данные;
		
		Если НомераУпаковок.НайтиСтроки(Новый Структура("НомерКиЗ", ДанныеМаркировкиМДЛП.sgtin)).Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(GTIN) Тогда
			GTIN = ДанныеМаркировкиМДЛП.GTIN;
		КонецЕсли;
		
		Если GTIN <> ДанныеМаркировкиМДЛП.GTIN Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Считанный GTIN %1 не соответствует текущему GTIN.'"), ДанныеМаркировкиМДЛП.GTIN);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
		
		Если ЗапрещенВводНесколькихУпаковок И НомераУпаковок.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Можно ввести только 1 номер упаковки.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Если ВыполнятьПроверкуКМНаККТ И ор_ИнтеграцияМДЛПКлиент.НужноЗапускатьПроверкуКМНаККТ(ДанныеМаркировкиМДЛП,,, Истина) Тогда
			ОбработатьНеобходимоПроверитьКММДЛПНаККТ(ДанныеМаркировкиМДЛП);
		Иначе
			ПродолжитьОбработатьШтрихкод(ДанныеМаркировкиМДЛП);
		КонецЕсли;
		
	Иначе
		
		ДанныеМаркировкиМДЛП = СтруктураМаркировки.Данные;
		
		Если ТранспортныеУпаковки.НайтиСтроки(Новый Структура("НомерУпаковки", ДанныеМаркировкиМДЛП.SSCC)).Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(GTIN) И ДанныеМаркировкиМДЛП.Свойство("GTIN") Тогда
			GTIN = ДанныеМаркировкиМДЛП.GTIN;
		КонецЕсли;
		
		Если ДанныеМаркировкиМДЛП.Свойство("GTIN") И GTIN <> ДанныеМаркировкиМДЛП.GTIN Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Считанный GTIN %1 не соответствует текущему GTIN.'"), ДанныеМаркировкиМДЛП.GTIN);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
		
		НоваяСтрока = ТранспортныеУпаковки.Добавить();
		НоваяСтрока.НомерУпаковки = ДанныеМаркировкиМДЛП.SSCC;
		
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбработатьШтрихкод(ДанныеМаркировкиМДЛП)
	
	НоваяСтрока = НомераУпаковок.Добавить();
	НоваяСтрока.НомерКиЗ = ДанныеМаркировкиМДЛП.sgtin;
	ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьПолныйКодМаркировки(НоваяСтрока, ДанныеМаркировкиМДЛП);
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередСохранением(ЕстьОшибки)
	
	// Проверим gtin
	Если НЕ ЗначениеЗаполнено(GTIN)
		ИЛИ ЗначениеЗаполнено(GTIN)
		И (СтрДлина(GTIN) <> 14
		Или Не МенеджерОборудованияКлиентСервер.ПроверитьКорректностьGTIN(GTIN)) Тогда
		
		ТекстСообщения = НСтр("ru = 'Неверный GTIN.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	// Удалим строки с пустым киз
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого Строка Из НомераУпаковок Цикл
		Если Не ЗначениеЗаполнено(Строка.НомерКИЗ) Тогда
			МассивУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаМассива Из МассивУдаляемыхСтрок Цикл
		НомераУпаковок.Удалить(СтрокаМассива);
	КонецЦикла;
	
	ОбработанныеУИН = Новый Соответствие;
	
	// Проверим заполненные кизы
	Для Каждого Строка Из НомераУпаковок Цикл
		
		Если СтрДлина(Строка.НомерКИЗ) <> 27 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Некорректный номер упаковки %1: номер упаковки должен состоять из 27 символов.'"),
				Строка.НомерКИЗ);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
		
		GTINСтроки = Лев(Строка.НомерКИЗ, 14);
		Если GTINСтроки <> GTIN Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Некорректный номер упаковки %1: GTIN номера упаковки не соответствует GTIN товара.'"),
				Строка.НомерКИЗ);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
		
		НайденноеЗначение = ОбработанныеУИН.Получить(Строка.НомерКИЗ);
		Если НайденноеЗначение = Неопределено Тогда
			ОбработанныеУИН.Вставить(Строка.НомерКИЗ, Ложь);
		ИначеЕсли Не НайденноеЗначение = Истина Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не уникальный номер упаковки %1: номера упаковки не должны повторяться.'"),
				Строка.НомерКИЗ);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
			// Взводим признак того что по КиЗу уже ругались.
			ОбработанныеУИН[Строка.НомерКИЗ] = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьПустыеСтроки = Ложь;
	ЕстьНеверныеСтроки = Ложь;
	ЕстьСтрокиСНулевымКол = Ложь;
	
	Для Каждого Строка Из ТранспортныеУпаковки Цикл
		
		Если Не ЗначениеЗаполнено(Строка.НомерУпаковки) Тогда
			ЕстьПустыеСтроки = Истина;
			
		ИначеЕсли СтрДлина(Строка.НомерУпаковки) <> 18 Тогда
			ЕстьНеверныеСтроки = Истина;
			
		ИначеЕсли Строка.Количество < 1 Тогда
			ЕстьСтрокиСНулевымКол = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПустыеСтроки ИЛИ ЕстьНеверныеСтроки Тогда
		ТекстСообщения = НСтр("ru = 'Введены неверные номера транспортных упаковок.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьСтрокиСНулевымКол Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено количество транспортных упаковок.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	//Если Количество > КоличествоДоПересчета Тогда
	//	ТекстСообщения = НСтр("ru = 'Не заполнено количество транспортных упаковок.'");
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	//	ЕстьОшибки = Истина;
	//КонецЕсли;
	
	Если (ЗначениеЗаполнено(НомерСерииРецепта)
		ИЛИ ЗначениеЗаполнено(НомерРецепта))
		И НЕ ЗначениеЗаполнено(ДатаРегистрацииРецепта) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена дата регистрации рецепта.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВводСервер(ЕстьОшибки)
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаНомеров", НомераУпаковок.Выгрузить());
	СтруктураТаблиц.Вставить("ТранспортныеУпаковки", ТранспортныеУпаковки.Выгрузить());
	СтруктураТаблиц.Вставить("НомерСерииРецепта", НомерСерииРецепта);
	СтруктураТаблиц.Вставить("НомерРецепта", НомерРецепта);
	СтруктураТаблиц.Вставить("ДатаРегистрацииРецепта", ДатаРегистрацииРецепта);
	
	ПоместитьВоВременноеХранилище(СтруктураТаблиц, АдресВоВременномХранилище);
	
	Если Модифицированность Тогда
		МодифицированностьВладельца = Истина;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьGTINПоРегиструШК()
	
	РезультатПроверки = Новый Структура("РегистрироватьНовыйGTIN, ДляХарактеристики", Истина, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК GTIN,
	|	Штрихкоды.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втШтрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Номенклатура = &Номенклатура
	|	И Штрихкоды.Партия = &Партия
	|	И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	GTIN,
	|	Характеристика
	|;
	|";
	
	Запрос.УстановитьПараметр("Номенклатура"    , Номенклатура);
	Запрос.УстановитьПараметр("GTIN"            , GTIN);
	Запрос.УстановитьПараметр("Характеристика"  , Характеристика);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	ор_ИнтеграцияМДЛП.ОтобратьТолькоGTIN(Запрос.МенеджерВременныхТаблиц, "втШтрихкоды");
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	втШтрихкоды.GTIN КАК GTIN,
	|	втШтрихкоды.Номенклатура КАК Номенклатура,
	|	втШтрихкоды.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втШтрихкодыПоGTIN
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|ГДЕ
	|	втШтрихкоды.GTIN = &GTIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыПоGTIN.GTIN КАК GTIN,
	|	втШтрихкодыПоGTIN.Номенклатура КАК Номенклатура,
	|	втШтрихкодыПоGTIN.Характеристика КАК Характеристика
	|ИЗ
	|	втШтрихкодыПоGTIN КАК втШтрихкодыПоGTIN
	|ГДЕ
	|	(втШтрихкодыПоGTIN.Характеристика = &Характеристика
	|			ИЛИ втШтрихкодыПоGTIN.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыПоGTIN.GTIN КАК GTIN,
	|	втШтрихкодыПоGTIN.Номенклатура КАК Номенклатура,
	|	втШтрихкодыПоGTIN.Характеристика КАК Характеристика
	|ИЗ
	|	втШтрихкодыПоGTIN КАК втШтрихкодыПоGTIN
	|ГДЕ
	|	НЕ(втШтрихкодыПоGTIN.Характеристика = &Характеристика
	|				ИЛИ втШтрихкодыПоGTIN.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втШтрихкоды.GTIN КАК GTIN
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|ГДЕ
	|	втШтрихкоды.Характеристика = &Характеристика
	|	И втШтрихкоды.GTIN <> &GTIN";
	
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если НЕ Результат[1].Пустой() Тогда
		РезультатПроверки.РегистрироватьНовыйGTIN = Ложь;
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Если НЕ Результат[2].Пустой() Тогда
		
		РезультатПроверки.ДляХарактеристики  = Истина;
		
		Если НЕ Результат[3].Пустой() Тогда
			ВыборкаОшибка = Результат[3].Выбрать();
			GtinДляУдаления = Новый Массив;
			Пока ВыборкаОшибка.Следующий() Цикл
				GtinДляУдаления.Добавить(ВыборкаОшибка.GTIN);
			КонецЦикла;
			Если GtinДляУдаления > 0 Тогда
				РезультатПроверки.Вставить("ТекстПредупреждения", СформироватьСообщениеОУдаленииСтарыхЗаписей(GtinДляУдаления));
				РезультатПроверки.Вставить("УдалитьСтарыеЗаписи", GtinДляУдаления);
			КонецЕсли;
		КонецЕсли;
		
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	втШтрихкоды.Номенклатура КАК Номенклатура,
	|	втШтрихкоды.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА втШтрихкоды.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втШтрихкоды.GTIN КАК GTIN
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|ГДЕ
	|	втШтрихкоды.Характеристика = &Характеристика
	|	И втШтрихкоды.GTIN <> &GTIN";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если НЕ Результат[0].Пустой() Тогда
		
		Выборка = Результат[0].Выбрать();
		Выборка.Следующий();
		
		РезультатПроверки.ДляХарактеристики = ЗначениеЗаполнено(Выборка.Характеристика);
		
		Если РезультатПроверки.ДляХарактеристики И НЕ Результат[1].Пустой() Тогда
			ВыборкаОшибка = Результат[1].Выбрать();
			GtinДляУдаления = Новый Массив;
			Пока ВыборкаОшибка.Следующий() Цикл
				GtinДляУдаления.Добавить(ВыборкаОшибка.GTIN);
			КонецЦикла;
			Если GtinДляУдаления > 0 Тогда
				РезультатПроверки.Вставить("ТекстПредупреждения", СформироватьСообщениеОУдаленииСтарыхЗаписей(GtinДляУдаления));
				РезультатПроверки.Вставить("УдалитьСтарыеЗаписи", GtinДляУдаления);
			КонецЕсли;
		КонецЕсли;
		
		Возврат РезультатПроверки;
	КонецЕсли;
	
	ТекстПредупреждения = НСтр("ru = 'Необходимо в регистре штрихкодов зарегистрировать GTIN %GTIN% для ""%Товар%"". Выберите вариант регистрации.'");
	ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%GTIN%", GTIN);
	ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%Товар%", ор_ИнтеграцияМДЛП.ПредставлениеНоменклатуры(Номенклатура, Характеристика));
	
	РезультатПроверки.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	РезультатПроверки.Вставить("НовыйGTIN");
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция СформироватьСообщениеОУдаленииСтарыхЗаписей(GtinДляУдаления)
	
	// Шапка сообщения
	ТекстСообщения = НСтр("ru = 'Регистрация GTIN %GTIN% для ""%Товар%"".'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", GTIN);
	ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС;
	
	// Тело сообщения
	ТекстСообщения = ТекстСообщения + НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%"" уже существуют записи с другими GTIN: %GTINРегистра%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%", ор_ИнтеграцияМДЛП.ПредставлениеНоменклатуры(Номенклатура, Характеристика));
	ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС;
	
	СтрокаGTIN = "";
	Для Каждого Строка Из GtinДляУдаления Цикл
		СтрокаGTIN = СтрокаGTIN + ?(СтрокаGTIN = "", "", ", ") + Строка;
	КонецЦикла;
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTINРегистра%", СтрокаGTIN);
	
	// Подвал Сообщения
	ТекстСообщения = ТекстСообщения + НСтр("ru = 'Существующие записи будут удалены. Продолжить?'");
	
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьGTIN(РезультатПроверки, ЕстьОшибки)
	
	НачатьТранзакцию();
	
	Если РезультатПроверки.Свойство("УдалитьСтарыеЗаписи") Тогда
		GtinДляУдаления = РезультатПроверки.УдалитьСтарыеЗаписи;
		Для Каждого СтрокаGTIN Из GtinДляУдаления Цикл
			НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			НовыйШтрихкод.Штрихкод = СтрокаGTIN;
			НовыйШтрихкод.Номенклатура = Номенклатура;
			НовыйШтрихкод.Характеристика = Характеристика;
			НовыйШтрихкод.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
			НовыйШтрихкод.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Попытка
				НовыйШтрихкод.Удалить();
			Исключение
				ОтменитьТранзакцию();
				ТекстСообщения = НСтр("ru= 'Не удалось удалить GTIN %GTIN% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", СтрокаGTIN);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ЕстьОшибки = Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонеЦЕсли;
	
	НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	НовыйШтрихкод.Штрихкод = GTIN;
	НовыйШтрихкод.Номенклатура = Номенклатура;
	НовыйШтрихкод.Характеристика = ?(РезультатПроверки.ДляХарактеристики, Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	НовыйШтрихкод.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	НовыйШтрихкод.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
	
	Попытка
		НовыйШтрихкод.Записать(Истина);
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru= 'Не удалось записать GTIN %GTIN% по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", GTIN);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецПопытки;
	
	Если НЕ ЕстьОшибки Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал()
	
	КоличествоНомеров = НомераУпаковок.Количество();
	КоличествоНомеровТУ = ТранспортныеУпаковки.Итог("Количество");
	
	Количество = КоличествоНомеров + КоличествоНомеровТУ;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодвалНаСервере()
	
	КоличествоНомеров = НомераУпаковок.Количество();
	КоличествоНомеровТУ = ТранспортныеУпаковки.Итог("Количество");
	
	Количество = КоличествоНомеров + КоличествоНомеровТУ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНеобходимоПроверитьКММДЛПНаККТ(ДанныеМаркировкиМДЛП) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ДанныеМаркировкиМДЛП", ДанныеМаркировкиМДЛП);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОбработатьНеобходимоПроверитьКММДЛПНаККТ", ЭтотОбъект, Контекст);
	
	СтруктураПараметровПроверки = Новый Структура;
	СтруктураПараметровПроверки.Вставить("ПредставлениеНоменклатуры", Строка(Номенклатура));
	СтруктураПараметровПроверки.Вставить("ДанныеМаркировкиМДЛП", ДанныеМаркировкиМДЛП);
	
	ор_ИнтеграцияМДЛПКлиент.ПроверкаКодаМаркировкиСредствамиККТПоДаннымШтрихкода(СтруктураПараметровПроверки, ЭтотОбъект, ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОбработатьНеобходимоПроверитьКММДЛПНаККТ(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено
		Или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьОбработатьШтрихкод(ДополнительныеПараметры.ДанныеМаркировкиМДЛП);
	
	// Перенесем результат проверки ГИС МТ.
	Если ТипЗнч(РезультатВыбора) = Тип("Структура")
		И РезультатВыбора.Свойство("ЭлементыПроверки") Тогда
		Для Каждого ЭлементПроверки Из РезультатВыбора.ЭлементыПроверки Цикл
			
			Если Не (ЗначениеЗаполнено(ЭлементПроверки.РазрешительныйРежимИдентификаторЗапросаГИСМТ)
				И ЭлементПроверки.Свойство("ЭтоЭлементМДЛП")) Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыПоиска = Новый Структура("ПолныйКодМаркировки", ЭлементПроверки.ПолныйКодМаркировки);
			СтрокиМарок = НомераУпаковок.НайтиСтроки(ПараметрыПоиска);
			Для Каждого СтрокаМарки Из СтрокиМарок Цикл
				СтрокаМарки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ЭлементПроверки.РазрешительныйРежимИдентификаторЗапросаГИСМТ;
				СтрокаМарки.РазрешительныйРежимДатаЗапросаГИСМТ = ЭлементПроверки.РазрешительныйРежимДатаЗапросаГИСМТ;
				СтрокаМарки.РазрешительныйРежимИдентификаторЭкземпляраПО = ЭлементПроверки.РазрешительныйРежимИдентификаторЭкземпляраПО;
				СтрокаМарки.РазрешительныйРежимВерсияБазы = ЭлементПроверки.РазрешительныйРежимВерсияБазы;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
