
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для поиска объектов по штрихкоду
//
// Параметры:
//  ФильтрПоиска - Структура - параметры определяющие состав таблиц и условий запроса
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаШтрихкодыБазы(ФильтрПоиска = Неопределено) Экспорт
	
	Если ФильтрПоиска = Неопределено Тогда
		ФильтрПоиска = Новый Структура;
	КонецЕсли;
	
	ТекстОбъединитьВсе = 
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	МодульШК = РаботаСоШтрихкодамиПереопределяемый;
	МассивЗапросов = Новый Массив;
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкоды(ФильтрПоиска, МассивЗапросов);
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоиска, МассивЗапросов);
	// +ор интеграция МДЛП
	ор_ИнтеграцияМДЛП.ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоиска, МассивЗапросов);
	// -ор интеграция МДЛП
	
	Если ФильтрПоиска.Свойство("ЭтоКодМаркировки") Тогда
		ТекстЗапроса = СтрСоединить(МассивЗапросов, ТекстОбъединитьВсе);
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаКодыSKU(ФильтрПоиска, МассивЗапросов);
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаСерии(ФильтрПоиска, МассивЗапросов);
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаНоменклатурнойКлассификации(ФильтрПоиска, МассивЗапросов);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда	
		Если ФильтрПоиска.Свойство("ШаблонНомерТелефона") ИЛИ ФильтрПоиска.Количество() = 0 Тогда
			ДобавитьТекстЗапросаОбъектыПоТелефону(МассивЗапросов, ФильтрПоиска);
		КонецЕсли;
		Если ФильтрПоиска.Свойство("ШаблонАдресЭП") ИЛИ ФильтрПоиска.Количество() = 0  Тогда
			ДобавитьТекстЗапросаОбъектыПоАдресуЭП(МассивЗапросов, ФильтрПоиска);
		КонецЕсли;
	КонецЕсли;
	
	Если ФильтрПоиска.Свойство("ШаблонНомерТелефона") Тогда
		РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаПоТелефону(ФильтрПоиска, МассивЗапросов);
		Если ФильтрПоиска.Свойство("ДобавлятьНеизвестнуюКИ") Тогда
			ДобавитьТекстЗапросаВМассив(ТекстЗапросаТелефонПоШаблону(), МассивЗапросов);
		КонецЕсли;
	КонецЕсли;
	
	Если ФильтрПоиска.Свойство("ШаблонАдресЭП") Тогда
		РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаПоАдресуЭП(ФильтрПоиска, МассивЗапросов);
		Если ФильтрПоиска.Свойство("ДобавлятьНеизвестнуюКИ") Тогда
			ДобавитьТекстЗапросаВМассив(ТекстЗапросаАдресЭППоШаблону(), МассивЗапросов);
		КонецЕсли;
	КонецЕсли;
	
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоиска, МассивЗапросов);
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаДополнительныеОбъекты(ФильтрПоиска, МассивЗапросов);
	РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаКассирыДляВхода(ФильтрПоиска, МассивЗапросов);
	
	ТекстЗапроса = СтрСоединить(МассивЗапросов, ТекстОбъединитьВсе);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает структуру данных поиска по штрихкоду
//
// Параметры:
//  Штрихкод - Строка - штрихкод для поиска
//  Форма - ФормаКлиентскогоПриложения - форма, в которой вызван поиск
//
// Возвращаемое значение:
//  Структура - данные поиска.
//
Функция ДанныеПоискаПоШтрихкоду(Штрихкод, Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыСобытийПО") Тогда
		Если Форма.ПараметрыСобытийПО = Неопределено Тогда
			СтруктураДействий = Новый Структура;
		Иначе
			СтруктураДействий = Форма.ПараметрыСобытийПО;
		КонецЕсли;
	Иначе
		СтруктураДействий = Новый Структура;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФильтрПоискаПоШтрихкоду") Тогда
		Если Форма.ФильтрПоискаПоШтрихкоду = Неопределено Тогда
			ФильтрПоискаПоШтрихкоду = Новый Структура;
			РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоШтрихкоду);
		Иначе
			ФильтрПоискаПоШтрихкоду = Форма.ФильтрПоискаПоШтрихкоду;
		КонецЕсли;
	Иначе
		ФильтрПоискаПоШтрихкоду = Новый Структура;
		РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоШтрихкоду);
	КонецЕсли;
	
	// +ор интеграция МДЛП
	ИспользоватьМаркировкуЛС = ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки();
	ДанныеМаркировкиМДЛП = Неопределено;
	GTINМДЛП = "";
	НомерУпаковкиSGTIN = "";
	
	СтруктураМаркировкиМДЛП = ор_ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодПоТипу(Штрихкод);
	Если СтруктураМаркировкиМДЛП.Свойство("МаркированныйТовар") Тогда
		GTINМДЛП = СтруктураМаркировкиМДЛП.Данные.GTIN;
		ДанныеМаркировкиМДЛП = СтруктураМаркировкиМДЛП.Данные;
		НомерУпаковкиSGTIN = ДанныеМаркировкиМДЛП.sgtin;
	КонецЕсли;
	// -ор интеграция МДЛП
	
	// +ор
	ИспользоватьОбщиеШКХарактеристик = Константы.ор_ИспользоватьОбщиеШКХарактеристик.Получить()
										И НЕ СтруктураДействий.Свойство("ЗапретПоискаХарактеристикПоШКПроизводителя");
	ДобавлятьНоменклатуруБезХарактеристики = СтруктураДействий.Свойство("ДобавлятьНоменклатуруПоЗаводскомуШК");
	ПоказыватьТолькоХарактеристикиВНаличии = СтруктураДействий.Свойство("ПоказыватьТолькоХарактеристикиВНаличии");
	
	ПоказыватьЦеныПоХарактеристикам = Истина;
	
	МассивОрганизаций = Новый Массив;
	МассивСтруктурныхЕдиниц = Новый Массив;
	ЗаказПокупателя = Неопределено;
	РозничныйВидЦены = Неопределено;
	
	Если СтруктураДействий <> Неопределено
		И СтруктураДействий.Свойство("ДанныеОбОстатках")
		И ЗначениеЗаполнено(СтруктураДействий.ДанныеОбОстатках)
		И ТипЗнч(СтруктураДействий.ДанныеОбОстатках) = Тип("Структура") Тогда
		
		СтруктураДействий.ДанныеОбОстатках.Свойство("МассивОрганизаций", МассивОрганизаций);
		СтруктураДействий.ДанныеОбОстатках.Свойство("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
		СтруктураДействий.ДанныеОбОстатках.Свойство("ЗаказПокупателя", ЗаказПокупателя);
		
	Иначе
		ПоказыватьТолькоХарактеристикиВНаличии = Ложь;
	КонецЕсли;
	
	Если СтруктураДействий <> Неопределено
		И СтруктураДействий.Свойство("ДанныеОЦенах")
		И ЗначениеЗаполнено(СтруктураДействий.ДанныеОЦенах)
		И ТипЗнч(СтруктураДействий.ДанныеОЦенах) = Тип("Структура") Тогда
		
		СтруктураДействий.ДанныеОЦенах.Свойство("РозничныйВидЦены", РозничныйВидЦены);
		
	Иначе
		ПоказыватьЦеныПоХарактеристикам = Ложь;
	КонецЕсли;
	// -ор
	
	// +ор интеграция МДЛП
	Если ИспользоватьОбщиеШКХарактеристик Тогда
		ОбщиеТолькоМаркируемыеЛС = Ложь;
	Иначе
		ОбщиеТолькоМаркируемыеЛС = Истина;
	КонецЕсли;
	Если ИспользоватьМаркировкуЛС Тогда
		ИспользоватьОбщиеШКХарактеристик = Истина;
	КонецЕсли;
	// -ор интеграция МДЛП
	
	СуффиксСерверЛояльности = "";
	Если ФильтрПоискаПоШтрихкоду.Свойство("ДанныеПокупателя") Тогда
		СуффиксСерверЛояльности = "СЛ";
		ФильтрПоискаПоШтрихкоду.Удалить("ДанныеПокупателя");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	КодМаркировкиОригинал = "";
	ЭтоКодМаркировки = Ложь;
	ДанныеМаркировки = Неопределено;
	ДанныеРазбораКода = Неопределено;
	ШтрихкодПоиска = Штрихкод;
	ШтрихкодМарки = Штрихкод;
	НомерТелефона = "";
	АдресЭП = "";
	КИПоШтрихкоду = ТипКонтактнойИнформацияПоШтрихкоду(Штрихкод);
	Если КИПоШтрихкоду.Свойство("НомерТелефона", НомерТелефона) Тогда
		ФильтрПоискаПоШтрихкоду.Вставить(СтрШаблон("ШаблонНомерТелефона%1", СуффиксСерверЛояльности));
	КонецЕсли;
	Если КИПоШтрихкоду.Свойство("АдресЭП", АдресЭП) Тогда
		ФильтрПоискаПоШтрихкоду.Вставить(СтрШаблон("ШаблонАдресЭП%1", СуффиксСерверЛояльности));
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("РегистрацияНовойКарты") Тогда
		ФильтрПоискаПоШтрихкоду.Вставить("РегистрацияНовойКарты");
	КонецЕсли;
	
	ДобавлятьНеизвестнуюКИ = Ложь;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьПризнакВводаНеизвестнойКИ(Форма, ДобавлятьНеизвестнуюКИ);
	Если ДобавлятьНеизвестнуюКИ Тогда
		ФильтрПоискаПоШтрихкоду.Вставить("ДобавлятьНеизвестнуюКИ");
	КонецЕсли;
	
	Если ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонНомерТелефона")
			И НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонАдресЭП") Тогда
			
			КодИКоличествоВесовогоТовара = Неопределено;
			РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьКодИКоличествоВесовогоТовара(Штрихкод, КодИКоличествоВесовогоТовара);
			
			Если НЕ КодИКоличествоВесовогоТовара = Неопределено Тогда
				ФильтрПоискаПоШтрихкоду.Вставить("ШаблонКодТовараSKU");
				Запрос.УстановитьПараметр("КодТовара", КодИКоличествоВесовогоТовара.КодТовара);
				Запрос.УстановитьПараметр("КоличествоТовара", КодИКоличествоВесовогоТовара.КоличествоТовара);
			КонецЕсли;
			
			Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонКодТовараSKU") Тогда
				ДанныеМаркировки = МенеджерОборудованияРМККлиентСервер.РазобратьШтриховойКодТовара(Штрихкод);
				ЭтоКодМаркировки = ЭтоШтрихкодМарки(ДанныеМаркировки);
				Если ЭтоКодМаркировки Тогда
					Если НЕ ДанныеМаркировки.EAN = Неопределено Тогда
						ШтрихкодПоиска = ДанныеМаркировки.EAN;
						ШтрихкодМарки = ДанныеМаркировки.EAN;
					КонецЕсли;
					ФильтрПоискаПоШтрихкоду.Вставить("ЭтоКодМаркировки");
					
					СимволGS1 = МенеджерОборудованияРМККлиентСервер.РазделительGS1();
					Разделитель = МенеджерОборудованияРМККлиентСервер.ЭкранированныйСимволGS1();
					КодМаркировкиОригинал = СтрЗаменить(Штрихкод, Разделитель, СимволGS1);
					
					ПримечаниеКРазборуШтрихкода = Неопределено;
					ДанныеРазбораКода = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(КодМаркировкиОригинал, , ПримечаниеКРазборуШтрихкода);
					РаботаСоШтрихкодамиПереопределяемый.ОбработатьРезультатРазбораКодаМаркировки(ДанныеРазбораКода, ПримечаниеКРазборуШтрихкода);
					
					Если НЕ ДанныеРазбораКода = Неопределено Тогда
						ШтрихкодМарки = ДанныеРазбораКода.НормализованныйКодМаркировки;
						Если ДанныеРазбораКода.Свойство("СоставКодаМаркировки") Тогда
							СоставКодаМаркировки = ДанныеРазбораКода.СоставКодаМаркировки;
							Если СоставКодаМаркировки.Свойство("EAN") И ЗначениеЗаполнено(СоставКодаМаркировки.EAN) Тогда
								ШтрихкодПоиска = СоставКодаМаркировки.EAN;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	НеизвестныеДанныеПО = Истина;
	СтруктураПараметров = СтруктураДанныхПоиска();
	
	ВыполнитьПоиск = Истина;
	Если ЭтоКодМаркировки Тогда
		СимволGS1 = МенеджерОборудованияРМККлиентСервер.РазделительGS1();
		Если СтрНайти(КодМаркировкиОригинал, СимволGS1) > 0 И (ДанныеРазбораКода = Неопределено 
			// ор ++
			И СтруктураМаркировкиМДЛП.Количество() = 0) Тогда
			// ор --
			ВыполнитьПоиск = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФильтрПоискаПоШтрихкоду", ФильтрПоискаПоШтрихкоду);
	ДополнительныеПараметры.Вставить("ШтрихкодОригинал", Штрихкод);
	ДополнительныеПараметры.Вставить("ШтрихкодПоиска", ШтрихкодПоиска);
	ДополнительныеПараметры.Вставить("ШтрихкодМарки", ШтрихкодМарки);
	ДополнительныеПараметры.Вставить("ДанныеМаркировки", ДанныеМаркировки);
	ДополнительныеПараметры.Вставить("ДанныеРазбораКода", ДанныеРазбораКода);
	ДополнительныеПараметры.Вставить("ЭтоКодМаркировки", ЭтоКодМаркировки);
	РаботаСоШтрихкодамиПереопределяемый.ПереопределитьПризнакВыполненияПоиска(ВыполнитьПоиск, ДополнительныеПараметры);
	
	ДополнительныеПараметры.Вставить("НекорректнаяМарка", Не ВыполнитьПоиск);
	
	Если ВыполнитьПоиск Тогда
		ТекстЗапроса = ТекстЗапросаШтрихкодыБазы(ФильтрПоискаПоШтрихкоду);
		
		ТекстЗапросаВыборки = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыВсе.Штрихкод КАК Штрихкод,
		|	ШтрихкодыВсе.Владелец КАК Владелец,
		|	ШтрихкодыВсе.Характеристика КАК Характеристика,
		|	ШтрихкодыВсе.Упаковка КАК Упаковка,
		|	ШтрихкодыВсе.Серия КАК СерияНоменклатуры,
		|	ШтрихкодыВсе.Партия КАК Партия,
		|	ТИПЗНАЧЕНИЯ(ШтрихкодыВсе.Владелец) КАК ТипОбъекта,
		|	ШтрихкодыВсе.ШаблонШтрихкода КАК ШаблонШтрихкода,
		|	0 КАК НомерСтроки,
		|	ШтрихкодыВсе.Количество КАК Количество,
		|	Ложь КАК ПоказыватьТолькоХарактеристикиВНаличии,
		|	Ложь КАК ПоказыватьЦеныПоХарактеристикам
		// +ор
		|ПОМЕСТИТЬ орвтШтрихкоды
		// -ор
		|ИЗ
		|	ШтрихкодыВсе КАК ШтрихкодыВсе";
		
		ТекстЗапроса = ТекстЗапроса +
		"
		|; 
		|////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапросаВыборки;
		
		// +ор
		Если ИспользоватьОбщиеШКХарактеристик Тогда
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "орвтШтрихкоды", "втШтрихкоды");
			
			ДоплнитьЗапросПоискаПоШтрихкоду(ТекстЗапроса, ПоказыватьТолькоХарактеристикиВНаличии);
			Запрос.УстановитьПараметр("ПоказыватьТолькоХарактеристикиВНаличии", ПоказыватьТолькоХарактеристикиВНаличии);
			Запрос.УстановитьПараметр("ПоказыватьЦеныПоХарактеристикам", ПоказыватьЦеныПоХарактеристикам);
			Запрос.УстановитьПараметр("ДобавлятьНоменклатуруБезХарактеристики", ДобавлятьНоменклатуруБезХарактеристики);
			
			// +ор интеграция МДЛП
			Запрос.УстановитьПараметр("ОбщиеТолькоМаркируемыеЛС", ОбщиеТолькоМаркируемыеЛС);
			// -ор интеграция МДЛП
			
			Если ПоказыватьТолькоХарактеристикиВНаличии Тогда
				
				ТипыНоменклатуры = Новый Массив;
				ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Запас);
				
				Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
				Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
				Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
				Запрос.УстановитьПараметр("ВидЦен", РозничныйВидЦены);
				Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
				Запрос.УстановитьПараметр("ТипыНоменклатуры", ТипыНоменклатуры);
				
			КонецЕсли;
			
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ орвтШтрихкоды", "");
		КонецЕсли;
		Запрос.УстановитьПараметр("ИспользоватьСерииНоменклатуры", ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры"));
		// -ор
		
		Запрос.Текст = ТекстЗапроса;
		
		ПараметрНомерТелефона = ОбщегоНазначенияРМК.ПолучитьОбратныйНомерТелефонаБезКодаСтраны(НомерТелефона);
		РаботаСоШтрихкодамиПереопределяемый.ПодготовитьНомерТелефонаДляПоиска(ПараметрНомерТелефона, НомерТелефона);
		Запрос.УстановитьПараметр("Штрихкод", ШтрихкодПоиска);
		Запрос.УстановитьПараметр("ШтрихкодМарки", ШтрихкодМарки);
		Запрос.УстановитьПараметр("ДлинаШтрихкода", СтрДлина(ШтрихкодПоиска));
		Запрос.УстановитьПараметр("НомерТелефона", ПараметрНомерТелефона);
		Запрос.УстановитьПараметр("ШтрихкодИнверсия", ПолучитьИнверсиюСтроки(ШтрихкодПоиска));
		Запрос.УстановитьПараметр("АдресЭП", АдресЭП);
		
		// +ор интеграция МДЛП
		Запрос.УстановитьПараметр("GTINМДЛП", GTINМДЛП);
		Запрос.УстановитьПараметр("НомерУпаковкиSGTIN", НомерУпаковкиSGTIN);
		Запрос.УстановитьПараметр("КлючУпаковкиSGTIN", ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НомерУпаковкиSGTIN));
		// -ор интеграция МДЛП
		
		РаботаСоШтрихкодамиПереопределяемый.ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, ДополнительныеПараметры);
		Выборка = Запрос.Выполнить().Выбрать();
		
		// +ор
		Если ИспользоватьОбщиеШКХарактеристик И ПоказыватьЦеныПоХарактеристикам Тогда
			СтруктураПараметров.Вставить("ОтображатьЦены");
			СтруктураПараметров.Вставить("РозничныйВидЦены", РозничныйВидЦены);
		КонецЕсли;
		// -ор
		
		ДополнитьСтруктуруРезультатамиПоиска(СтруктураПараметров, Выборка, Штрихкод, "", НеизвестныеДанныеПО);
		
	КонецЕсли;
	
	СтруктураПараметров.ПараметрыШтрихкода = ДополнительныеПараметры;
	СтруктураПараметров.Вставить("ФормаВызова", Форма);
	
	РаботаСоШтрихкодамиПереопределяемый.СкорректироватьСтруктуруРезультата(
			СтруктураПараметров,
			Штрихкод,
			СтруктураДействий,
			НеизвестныеДанныеПО,
			Истина);
	СтруктураПараметров.Удалить("ФормаВызова");
	
	НайденоОбъектов = СтруктураПараметров.ЗначенияПоиска.Количество();
	Если НайденоОбъектов > 1 Тогда
		СтруктураПараметров.Вставить("ИспользоватьНовыйАлгоритмПоискаПоШтрихкоду");
	КонецЕсли;
	
	СтруктураПараметров.НеизвестныеДанныеПО = НеизвестныеДанныеПО;
	
	Позиция = НайтиНедопустимыеСимволыXML(Штрихкод);
	Если Позиция > 0 Тогда
		Штрихкод = Лев(Штрихкод, Позиция - 1);
	КонецЕсли;
	
	РеквизитыФормыРМК = Форма;
	СтруктураПараметров.ДанныеПО = Штрихкод;
	СтруктураПараметров.ТипДанныхПО = "Штрихкод";
	СтруктураПараметров.ПараметрыШтрихкода = ДополнительныеПараметры;
	
	ПределКэшированияСтрок = 30;
	Если РеквизитыФормыРМК.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК"
		И ТипЗнч(РеквизитыФормыРМК) = Тип("Структура") Тогда
		
		СтруктураПараметров.РеквизитыФормыРМК = РеквизитыФормыРМК;
		
		Если НайденоОбъектов < ПределКэшированияСтрок Тогда
			
			Если РеквизитыФормыРМК.Свойство("ПараметрыДляОбработкиШтрихкода") Тогда
				РеквизитыФормыРМК.ПараметрыДляОбработкиШтрихкода.Вставить("ПараметрыШтрихкода", ДополнительныеПараметры);
			КонецЕсли;
			
			НесколькоЗначенийПоиска = НайденоОбъектов > 1;
			Если НесколькоЗначенийПоиска Тогда
				ПустаяСтрокаТаблицыТоваров = ОбщегоНазначения.СкопироватьРекурсивно(РеквизитыФормыРМК.ПустаяСтрокаТаблицыТоваров);
			Иначе
				ПустаяСтрокаТаблицыТоваров = РеквизитыФормыРМК.ПустаяСтрокаТаблицыТоваров;
			КонецЕсли;
			
			МассивКонтрагентов = Новый Массив;
			МассивРазличныхЗначений = Новый Массив;
			КоличествоКартЛояльности = 0;
			
			Для Каждого СтрокаЗначения Из СтруктураПараметров.ЗначенияПоиска Цикл
				
				Если МассивРазличныхЗначений.Найти(СтрокаЗначения.Владелец) = Неопределено Тогда
					МассивРазличныхЗначений.Добавить(СтрокаЗначения.Владелец);
				КонецЕсли;
				
				Если СтрокаЗначения.Свойство("Номенклатура") И ЗначениеЗаполнено(СтрокаЗначения.Номенклатура) Тогда
					
					Если НесколькоЗначенийПоиска Тогда
						ПустаяСтрокаТаблицыТоваровДляЗаполнения = ОбщегоНазначения.СкопироватьРекурсивно(ПустаяСтрокаТаблицыТоваров);
						РеквизитыФормыРМК.Вставить("ПустаяСтрокаТаблицыТоваров" ,ПустаяСтрокаТаблицыТоваровДляЗаполнения);
					КонецЕсли;
					
					ДополнитьЗначениеСтрокойТовара(СтрокаЗначения, СтруктураПараметров, ПустаяСтрокаТаблицыТоваров);
					
				ИначеЕсли СтрокаЗначения.Свойство("ВладелецКарты")
					И ЗначениеЗаполнено(СтрокаЗначения.ВладелецКарты) Тогда
					
					ШтрихкодированиеРМКПереопределяемый.ДополнитьМассивВладельцамиКарт(МассивКонтрагентов, СтрокаЗначения.ВладелецКарты);
					КоличествоКартЛояльности = КоличествоКартЛояльности + 1;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СтруктураПараметров.Вставить("ОткрытьФормуСписанияБаллов", Ложь);
			СтруктураПараметров.Вставить("ОдинВладелец", МассивКонтрагентов.Количество() = 1);
			Если МассивРазличныхЗначений.Количество() > 1
				И НайденоОбъектов = КоличествоКартЛояльности Тогда
				СтруктураПараметров.ОткрытьФормуСписанияБаллов = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаОбъектыПоТелефону(МассивЗапросов, ФильтрПоискаПоШтрихкоду)
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	МассивСправочниковСКИ = Новый Массив;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьМассивСправочниковСКИ(МассивСправочниковСКИ, ФильтрПоискаПоШтрихкоду);
	
	Для Каждого СтрокаМассива Из МассивСправочниковСКИ Цикл
		
		Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство(СтрокаМассива) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапросаКИ = "ВЫБРАТЬ
		|	КонтактнаяИнформация.НомерТелефона,
		|	КонтактнаяИнформация.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.Телефон)
		|ИЗ
		|	&ТаблицаКИ КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = Значение(Перечисление.ТипыКонтактнойИнформации.Телефон) И &Условие";
		
		ТекстЗапросаКИ = СтрЗаменить(ТекстЗапросаКИ, "&ТаблицаКИ" , "Справочник." + СтрокаМассива + ".КонтактнаяИнформация");
		ТекстЗапросаКИ = СтрЗаменить(ТекстЗапросаКИ, "И &Условие", 
			?(СУсловиемПоиска, "И КонтактнаяИнформация.НомерТелефона = &НомерТелефона", ""));
		МассивЗапросов.Добавить(ТекстЗапросаКИ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаОбъектыПоАдресуЭП(МассивЗапросов, ФильтрПоискаПоШтрихкоду)
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;

	МассивСправочниковСКИ = Новый Массив;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьМассивСправочниковСКИ(МассивСправочниковСКИ, ФильтрПоискаПоШтрихкоду);
	
	Для Каждого СтрокаМассива Из МассивСправочниковСКИ Цикл
		
		Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство(СтрокаМассива) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапросаКИ = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.АдресЭП)
		|ИЗ
		|	&ТаблицаКИ КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = Значение(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) И &Условие";
		
		ТекстЗапросаКИ = СтрЗаменить(ТекстЗапросаКИ, "&ТаблицаКИ" , "Справочник." + СтрокаМассива + ".КонтактнаяИнформация");
		ТекстЗапросаКИ = СтрЗаменить(ТекстЗапросаКИ, "И &Условие", 
			?(СУсловиемПоиска, "И КонтактнаяИнформация.АдресЭП = &АдресЭП", ""));
		МассивЗапросов.Добавить(ТекстЗапросаКИ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаТелефонПоШаблону()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НомерТелефона,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.Телефон)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаАдресЭППоШаблону()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&АдресЭП,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.АдресЭП)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВМассив(ТекстЗапроса, МассивЗапросов)
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		МассивЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
КонецПроцедуры

Функция ТипКонтактнойИнформацияПоШтрихкоду(Штрихкод)
	
	НомерТелефона = СокрЛП(Штрихкод);
	НомерТелефона = СтрЗаменить(НомерТелефона, "(", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, ")", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	
	СтруктураКИ = Новый Структура;
	
	Если ЭтоСтрокаНомераТелефона(НомерТелефона) Тогда
		
		СтруктураКИ.Вставить("НомерТелефона", НомерТелефона);
		Возврат СтруктураКИ;
		
	КонецЕсли;
	
	АдресЭП = Штрихкод;
	
	Если ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресЭП) Тогда
		
		СтруктураКИ.Вставить("АдресЭП", АдресЭП);
		Возврат СтруктураКИ;
		
	КонецЕсли;
	
	Возврат СтруктураКИ;
	
КонецФункции

Процедура ДополнитьСтруктуруРезультатамиПоиска(
	СтруктураПараметров,
	Выборка,
	Знач Штрихкод = "",
	МагнитныйКод = "",
	НеизвестныеДанныеПО = Ложь)
	
	Если Не ПустаяСтрока(Штрихкод) Тогда
		Позиция = НайтиНедопустимыеСимволыXML(Штрихкод);
		Если Позиция > 0 Тогда
			Штрихкод = Лев(Штрихкод, Позиция - 1);
		КонецЕсли;
	КонецЕсли;
	
	ЕстьВладелецВРезультатеПоиска = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Выборка.Владелец) Тогда
			Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Владелец) Тогда
				Продолжить;
			КонецЕсли;
			ЕстьВладелецВРезультатеПоиска = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Выборка.Владелец) Тогда
			Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Владелец) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьВладелецВРезультатеПоиска И Не ЗначениеЗаполнено(Выборка.Владелец) Тогда
			Продолжить;
		КонецЕсли;
		
		НеизвестныеДанныеПО = Ложь;
		
		СтруктураШтрихкода = НачатьСтруктуруРезультатовПоиска(СтруктураПараметров, Выборка, Штрихкод, МагнитныйКод);
		
		ЗаполнитьЗначенияСвойств(СтруктураШтрихкода, Выборка, , "Штрихкод");
		
		ДополнительныеДанные = Новый Структура;
		РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДополнительныеДанныеОбъектовВыборки(ДополнительныеДанные, Выборка);
		ДополнительныеДанные.Вставить("Серия", СтруктураШтрихкода.СерияНоменклатуры);
		СтруктураШтрихкода.Вставить("ДополнительныеДанные", ДополнительныеДанные);
		
		Для Каждого ДополнительныйПараметр Из ДополнительныеДанные Цикл
			СтруктураШтрихкода.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
		
		СтруктураПараметров.ЗначенияПоиска.Добавить(СтруктураШтрихкода);
		
	КонецЦикла;
	
	// Неактуальную номенклатуру исключаем, если есть актуальная
	ЕстьНеактуальнаяНоменклатура = Ложь;
	ЕстьАктуальнаяНоменклатура = Ложь;
	Для Каждого ЗначениеПоиска Из СтруктураПараметров.ЗначенияПоиска Цикл
		Если ЗначениеПоиска.Свойство("Номенклатура") Тогда
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеПоиска.Номенклатура, "ПометкаУдаления") Тогда
				ЕстьНеактуальнаяНоменклатура = Истина;
			Иначе
				ЕстьАктуальнаяНоменклатура = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНеактуальнаяНоменклатура И ЕстьАктуальнаяНоменклатура Тогда
		ИндексыДляУдаления = Новый СписокЗначений;
		Индекс = 0;
		
		Для Каждого ЗначениеПоиска Из СтруктураПараметров.ЗначенияПоиска Цикл
			Если ЗначениеПоиска.Свойство("Номенклатура") Тогда
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеПоиска.Номенклатура, "ПометкаУдаления") Тогда
					ИндексыДляУдаления.Добавить(Индекс);
				КонецЕсли;
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
		
		ИндексыДляУдаления.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		
		Для Каждого ИндексДляУдаления Из ИндексыДляУдаления Цикл
			СтруктураПараметров.ЗначенияПоиска.Удалить(ИндексДляУдаления.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция НачатьСтруктуруРезультатовПоиска(
	СтруктураПараметров,
	Выборка,
	Штрихкод,
	МагнитныйКод)
	
	СтруктураШтрихкода = Новый Структура;
	Если ЗначениеЗаполнено(СтруктураПараметров.ДанныеПО) Тогда
		СтруктураШтрихкода.Вставить("ДанныеПО", СтруктураПараметров.ДанныеПО);
	ИначеЕсли ЗначениеЗаполнено(Штрихкод) Тогда
		СтруктураШтрихкода.Вставить("ДанныеПО", Штрихкод);
	Иначе
		СтруктураШтрихкода.Вставить("ДанныеПО", МагнитныйКод);
	КонецЕсли;
	СтруктураШтрихкода.Вставить("НомерСтрокиЗагрузки", Выборка.НомерСтроки);
	СтруктураШтрихкода.Вставить("Штрихкод", Штрихкод);
	СтруктураШтрихкода.Вставить("МагнитныйКод", МагнитныйКод);
	СтруктураШтрихкода.Вставить("Количество", Выборка.Количество);
	
	СтруктураШтрихкода.Вставить("Владелец");
	СтруктураШтрихкода.Вставить("ТипОбъекта");
	СтруктураШтрихкода.Вставить("ШаблонШтрихкода");
	СтруктураШтрихкода.Вставить("Характеристика");
	СтруктураШтрихкода.Вставить("Упаковка");
	СтруктураШтрихкода.Вставить("СерияНоменклатуры");

	
	Возврат СтруктураШтрихкода;
	
КонецФункции

// Формирует предопределенную структуру,
// Которая используется при поиске по ШК.
//
// Возвращаемое значение:
//  Структура - структура данных поиска.
//
Функция СтруктураДанныхПоиска()
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ЗначенияПоиска", Новый Массив);
	СтруктураПараметров.Вставить("НеизвестныеДанныеПО", Истина);
	СтруктураПараметров.Вставить("ДанныеПО", "");
	СтруктураПараметров.Вставить("ТипДанныхПО", "Штрихкод");
	СтруктураПараметров.Вставить("ПараметрыШтрихкода", Новый Структура);
	СтруктураПараметров.Вставить("ДанныеКонтроляПродаж", ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаКонтроляПродаж());
	СтруктураПараметров.Вставить("ДанныеУточненияПринадлежностиЗапасов", Новый Соответствие);
	СтруктураПараметров.Вставить("РеквизитыФормыРМК");
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ЭтоШтрихкодМарки(ДанныеМаркировки)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеМаркировки, "ТипИдентификатораТовара") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипИдентификатораТовара = ДанныеМаркировки.ТипИдентификатораТовара;
	
	ТипыИдентификаторов = Перечисления.ТипыИдентификаторовТовараККТ;
	
	Возврат (ТипИдентификатораТовара = ТипыИдентификаторов.ИзделияИзНатуральногоМеха 
		ИЛИ ТипИдентификатораТовара = ТипыИдентификаторов.КодТовараВФорматеDataMatrixGS1
		ИЛИ ТипИдентификатораТовара = ТипыИдентификаторов.КодТовараВФорматеЕГАИС2
		ИЛИ ТипИдентификатораТовара = ТипыИдентификаторов.КодТовараВФорматеЕГАИС3);
	
КонецФункции

Функция ЭтоСтрокаНомераТелефона(НомерТелефона)
	
	ДлинаНомераБезКодаСтраны = 10;
	РезультатФункции = ((СтрДлина(НомерТелефона) = ДлинаНомераБезКодаСтраны + 1
			И (Лев(НомерТелефона, 1) = "7" Или Лев(НомерТелефона, 1) = "8"))
		Или СтрДлина(НомерТелефона) = ДлинаНомераБезКодаСтраны)
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерТелефона);
		
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьИнверсиюСтроки(ИсходнаяСтрока)
	
	НоваяСтрока = "";
	
	ДлинаИсходногоТекста = СтрДлина(ИсходнаяСтрока);
	Пока ДлинаИсходногоТекста > 0 Цикл
		НоваяСтрока = НоваяСтрока + Сред(ИсходнаяСтрока, ДлинаИсходногоТекста, 1);
		ДлинаИсходногоТекста = ДлинаИсходногоТекста - 1;
	КонецЦикла;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ДоплнитьЗапросПоискаПоШтрихкоду(ТекстЗапроса, ПолучатьОстатокПоХарактеристикам) Экспорт
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	втШтрихкоды.НомерСтроки КАК НомерСтроки,
	|	втШтрихкоды.Владелец КАК Владелец,
	|	СправочникНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
	|	СправочникНоменклатура.ИспользоватьХарактеристики КАК ИспользоватьХарактеристикиНоменклатура,
	|	втШтрихкоды.Характеристика КАК Характеристика,
	|	втШтрихкоды.Упаковка КАК Упаковка,
	|	втШтрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втШтрихкоды.Партия КАК Партия,
	|	втШтрихкоды.Количество КАК Количество,
	|	втШтрихкоды.Штрихкод КАК Штрихкод,
	|	втШтрихкоды.ТипОбъекта КАК ТипОбъекта,
	|	втШтрихкоды.ШаблонШтрихкода КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ втШтрихкодыНоменклатураВременная
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|		Внутреннее СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО втШтрихкоды.Владелец = СправочникНоменклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкоды.НомерСтроки КАК НомерСтроки,
	|	втШтрихкоды.Владелец КАК Владелец,
	|	втШтрихкоды.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
	|	втШтрихкоды.ИспользоватьХарактеристикиНоменклатура КАК ИспользоватьХарактеристикиНоменклатура,
	|	СправочникКатегорииНоменклатуры.ИспользоватьХарактеристики КАК ИспользоватьХарактеристикиКатегория,
	|	втШтрихкоды.Характеристика КАК Характеристика,
	|	втШтрихкоды.Упаковка КАК Упаковка,
	|	втШтрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втШтрихкоды.Партия КАК Партия,
	|	втШтрихкоды.Количество КАК Количество,
	|	втШтрихкоды.Штрихкод КАК Штрихкод,
	|	втШтрихкоды.ТипОбъекта КАК ТипОбъекта,
	|	втШтрихкоды.ШаблонШтрихкода КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ втШтрихкодыНоменклатура
	|ИЗ
	|	втШтрихкодыНоменклатураВременная КАК втШтрихкоды
	|		Внутреннее СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК СправочникКатегорииНоменклатуры
	|		ПО втШтрихкоды.КатегорияНоменклатуры = СправочникКатегорииНоменклатуры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыНоменклатура.НомерСтроки КАК НомерСтроки,
	|	втШтрихкодыНоменклатура.Владелец КАК Владелец,
	|	втШтрихкодыНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
	|	втШтрихкодыНоменклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров КАК УчетМаркируемыхТоваров,
	|	втШтрихкодыНоменклатура.ИспользоватьХарактеристикиНоменклатура КАК ИспользоватьХарактеристикиНоменклатура,
	|	втШтрихкодыНоменклатура.ИспользоватьХарактеристикиКатегория КАК ИспользоватьХарактеристикиКатегория,
	|	втШтрихкодыНоменклатура.Характеристика КАК Характеристика,
	|	втШтрихкодыНоменклатура.Упаковка КАК Упаковка,
	|	втШтрихкодыНоменклатура.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втШтрихкодыНоменклатура.Партия КАК Партия,
	|	втШтрихкодыНоменклатура.Количество КАК Количество,
	|	втШтрихкодыНоменклатура.Штрихкод КАК Штрихкод,
	|	втШтрихкодыНоменклатура.ТипОбъекта КАК ТипОбъекта,
	|	втШтрихкодыНоменклатура.ШаблонШтрихкода КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ втНоменклатураБезХарактеристики
	|ИЗ
	|	втШтрихкодыНоменклатура КАК втШтрихкодыНоменклатура
	|ГДЕ
	|	втШтрихкодыНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И (втШтрихкодыНоменклатура.ИспользоватьХарактеристикиКатегория
	|	ИЛИ втШтрихкодыНоменклатура.ИспользоватьХарактеристикиНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатураБезХарактеристики.НомерСтроки КАК НомерСтроки,
	|	втНоменклатураБезХарактеристики.Владелец КАК Владелец,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	втНоменклатураБезХарактеристики.Упаковка КАК Упаковка,
	|	втНоменклатураБезХарактеристики.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втНоменклатураБезХарактеристики.Партия КАК Партия,
	|	втНоменклатураБезХарактеристики.Количество КАК Количество,
	|	втНоменклатураБезХарактеристики.Штрихкод КАК Штрихкод,
	|	втНоменклатураБезХарактеристики.ТипОбъекта КАК ТипОбъекта,
	|	втНоменклатураБезХарактеристики.ШаблонШтрихкода КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ втНоменклатураСХарактеристикой
	|ИЗ
	|	втНоменклатураБезХарактеристики КАК втНоменклатураБезХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО втНоменклатураБезХарактеристики.Владелец = ХарактеристикиНоменклатуры.Владелец
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОбщиеТолькоМаркируемыеЛС
	|				ТОГДА втНоменклатураБезХарактеристики.УчетМаркируемыхТоваров
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втНоменклатураБезХарактеристики.НомерСтроки,
	|	втНоменклатураБезХарактеристики.Владелец,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	втНоменклатураБезХарактеристики.Упаковка,
	|	втНоменклатураБезХарактеристики.СерияНоменклатуры,
	|	втНоменклатураБезХарактеристики.Партия,
	|	втНоменклатураБезХарактеристики.Количество,
	|	втНоменклатураБезХарактеристики.Штрихкод,
	|	втНоменклатураБезХарактеристики.ТипОбъекта,
	|	втНоменклатураБезХарактеристики.ШаблонШтрихкода
	|ИЗ
	|	втНоменклатураБезХарактеристики КАК втНоменклатураБезХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО втНоменклатураБезХарактеристики.КатегорияНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОбщиеТолькоМаркируемыеЛС
	|				ТОГДА втНоменклатураБезХарактеристики.УчетМаркируемыхТоваров
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	втШтрихкодыНоменклатура.НомерСтроки КАК НомерСтроки,
	|	втШтрихкодыНоменклатура.Владелец КАК Владелец,
	|	втШтрихкодыНоменклатура.Характеристика КАК Характеристика,
	|	втШтрихкодыНоменклатура.Упаковка КАК Упаковка,
	|	втШтрихкодыНоменклатура.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втШтрихкодыНоменклатура.Партия КАК Партия,
	|	втШтрихкодыНоменклатура.Количество КАК Количество,
	|	втШтрихкодыНоменклатура.Штрихкод КАК Штрихкод,
	|	втШтрихкодыНоменклатура.ТипОбъекта КАК ТипОбъекта,
	|	втШтрихкодыНоменклатура.ШаблонШтрихкода КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ втШтрихкодыИтог
	|ИЗ
	|	втШтрихкодыНоменклатура КАК втШтрихкодыНоменклатура
	|ГДЕ
	|	НЕ(втШтрихкодыНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И (втШтрихкодыНоменклатура.ИспользоватьХарактеристикиНоменклатура
	|					ИЛИ втШтрихкодыНоменклатура.ИспользоватьХарактеристикиКатегория))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втНоменклатураБезХарактеристики.НомерСтроки,
	|	втНоменклатураБезХарактеристики.Владелец,
	|	втНоменклатураБезХарактеристики.Характеристика,
	|	втНоменклатураБезХарактеристики.Упаковка,
	|	втНоменклатураБезХарактеристики.СерияНоменклатуры,
	|	втНоменклатураБезХарактеристики.Партия,
	|	втНоменклатураБезХарактеристики.Количество,
	|	втНоменклатураБезХарактеристики.Штрихкод,
	|	втНоменклатураБезХарактеристики.ТипОбъекта,
	|	втНоменклатураБезХарактеристики.ШаблонШтрихкода
	|ИЗ
	|	втНоменклатураБезХарактеристики КАК втНоменклатураБезХарактеристики
	|ГДЕ
	|	&ДобавлятьНоменклатуруБезХарактеристики
	|	И НЕ &ОбщиеТолькоМаркируемыеЛС
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втНоменклатура.НомерСтроки
	|	,втНоменклатура.Владелец
	|	,втНоменклатура.Характеристика
	|	,втНоменклатура.Упаковка
	|	,втНоменклатура.СерияНоменклатуры
	|	,втНоменклатура.Партия
	|	,втНоменклатура.Количество
	|	,втНоменклатура.Штрихкод
	|	,втНоменклатура.ТипОбъекта
	|	,втНоменклатура.ШаблонШтрихкода
	|ИЗ
	|	втНоменклатураСХарактеристикой КАК втНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыИтог.НомерСтроки КАК НомерСтроки,
	|	втШтрихкодыИтог.Владелец КАК Владелец,
	|	втШтрихкодыИтог.Характеристика КАК Характеристика,
	|	втШтрихкодыИтог.Упаковка КАК Упаковка,
	|	втШтрихкодыИтог.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втШтрихкодыИтог.Партия КАК Партия,
	|	втШтрихкодыИтог.Количество КАК Количество,
	|	втШтрихкодыИтог.Штрихкод КАК Штрихкод,
	|	втШтрихкодыИтог.ТипОбъекта КАК ТипОбъекта,
	|	втШтрихкодыИтог.ШаблонШтрихкода КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ ИтогиДляОСтатков
	|ИЗ
	|	втШтрихкодыИтог КАК втШтрихкодыИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	втШтрихкодыИтог.Владелец,
	|	втШтрихкодыИтог.Упаковка,
	|	втШтрихкодыИтог.СерияНоменклатуры,
	|	втШтрихкодыИтог.Партия,
	|	втШтрихкодыИтог.Количество,
	|	втШтрихкодыИтог.Штрихкод,
	|	втШтрихкодыИтог.ТипОбъекта,
	|	втШтрихкодыИтог.ШаблонШтрихкода,
	|	втШтрихкодыИтог.Характеристика,
	|	втШтрихкодыИтог.НомерСтроки";
	
	ДоплнитьЗапросПоискаПоШтрихкодуОстатки(ТекстЗапроса, ПолучатьОстатокПоХарактеристикам);
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	втШтрихкоды.НомерСтроки КАК НомерСтроки,
	|	втШтрихкоды.Владелец КАК Владелец,
	|	втШтрихкоды.Характеристика КАК Характеристика,
	|	втШтрихкоды.Упаковка КАК Упаковка,
	|	втШтрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втШтрихкоды.Партия КАК Партия,
	|	втШтрихкоды.Количество КАК Количество,
	|	втШтрихкоды.Штрихкод КАК Штрихкод,
	|	втШтрихкоды.ТипОбъекта КАК ТипОбъекта,
	|	втШтрихкоды.ШаблонШтрихкода КАК ШаблонШтрихкода,
	|	Ложь КАК ПоказыватьТолькоХарактеристикиВНаличии,
	|	Ложь КАК ПоказыватьЦеныПоХарактеристикам
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|ГДЕ
	|	НЕ втШтрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВтНоменклатура.НомерСтроки,
	|	ВтНоменклатура.Владелец,
	|	ВтНоменклатура.Характеристика,
	|	ВтНоменклатура.Упаковка,
	|	ВтНоменклатура.СерияНоменклатуры,
	|	ВтНоменклатура.Партия,
	|	ВтНоменклатура.Количество,
	|	ВтНоменклатура.Штрихкод,
	|	ВтНоменклатура.ТипОбъекта,
	|	ВтНоменклатура.ШаблонШтрихкода,
	|	&ПоказыватьТолькоХарактеристикиВНаличии,
	|	&ПоказыватьЦеныПоХарактеристикам
	|ИЗ
	|	" + ?( ПолучатьОстатокПоХарактеристикам, "втНоменклатураОстаткиИтог", "ИтогиДляОСтатков") + " КАК втНоменклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Владелец,
	|	Характеристика,
	|	Упаковка,
	|	СерияНоменклатуры,
	|	Партия,
	|	Количество,
	|	Штрихкод,
	|	ТипОбъекта,
	|	ШаблонШтрихкода";
	
КонецПроцедуры

Процедура ДоплнитьЗапросПоискаПоШтрихкодуОстатки(ТекстЗапроса, ПолучатьОстатокПоХарактеристикам)
	
	Если ПолучатьОстатокПоХарактеристикам Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТовары.Владелец КАК Владелец,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ТаблицаТовары.Упаковка КАК Упаковка,
		|	ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаТовары.Партия КАК Партия,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Штрихкод КАК Штрихкод1,
		|	ТаблицаТовары.ТипОбъекта КАК ТипОбъекта,
		|	ТаблицаТовары.ШаблонШтрихкода КАК ШаблонШтрихкода
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	ИтогиДляОСтатков КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТовары.Владелец КАК Владелец,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ТаблицаТовары.Упаковка КАК Упаковка,
		|	ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаТовары.Партия КАК Партия,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Штрихкод1 КАК Штрихкод1,
		|	ТаблицаТовары.ТипОбъекта КАК ТипОбъекта,
		|	ТаблицаТовары.ШаблонШтрихкода КАК ШаблонШтрихкода,
		|	ВЫБОР
		|		КОГДА СпрПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий)
		|			ТОГДА ЛОЖЬ
		|		КОГДА СпрПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
		|			И СпрНоменклатура.ИспользоватьСерииНоменклатуры И &ИспользоватьСерииНоменклатуры
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КонтрольОстатковСерий
		|ПОМЕСТИТЬ ИтоговаяТаблицаТовары
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикаУчетаСерий КАК СпрПолитикаУчетаСерий
		|			ПО СпрНоменклатура.ПолитикаУчетаСерий = СпрПолитикаУчетаСерий.Ссылка
		|		ПО ТаблицаТовары.Владелец = СпрНоменклатура.Ссылка
		|ГДЕ
		|	СпрНоменклатура.ТипНоменклатуры В(&ТипыНоменклатуры)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Штрихкод1,
		|	Владелец,
		|	Характеристика,
		|	" + ?(ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры"), "СерияНоменклатуры,", "") + "
		|	Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК ОстатокНаСкладе
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			&Дата,
		|			Организация В (&МассивОрганизаций)
		|				И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
		|				И (Номенклатура, Характеристика, Партия) В
		|					(ВЫБРАТЬ
		|						ТоварыДокумента.Владелец КАК Номенклатура,
		|						ТоварыДокумента.Характеристика КАК Характеристика,
		|						ТоварыДокумента.Партия КАК Партия
		|					ИЗ
		|						ИтоговаяТаблицаТовары КАК ТоварыДокумента
		|					ГДЕ
		|						НЕ ТоварыДокумента.КонтрольОстатковСерий)) КАК ЗапасыНаСкладахОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервыТоваровОрганизацийОстатки.Номенклатура КАК Номенклатура,
		|	РезервыТоваровОрганизацийОстатки.Характеристика КАК Характеристика,
		|	РезервыТоваровОрганизацийОстатки.Партия КАК Партия,
		|	РезервыТоваровОрганизацийОстатки.КоличествоОстаток КАК КоличествоРезерв
		|ПОМЕСТИТЬ ТаблицаРезерв
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&Дата,
		|			Организация В (&МассивОрганизаций)
		|				И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
		|				И (Номенклатура, Характеристика, Партия) В
		|					(ВЫБРАТЬ
		|						ТоварыДокумента.Владелец КАК Номенклатура,
		|						ТоварыДокумента.Характеристика КАК Характеристика,
		|						ТоварыДокумента.Партия КАК Партия
		|					ИЗ
		|						ИтоговаяТаблицаТовары КАК ТоварыДокумента)
		|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И НЕ ЗаказПокупателя = &ЗаказПокупателя) КАК РезервыТоваровОрганизацийОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СерииНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	СерииНоменклатурыОстатки.Характеристика КАК Характеристика,
		|	СерииНоменклатурыОстатки.Партия КАК Партия,
		|	СерииНоменклатурыОстатки.Серия КАК Серия,
		|	СерииНоменклатурыОстатки.КоличествоОстаток КАК КоличествоСерий
		|ПОМЕСТИТЬ ТаблицаОстатокСерий
		|ИЗ
		|	РегистрНакопления.СерииНоменклатуры.Остатки(
		|			&Дата,
		|			Организация В (&МассивОрганизаций)
		|				И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)
		|				И (Номенклатура, Характеристика, Партия, Серия) В
		|					(ВЫБРАТЬ
		|						ТоварыДокумента.Владелец КАК Номенклатура,
		|						ТоварыДокумента.Характеристика КАК Характеристика,
		|						ТоварыДокумента.Партия КАК Партия,
		|						ТоварыДокумента.СерияНоменклатуры КАК Серия
		|					ИЗ
		|						ИтоговаяТаблицаТовары КАК ТоварыДокумента
		|					ГДЕ
		|						ТоварыДокумента.КонтрольОстатковСерий)) КАК СерииНоменклатурыОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ИтоговаяТаблицаТовары.Владелец КАК Владелец,
		|	ИтоговаяТаблицаТовары.Характеристика КАК Характеристика,
		|	ИтоговаяТаблицаТовары.Упаковка КАК Упаковка,
		|	ИтоговаяТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ИтоговаяТаблицаТовары.Партия КАК Партия,
		|	ИтоговаяТаблицаТовары.Количество КАК Количество,
		|	ИтоговаяТаблицаТовары.Штрихкод1 КАК Штрихкод,
		|	ИтоговаяТаблицаТовары.ТипОбъекта КАК ТипОбъекта,
		|	ИтоговаяТаблицаТовары.ШаблонШтрихкода КАК ШаблонШтрихкода,
		|	ЕСТЬNULL(ТаблицаОстатки.ОстатокНаСкладе, 0) + ЕСТЬNULL(ТаблицаОстатокСерий.КоличествоСерий, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ТаблицаРезерв.КоличествоРезерв, 0) КАК КоличествоРезерв
		|ПОМЕСТИТЬ ТаблицаИтоговоеКоличество
		|ИЗ
		|	ИтоговаяТаблицаТовары КАК ИтоговаяТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
		|		ПО ИтоговаяТаблицаТовары.Владелец = ТаблицаОстатки.Номенклатура
		|			И ИтоговаяТаблицаТовары.Характеристика = ТаблицаОстатки.Характеристика
		|			И ИтоговаяТаблицаТовары.Партия = ТаблицаОстатки.Партия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРезерв КАК ТаблицаРезерв
		|		ПО ИтоговаяТаблицаТовары.Владелец = ТаблицаРезерв.Номенклатура
		|			И ИтоговаяТаблицаТовары.Характеристика = ТаблицаРезерв.Характеристика
		|			И ИтоговаяТаблицаТовары.Партия = ТаблицаРезерв.Партия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатокСерий КАК ТаблицаОстатокСерий
		|		ПО ИтоговаяТаблицаТовары.Владелец = ТаблицаОстатокСерий.Номенклатура
		|			И ИтоговаяТаблицаТовары.Характеристика = ТаблицаОстатокСерий.Характеристика
		|			И ИтоговаяТаблицаТовары.Партия = ТаблицаОстатокСерий.Партия
		|			И ИтоговаяТаблицаТовары.СерияНоменклатуры = ТаблицаОстатокСерий.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИтоговоеКоличество.НомерСтроки КАК НомерСтроки,
		|	ТаблицаИтоговоеКоличество.Владелец КАК Владелец,
		|	ТаблицаИтоговоеКоличество.Характеристика КАК Характеристика,
		|	ТаблицаИтоговоеКоличество.Упаковка КАК Упаковка,
		|	ТаблицаИтоговоеКоличество.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаИтоговоеКоличество.Партия КАК Партия,
		|	ТаблицаИтоговоеКоличество.Количество КАК Количество,
		|	ТаблицаИтоговоеКоличество.Штрихкод КАК Штрихкод,
		|	ТаблицаИтоговоеКоличество.ТипОбъекта КАК ТипОбъекта,
		|	ТаблицаИтоговоеКоличество.ШаблонШтрихкода КАК ШаблонШтрихкода,
		|	ТаблицаИтоговоеКоличество.КоличествоОстаток - ТаблицаИтоговоеКоличество.КоличествоРезерв КАК КоличествоОстаток
		|ПОМЕСТИТЬ ТаблицаИтог
		|ИЗ
		|	ТаблицаИтоговоеКоличество КАК ТаблицаИтоговоеКоличество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ТаблицаИтоговоеКоличество.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВсегоОстаток
		|ИЗ
		|	ТаблицаИтоговоеКоличество КАК ТаблицаИтоговоеКоличество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИтог.НомерСтроки КАК НомерСтроки,
		|	ТаблицаИтог.Владелец КАК Владелец,
		|	ТаблицаИтог.Характеристика КАК Характеристика,
		|	ТаблицаИтог.Упаковка КАК Упаковка,
		|	ТаблицаИтог.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаИтог.Партия КАК Партия,
		|	ТаблицаИтог.Количество КАК Количество,
		|	ТаблицаИтог.Штрихкод КАК Штрихкод,
		|	ТаблицаИтог.ТипОбъекта КАК ТипОбъекта,
		|	ТаблицаИтог.ШаблонШтрихкода КАК ШаблонШтрихкода
		|ПОМЕСТИТЬ втНоменклатураОстаткиИтог
		|ИЗ
		|	ТаблицаИтог КАК ТаблицаИтог,
		|	ВсегоОстаток
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТаблицаИтог.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				ТОГДА ВЫБОР
		|						КОГДА ТаблицаИтог.КоличествоОстаток > 0
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ ВсегоОстаток.КоличествоОстаток = 0
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьЗначениеСтрокойТовара(СтрокаЗначения, СтруктураПараметров, ПустаяСтрокаТаблицыТоваров = Неопределено) Экспорт
	
	РеквизитыФормыРМК = СтруктураПараметров.РеквизитыФормыРМК;
	Если ПустаяСтрокаТаблицыТоваров = Неопределено Тогда
		ПустаяСтрокаТаблицыТоваров = РеквизитыФормыРМК.ПустаяСтрокаТаблицыТоваров;
	КонецЕсли;
	
	ПараметрыДляОбработкиШтрихкода = Неопределено;
	НайденнаяНоменклатура = Неопределено;
	ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденнойНоменклатуры(
		СтрокаЗначения, РеквизитыФормыРМК, ПараметрыДляОбработкиШтрихкода, НайденнаяНоменклатура);
		
	Если НЕ НайденнаяНоменклатура = Неопределено Тогда
		
		ДанныеКонтроляПродаж = ?(РеквизитыФормыРМК.ИспользоватьКонтрольПродаж, Новый Структура, Неопределено);
		ДополнительныеДанные = Новый Структура("ДанныеКонтроляПродаж", ДанныеКонтроляПродаж);
		ДополнительныеДанные.Вставить("Характеристика", Неопределено);
		ДополнительныеДанные.Вставить("ИспользоватьВыборСкладаПриПродаже", РеквизитыФормыРМК.ИспользоватьВыборСкладаПриПродаже);
		ДополнительныеДанные.Вставить("ТорговыйОбъект", РеквизитыФормыРМК.Объект.ТорговыйОбъект);
		ДополнительныеДанные.Вставить("РежимКассыСамообслуживания", РеквизитыФормыРМК.РежимКассыСамообслуживания);
		
		ДанныеУточненияПринадлежностиЗапасов = ?(РеквизитыФормыРМК.ИспользоватьУточненияПринадлежностиЗапасов, Новый Соответствие, Неопределено);
		ДополнительныеДанные.Вставить("ДанныеУточненияПринадлежностиЗапасов", ДанныеУточненияПринадлежностиЗапасов);
		
		Если СтрокаЗначения.Свойство("Характеристика") Тогда
			ДополнительныеДанные.Характеристика = СтрокаЗначения.Характеристика;
		КонецЕсли;
		
		НайденнаяНоменклатура.Вставить("РеквизитыФормыРМК", РеквизитыФормыРМК);
		СтрокаТовара = ПродажиРМК.СтрокаТовара(НайденнаяНоменклатура, ДополнительныеДанные);
		СтрокаЗначения.Вставить("СтрокаТовара", СтрокаТовара);
		СтрокаЗначения.Вставить("СтруктураНайденнойНоменклатуры", НайденнаяНоменклатура);
		Если СтрокаЗначения.Свойство("ДополнительныеДанные") Тогда
			СтрокаЗначения.ДополнительныеДанные.Вставить("СтрокаТовара", СтрокаТовара);
			СтрокаЗначения.ДополнительныеДанные.Вставить("СтруктураНайденнойНоменклатуры", НайденнаяНоменклатура);
		КонецЕсли;
		
		Если Не ДополнительныеДанные.ДанныеКонтроляПродаж = Неопределено Тогда
			ИнтерфейсРМКСлужебныйКлиентСервер.ДобавитьНовыеДанныеКэшаПродаж(СтруктураПараметров.ДанныеКонтроляПродаж,
				ДополнительныеДанные.ДанныеКонтроляПродаж);
		КонецЕсли;
			
		Если Не ДополнительныеДанные.ДанныеУточненияПринадлежностиЗапасов = Неопределено Тогда
			ИнтерфейсРМКСлужебныйКлиентСервер.ДобавитьНовыеДанныеКэшаУточненияПринадлежностиЗапасов(СтруктураПараметров.ДанныеУточненияПринадлежностиЗапасов,
				ДополнительныеДанные.ДанныеУточненияПринадлежностиЗапасов);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
