
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Неопределено;
	Параметры.Свойство("Номенклатура", Номенклатура);
	
	КатегорияНоменклатуры = Номенклатура.КатегорияНоменклатуры;
	ИспользоватьНаборыЕдиницИзмерения = Номенклатура.ИспользоватьНаборыЕдиницИзмерения;
	НаборЕдиницИзмерения = Номенклатура.НаборЕдиницИзмерения;
	ЕдиницаХранения = Номенклатура.ЕдиницаИзмерения;
	
	СписокОтбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		СписокОтбора.Добавить(КатегорияНоменклатуры);
	КонецЕсли;
	
	Если ИспользоватьНаборыЕдиницИзмерения = 1 Тогда
		Если ЗначениеЗаполнено(НаборЕдиницИзмерения) Тогда
			СписокОтбора.Добавить(НаборЕдиницИзмерения);
		Иначе
			СписокОтбора.Добавить(Номенклатура);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Номенклатура) Тогда
		Если ИспользоватьНаборыЕдиницИзмерения = 1 Тогда
			СписокОтбора.Добавить("");
		Иначе
			СписокОтбора.Добавить(Номенклатура);
		КонецЕсли;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК СправочникЕдиницыИзмерения
	|ГДЕ
	|	СправочникЕдиницыИзмерения.Коэффициент < 1
	|	И СправочникЕдиницыИзмерения.ор_КоличествоПервичныхУпаковок > 1
	|	И СправочникЕдиницыИзмерения.Владелец В(&Владелец)
	|	И НЕ СправочникЕдиницыИзмерения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", СписокОтбора);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НоваяСтрока = СписокУпаковок.Добавить();
		НоваяСтрока.Упаковка = Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокУпаковок.Добавить();
		НоваяСтрока.Упаковка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЧеков

&НаКлиенте
Процедура СписокУпаковокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗафиксироватьВыбор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ЗафиксироватьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьВыбор()
	
	ТекущиеДанные = Элементы.СписокУпаковок.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(ТекущиеДанные.Упаковка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
