
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерОборудованияРМК.НастроитьПодключаемоеОборудование(ЭтотОбъект, "");
	
	СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
	РозничныйВидЦены = Параметры.РозничныйВидЦены;
	ХарактеристикиИспользуются = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	АдресКартинки   = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещенияПриПодключении, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		
		Если Событие = "Штрихкод" Или Событие = "ПолученШтрихкод" Или Событие = "ScanData" Тогда
			ВыполнитьПоискШтрихкода(Данные);
		ИначеЕсли Событие = "TracksData" Или Событие = "ДанныеКарты" Тогда
			ВыполнитьПоискМагнитногоКода(Данные);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			ВыполнитьПоискШтрихкода(Штрихкод);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			ВыполнитьПоискМагнитногоКода(Параметр[0]);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСтрокаВыбораСерииНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Владелец", НайденнаяНоменклатура));
	ПараметрыОткрытия.Вставить("ПоказатьПроданные", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборСерииСертификата", ЭтотОбъект);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ДополнительныеПараметры = Новый Структура("ПолученШтрихкодИзСШК");
	
	Оповещение = Новый ОписаниеОповещения("РучнойВводШтрихкодаПослеВвода", ЭтотОбъект, ДополнительныеПараметры);
	ЗаголовокОкнаВвода = НСтр("ru = 'Введите штрихкод'");
	ПоказатьВводЗначения(Оповещение, "", ЗаголовокОкнаВвода);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийПодключаемогоОборудования

&НаКлиенте
Процедура ВыполнитьПоискШтрихкода(Штрихкод)
	
	Если НЕ ПустаяСтрока(Штрихкод) Тогда
		СтруктураПараметровКлиента = ПолученШтрихкодИзСШК(Штрихкод);
		ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
		ОбработатьДанныеПоКодуСервер(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискМагнитногоКода(ТекКод)
	
	Если Не ПустаяСтрока(ТекКод) Тогда
		СтруктураПараметровКлиента = ДанныеПоискаПоМагнитномуКодуСервер(ТекКод);
		ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
		ОбработатьДанныеПоКодуСервер(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораДанныхПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьДанныеПоКодуСервер(Результат);
		ОбработатьДанныеПоКодуКлиент(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеПоискаПоМагнитномуКодуСервер(МагнитныйКод)
	
	Возврат ДисконтныеКартыСервер.НайтиДисконтныеКартыПоМагнитномуКоду(МагнитныйКод);
	
КонецФункции

&НаКлиенте
Функция ПолученШтрихкодИзСШК(Штрихкод)
	
	ОткрытаБлокирующаяФорма = Ложь;
	Возврат ДанныеПоискаПоШтрихкодуСервер(Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура РучнойВводШтрихкодаПослеВвода(ДанныеШтрихкода, ДополнительныеПараметры) Экспорт
	
	Если ДанныеШтрихкода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВведенноеЧисло", ДанныеШтрихкода);
	СтруктураОтвета.Вставить("ДанныеКарты", "");
	
	ОповещениеОткрытьФормуВводаЧисла(СтруктураОтвета, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ДанныеПоискаПоШтрихкодуСервер(Штрихкод)
	
	Возврат РаботаСоШтрихкодами.ДанныеПоискаПоШтрихкоду(Штрихкод, ЭтотОбъект);
	
КонецФункции

&НаСервере
Процедура ОбработатьДанныеПоКодуСервер(СтруктураРезультат)
	
	Если СтруктураРезультат.НеизвестныеДанныеПО
		И СтруктураРезультат.ЗначенияПоиска.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРезультата = СтруктураРезультат.ЗначенияПоиска[0];
		
	Если СтрокаРезультата.ТипОбъекта = Тип("СправочникСсылка.Номенклатура")
		Или СтрокаРезультата.ТипОбъекта = "Номенклатура" Тогда
		
		ПодготовитьДанныеДляФормыНоменклатура(СтрокаРезультата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента)
	
	Если СтруктураПараметровКлиента.НеизвестныеДанныеПО
		И СтруктураПараметровКлиента.ЗначенияПоиска.Количество() = 0 Тогда
		
		НеизвестныйШтрихкод = Новый Структура();
		НеизвестныйШтрихкод.Вставить("Штрихкод", СтруктураПараметровКлиента.ДанныеПО);
		НеизвестныйШтрихкод.Вставить("Количество", 1);
		
		МассивШтрихкода = Новый Массив();
		МассивШтрихкода.Добавить(НеизвестныйШтрихкод);
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", МассивШтрихкода), ЭтотОбъект,,,,Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытаБлокирующаяФорма = Ложь;
	РаботаСоШтрихкодамиКлиентПереопределяемый.ОбработатьДанныеПоКоду(ЭтотОбъект, СтруктураПараметровКлиента, ОткрытаБлокирующаяФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		Для Каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			ВыполнитьПоискШтрихкода(ЭлементМассива.Штрихкод);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаЧисла(РезультатОткрытияФормы, ДополнительныеПараметры)
	
	ТекКод = "";
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		ЗначениеВыбораЧисло = РезультатОткрытияФормы.ВведенноеЧисло;
		Если ЗначениеЗаполнено(ЗначениеВыбораЧисло) Тогда
			ЧислоВвода = ЗначениеВыбораЧисло;
			ТекКод = Формат(ЗначениеВыбораЧисло, "ЧН=0; ЧГ=0");
			Если ДополнительныеПараметры.Свойство("ПолученМагнитныйКод") Тогда
				СтруктураПараметровКлиента = ДанныеПоискаПоМагнитномуКодуСервер(ТекКод);
			ИначеЕсли ДополнительныеПараметры.Свойство("ПолученШтрихкодИзСШК") Тогда
				СтруктураПараметровКлиента = ПолученШтрихкодИзСШК(ТекКод);
			КонецЕсли;
			ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
			ОбработатьДанныеПоКодуСервер(СтруктураПараметровКлиента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстИнформации = НСтр("ru = 'При подключении оборудования произошла ошибка'");
		ПоказатьПредупреждение(, ТекстИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеДляФормыНоменклатура(СтруктураПараметров)
	
	НайденнаяНоменклатура   = СтруктураПараметров.Владелец;
	НайденнаяХарактеристика = СтруктураПараметров.Характеристика;
	ТипСканируемогоОбъекта = НайденнаяНоменклатура.ТипНоменклатуры;
	
	ОбработатьИзмениеТипСканируемогоОбъекта();
	
	Если СтруктураПараметров.Свойство("Количество") Тогда
		КоличествоУпаковок	= СтруктураПараметров.Количество;
	Иначе
		КоличествоУпаковок  = 1;
	КонецЕсли;
	
	ЕдиницаИзмерения = НайденнаяНоменклатура.ЕдиницаИзмерения;
	Коэффициент = НайденнаяНоменклатура.КоэффициентЕдиницыДляОтчетов;
	
	СтруктураРасчетаЦены = Новый Структура();
	СтруктураРасчетаЦены.Вставить("ВидЦен", РозничныйВидЦены);
	СтруктураРасчетаЦены.Вставить("ДатаОбработки", ТекущаяДатаСеанса());
	СтруктураРасчетаЦены.Вставить("Номенклатура", НайденнаяНоменклатура);
	СтруктураРасчетаЦены.Вставить("Характеристика", НайденнаяХарактеристика);
	СтруктураРасчетаЦены.Вставить("Коэффициент", Коэффициент);
	СтруктураРасчетаЦены.Вставить("ВалютаДокумента", Константы.НациональнаяВалюта.Получить());
	
	АдресКартинки = "";
	Если НЕ НайденнаяНоменклатура.ФайлКартинки.Пустая() Тогда
		Попытка
			АдресКартинки = НавигационнаяСсылкаКартинки(НайденнаяНоменклатура.ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не удалось загрузить изображение номенклатуры'");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
	// Для подарочного сертификата необходимо ввести серию, после этого будет выведен статус сертификата.
	Если НайденнаяНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураРасчетаЦены);
		НаименованиеТовара		= СтрШаблон(НСтр("ru = '%1'"), СокрЛП(НайденнаяНоменклатура));
		ДатаОкончанияДействия	= ?(ЗначениеЗаполнено(НайденнаяНоменклатура.ДатаОкончанияДействия),
									Формат(НайденнаяНоменклатура.ДатаОкончанияДействия, "ДФ = дд.ММ.гггг"),
									"");
		Номинал 				= НайденнаяНоменклатура.Номинал;
		СтатусСертификата		= "Не выбрана серия сертификата";
		Остаток					= "Не выбрана серия сертификата";
		Элементы.ДекорацияСтрокаВыбораСерии.Видимость = Истина;
		Элементы.ЦенаСертификат.Заголовок = Элементы.ЦенаСертификат.Заголовок + СтрШаблон(НСтр("ru = ' (за 1 %1)'"), ЕдиницаИзмерения);
		
	Иначе
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураРасчетаЦены);
		СтруктураОстатка = ПолучитьОстатокИРезерв(НайденнаяНоменклатура ,НайденнаяХарактеристика, Коэффициент);
		Остаток = СтруктураОстатка.Остаток;
		НаименованиеТовара = СтрШаблон(НСтр("ru = '%1 %2'"),
								СокрЛП(НайденнаяНоменклатура),
								?(ЗначениеЗаполнено(НайденнаяХарактеристика)И ХарактеристикиИспользуются,
									" (" + НайденнаяХарактеристика + ")", ""));
			
		Элементы.ЦенаНоменклатура.Заголовок = Элементы.ЦенаСертификат.Заголовок + СтрШаблон(НСтр("ru = ' (за 1 %1)'"), ЕдиницаИзмерения);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьДанныеНаФормуНоменклатура()

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаНаДвоичныеДанныеФайла = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаСервере
Функция ПолучитьОстатокИРезерв(Номенклатура ,Характеристика, Коэффициент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваров.Характеристика КАК Характеристика,
		|	(ОстаткиТоваров.Количество - ОстаткиТоваров.Резерв) / &Коэффициент КАК Остаток
		|ИЗ
		|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
		|ГДЕ
		|	ОстаткиТоваров.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ОстаткиТоваров.Номенклатура = &Номенклатура
		|	И ОстаткиТоваров.Характеристика = &Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.Характеристика,
		|	ОстаткиТоваров.Количество / &Коэффициент,
		|	ОстаткиТоваров.Резерв / &Коэффициент,
		|	(ОстаткиТоваров.Количество - ОстаткиТоваров.Резерв) / &Коэффициент";
	

	Запрос.УстановитьПараметр("Коэффициент", Коэффициент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаОстатка = РезультатЗапроса.Выбрать();
	
	СтруктураОстатка = Новый Структура();
	СтруктураОстатка.Вставить("Остаток",0);
	
	Пока ВыборкаОстатка.Следующий() Цикл
		СтруктураОстатка.Остаток = ВыборкаОстатка.Остаток;
	КонецЦикла;
	
	Возврат СтруктураОстатка;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборСерииСертификата(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияСтрокаВыбораСерии.Видимость = Ложь;
	СформироватьСтатусДляСертификата(РезультатЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтатусДляСертификата(ВыбраннаяСерияСертификата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(ДвиженияСерииНоменклатуры.Период) КАК Период,
	|	ДвиженияСерииНоменклатуры.Организация КАК Организация,
	|	ДвиженияСерииНоменклатуры.Серия КАК Серия,
	|	ДвиженияСерииНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДвиженияСерииНоменклатуры.Характеристика КАК Характеристика,
	|	ДвиженияСерииНоменклатуры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияСерииНоменклатуры.Операция КАК Операция
	|ПОМЕСТИТЬ ВтПоследнийПриходСертификата
	|ИЗ
	|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
	|ГДЕ
	|	ДвиженияСерииНоменклатуры.Номенклатура = &Номенклатура
	|	И ДвиженияСерииНоменклатуры.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Приход)
	|	И ДвиженияСерииНоменклатуры.Серия = &Серия
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСерииНоменклатуры.Организация,
	|	ДвиженияСерииНоменклатуры.Серия,
	|	ДвиженияСерииНоменклатуры.Номенклатура,
	|	ДвиженияСерииНоменклатуры.Характеристика,
	|	ДвиженияСерииНоменклатуры.СтруктурнаяЕдиница,
	|	ДвиженияСерииНоменклатуры.Операция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПоследнийПриходСертификата.Номенклатура КАК Номенклатура,
	|	ВтПоследнийПриходСертификата.Серия КАК Серия
	|ПОМЕСТИТЬ ВтСертификатОтборПоСтруктурнойЕдинице
	|ИЗ
	|	ВтПоследнийПриходСертификата КАК ВтПоследнийПриходСертификата
	|ГДЕ
	|	ВтПоследнийПриходСертификата.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСертификатОтборПоСтруктурнойЕдинице.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВтСертификатОтборПоСтруктурнойЕдинице КАК ВтСертификатОтборПоСтруктурнойЕдинице
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодарочныеСертификатыОбороты.СуммаПриход КАК СуммаПриход,
	|	ПодарочныеСертификатыОбороты.СуммаРасход КАК СуммаРасход,
	|	ЕСТЬNULL(Номенклатура.ДатаОкончанияДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияДействия,
	|	ВЫБОР
	|		КОГДА ПодарочныеСертификатыОбороты.СуммаРасход = 0
	|			ТОГДА ""Реализован""
	|		КОГДА ПодарочныеСертификатыОбороты.СуммаРасход < ПодарочныеСертификатыОбороты.СуммаПриход
	|				И ПодарочныеСертификатыОбороты.СуммаРасход <> 0
	|			ТОГДА ""Частично погашен""
	|		КОГДА ПодарочныеСертификатыОбороты.СуммаРасход = ПодарочныеСертификатыОбороты.СуммаПриход
	|			ТОГДА ""Погашен""
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	РегистрНакопления.ПодарочныеСертификаты.Обороты(
	|			,
	|			&Дата,
	|			,
	|			(ПодарочныйСертификат, НомерСертификата) В
	|				(ВЫБРАТЬ
	|					ВтСертификатОтборПоСтруктурнойЕдинице.Номенклатура КАК Номенклатура,
	|					ВтСертификатОтборПоСтруктурнойЕдинице.Серия КАК Серия
	|				ИЗ
	|					ВтСертификатОтборПоСтруктурнойЕдинице КАК ВтСертификатОтборПоСтруктурнойЕдинице)) КАК ПодарочныеСертификатыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ПодарочныеСертификатыОбороты.ПодарочныйСертификат = Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Номенклатура" , НайденнаяНоменклатура);
	Запрос.УстановитьПараметр("Серия", ВыбраннаяСерияСертификата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	НаименованиеТовара = НаименованиеТовара + СтрШаблон(НСтр("ru = ' (%1)'"), СокрЛП(ВыбраннаяСерияСертификата));
	
	Остаток = "";
	
	Если РезультатыЗапроса[2].Пустой() Тогда
		// Если в выбранной структурной единице отсутствует приход сертификата, тогда необходимо вывести статус "Нет в наличии".
		СтатусСертификата = НСтр("ru = 'Нет в наличии'");
	ИначеЕсли РезультатыЗапроса[3].Пустой() Тогда
		// Если у сертификата нет движений в регистре накопления "ПодарочныеСертификаты",
		// то это означает, что сертификат на складе, но не реализован.
		СтатусСертификата = НСтр("ru = 'Не реализован'");
	Иначе
		ВыборкаСертификата = РезультатыЗапроса[3].Выбрать();
		
		Если ВыборкаСертификата.Следующий() Тогда
			
			СтатусСертификата = ВыборкаСертификата.Статус;
			Номинал = ВыборкаСертификата.СуммаПриход;
			Остаток = ВыборкаСертификата.СуммаПриход - ВыборкаСертификата.СуммаРасход;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмениеТипСканируемогоОбъекта()
	
	Если ТипСканируемогоОбъекта = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		ОчиститьЗначенияРеквизитов();
		Элементы.ГруппаИнформацииНоменклатура.Видимость = Ложь;
		Элементы.ГруппаИнформацииСертификат.Видимость = Истина;
	Иначе
		ОчиститьЗначенияРеквизитов();
		Элементы.ГруппаИнформацииНоменклатура.Видимость = Истина;
		Элементы.ГруппаИнформацииСертификат.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗначенияРеквизитов()
	
	НаименованиеТовара = "";
	Остаток = "";
	Цена = "";
	СтатусСертификата = "";
	Номинал = "";
	ДатаОкончанияДействия = "";
	ВладелецКарты = "";
	
	Элементы.ДекорацияСтрокаВыбораСерии.Видимость = Ложь;
	Элементы.ЦенаСертификат.Заголовок = НСтр("ru = 'Цена'")
КонецПроцедуры

#КонецОбласти