
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если НЕ Параметры.Свойство("ТаблицаДополнительныхПараметров") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;

	ТаблицаДополнительныхПараметров.Загрузить(Параметры.ТаблицаДополнительныхПараметров.Выгрузить());
	ВсегдаФормироватьНовыеСерии  = Параметры.ВсегдаФормироватьНовыеСерии;
	СоздаватьПроизводителя       = Параметры.СоздаватьПроизводителя;
	ФорматДатыСрокаГодности      = Параметры.ФорматДатыСрокаГодности;
	НеФормироватьДопНомерСерии   = Параметры.НеФормироватьДопНомерСерии;
	ЭтотОбъект.ЗагружатьШК                  = Параметры.ЗагружатьШК;
	ЭтотОбъект.СоздаватьСтрануПроисхождения = Параметры.СоздаватьСтрануПроисхождения;
	ЭтотОбъект.ЗагружатьGTINДляСерии        = Параметры.ЗагружатьGTINДляСерии;
	СоздаватьОбщиеХарактеристики = Параметры.СоздаватьОбщиеХарактеристики;
	КудаЗагружаемХарактеристики = ?(СоздаватьОбщиеХарактеристики, 1, 0);
	
	Если Параметры.Свойство("ОтображениеТабличногоДокумента") Тогда
		ОтображениеТабличногоДокумента = Параметры.ОтображениеТабличногоДокумента;
	Иначе 
		ОтображениеТабличногоДокумента = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоЗагрузкаВСправочникНоменклатура") Тогда
		ЭтоЗагрузкаВСправочникНоменклатура = Параметры.ЭтоЗагрузкаВСправочникНоменклатура;
		Если ЭтоЗагрузкаВСправочникНоменклатура И ТаблицаДополнительныхПараметров.Количество() = 0 Тогда
			НоваяТаблица = ТаблицаДополнительныхПараметров.Выгрузить();
			ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДопПараметровСправочникаНастроек(Неопределено, НоваяТаблица);
			ТаблицаДополнительныхПараметров.Загрузить(НоваяТаблица);
		КонецЕсли;
	Иначе
		ЭтоЗагрузкаВСправочникНоменклатура = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТабличныйДокумент") Тогда
		ТабличныйДокумент = Параметры.ТабличныйДокумент;
	КонецЕсли;
	
	Если ЭтоЗагрузкаВСправочникНоменклатура И Параметры.Свойство("ШКЯвляетсяПолемПоискаНоменклатуры") Тогда
		ШКЯвляетсяПолемПоискаНоменклатуры = Параметры.ШКЯвляетсяПолемПоискаНоменклатуры;
		Элементы.ШКЯвляетсяПолемПоискаНоменклатуры.Видимость = Истина;
	Иначе
		Элементы.ШКЯвляетсяПолемПоискаНоменклатуры.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиЗагрузкиХарактеристик.Видимость = Не ЭтоЗагрузкаВСправочникНоменклатура;
	Элементы.ВсегдаФормироватьНовыеСерии.Доступность        = Не ЭтоЗагрузкаВСправочникНоменклатура;
	Элементы.СоздаватьПроизводителя.Доступность             = Не ЭтоЗагрузкаВСправочникНоменклатура;
	Элементы.НеФормироватьДопНомерСерии.Доступность         = Не ЭтоЗагрузкаВСправочникНоменклатура;
	Элементы.ФорматДатыСрокаГодности.Доступность            = Не ЭтоЗагрузкаВСправочникНоменклатура;
	Элементы.СоздаватьСтрануПроисхождения.Доступность       = Не ЭтоЗагрузкаВСправочникНоменклатура;
	Элементы.ЗагружатьGTINДляСерии.Доступность              = Не ЭтоЗагрузкаВСправочникНоменклатура;
	
	СписокВыбора = Элементы.ФорматДатыСрокаГодности.СписокВыбора;
	СписокВыбора.Добавить("дд.мм.гггг","дд.мм.гггг");
	СписокВыбора.Добавить("ддммгггг","ддммгггг");
	СписокВыбора.Добавить("дд.мм.гг","дд.мм.гг");
	СписокВыбора.Добавить("гггг.мм.дд","гггг.мм.дд");
	СписокВыбора.Добавить("ггггммдд","ггггммдд");
	СписокВыбора.Добавить("мм.гггг","мм.гггг");
	СписокВыбора.Добавить("ммгггг","ммгггг");
	СписокВыбора.Добавить("гггг.мм","гггг.мм");
	СписокВыбора.Добавить("ггггмм","ггггмм");
	СписокВыбора.Добавить("мм.гг","мм.гг");
	
	Для Каждого СтрокаТаблицы Из ТаблицаДополнительныхПараметров Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.РежимЗагрузки) Тогда
			СтрокаТаблицы.РежимЗагрузки = "Искать";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьТабличныйДокумент();
	ЗаполнитьМассивКнопок();
	ТаблицаДополнительныхПараметровПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПередНачаломДобавления" таблицы "ТаблицаДополнительныхПараметров"
//
&НаКлиенте
Процедура ТаблицаДополнительныхПараметровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" таблицы "ТаблицаДополнительныхПараметров"
//
&НаКлиенте
Процедура ТаблицаДополнительныхПараметровПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" реквизита "РежимЗагрузки" таблицы "ТаблицаДополнительныхПараметров"
//
&НаКлиенте
Процедура ТаблицаДополнительныхПараметровРежимЗагрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаДополнительныхПараметров.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.РежимЗагрузки = "Искать" Тогда
			ТекДанные.Выражение = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" реквизита "Выражение" таблицы "ТаблицаДополнительныхПараметров"
//
&НаКлиенте
Процедура ТаблицаДополнительныхПараметровВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаДополнительныхПараметров.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.РежимЗагрузки = "Вычислять" Тогда
				
			ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
			ПараметрыФормы = Новый Структура("Выражение", ТекДанные.Выражение);
			ПараметрыФормы.Вставить("ОткрытьДляРедактированияДопРеквизитов");
			
			ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ТаблицаДополнительныхПараметровОткрытьФормуЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" реквизита "НомерКолонки" таблицы "ТаблицаДополнительныхПараметров"
//
&НаКлиенте
Процедура ТаблицаДополнительныхПараметровНомерКолонкиПриИзменении(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаДополнительныхПараметров);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "ПриАктивизацииСтроки"  таблицы "ТаблицаДополнительныхПараметров"
//
&НаКлиенте
Процедура ТаблицаДополнительныхПараметровПриАктивизацииСтроки(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаДополнительныхПараметров);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "ПриАктивизацииОбласти"  табличного документа
//
&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если ЗначениеЗаполнено(НомерКолонки) Тогда
		РасставитьПометкиНаКнопках(НомерКолонки);
	КонецЕсли;
    ПодсветитьВыбраннуюКолонку(Неопределено);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

&НаКлиенте
Процедура КудаЗагружаемХарактеристикиПриИзменении(Элемент)
	СоздаватьОбщиеХарактеристики = КудаЗагружаемХарактеристики = 1;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаДополнительныхПараметров Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.РежимЗагрузки) Тогда
			СтрокаТаблицы.РежимЗагрузки = "Искать";
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныхПараметров = Новый Структура();
	СтруктураДополнительныхПараметров.Вставить("ТаблицаДополнительныхПараметров", ТаблицаДополнительныхПараметров);
	СтруктураДополнительныхПараметров.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры",ШКЯвляетсяПолемПоискаНоменклатуры);
	СтруктураДополнительныхПараметров.Вставить("СоздаватьОбщиеХарактеристики",СоздаватьОбщиеХарактеристики);
	СтруктураДополнительныхПараметров.Вставить("ВсегдаФормироватьНовыеСерии", ВсегдаФормироватьНовыеСерии);
	СтруктураДополнительныхПараметров.Вставить("СоздаватьСтрануПроисхождения", ЭтотОбъект["СоздаватьСтрануПроисхождения"]);
	СтруктураДополнительныхПараметров.Вставить("СоздаватьПроизводителя", СоздаватьПроизводителя);
	СтруктураДополнительныхПараметров.Вставить("ФорматДатыСрокаГодности", ФорматДатыСрокаГодности);
	СтруктураДополнительныхПараметров.Вставить("НеФормироватьДопНомерСерии", НеФормироватьДопНомерСерии);
	СтруктураДополнительныхПараметров.Вставить("ЗагружатьШК", ЭтотОбъект.ЗагружатьШК);
	СтруктураДополнительныхПараметров.Вставить("ЗагружатьGTINДляСерии", ЭтотОбъект["ЗагружатьGTINДляСерии"]);
	Закрыть(СтруктураДополнительныхПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонку(Команда)
	
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.ТаблицаДополнительныхПараметров.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.НомерКолонки = НомерКолонки Тогда
		Возврат;
	ИначеЕсли ТекСтрока.НомерКолонки<>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьКолонкуВопросЗавершение", ЭтотОбъект, Новый Структура("НомерКолонки, ТекСтрока", НомерКолонки, ТекСтрока)), 
		"Для текущего реквизита """+СокрЛП(ТекСтрока.ИмяРеквизита)+""" уже установлен номер колонки "+ТекСтрока.НомерКолонки+". Изменить его на номер "+НомерКолонки+"?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОбработкаНомераКолонки(НомерКолонки, ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыеКнопкиНажатие(Команда)
	
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТек Из ТаблицаДополнительныхПараметров Цикл
		Если Команда.Имя = "ПодключаемаяКнопка_"+СтрЗаменить(СтрокаТек.ИмяРеквизита, " ", "") Тогда
			Если Элементы[Команда.Имя].Пометка Тогда
				СтрокаТек.НомерКолонки = 0;
			Иначе
				СтрокаТек.НомерКолонки = НомерКолонки;
			КонецЕсли;
			РасставитьПометкиНаКнопках(НомерКолонки);
			РазобратьсяСОформлениемСтрок();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, устанавливает видимость табличного документа
//
&НаКлиенте
Процедура УстановитьВидимостьТабличныйДокумент()
	Если НЕ ОтображениеТабличногоДокумента Тогда
		Элементы.ГруппаТабличныйДокумент.Видимость = Истина;
	Иначе
		Элементы.ГруппаТабличныйДокумент.Видимость = Ложь;
	КонецЕсли; 
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура установки условного оформления строк
//
&НаКлиенте
Процедура РазобратьсяСОформлениемСтрок()
	
	Если ТабличныйДокумент.ТекущаяОбласть <> Неопределено Тогда
		НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	КонецЕсли;
	
	Если ЭтотОбъект.ТекущийЭлемент <> Элементы.ТабличныйДокумент
		ИЛИ ТабличныйДокумент.ТекущаяОбласть = Неопределено Тогда
		НомерКолонки = 0;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из ТаблицаДополнительныхПараметров Цикл
		СтрокаТаблицы.ПодсвечиватьСтроку = ?(НомерКолонки = 0, Ложь, НомерКолонки = СтрокаТаблицы.НомерКолонки);
	КонецЦикла;
КонецПроцедуры

// процедура расстановки пометок на кнопках контекстного меню
//
&НаСервере
Процедура РасставитьПометкиНаКнопках(НомерКолонки)
	
	Если ОтображениеТабличногоДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПомеченныхКолонок = Новый Массив;
	СтрокиТЧ = ТаблицаДополнительныхПараметров.НайтиСтроки(Новый Структура("НомерКолонки", НомерКолонки));
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		ИменаПомеченныхКолонок.Добавить("ПодключаемаяКнопка_"+СтрЗаменить(СтрокаТЧ.ИмяРеквизита, " ", ""));
	КонецЦикла;
	
	Для Каждого Кнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		Кнопка.Пометка = ИменаПомеченныхКолонок.Найти(Кнопка.Имя)<>Неопределено;
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения контекстного меню табличного документа
//
&НаСервере
Процедура ЗаполнитьМассивКнопок()
	
	МассивКнопокДляУдаления = Новый Массив;
	Для Каждого СуществующаяКнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		МассивКнопокДляУдаления.Добавить(СуществующаяКнопка);
	КонецЦикла;
	
	Для Каждого Кнопка Из МассивКнопокДляУдаления Цикл
		Попытка
			Команды.Удалить(Кнопка.Имя);
		Исключение
		КонецПопытки;
		Попытка
			Элементы.Удалить(Кнопка);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ИмяДействия = "ПодключаемыеКнопкиНажатие";
	Для Каждого СтрокаТЧ Из ТаблицаДополнительныхПараметров Цикл
		ИмяКнопки = "ПодключаемаяКнопка_"+СтрЗаменить(СтрокаТЧ.ИмяРеквизита, " ", "");
		Команда = Команды.Найти(ИмяКнопки);
		
		Если Команда = Неопределено Тогда
			Команда = Команды.Добавить(ИмяКнопки);
		КонецЕсли;
		
		Кнопка = Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"), Элементы.ТабличныйДокументКонтекстноеМеню);
		Команда.Действие = ИмяДействия;
		Кнопка.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), СтрокаТЧ.ИмяРеквизита);
		Кнопка.ИмяКоманды = ИмяКнопки;
	КонецЦикла;

КонецПроцедуры

// Процедура выделения цветом нужной колонки табличного документа
//
&НаКлиенте
Процедура ПодсветитьВыбраннуюКолонку(ТекТаблицаФормы)
	
	Если НЕ Элементы.ГруппаТабличныйДокумент.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ТипЛинииРамки 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1, 0);

	ЦветРамки = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаКнопки");
	
	ТекОбласть 				= ТабличныйДокумент.Область(1,1,ТабличныйДокумент.ВысотаТаблицы,ТабличныйДокумент.ШиринаТаблицы);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаПоля");

	Если ТекТаблицаФормы = Неопределено Тогда
		// спозиционировались на колонке
		НомерКолонкиПодсветки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Иначе
		ТекСтрока 		= ТекТаблицаФормы.ТекущиеДанные;
		Если ТекСтрока = Неопределено ИЛИ ТекСтрока.НомерКолонки = 0 Тогда
			Возврат;
		КонецЕсли;
		НомерКолонкиПодсветки = ТекСтрока.НомерКолонки;
	КонецЕсли;
	
	ТекОбласть = ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, ТабличныйДокумент.ВысотаТаблицы, НомерКолонкиПодсветки);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаШапкиОтчета");
	
	Если ТекТаблицаФормы<>Неопределено Тогда
		ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, 1, НомерКолонкиПодсветки);
	КонецЕсли;
	ТабличныйДокумент.ОтображатьСетку = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонкуВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбработканомераКолонки(ДополнительныеПараметры.НомерКолонки, ДополнительныеПараметры.ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДополнительныхПараметровОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНомераКолонки(НомерКолонки, ТекСтрока)
	
	ТекСтрока.НомерКолонки = НомерКолонки;
	
	РасставитьПометкиНаКнопках(НомерКолонки);

КонецПроцедуры

#КонецОбласти
