
#Область ОписаниеПеременных

&НаКлиенте
Перем СтараяСтраница; // Страница которая была открыта до перехода на другую страницу.

&НаКлиенте
Перем СписокСтраниц; // Список страниц которые используются в информационном киоске.

&НаКлиенте
Перем стекПереходов; // История переходов по страницам.

&НаКлиенте
Перем резНажатияНавигации; // Структура которая содержит параметры перехода на другую страницу.

&НаКлиенте
Перем ОбработатьСобытиеПодключаемогоОборудования; // Содержит код HTML который выводится на страницу.

&НаКлиенте
Перем Корзина; // Корзина покупателя.

&НаКлиенте
Перем КэшированныеЗначения; //Переменная необходимая для вызова процедур обработки.

&НаКлиенте
Перем ОпцииКиоскаСтрокаСкрипта; // Опции которые включают отображение элементов киоска.

&НаКлиенте
Перем мЭтаФормаЗаголовок; // Переменная которая хранит заголовок окна для того чтобы компонента могла его закрыть.

&НаКлиенте
Перем ТаймАутВозврата; // Таймаут по которому будет происходить возврат киоска в начальное состояние.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если ЭтоМобильныйКлиент Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Мобильный клиент не поддерживается.'"));
		Возврат;
	КонецЕсли;
	
	ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
	Если ЭтоВебКлиент Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Веб-клиент не поддерживается.'"));
		Возврат;
	КонецЕсли;
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ИспользоватьМинимальныеЦены", ЦенообразованиеСерверПовтИсп.МинимальныеЦеныИспользуются());
	КэшЗначений.Вставить("РезервированиеЗапасов", ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));
	КэшЗначений.Вставить("НаборСвойств_Документ_ЗаказПокупателя",
		УправлениеСвойствами.НаборСвойствПоИмени("Документ_ЗаказПокупателя"));
	
	МассивТиповНоменклатуры = Новый Массив;
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Запас);
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.ПодарочныйСертификат);
	КэшЗначений.Вставить("ДоступныеТипыНоменклатуры", МассивТиповНоменклатуры);
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Объект.Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ПолучитьПервуюПредопределеннуюИлиДоступнуюОрганизацию();
	КонецЕсли;
	
	Объект.СтруктурнаяЕдиницаРезерв = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад");
	Объект.НалогообложениеНДС = НалогиУНФ.НалогообложениеНДС(Объект.Организация, Объект.СтруктурнаяЕдиницаРезерв, ТекущаяДатаСеанса());
	
	Объект.СтруктурнаяЕдиницаПродажи = ПерсональныеНастройкиРУНФ.Прочитать("ОсновноеПодразделение");
	Объект.СтруктурнаяЕдиницаПродажи = ?(ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродажи),
		Объект.СтруктурнаяЕдиницаПродажи,
		Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	ОбщегоНазначенияРМКУНФ.ОпределитьТекущийТорговыйОбъект(Объект.ТорговыйОбъект);
	
	ЗаполнитьРозничныйВидЦены();
	
	ТекстОшибки = "";
	ПроверитьОбщуюВозможностьРаботы(Отказ, ТекстОшибки);
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	КонтрагентПоУмолчанию = Константы.ор_ИнфоКиоскКонтрагентПоУмолчанию.Получить();
	Если НЕ ЗначениеЗаполнено(КонтрагентПоУмолчанию) Тогда
		Выборка = Справочники.Контрагенты.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.ЭтоГруппа И Выборка.Покупатель Тогда
				КонтрагентПоУмолчанию = Выборка.Ссылка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Объект.Контрагент = КонтрагентПоУмолчанию;
	
	Объект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	
	КонтролироватьОстаткиТоваров = Константы.КонтролироватьОстаткиПриПроведении.Получить();
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	ИспользоватьАвтоматическиеСкидки     = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		ОбщегоНазначенияРМККлиентПереопределяемый.ЗаполнитьРабочееМесто(ЭтотОбъект);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		ТекстОшибки = НСтр("ru = 'Не смогли определить рабочее место.
			|Обратитесь к администратору системы.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	РеквизитыФормыДляДобавленияСтроки = СтруктураРеквизитовФормыДляДобавленияСтроки();
	
	Активизировать();
	
	ЗагрузитьHTMLСтраницу();
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода,СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
	СобратьФункциональныеОпцииКиоска();
	
	ТаймАутВозврата = ПолучитьТаймАутВозврата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Или ЗакрытьБезПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватьПодключаемоеОборудование Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// С появлением webkit когда поле доступно на редактирование и в нем моргает курсор,
	// то ВводДоступен у формы будет возращать ложь.
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Или ПолеHTMLВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			ВыполнитьПоискШтрихкода(Штрихкод);
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			Штрихкод = МенеджерОборудованияКлиентСервер.Base64ВШтрихкод(Штрихкод);
			ВыполнитьПоискШтрихкода(Штрихкод);
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			ВыполнитьПоискМагнитнойКарты(Параметр[0]);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеПараметровКиоска" Тогда
		Если Параметр.ТорговыйОбъект <> Объект.ТорговыйОбъект Тогда
			Объект.ТорговыйОбъект = Параметр.ТорговыйОбъект;
			Объект.ВидЦен = Параметр.ВидЦены;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "НастройкаКиоска" Тогда
		
		ОпцииКиоскаСтрокаСкрипта = Параметр;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИнфоКиоскДокументСформирован(Элемент)
	
	АдресНовый = Элементы.ИнфоКиоск.Документ.url;
	Для Каждого АдресСписка Из СписокСтраниц Цикл
		Если Найти(АдресНовый, АдресСписка.Значение) <> 0 Тогда
			ТекСтраница = АдресСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекСтраница = "data-transfer.html" Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекСтраница <> "about:blank" Тогда
		ЭтотОбъект.ПодключитьОбработчикОжидания("ВернутьИнфоКиоскВПервоначальноеСостояниеПоВремениОжидания", ТаймАутВозврата, Истина); 
		элемНавигацииНазад  = Элементы.ИнфоКиоск.Документ.getElementById("prev nav");
		элемНавигацииВперед = Элементы.ИнфоКиоск.Документ.getElementById("next nav");
		
		ЭлементВыполнения = Элементы.ИнфоКиоск.Документ.getElementById("execution");
		ЭлементВыполнения.setAttribute("paramBasketCount", ПолучитьКоличествоТовараВКорзине());
		
		ЭлементВыполнения2 = Элементы.ИнфоКиоск.Документ.getElementById("basket-count");
		ЭлементВыполнения2.innerHTML = СтрШаблон("(%1)", ПолучитьКоличествоТовараВКорзине());
		
		// Отображаемые элементы информационного киоска.
		ЭлементВыполнения.setAttribute("paramOptions", ОпцииКиоскаСтрокаСкрипта);
		
		резНавигацииИдОбработки = резНажатияНавигации.ИдентификаторОбработки;
		
		// Переход по истории.
		Если (резНавигацииИдОбработки = "prev nav" ИЛИ резНавигацииИдОбработки = "next nav") Тогда
			
			лСтраницаИстории = Неопределено;
			Для Каждого СтраницаИстории Из СтекПереходов Цикл
				Если СтраницаИстории.Пометка Тогда
					лСтраницаИстории = СтраницаИстории;
				КонецЕсли;
			КонецЦикла;
			
			Если лСтраницаИстории <> Неопределено Тогда
				ИндексСтраницы = стекПереходов.Индекс(лСтраницаИстории);
				колвоЭлементов = стекПереходов.Количество()-1;
				лСтраницаПерехода = Неопределено;
				Если резНажатияНавигации.ЭтоКнопкаПереходаНазад Тогда
					ИндексПерехода = ИндексСтраницы - 1;
					ИндексПереходаНазад = ИндексСтраницы - 2;
					Если ЗначениеЗаполнено(СтараяСтраница) И СтараяСтраница = "error.html" Тогда
						элемНавигацииВперед.href = "#";
						элемНавигацииВперед.setAttribute("paramKod", "");
						ИндексПереходаНазад = ИндексПереходаНазад + 1; // Значит побывали на странице описания ошибки.
					ИначеЕсли ИндексПерехода >= 0 Тогда
						лСтраницаПерехода = стекПереходов.Получить(ИндексПерехода);
						
						элемНавигацииВперед.href = лСтраницаИстории.Значение.АдресПерехода;
						элемНавигацииВперед.setAttribute("paramKod", лСтраницаИстории.Значение.КодСкрипта);
					КонецЕсли;
					
					Если ИндексПереходаНазад >= 0 Тогда
						лСтраницаПереходаНазад  = стекПереходов.Получить(ИндексПереходаНазад);
						элемНавигацииНазад.href = лСтраницаПереходаНазад.Значение.АдресПерехода;
						элемНавигацииНазад.setAttribute("paramKod", лСтраницаПереходаНазад.Значение.КодСкрипта);
					Иначе
						элемНавигацииНазад.href = "#";
						элемНавигацииНазад.setAttribute("paramKod", "");
					КонецЕсли;
					
				Иначе
					ИндексПерехода = ИндексСтраницы + 1;
					ИндексПереходаВперед = ИндексСтраницы + 2;
					
					Если ИндексПерехода <= колвоЭлементов Тогда
						лСтраницаПерехода = стекПереходов.Получить(ИндексПерехода);
						
						элемНавигацииНазад.href = лСтраницаИстории.Значение.АдресПерехода;
						элемНавигацииНазад.setAttribute("paramKod", лСтраницаИстории.Значение.КодСкрипта);
					КонецЕсли;
					
					Если ИндексПереходаВперед <= колвоЭлементов Тогда
						лСтраницаПереходаВперед = стекПереходов.Получить(ИндексПереходаВперед);
						
						элемНавигацииВперед.href = лСтраницаПереходаВперед.Значение.АдресПерехода;
						элемНавигацииВперед.setAttribute("paramKod", лСтраницаПереходаВперед.Значение.КодСкрипта);
					Иначе
						элемНавигацииВперед.href = "#";
						элемНавигацииВперед.setAttribute("paramKod", "");
					КонецЕсли;
					
				КонецЕсли;
				
				Если лСтраницаПерехода <> Неопределено Тогда 
					стекПереходов.ЗаполнитьПометки(Ложь);
					лСтраницаПерехода.Пометка = Истина;
					
					ЭлементВыполнения.setAttribute("paramKod", лСтраницаПерехода.Значение.КодСкрипта);
					
					резНажатияНавигации.Вставить("ЭтоПроходДляИстории");
				Иначе
					резНажатияНавигации.Вставить("ЭтоПУСТОЙПроходДляИстории");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Загрузка страниц.
		Если ТекСтраница = "catalog.html" Тогда
			
			Если резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			ИначеЕсли резНажатияНавигации.Свойство("ЭтоПроходДляИстории") Тогда
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
			ИначеЕсли резНажатияНавигации.ИдентификаторОбработки = "CatalogItem" Тогда
				
				СтрокаСкрипта = ПолучитьСтраницуКаталога(резНажатияНавигации.ИД);
				
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
			Иначе
				
				СтрокаСкрипта = ПолучитьСтраницуКаталога();
				
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтраница = "catalog-detail.html" Тогда
			
			Если НЕ ПустаяСтрока(ОбработатьСобытиеПодключаемогоОборудования) Тогда
				
				СтрокаСкрипта = ОбработатьСобытиеПодключаемогоОборудования;
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				ОбработатьСобытиеПодключаемогоОборудования = "";
				
			ИначеЕсли резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			ИначеЕсли резНажатияНавигации.Свойство("ЭтоПроходДляИстории") Тогда
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
			ИначеЕсли резНажатияНавигации.ИдентификаторОбработки = "CatalogItem" Тогда
				
				СтрокаСкрипта = ПолучитьСтраницуТовара(резНажатияНавигации.ИД);
				
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ЭлементВыполнения.setAttribute("paramID", резНажатияНавигации.ИД);
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтраница = "action.html" Тогда
			
			Если резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			Иначе
				СтрокаСкрипта = ПолучитьСтраницуАкций();
				ЭлементВыполнения.setAttribute("paramID", "");
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтраница = "about.html" Тогда
			
			Если резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			Иначе
				
				СтрокаСкрипта = ПолучитьСтраницуОМагазине();
				
				ЭлементВыполнения.setAttribute("paramID", "");
				
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтраница = "basket.html" Тогда
			
			Если резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			Иначе
				СтрокаСкрипта = ПолучитьОбъектКорзиныНаJS();
				ЭлементВыполнения.setAttribute("paramID", "");
				
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтраница = "cardinfo.html" Тогда
			
			Если НЕ ПустаяСтрока(ОбработатьСобытиеПодключаемогоОборудования) Тогда
				
				СтрокаСкрипта = ОбработатьСобытиеПодключаемогоОборудования;
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
				ОбработатьСобытиеПодключаемогоОборудования = "";
				
			ИначеЕсли резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			Иначе
				
				СтрокаСкрипта = ПолучитьСтраницуИнформацияПоДисконту(Объект.ДисконтнаяКарта);
				ЭлементВыполнения.setAttribute("paramID", "");
				
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтраница = "search-code.html" Тогда
			
			Если НЕ ПустаяСтрока(ОбработатьСобытиеПодключаемогоОборудования) Тогда
				
				СтрокаСкрипта = ОбработатьСобытиеПодключаемогоОборудования;
				ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
				ВыполнитьСобытиеOnclick(ЭлементВыполнения);
				
				ОбработатьСобытиеПодключаемогоОборудования = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если (ТекСтраница = "main.html"
				ИЛИ ТекСтраница = "data-transfer.html"
				ИЛИ ТекСтраница = "error.html"
				ИЛИ ТекСтраница = "search.html" ИЛИ ТекСтраница = "terminal-not-work.html")
			И Не резНажатияНавигации.Свойство("ЭтоПУСТОЙПроходДляИстории") Тогда
			ВыполнитьСобытиеOnclick(ЭлементВыполнения);
		КонецЕсли;
		
		// Запоминание истории.
		Если (резНавигацииИдОбработки = ""
			ИЛИ (резНавигацииИдОбработки <> "prev nav" И резНавигацииИдОбработки <> "next nav")) Тогда
			// Если осуществляется переход на одну и ту же страницу то историю не запоминаем.
			Если ТекСтраница <> "about:blank"
				И СтараяСтраница <> Неопределено И ТекСтраница = СтараяСтраница
				// Если идут переходы по дереву каталога то их не надо стирать, а надо запоминать.
				И резНажатияНавигации.ИдентификаторОбработки <> "CatalogItem" Тогда
				
				Для Каждого историяПерехода Из стекПереходов Цикл
					Если историяПерехода.Пометка Тогда
						
						ИндексСтраницы = стекПереходов.Индекс(историяПерехода);
						колвоЭлементов = стекПереходов.Количество()-1;
						лСтраницаПерехода = Неопределено;
						ИндексПереходаНазад = ИндексСтраницы - 1;
						
						Если ИндексПереходаНазад >= 0 Тогда
							лСтраницаПереходаНазад  = стекПереходов.Получить(ИндексПереходаНазад);
							элемНавигацииНазад.href = лСтраницаПереходаНазад.Значение.АдресПерехода;
							элемНавигацииНазад.setAttribute("paramKod", лСтраницаПереходаНазад.Значение.КодСкрипта);
						Иначе
							элемНавигацииНазад.href = "#";
							элемНавигацииНазад.setAttribute("paramKod", "");
						КонецЕсли;
						
						элемНавигацииВперед.href = "#";
						элемНавигацииВперед.setAttribute("paramKod", "");
						
						РаботаСоСтеком("отсечьДоКонца");
						
					КонецЕсли;
				КонецЦикла;
			// Если осуществляется переход на другой URL то его запомним.
			ИначеЕсли ТекСтраница <> "about:blank" И СтараяСтраница <> Неопределено Тогда
				
				Для Каждого историяПерехода Из стекПереходов Цикл
					Если историяПерехода.Пометка Тогда
						ПереходДляКнопкиНазад = историяПерехода.Значение.АдресПерехода;
						
						элемНавигацииНазад.href = ПереходДляКнопкиНазад;
						
						КодСкрипта = историяПерехода.Значение.КодСкрипта;
						элемНавигацииНазад.setAttribute("paramKod", КодСкрипта);
						
						элемНавигацииВперед.href = "#";
						элемНавигацииВперед.setAttribute("paramKod", "");
					КонецЕсли;
				КонецЦикла;
				Если ТекСтраница <> "error.html" Тогда
					КомандаСтека = "добавить";
					АдресПерехода = АдресНовый;
					СтраницаПерехода = ТекСтраница;
					КодСкрипта = ЭлементВыполнения.getAttribute("paramKod");
					
					РаботаСоСтеком(КомандаСтека, АдресПерехода, СтраницаПерехода, КодСкрипта);
				КонецЕсли;
				
			// Первый запуск.
			ИначеЕсли ТекСтраница <> "about:blank" И СтараяСтраница = Неопределено Тогда
				
				КомандаСтека     = "добавить";
				АдресПерехода    = АдресНовый;
				СтраницаПерехода = ТекСтраница;
				КодСкрипта = ЭлементВыполнения.getAttribute("paramKod");
				
				РаботаСоСтеком(КомандаСтека, АдресПерехода, СтраницаПерехода, КодСкрипта);
				
			КонецЕсли;
		КонецЕсли;
		
		// Очистим вспомогательные свойства.
		резНажатияНавигации.ИдентификаторОбработки = "";
		Если резНажатияНавигации.Свойство("ЭтоПроходДляИстории") Тогда
			резНажатияНавигации.Удалить("ЭтоПУСТОЙПроходДляИстории");
		ИначеЕсли резНажатияНавигации.Свойство("ЭтоПроходДляИстории") Тогда
			резНажатияНавигации.Удалить("ЭтоПроходДляИстории");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфоКиоскПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ЭтотОбъект.ПодключитьОбработчикОжидания("ВернутьИнфоКиоскВПервоначальноеСостояниеПоВремениОжидания", ТаймАутВозврата, Истина);
	
	// Определим адрес текущей страницы.
	ПолучитьСтаруюСтраницу();
	
	// Соберём корзину в 1С по переданному коду.
	Если СтараяСтраница = "basket.html" Тогда
		ЭлементВыполнения = Элементы.ИнфоКиоск.Документ.getElementById("execution");
		Код1С = ЭлементВыполнения.getAttribute("paramKod");
		Если СтрНайти(Код1С, "&quot;") > 0 Тогда
			Код1С = СтрЗаменить(Код1С, "&quot;", """""");
		КонецЕсли;
		// Получение объектов 1С из HTML.
		Выполнить(Код1С);
		
		ПересчитатьИтогоКорзины();
		РассчитатьСкидкиКорзины();
	КонецЕсли;
	
	ЭлементКонтейнера = ДанныеСобытия.Element;
	
	резНажатияНавигации = ПолучитьКлавишиНавигации(ЭлементКонтейнера);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьСобытиеOnclick(ЭлементВыполнения)
	
	// Ошибка платформы 8.3.27.1508: прямой вызов onclick элемента DOM вызывает ошибку "Метод объекта не обнаружен (onclick)".
	Попытка
		ЭлементВыполнения.onclick();
	Исключение
		Выполнить("ЭлементВыполнения.parent."+ ЭлементВыполнения.getAttribute("onclick"));
	КонецПопытки;
	
КонецПроцедуры

#Область ОбработчикиСобытийПодключаемогоОборудования

&НаКлиенте
Процедура ЗаменитьСимволGS1(Штрихкод)
	
	СимволGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
	Разделитель = МенеджерОборудованияМаркировкаКлиентСервер.ЭкранированныйСимволGS1();
	
	Штрихкод = СтрЗаменить(Штрихкод, СимволGS1, Разделитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискШтрихкода(Штрихкод)
	
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменитьСимволGS1(Штрихкод);
	
	ПараметрыДляОбработкиШтрихкода = Новый Структура();
	ПараметрыДляОбработкиШтрихкода.Вставить("Штрихкод", Штрихкод);
	
	ОповещениеПоискаПоШтрихкоду(Штрихкод, ПараметрыДляОбработкиШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры)
	
	ФильтрПоискаПоШтрихкоду = Новый Структура;
	ФильтрПоискаПоШтрихкоду.Вставить("Номенклатура");
	ФильтрПоискаПоШтрихкоду.Вставить("Пользователи");
	ФильтрПоискаПоШтрихкоду.Вставить("ФизическиеЛица");
	ФильтрПоискаПоШтрихкоду.Вставить("ИнформационныеКарты");
	
	СтруктураПараметровКлиента = ДанныеПоискаПоШтрихкодуСервер(Штрихкод, ДополнительныеПараметры);
	ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента, ПараметрыДляОбработкиШтрихкода)
	
	Если СтруктураПараметровКлиента.ЗначенияПоиска.Количество() > 0 Тогда
		
		СтрокаРезультата = СтруктураПараметровКлиента.ЗначенияПоиска[0];
		Если ЕстьСвойство(ПараметрыДляОбработкиШтрихкода, "ВыйтиИзКиоска")
			И ПараметрыДляОбработкиШтрихкода.ВыйтиИзКиоска Тогда
			
			ЗакрытьБезПроверки = Истина;
			ЗавершитьРаботуСистемы();
			Возврат;
			
		ИначеЕсли ЕстьСвойство(ПараметрыДляОбработкиШтрихкода, "ПоказатьДисконт") Тогда
			Если ФОКиоска.ИнформацияПоКарте Тогда
				
				ПолучитьСтаруюСтраницу();
				
				Если СтараяСтраница <> "basket.html" Тогда
					ОсуществитьПереходНаСтраницу("cardinfo.html");
					ОбработатьСобытиеПодключаемогоОборудования = ПараметрыДляОбработкиШтрихкода.ПоказатьДисконт;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ЕстьСвойство(ПараметрыДляОбработкиШтрихкода, "ПоказатьТовары") Тогда
			
			ПолучитьСтаруюСтраницу();
			ОсуществитьПереходНаСтраницу("catalog-detail.html");
			СтрокаСкрипта = ПараметрыДляОбработкиШтрихкода.ПоказатьТовары;
			ОбработатьСобытиеПодключаемогоОборудования = СтрокаСкрипта;
			
		Иначе
			
			ПолучитьСтаруюСтраницу();
			ОсуществитьПереходНаСтраницу("search-code.html");
			
			ОбработатьСобытиеПодключаемогоОборудования = СтрШаблон(
				НСтр("ru = 'Данные по коду не найдены: %1'"),
				СтрокаРезультата.ДанныеПО);
			
		КонецЕсли;
		
	Иначе
		
		ПолучитьСтаруюСтраницу();
		ОсуществитьПереходНаСтраницу("search-code.html");
		
		ОбработатьСобытиеПодключаемогоОборудования = СтрШаблон(
			НСтр("ru = 'Данные по коду не найдены: %1'"),
			СтруктураПараметровКлиента.ДанныеПО);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоШтрихкоду(СтрокаРезультата, ПараметрыДляОбработкиШтрихкода)
	
	Если СтрокаРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыДляОбработкиШтрихкода = Неопределено Тогда
		ПараметрыДляОбработкиШтрихкода = Новый Структура();
		ПараметрыДляОбработкиШтрихкода.Вставить("Штрихкод", СтрокаРезультата.ДанныеПО);
	КонецЕсли;
	
	ВладелецШтрихкода = СтрокаРезультата.Владелец;
	
	НайденныйКассир = Неопределено;
	ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденногоКассира(ВладелецШтрихкода, ЭтотОбъект, НайденныйКассир);
	Если НЕ НайденныйКассир = Неопределено Тогда
		
		РазрешитьЗакрыватьИнфоКиоск = ПерсональныеНастройкиРУНФ.Прочитать(
			"ор_РазрешитьЗакрыватьИнформационныйКиоск",,
			НайденныйКассир.ПользовательБД,
			Ложь);
		Если РазрешитьЗакрыватьИнфоКиоск Тогда
			ПараметрыДляОбработкиШтрихкода.Вставить("ВыйтиИзКиоска", РазрешитьЗакрыватьИнфоКиоск);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	НайденнаяКартаЛояльности = Неопределено;
	ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденнойКартыЛояльности(ВладелецШтрихкода,
		НайденнаяКартаЛояльности);
	Если НЕ НайденнаяКартаЛояльности = Неопределено Тогда
		
		Объект.ДисконтнаяКарта = НайденнаяКартаЛояльности.КартаЛояльности;
		ВладелецДисконтнойКарты = Объект.ДисконтнаяКарта.ВладелецКарты;
		Если ВладелецДисконтнойКарты.Пустая() Тогда
			Объект.Контрагент = КонтрагентПоУмолчанию;
		Иначе
			Объект.Контрагент = ВладелецДисконтнойКарты;
		КонецЕсли;
		
		СтрокаСкрипта = ПолучитьСтраницуИнформацияПоДисконту(Объект.ДисконтнаяКарта);
		ПараметрыДляОбработкиШтрихкода.Вставить("ПоказатьДисконт", СтрокаСкрипта);
		Возврат;
		
	КонецЕсли;
	
	НайденнаяНоменклатура = Неопределено;
	ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденнойНоменклатуры(
		СтрокаРезультата, РеквизитыФормыДляДобавленияСтроки, ПараметрыДляОбработкиШтрихкода, НайденнаяНоменклатура);
	Если НЕ НайденнаяНоменклатура = Неопределено Тогда
		
		СписокНоменклатуры = Новый СписокЗначений;
		СписокНоменклатуры.Добавить(НайденнаяНоменклатура.Номенклатура);
		
		Если ФОКиоска.КаталогИзПрайсЛиста
			И НЕ ЭтаНоменклатураВходитВСписокПрайсЛиста(Строка(СписокНоменклатуры[0].Значение.УникальныйИдентификатор())) Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаСкрипта = ПолучитьСтраницуТовара(Строка(СписокНоменклатуры[0].Значение.УникальныйИдентификатор()), Истина);
		
		ПараметрыДляОбработкиШтрихкода.Вставить("ПоказатьТовары", СтрокаСкрипта);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеПоискаПоШтрихкодуСервер(Штрихкод, ПараметрыДляОбработкиШтрихкода)
	
	ДанныеШтрихкода = Новый Структура;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, ЭтотОбъект, ДанныеШтрихкода);
	
	Если ДанныеШтрихкода <> Неопределено
		И ДанныеШтрихкода.ЗначенияПоиска.Количество() > 0 Тогда
		СтрокаРезультата = ДанныеШтрихкода.ЗначенияПоиска[0];
		ЗаполнитьДанныеПоШтрихкоду(СтрокаРезультата, ПараметрыДляОбработкиШтрихкода);
	КонецЕсли;
	
	Возврат ДанныеШтрихкода;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоискМагнитнойКарты(МагнитныйКод)
	
	// Ветка поиска по штрихкоду дополнительно ищет и по магнитному коду,
	// поэтому дергаем ее.
	ФильтрПоискаПоШтрихкоду = Новый Структура;
	ФильтрПоискаПоШтрихкоду.Вставить("Пользователи");
	ФильтрПоискаПоШтрихкоду.Вставить("ФизическиеЛица");
	ФильтрПоискаПоШтрихкоду.Вставить("ИнформационныеКарты");
	
	ПараметрыДляОбработкиШтрихкода = Новый Структура();
	ПараметрыДляОбработкиШтрихкода.Вставить("Штрихкод", МагнитныйКод);
	
	СтруктураПараметровКлиента = ДанныеПоискаПоШтрихкодуСервер(МагнитныйКод, ПараметрыДляОбработкиШтрихкода);
	ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента, ПараметрыДляОбработкиШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураРеквизитовФормыДляДобавленияСтроки()
	
	ИменаРеквизитовОбъектаФормыРМК = ОбщегоНазначенияРМККлиент.ИменаРеквизитовОбъектаФормыРМКДляДобавленияСтроки();
	СтруктураРеквизитовОбъектаФормыРМК = Новый Структура(ИменаРеквизитовОбъектаФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовОбъектаФормыРМК, Объект);
	
	ИменаРеквизитовФормыРМК = ОбщегоНазначенияРМККлиент.ИменаРеквизитовФормыРМКДляДобавленияСтроки();
	СтруктураРеквизитовФормыРМК = Новый Структура(ИменаРеквизитовФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормыРМК, ЭтотОбъект);
	СтруктураРеквизитовФормыРМК.Вставить("Объект", СтруктураРеквизитовОбъектаФормыРМК);
	
	СтруктураРеквизитовФормыРМК.ОсновнаяОрганизация  = Объект.Организация;
	СтруктураРеквизитовФормыРМК.ВыбраннаяОрганизация = Объект.Организация;
	СтруктураРеквизитовФормыРМК.ОтображатьОстаток    = Ложь;
	СтруктураРеквизитовФормыРМК.РозничныйВидЦены     = Объект.ВидЦен;
	СтруктураРеквизитовФормыРМК.ИспользоватьКонтрольПродаж = Ложь;
	СтруктураРеквизитовФормыРМК.ИспользоватьВыборСкладаПриПродаже = Ложь;
	СтруктураРеквизитовФормыРМК.РежимКассыСамообслуживания        = Ложь;
	
	СтруктураРеквизитовФормыРМК.КэшРаспределенияПродаж = Новый Структура;
	СтруктураРеквизитовФормыРМК.КэшРаспределенияПродаж.Вставить("ГруппыКатегории", 0);
	СтруктураРеквизитовФормыРМК.КэшРаспределенияПродаж.Вставить("РаспределениеНоменклатуры", Новый Соответствие);
	СтруктураРеквизитовФормыРМК.КэшРаспределенияПродаж.Вставить("СистемаНалогообложения", Новый Соответствие);
	
	КассыККМИОрганизации = ПодключенныеКассыККМИОрганизации();
	МассивОрганизаций = КассыККМИОрганизации.МассивОрганизаций;
	
	СтруктураРеквизитовФормыРМК.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	СтруктураРеквизитовФормыРМК.Вставить("ПризнакЗапрета", Истина);
	
	Возврат СтруктураРеквизитовФормыРМК;
	
КонецФункции

&НаКлиенте
Функция ПодключенныеКассыККМИОрганизации()
	
	МассивКассККМ = Новый Массив;
	МассивОрганизаций = Новый Массив;
	
	Для Каждого СтрокаКасс Из ТаблицаКассККМОрганизаций Цикл
		
		МассивКассККМ.Добавить(СтрокаКасс.КассаККМ);
		МассивОрганизаций.Добавить(СтрокаКасс.Организация);
		
	КонецЦикла;
	
	СтруктураКассККМИОрганизаций = Новый Структура();
	СтруктураКассККМИОрганизаций.Вставить("МассивКассККМ", МассивКассККМ);
	СтруктураКассККМИОрганизаций.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	Возврат СтруктураКассККМИОрганизаций;
	
КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьСвойство(Объект, ИмяРеквизита)
	Возврат ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Объект, ИмяРеквизита);
КонецФункции

&НаКлиенте
Процедура ЗагрузитьHTMLСтраницу()
	
	ТемпКаталог = КаталогВременныхФайлов();
	
	ПутьКФайлуАрхива = ПолучитьИмяВременногоФайла("zip");
	
	// Записываем архив информационного киоска на диск.
	ДвоичныеДанные = ПолучитьМакетНаСервере();
	
	ДвоичныеДанные.Записать(ПутьКФайлуАрхива);
	
	// Извлекаем из архива файлы информационного киоска в каталог временных файлов.
	АрхивКиоска = Новый ЧтениеZipФайла(ПутьКФайлуАрхива);
	АрхивКиоска.ИзвлечьВсе(ТемпКаталог);
	
	// Получим директорию сайта.
	Путь = АрхивКиоска.Элементы[0].Путь;
	НомерСимвола = Найти(Путь, "/");
	
	Если НомерСимвола = 0 Тогда
		ПапкаКиоска = Путь;
	Иначе
		ПапкаКиоска = Сред(Путь, 1, НомерСимвола);
		ПапкаКиоска = СтрЗаменить(ПапкаКиоска, "/", "\");
	КонецЕсли;

	// Запомним путь к киоску.
	ПутьККиоску = ТемпКаталог + ПапкаКиоска;
	СборщикМусора(ПутьКФайлуАрхива, Истина);
	
	ПутьКВременнымФайламКиоска = ПутьККиоску + "temp\";
	
	ИнфоКиоск = ПутьККиоску + "main.html";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СборщикМусора(Путь, ОдинФайл)
	
	Попытка
		Если ОдинФайл Тогда
			УдалитьФайлы(Путь);
		Иначе
			УдалитьФайлы(Путь, "*.*");
		КонецЕсли;
	Исключение
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Записываем архив информационного киоска на диск.
	Возврат ОбработкаОбъект.ПолучитьМакет("ШаблонИнфоКиоска");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиЧислоКФорматуJS(Знач Число1С)
	
	Возврат СтрЗаменить(Формат(Число1С, "ЧГ=0; ЧН="), ",", ".");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиБулевоКФорматуJS(Знач Булево1С)
	
	Возврат Формат(Булево1С, "БЛ=false; БИ=true");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуТекстаДляJS(СтрокаТекста)
	
	ФорматированнаяСтрока  = Строка(СтрокаТекста);
	ФорматированнаяСтрока = СтрЗаменить(ФорматированнаяСтрока, "'", "");
	ФорматированнаяСтрока = СокрЛП(ФорматированнаяСтрока);
	ФорматированнаяСтрока = СтрЗаменить(ФорматированнаяСтрока, Символы.ПС, "\" + Символы.ПС);
	
	Возврат ФорматированнаяСтрока
	
КонецФункции

&НаКлиенте
Процедура ОсуществитьПереходНаСтраницу(СтраницаПерехода)
	
	Если Найти(ИнфоКиоск, СтраницаПерехода+"#") Тогда
		ИнфоКиоск = ПутьККиоску + СтраницаПерехода;
	Иначе
		ИнфоКиоск = ПутьККиоску + СтраницаПерехода+"#";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СократитьСтрокуДоНужногоКоличестваСимволов(СтрокаТекста, КоличествоСимволов)
	
	ФорматированнаяСтрока = Строка(СтрокаТекста);
	
	ФорматированнаяСтрока = Сред(ФорматированнаяСтрока, 1, КоличествоСимволов);
	
	Возврат ФорматированнаяСтрока;
	
КонецФункции

// Проверяет вхождение полученного ИД товара в Прайс-лист информационного киоска
//
&НаСервере
Функция ЭтаНоменклатураВходитВСписокПрайсЛиста(ТоварИД)
	
	Товар = ПолучитьСсылкуНаСправочник("Номенклатура", ТоварИД);
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрайсЛист.Ссылка
	|ИЗ
	|	Справочник.ор_ПрайсЛистИнформационногоКиоска КАК ПрайсЛист
	|ГДЕ
	|	ПрайсЛист.Номенклатура = &Ссылка
	|	И НЕ ПрайсЛист.ПометкаУдаления
	|	И НЕ ПрайсЛист.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Ссылка", Товар);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ПроверитьОбщуюВозможностьРаботы(Отказ, ТекстСообщения)
	
	ВалютаЗаполненаПравильно = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ПроверитьВозможностьРаботыСВалютой(ВалютаЗаполненаПравильно, ЭтотОбъект);
	Если Не ВалютаЗаполненаПравильно Тогда
		ТекстСообщения = НСтр("ru = 'В настройках программы и в данных торгового объекта указаны разные валюты.
			|Обратитесь к администратору системы.'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	СформироватьЗапросДанныеКассыККМ(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ПодключенныеККМПроверка = РезультатЗапроса.Выгрузить();
	ПодключенныеККМПроверка.Колонки.Добавить("Количество");
	ПодключенныеККМПроверка.ЗаполнитьЗначения(1, "Количество");
	ПодключенныеККМПроверкаККТ = ПодключенныеККМПроверка.Скопировать();
	
	ПодключенныеККМПроверка.Свернуть("Организация", "Количество");
	Для Каждого СтрокаОрганизации Из ПодключенныеККМПроверка Цикл
		Если СтрокаОрганизации.Количество > 1 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'На организацию: %1 подключено несколько касс ККМ. Допустима одна.
				|Обратитесь к администратору системы.'"), СтрокаОрганизации.Организация);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПодключенныеККМПроверкаККТ.Свернуть("ПодключаемоеОборудование", "Количество");
	Для Каждого СтрокаОборудования Из ПодключенныеККМПроверкаККТ Цикл
		Если СтрокаОборудования.Количество > 1 И ЗначениеЗаполнено(СтрокаОборудования.ПодключаемоеОборудование) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Подключаемое оборудование: %1 установлено к нескольким кассам ККМ.
				|Обратитесь к администратору системы.'"), СтрокаОборудования.ПодключаемоеОборудование);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда
		
		ТаблицаКассККМОрганизаций.Очистить();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаКассККМ = ТаблицаКассККМОрганизаций.Добавить();
			СтрокаКассККМ.КассаККМ                 = Выборка.КассаККМ;
			СтрокаКассККМ.ПодключаемоеОборудование = Выборка.ПодключаемоеОборудование;
			СтрокаКассККМ.Организация              = Выборка.Организация;
			
		КонецЦикла;
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ТорговыйОбъект) Тогда
		ТекстСообщения = НСтр("ru = 'Для запуска информационного киоска необходимо выбрать магазин.'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗапросДанныеКассыККМ(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСкладов
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы В (&МассивТиповСтруктурныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КассыККМ.Ссылка КАК КассаККМ,
	|	КассыККМ.СтруктурнаяЕдиница КАК ТорговыйОбъект,
	|	КассыККМ.Владелец КАК Организация,
	|	КассыККМ.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	КассыККМ.ИспользоватьБезПодключенияОборудования КАК ИспользоватьБезПодключенияОборудования
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК СпрПодключаемоеОборудование
	|		ПО КассыККМ.ПодключаемоеОборудование = СпрПодключаемоеОборудование.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСкладов КАК ТаблицаСкладов
	|		ПО КассыККМ.СтруктурнаяЕдиница = ТаблицаСкладов.Склад
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И СпрПодключаемоеОборудование.РабочееМесто = &РабочееМесто
	|	И КассыККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ФискальныйРегистратор)
	|	И СпрПодключаемоеОборудование.УстройствоИспользуется";
	
	МассивТиповСтруктурныхЕдиниц = Новый Массив;
	МассивТиповСтруктурныхЕдиниц.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	МассивТиповСтруктурныхЕдиниц.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	
	Если Не ЗначениеЗаполнено(Объект.ТорговыйОбъект) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект", "");
	Иначе
		Запрос.УстановитьПараметр("ТорговыйОбъект", Объект.ТорговыйОбъект);
	КонецЕсли;
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("МассивТиповСтруктурныхЕдиниц", МассивТиповСтруктурныхЕдиниц);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРозничныйВидЦены()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.РозничныйВидЦен КАК РозничныйВидЦен,
	|	ВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВидыЦен.ВалютаЦены КАК ВалютаЦены
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО СтруктурныеЕдиницы.РозничныйВидЦен = ВидыЦен.Ссылка
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект";
	
	Запрос.УстановитьПараметр("ТорговыйОбъект", Объект.ТорговыйОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ВидЦен = Выборка.РозничныйВидЦен;
		Объект.СуммаВключаетНДС = Выборка.ЦенаВключаетНДС;
		Объект.ВалютаДокумента = Выборка.ВалютаЦены;
	Иначе
		Если ЗначениеЗаполнено(Объект.ТорговыйОбъект) Тогда
			ВидЦеныПоУмолчанию = Справочники.ВидыЦен.Оптовая;
			Объект.ВидЦен = ВидЦеныПоУмолчанию;
			Объект.СуммаВключаетНДС = ВидЦеныПоУмолчанию.ЦенаВключаетНДС;
			Объект.ВалютаДокумента = ВидЦеныПоУмолчанию.ВалютаЦены;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПервуюПредопределеннуюИлиДоступнуюОрганизацию()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации");
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", "ОсновнаяОрганизация");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

#Область ПечатьЗаказаНаЛентуФискальногоРегистратора

// Процедура - выполняет вывод заказа на ленту принтера чеков или фискального регистратора в не фискальном режиме
//
&НаКлиенте
Процедура НапечататьЗаказ()
	
	Если Не ИспользоватьПодключаемоеОборудование
		Или Не МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() 
		Или ТаблицаКассККМОрганизаций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказНапечатан = Ложь;
	Для Каждого СтрокаКассККМОрганизаций Из ТаблицаКассККМОрганизаций Цикл
		
		Если ЗаказНапечатан Тогда
			Прервать;
		КонецЕсли;
		
		СтруктураПараметровПечати = СтруктураПараметровПечати(СтрокаКассККМОрганизаций.КассаККМ);
		
		ИдентификаторУстройстваФР = СтруктураПараметровПечати.ПодключаемоеОборудование;
		
		Если ИдентификаторУстройстваФР <> Неопределено Тогда
			
			ТекстЧекаЗаказа = ТекстПечатиЗаказаНаФР(СтруктураПараметровПечати.ШиринаЛенты);
			Если ПустаяСтрока(ТекстЧекаЗаказа) Тогда
				Возврат;
			КонецЕсли;
			
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("НапечататьЗаказа_Завершение",ЭтотОбъект);
			ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(ТекстЧекаЗаказа);
			ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(
				ОповещениеПриЗавершении,
				УникальныйИдентификатор,
				ИдентификаторУстройстваФР,
				ПараметрыОперации);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЗаказа_Завершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ЗаказНапечатан = Ложь;
		ТекстСообщения = НСтр("ru = 'При печати заказа возникла ошибка.
			|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		ЗаказНапечатан = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтруктураПараметровПечати(КассаККМ)
	
	ВыходнаяСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ, "Ссылка, ПодключаемоеОборудование");
	
	ВыходнаяСтруктура.Вставить("ШиринаЛенты", 32);
	
	Возврат ВыходнаяСтруктура;
	
КонецФункции

&НаСервере
Функция ТекстПечатиЗаказаНаФР(ШиринаЛенты)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &СсылкаНаЗаказ
	|	И Документ.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Номенклатура.Артикул КАК Артикул,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Цена КАК Цена,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &СсылкаНаЗаказ
	|	И ТаблицаТовары.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки");
	
	Запрос.УстановитьПараметр("СсылкаНаЗаказ", ЗаказПокупателя);
	Запрос.УстановитьПараметр("ТекстИП", НСтр("ru = 'ИП '"));
	Запрос.УстановитьПараметр("ТекстТочкаПробел", НСтр("ru = '. '"));
	Запрос.УстановитьПараметр("ТекстТочка", НСтр("ru = '.'"));
	Запрос.УстановитьПараметр("ТекстПробел", НСтр("ru = ' '"));
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДокументЗаказККМ  = Новый ТекстовыйДокумент();
	
	// Получение макета
	МакетЗаказаККМ = Обработки.ор_ИнформационныйКиоск.ПолучитьМакет("ЗаказПокупателя");
	
	ОбластьШапкаЧека  = МакетЗаказаККМ.ПолучитьОбласть("ШапкаЧека"      + ШиринаЛенты);
	ОбластьТелоЧека   = МакетЗаказаККМ.ПолучитьОбласть("ТелоЧека"       + ШиринаЛенты);
	ОбластьСкидка     = МакетЗаказаККМ.ПолучитьОбласть("ТелоЧекаСкидка" + ШиринаЛенты);
	ОбластьПодвалЧека = МакетЗаказаККМ.ПолучитьОбласть("ПодвалЧека"     + ШиринаЛенты);
	ОбластьРазрывЧека = МакетЗаказаККМ.ПолучитьОбласть("РазрывЧека"     + ШиринаЛенты);
	
	ВыборкаШапка       = Результаты[0].Выбрать();
	ВыборкаПоСтрокамТЧ = Результаты[1].Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		
		ОбластьШапкаЧека.Параметры.Организация = Строка(ВыборкаШапка.Организация);
		ОбластьШапкаЧека.Параметры.Магазин     = Строка(Объект.ТорговыйОбъект);
		ОбластьШапкаЧека.Параметры.НомерЗаказа = ВыборкаШапка.Номер;
		ОбластьШапкаЧека.Параметры.Дата        = Строка(ВыборкаШапка.Дата);
		
		ДокументЗаказККМ.Вывести(ОбластьШапкаЧека);
		
		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамТЧ.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыНоменклатуры = Новый Структура;
			ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", ВыборкаПоСтрокамТЧ.Номенклатура);
			ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", ВыборкаПоСтрокамТЧ.Характеристика);
			ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", ВыборкаПоСтрокамТЧ.Артикул);
			
			ОбластьТелоЧека.Параметры.НаименованиеТовара = ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры);
			ОбластьТелоЧека.Параметры.КоличествоЦена     = СтрШаблон("%1 х %2",
			Формат(ВыборкаПоСтрокамТЧ.Количество, "ЧЦ=17; ЧДЦ=3; ЧРД=.; ЧН=; ЧГ=0"),
				Формат(ВыборкаПоСтрокамТЧ.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0"));
			ОбластьТелоЧека.Параметры.СуммаПоСтроке     = "="
				+ Формат(ВыборкаПоСтрокамТЧ.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
			
			КонечнаяСкидка = ВыборкаПоСтрокамТЧ.Количество *  ВыборкаПоСтрокамТЧ.Цена -  ВыборкаПоСтрокамТЧ.Сумма;
			
			ДокументЗаказККМ.Вывести(ОбластьТелоЧека);
			
			Если КонечнаяСкидка <> 0 Тогда
				ЗагСкидка = ?(КонечнаяСкидка > 0, НСтр("ru = 'СКИДКА='"), НСтр("ru = 'НАДБАВКА='"));
				ОбластьСкидка.Параметры.Скидка = ЗагСкидка + Формат(?(КонечнаяСкидка > 0, КонечнаяСкидка, -КонечнаяСкидка), "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
				ДокументЗаказККМ.Вывести(ОбластьСкидка);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьПодвалЧека.Параметры.Итог = НСтр("ru = 'ИТОГ='") + Формат(ВыборкаШапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
		
		ДокументЗаказККМ.Вывести(ОбластьПодвалЧека);
		
	КонецЕсли;
	
	СтрокаВозврат = "";
	
	КоличествоСтрок = ДокументЗаказККМ.КоличествоСтрок();
	
	Для Индекс = 1 По КоличествоСтрок Цикл
		СтрокаВозврат = СтрокаВозврат + ДокументЗаказККМ.ПолучитьСтроку(Индекс); 
		
		Если НЕ Индекс = КоличествоСтрок Тогда
			СтрокаВозврат = СтрокаВозврат + Символы.ПС; 
		КонецЕсли;
	КонецЦикла;
	
	ДокументЗаказККМ.Вывести(ОбластьРазрывЧека);
	
	Возврат СтрокаВозврат
	
КонецФункции

#КонецОбласти

#Область РаботаСВременемБездействияКиоска

&НаСервереБезКонтекста
Функция ПолучитьТаймАутВозврата()
	
	Время = Константы.ор_ИнфоКиоскВремяБездействия.Получить();
	
	Возврат ?(Время = 0, 300, Время);
	
КонецФункции

&НаКлиенте
Процедура ВернутьИнфоКиоскВПервоначальноеСостояниеПоВремениОжидания()
	
	// Может поменяли тайм-аут.
	ТаймАутВозврата = ПолучитьТаймАутВозврата();
	
	// Очистка корзины
	Корзина.Очистить();
	
	Объект.Контрагент = КонтрагентПоУмолчанию;
	Объект.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
	
	// Переход на главную.
	ОсуществитьПереходНаСтраницу("main.html");
	
	// Очистка истории.
	РаботаСоСтеком("очистить");
	
	// Отключение обработчика ожидания
	ЭтотОбъект.ОтключитьОбработчикОжидания("ВернутьИнфоКиоскВПервоначальноеСостояниеПоВремениОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаOptionsКиоска

&НаКлиенте
Процедура СобратьФункциональныеОпцииКиоска()
	
	ФОКиоска = Новый Структура();
	ЗаполнитьФункциональныеОпции(ФОКиоска);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(СтрШаблон("Options.Actions = %1;", ПривестиБулевоКФорматуJS(ФОКиоска.Акции)));
	МассивСтрок.Добавить(СтрШаблон("Options.QuantityShops = %1;", ПривестиБулевоКФорматуJS(ФОКиоска.ОстаткиПоМагазинам)));
	МассивСтрок.Добавить(СтрШаблон("Options.CardInfo = %1;", ПривестиБулевоКФорматуJS(ФОКиоска.ИнформацияПоКарте)));
	МассивСтрок.Добавить(СтрШаблон("Options.Basket = %1;", ПривестиБулевоКФорматуJS(ФОКиоска.Корзина)));
	МассивСтрок.Добавить(СтрШаблон("Options.AboutShop = %1;", ПривестиБулевоКФорматуJS(ФОКиоска.ОМагазине)));
	
	ОпцииКиоскаСтрокаСкрипта = СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьФункциональныеОпции(СтруктураДанных)
	
	СтруктураДанных.Вставить("Акции"              , Константы.ор_ИнфоКиоскПоказыватьАкции.Получить());
	СтруктураДанных.Вставить("ОстаткиПоМагазинам" , Константы.ор_ИнфоКиоскПоказыватьОстаткиВДругихМагазинах.Получить());
	СтруктураДанных.Вставить("ИнформацияПоКарте"  , Константы.ор_ИнфоКиоскПоказыватьИнформациюПоКарте.Получить());
	СтруктураДанных.Вставить("Корзина"            , Константы.ор_ИнфоКиоскПоказыватьКорзину.Получить());
	СтруктураДанных.Вставить("ОМагазине"          , Константы.ор_ИнфоКиоскПоказыватьИнформациюОМагазине.Получить());
	СтруктураДанных.Вставить("КаталогИзПрайсЛиста", Константы.ор_ИнфоКиоскВКаталогеОтображатьПрайсЛист.Получить());
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКорзиной

&НаКлиенте
Процедура ПересчитатьИтогоКорзины()
	
	ИтогоПоЗаказу = 0;
	Для Каждого ТоварКорзины Из Корзина Цикл
		ИтогоПоЗаказу = ИтогоПоЗаказу + ТоварКорзины.Сумма;
	КонецЦикла;
	
	Для Каждого ТоварКорзины Из Корзина Цикл
		ТоварКорзины.ИтогоПоЗаказу = ИтогоПоЗаказу;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоТовараВКорзине()
	
	КоличествоТовара = 0;
	
	Для Каждого Товар Из Корзина Цикл
		КоличествоТовара = КоличествоТовара + Товар.Количество;
	КонецЦикла;
	
	Возврат КоличествоТовара;
	
КонецФункции

&НаСервере
Процедура ПоместитьКорзинуВТабличнуюЧастьТовары(КорзинаТоваров)
	
	Объект.Запасы.Очистить();
	Объект.СкидкиНаценки.Очистить();
	
	Для Каждого ТоварКорзины Из КорзинаТоваров Цикл
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура       = ПолучитьСсылкуНаСправочник("Номенклатура",   ТоварКорзины.ИДНоменклатуры);
		НоваяСтрока.Характеристика     = ПолучитьСсылкуНаСправочник("Характеристика", ТоварКорзины.ИДХарактеристики);
		НоваяСтрока.Количество         = ТоварКорзины.Количество;
		НоваяСтрока.Цена               = ТоварКорзины.Цена;
		НоваяСтрока.ПродажаПодарка     = ТоварКорзины.Свойство("ПродажаПодарка") И ТоварКорзины.ПродажаПодарка;
		
		ЗапасыНоменклатураПриИзменении(НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьТабличнуюЧастьТоварыВКорзину()
	
	Объект.Запасы.Сортировать("Номенклатура");
	
	Корзина = Новый Массив;
	
	Для Каждого ТоварВКорзину Из Объект.Запасы Цикл
		
		идНоменклатуры   = Строка(ТоварВКорзину.Номенклатура.УникальныйИдентификатор());
		идХарактеристики = Строка(ТоварВКорзину.Характеристика.УникальныйИдентификатор());
		
		Если ТоварВКорзину.Характеристика.Пустая() Тогда
			НаименованиеТовара = Строка(ТоварВКорзину.Номенклатура);
		Иначе
			НаименованиеТовара = СтрШаблон("%1 (%2)", Строка(ТоварВКорзину.Номенклатура), Строка(ТоварВКорзину.Характеристика));
		КонецЕсли;
		
		ТоварКорзины = Новый Структура();
		ТоварКорзины.Вставить("ИДНоменклатуры"  , идНоменклатуры);
		ТоварКорзины.Вставить("ИДХарактеристики", идХарактеристики);
		ТоварКорзины.Вставить("Наименование"    , НаименованиеТовара);
		ТоварКорзины.Вставить("Цена"            , ТоварВКорзину.Цена);
		ТоварКорзины.Вставить("Количество"      , ТоварВКорзину.Количество);
		ТоварКорзины.Вставить("СкидкаЗначение"  , ТоварВКорзину.ПроцентАвтоматическойСкидки);
		ТоварКорзины.Вставить("Сумма"           , ТоварВКорзину.Сумма);
		ТоварКорзины.Вставить("ПродажаПодарка"  , ТоварВКорзину.ПродажаПодарка);
		ТоварКорзины.Вставить("ИтогоПоЗаказу"   , Объект.СуммаДокумента);
		
		Корзина.Добавить(ТоварКорзины);
		
	КонецЦикла;
	
	// Очистим для последующих подсчетов.
	Объект.Запасы.Очистить();
	Объект.СкидкиНаценки.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПомещенияТовараВКорзину(ИДНоменклатуры, ИДХарактеристики)
	
	ДанныеТовара = Новый Структура;
	
	СсылкаНоменклатура   = ПолучитьСсылкуНаСправочник("Номенклатура", ИДНоменклатуры);
	СсылкаХарактеристика = ПолучитьСсылкуНаСправочник("Характеристика", ИДХарактеристики);
	Если СсылкаХарактеристика.Пустая() Тогда
		НаименованиеТовара = Строка(СсылкаНоменклатура);
	Иначе
		НаименованиеТовара = СтрШаблон("%1 (%2)", Строка(СсылкаНоменклатура), Строка(СсылкаХарактеристика));
	КонецЕсли;
	
	ДанныеТовара.Вставить("Наименование", НаименованиеТовара);
	ДанныеТовара.Вставить("Цена", ПолучитьЦенуТовара(СсылкаНоменклатура, СсылкаХарактеристика));
	
	Возврат ДанныеТовара;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуТовара(СсылкаНоменклатура, СсылкаХарактеристика)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ВидЦен"          , Объект.ВидЦен);
	СтруктураДанные.Вставить("ДатаОбработки"   , ТекущаяДатаСеанса());
	СтруктураДанные.Вставить("Номенклатура"    , СсылкаНоменклатура);
	СтруктураДанные.Вставить("Характеристика"  , СсылкаХарактеристика);
	СтруктураДанные.Вставить("Коэффициент"     , 1);
	СтруктураДанные.Вставить("ВалютаДокумента" , Объект.ВалютаДокумента);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	
	Возврат ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаСправочник(ПолучитьОбъект, ид)
	
	ИмяСправочника = "";
	Если ПолучитьОбъект = "Характеристика" Тогда
		ИмяСправочника = "ХарактеристикиНоменклатуры";
	ИначеЕсли ПолучитьОбъект = "Номенклатура" Тогда
		ИмяСправочника = "Номенклатура";
	ИначеЕсли ПолучитьОбъект = "ПрайсЛист" Тогда
		ИмяСправочника = "ор_ПрайсЛистИнформационногоКиоска";
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСправочника) Тогда
		Ссылка = Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(ид) Тогда
		Ссылка = Справочники[ИмяСправочника].ПустаяСсылка();
	Иначе
		Ссылка = Справочники[ИмяСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(ид));
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

&НаСервере
Процедура ЗапасыНоменклатураПриИзменении(СтрокаТабличнойЧасти)
	
	СтруктураДанные = СтруктураДанныхДляНомеклатуры();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	Если СтруктураДанные.ЭтоНабор И НЕ СтруктураДанные.ИспользоватьХарактеристики Тогда
		
		// Наборы
		НаборыКлиентСервер.ЗаменитьСтрокуДаннымиНабора(Объект, "Запасы", СтрокаТабличнойЧасти, СтруктураДанные);
		
		// АвтоматическиеСкидки.
		СброситьФлагСкидкиРассчитаныСервер("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
		// Конец АвтоматическиеСкидки
		
	Иначе
		
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
		СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		
		Если СтруктураДанные.ИспользоватьХарактеристики Тогда
			СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
		
		Если СтруктураДанные.ЭтоЗапас Тогда
			СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = Объект.СтруктурнаяЕдиницаРезерв;
		КонецЕсли;
		
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	// Наборы
	Если НЕ СтруктураДанные.Свойство("ЕдиницаИзмерения") И ТипЗнч(СтруктураДанные.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	КонецЕсли; 
	Если НЕ СтруктураДанные.Свойство("Коэффициент") Тогда
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			СтруктураДанные.Вставить("Коэффициент", СтруктураДанные.ЕдиницаИзмерения.Коэффициент);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли; 
	КонецЕсли;
	// Конец Наборы
	
	СтруктураДанные.Вставить("ЭтоУслуга", СтруктураДанные.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	СтруктураДанные.Вставить("ЭтоЗапас", (СтруктураДанные.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас")
									ИЛИ СтруктураДанные.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат")));
	
	СтруктураДанные.Вставить("Склад", СтруктураДанные.Номенклатура.Склад);
	СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Номенклатура.Ячейка);
	
	Если СтруктураДанные.Свойство("НормаВремени") Тогда
		СтруктураДанные.НормаВремени = ЦенообразованиеСервер.ПолучитьНормуВремениРаботы(СтруктураДанные);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.ВидСтавкиНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", Справочники.СтавкиНДС.СтавкаНДС(СтруктураДанные.Номенклатура.ВидСтавкиНДС, ?(ЗначениеЗаполнено(СтруктураДанные.ДатаОбработки), СтруктураДанные.ДатаОбработки, ТекущаяДатаСеанса())));
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", Справочники.СтавкиНДС.СтавкаНДС(СтруктураДанные.Организация.ВидСтавкиНДСПоУмолчанию, ?(ЗначениеЗаполнено(СтруктураДанные.ДатаОбработки), СтруктураДанные.ДатаОбработки, ТекущаяДатаСеанса())));
	КонецЕсли;
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура)
		И СтруктураДанные.Номенклатура.ИспользоватьХарактеристики Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(
				ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика,
				ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики",Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", СтруктураДанные.Номенклатура.ПроверятьЗаполнениеХарактеристики);
	КонецЕсли; 
	// Конец Характеристики
	
	Если СтруктураДанные.Свойство("Цена") И ЗначениеЗаполнено(СтруктураДанные.Цена) Тогда
		// При подборе наборов расчет цены не требуется - используется цена, указанная в подборе
	ИначеЕсли СтруктураДанные.Свойство("ВидЦен") Тогда
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		КонецЕсли;
		
		Если СтруктураДанные.Свойство("ВидРабот") Тогда
		
			Если СтруктураДанные.Номенклатура.ФиксированнаяСтоимость Тогда
				
				Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
				СтруктураДанные.Вставить("Цена", Цена);
			
			Иначе
			
				СтруктураДанные.Номенклатура = СтруктураДанные.ВидРабот;
				СтруктураДанные.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
				СтруктураДанные.Вставить("Цена", Цена);
				
			КонецЕсли;
			
		Иначе
			
			Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
			СтруктураДанные.Вставить("Цена", Цена);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	СтруктураДанные.Вставить("МинимальнаяЦена", ЦенообразованиеСервер.ПолучитьМинимальнуюЦенуНоменклатуры(СтруктураДанные));
	
	Если СтруктураДанные.Свойство("ВидСкидкиНаценки") 
		И ЗначениеЗаполнено(СтруктураДанные.ВидСкидкиНаценки) Тогда
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки.Процент);
	Иначе
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", 0);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ПроцентСкидкиПоДисконтнойКарте") 
		И ЗначениеЗаполнено(СтруктураДанные.ДисконтнаяКарта) Тогда
		ТекПроцент = СтруктураДанные.ПроцентСкидкиНаценки;
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", ТекПроцент + СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
	КонецЕсли;
	СтруктураДанные.Вставить("ВесЕдиницыТовара", СтруктураДанные.Номенклатура.Вес);
	СтруктураДанные.Вставить("ОбъемЕдиницыТовара", СтруктураДанные.Номенклатура.Объем);
	
	// Наборы
	НаборыСервер.ДобавитьИнформациюОНабореПриПолученииДанныхНоменклатуры(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция СтруктураДанныхДляНомеклатуры()
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаРезерв);
	СтруктураДанные.Вставить("ЭтоНовыйОбъект", Истина);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	СтруктураДанные.Вставить("Коэффициент", 1);
	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	// Конец ДисконтныеКарты
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ПараметрыРасчета = Неопределено)
	
	Если ПараметрыРасчета = Неопределено Тогда
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны", Истина);
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПараметрыРасчета.Вставить("ИспользоватьМинимальныеЦены", КэшЗначений.ИспользоватьМинимальныеЦены);
	
	ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	// АвтоматическиеСкидки.
	СброситьФлагСкидкиРассчитаныСервер("РассчитатьСуммуВСтрокеТабличнойЧасти");
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры

// Функция сбрасывает флаг "СкидкиРассчитаны", если это необходимо, и возвращает Истина, если требуется пересчёт скидок.
//
&НаСервере
Функция СброситьФлагСкидкиРассчитаныСервер(Действие, КолонкаТЧ = "")
	
	ТребуетсяПересчет = Ложь;
	Если ИспользоватьАвтоматическиеСкидки И Объект.Запасы.Количество() > 0 И Объект.СкидкиРассчитаны Тогда
		ТребуетсяПересчет = СброситьФлагСкидкиРассчитаны(Действие, КолонкаТЧ);
	КонецЕсли;
	Если ТребуетсяПересчет Тогда
		ВывестиСообщения = Ложь;
		ВыдатьПодаркиНаВыбор = Ложь;
	КонецЕсли;
	Возврат ТребуетсяПересчет;
	
КонецФункции

// Функция сбрасывает флаг СкидкиРассчитаны, если это необходимо, и возвращает Истина, если требуется пересчёт скидок.
//
&НаСервере
Функция СброситьФлагСкидкиРассчитаны(Действие, КолонкаТЧ = "")
	
	Возврат СкидкиНаценкиСервер.СброситьФлагСкидкиРассчитаны(ЭтотОбъект, Действие, КолонкаТЧ);
	
КонецФункции

#КонецОбласти

#Область РасчетСкидок

&НаКлиенте
Процедура РассчитатьСкидкиКорзины()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту"          , Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет", Ложь);
	СтруктураПараметры.Вставить("РабочееМесто"               , РабочееМесто);
	СтруктураПараметры.Вставить("Корзина"                    , Корзина);
	
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	
	ИзвлечьТабличнуюЧастьТоварыВКорзину();
	
КонецПроцедуры

// Процедура - обработчик команды "РассчитатьСкидкиНаценки".
//
&НаСервере
Процедура РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры)
	
	Объект.Дата = ТекущаяДатаСеанса();
	
	ПоместитьКорзинуВТабличнуюЧастьТовары(СтруктураПараметры.Корзина);
	
	ЗаполнитьБонуснуюПрограмму(Объект, СтруктураПараметры);
	
	РасчетныеСкидки = ВыполнитьРасчетСкидокНаСервере(Объект, СтруктураПараметры);
	РезультатПрименения = ПрименитьРассчитанныеСкидкиКОбъекту(Объект, РасчетныеСкидки);
	
	Объект.СкидкиРассчитаны = РезультатПрименения.Успех;
	АдресСкидокВоВременномХранилище = "";
	Если РезультатПрименения.Успех Тогда
		АдресСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(
			РезультатПрименения.ПримененныеСкидкиНаценки,
			УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьБонуснуюПрограмму(Знач Объект, СтруктураПараметры)
	
	Если Не ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РеквизитыБП = РаботаСБонусами.РеквизитыБонуснойПрограммы(Объект.ДисконтнаяКарта);
	
	Если РеквизитыБП.БонуснаяПрограмма.Пустая() Тогда
		Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если РеквизитыБП.НеНачислятьПриОплатеБонусами Тогда
		Если РаботаСБонусами.ЕстьОплатаБонусами(Объект.Предоплата) Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметры.Вставить("БонуснаяПрограмма", РеквизитыБП.БонуснаяПрограмма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьРасчетСкидокНаСервере(ОбъектДляРасчета, СтруктураПараметры)
	
	СкидкиНаценкиСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(ОбъектДляРасчета, "Запасы");
	
	РассчитанныеСкидкиПоВсемВариантам = Новый Структура;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("НомерВариантаКП", 0);
	ОтборСтрок.Вставить("ЭтоРазделитель", Ложь);
	СтруктураПараметры.Вставить("ОтборСтрок", ОтборСтрок);
	
	РассчитанныеСкидки = СкидкиНаценкиСерверПереопределяемый.ВыполнитьРасчетСкидокНаСервере(ОбъектДляРасчета, СтруктураПараметры);
	
	ТаблицаСообщений         = СкидкиНаценкиСервер.ПустаяТаблицаСообщений();
	ТаблицаПодарков          = СкидкиНаценкиСервер.ПустаяТаблицаПодарков();
	ТаблицаБонусыКНачислению = СкидкиНаценкиСервер.ПустаяТаблицаБонусов();
	
	РассчитанныеСкидкиПоВсемВариантам.Вставить("ДеревоСкидок", РассчитанныеСкидки.ДеревоСкидок);
	РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаСкидкиНаценки", РассчитанныеСкидки.ТаблицаСкидкиНаценки);
	РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаСообщений", ТаблицаСообщений);
	РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаПодарков", ТаблицаПодарков);
	РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаБонусыКНачислению", ТаблицаБонусыКНачислению);
	
	Если РассчитанныеСкидки.Свойство("ТаблицаСообщений", ТаблицаСообщений) Тогда
		РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаСообщений", ТаблицаСообщений);
	КонецЕсли;
	Если РассчитанныеСкидки.Свойство("ТаблицаПодарков", ТаблицаПодарков) Тогда
		РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаПодарков", ТаблицаПодарков);
	КонецЕсли;
	Если РассчитанныеСкидки.Свойство("ТаблицаБонусыКНачислению", ТаблицаБонусыКНачислению) Тогда
		РассчитанныеСкидкиПоВсемВариантам.Вставить("ТаблицаБонусыКНачислению", ТаблицаБонусыКНачислению);
	КонецЕсли;
	
	Возврат РассчитанныеСкидкиПоВсемВариантам
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрименитьРассчитанныеСкидкиКОбъекту(Объект, РасчетныеСкидки)
	
	Результат = СкидкиНаценкиСервер.ПрименитьРассчитанныеСкидкиКОбъекту(Объект, РасчетныеСкидки);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСИсторией

&НаКлиенте
Процедура ПолучитьСтаруюСтраницу()
	
	// Определим адрес текущей страницы.
	Адрес = Элементы.ИнфоКиоск.Документ.url;
	Для Каждого АдресСписка Из СписокСтраниц Цикл
		Если Найти(Адрес, АдресСписка.Значение) <> 0 Тогда
			СтараяСтраница = АдресСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСтеком(КомандаСтека, АдресПерехода = "", СтраницаПерехода = "", КодСкрипта = "")
	
	Если КомандаСтека = "очистить" Тогда
		
		стекПереходов.Очистить();
		СтараяСтраница = Неопределено;
		
	ИначеЕсли КомандаСтека = "добавить" Тогда
		
		индексОтсечения = 0;
		Для Каждого страницаИстории Из стекПереходов Цикл
			Если страницаИстории.Пометка Тогда
				индексОтсечения = стекПереходов.Индекс(страницаИстории);
			КонецЕсли;
		КонецЦикла;
		
		колвоЭлем = стекПереходов.Количество()-1;
		Пока колвоЭлем > индексОтсечения Цикл
			удаляемыйЭлем = стекПереходов.Получить(колвоЭлем);
			стекПереходов.Удалить(удаляемыйЭлем);
			колвоЭлем = колвоЭлем - 1;
		КонецЦикла;
		
		СтруктураПереходов = Новый Структура;
		СтруктураПереходов.Вставить("АдресПерехода",    АдресПерехода);
		СтруктураПереходов.Вставить("СтраницаПерехода", СтраницаПерехода);
		СтруктураПереходов.Вставить("КодСкрипта",       КодСкрипта);
		
		стекПереходов.ЗаполнитьПометки(Ложь);
		
		стекПереходов.Добавить(СтруктураПереходов,,Истина);
		
	ИначеЕсли КомандаСтека = "отсечьДоКонца" Тогда
		
		индексОтсечения = 0;
		Для Каждого страницаИстории Из стекПереходов Цикл
			Если страницаИстории.Пометка Тогда
				индексОтсечения = стекПереходов.Индекс(страницаИстории);
			КонецЕсли;
		КонецЦикла;
		
		колвоЭлем = стекПереходов.Количество()-1;
		Пока колвоЭлем > индексОтсечения Цикл
			удаляемыйЭлем = стекПереходов.Получить(колвоЭлем);
			стекПереходов.Удалить(удаляемыйЭлем);
			колвоЭлем = колвоЭлем - 1;
		КонецЦикла;
		
	КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПоИД(ОбработатьКак, ИД)
	
	СсылкаНаЭлемент = ПолучитьСсылкуНаСправочник(ОбработатьКак, ИД);
	
	Структура = Новый Структура;
	Структура.Вставить("СсылкаНаЭлемент", СсылкаНаЭлемент);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СсылкаНаЭлемент, "ЭтоГруппа") Тогда
		Структура.Вставить("ЭтоГруппа", СсылкаНаЭлемент.ЭтоГруппа);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыДляПолученияСтраницКиоска

&НаСервере
Функция ПолучитьТаблицуАвтоматическихСкидокДляРозничнойТорговли(Номенклатура = Неопределено)
	
	Запрос = ЗапросДляАвтоматическихСкидок();
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтфильтрованныеПоПолучателям.СкидкаНаценка КАК СкидкаНаценка,
	|	АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления КАК УсловиеПредоставления,
	|	УсловияПредоставленияСкидокНаценок.УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры КАК УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры
	|ПОМЕСТИТЬ УсловияПредоставления
	|ИЗ
	|	ОтфильтрованныеПоПолучателям КАК ОтфильтрованныеПоПолучателям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|			ПО АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления = УсловияПредоставленияСкидокНаценок.Ссылка
	|		ПО ОтфильтрованныеПоПолучателям.СкидкаНаценка = АвтоматическиеСкидкиУсловияПредоставления.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УсловияПредоставления.СкидкаНаценка КАК СкидкаНаценка
	|ПОМЕСТИТЬ ОтфильтрованныеПоНоменклатуре
	|ИЗ
	|	УсловияПредоставления КАК УсловияПредоставления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УсловияПредоставленияСкидокНаценок.ОтборПродажПоСегменту КАК ОтборПродажПоСегменту
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставСегментаНоменклатуры КАК СоставСегментаНоменклатуры
	|			ПО ОтборПродажПоСегменту.СегментНоменклатуры = СоставСегментаНоменклатуры.Сегмент
	|		ПО УсловияПредоставления.УсловиеПредоставления = ОтборПродажПоСегменту.Ссылка
	|ГДЕ
	|	&ОтборПоНоменклатуре
	|	И УсловияПредоставления.УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры
	|	И СоставСегментаНоменклатуры.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УсловияПредоставления.СкидкаНаценка
	|ИЗ
	|	УсловияПредоставления КАК УсловияПредоставления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УсловияПредоставленияСкидокНаценок.ОтборПродажПоНоменклатуре КАК ОтборПродажПоНоменклатуре
	|		ПО УсловияПредоставления.УсловиеПредоставления = ОтборПродажПоНоменклатуре.Ссылка
	|ГДЕ
	|	&ОтборПоНоменклатуре
	|	И УсловияПредоставления.УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры
	|	И ОтборПродажПоНоменклатуре.Номенклатура В (&СписокНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УсловияПредоставления.СкидкаНаценка
	|ИЗ
	|	УсловияПредоставления КАК УсловияПредоставления
	|ГДЕ
	|	&ОтборПоНоменклатуре
	|	И НЕ УсловияПредоставления.УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтфильтрованныеПоПолучателям.СкидкаНаценка
	|ИЗ
	|	ОтфильтрованныеПоПолучателям КАК ОтфильтрованныеПоПолучателям
	|ГДЕ
	|	НЕ &ОтборПоНоменклатуре
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СкидкаНаценка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтфильтрованныеПоНоменклатуре.СкидкаНаценка КАК СкидкаНаценка,
	|	АвтоматическиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	АвтоматическиеСкидки.СпособПредоставления КАК СпособПредоставления,
	|	АвтоматическиеСкидки.ДатаОкончания КАК ДатаОкончания,
	|	АвтоматическиеСкидки.Наименование КАК Наименование,
	|	АвтоматическиеСкидки.Назначение КАК Назначение,
	|	АвтоматическиеСкидки.Комментарий КАК Описание
	|ИЗ
	|	ОтфильтрованныеПоНоменклатуре КАК ОтфильтрованныеПоНоменклатуре
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|		ПО ОтфильтрованныеПоНоменклатуре.СкидкаНаценка = АвтоматическиеСкидки.Ссылка";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СписокНоменклатуры", ПолучитьРодителейНоменклатурыИерархически(Номенклатура));
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре", ЗначениеЗаполнено(Номенклатура));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьПроцентСкидкиПоДисконтнойКарте()
	
	СпособыПредоставления = Новый Массив;
	СпособыПредоставления.Добавить(Перечисления.СпособыПредоставленияСкидокНаценок.Сумма);
	СпособыПредоставления.Добавить(Перечисления.СпособыПредоставленияСкидокНаценок.Процент);
	
	Запрос = ЗапросДляАвтоматическихСкидок(СпособыПредоставления);
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтфильтрованныеПоПолучателям.СкидкаНаценка КАК СкидкаНаценка,
	|	АвтоматическиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	АвтоматическиеСкидки.СпособПредоставления КАК СпособПредоставления,
	|	УсловияПредоставления.УсловиеПредоставления КАК УсловиеПредоставления
	|ПОМЕСТИТЬ УсловияПредоставления
	|ИЗ
	|	ОтфильтрованныеПоПолучателям КАК ОтфильтрованныеПоПолучателям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК УсловияПредоставления
	|		ПО ОтфильтрованныеПоПолучателям.СкидкаНаценка = УсловияПредоставления.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|		ПО ОтфильтрованныеПоПолучателям.СкидкаНаценка = АвтоматическиеСкидки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрефиксыДиапазоновКарт.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПрефиксыДиапазоновКарт
	|ИЗ
	|	Справочник.ор_ПрефиксыДиапазоновКарт.Префиксы КАК ПрефиксыДиапазоновКарт
	|ГДЕ
	|	ПрефиксыДиапазоновКарт.ТипКарты = &ТипКарты
	|	И &НомерКарты ПОДОБНО ПрефиксыДиапазоновКарт.Префикс + ""%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрефиксыДиапазоновКарт.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ УсловияПредоставленияПоПрефиксамКарт
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок.ор_ПрефиксыДиапазоновКарт КАК ПрефиксыДиапазоновКарт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УсловияПредоставления КАК УсловияПредоставления
	|		ПО ПрефиксыДиапазоновКарт.Ссылка = УсловияПредоставления.УсловиеПредоставления
	|ГДЕ
	|	ПрефиксыДиапазоновКарт.Префикс В
	|			(ВЫБРАТЬ
	|				ТаблицаУсловий.Ссылка
	|			ИЗ
	|				ПрефиксыДиапазоновКарт КАК ТаблицаУсловий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловияПредоставления.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	УсловияПредоставления.СпособПредоставления КАК СпособПредоставления
	|ИЗ
	|	УсловияПредоставления КАК УсловияПредоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|		ПО УсловияПредоставления.УсловиеПредоставления = УсловияПредоставленияСкидокНаценок.Ссылка
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту)
	|	И УсловияПредоставленияСкидокНаценок.ВидДисконтнойКарты = &ВидДисконтнойКарты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УсловияПредоставления.ЗначениеСкидкиНаценки,
	|	УсловияПредоставления.СпособПредоставления
	|ИЗ
	|	УсловияПредоставления КАК УсловияПредоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|		ПО УсловияПредоставления.УсловиеПредоставления = УсловияПредоставленияСкидокНаценок.Ссылка
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УсловияПредоставления.ЗначениеСкидкиНаценки,
	|	УсловияПредоставления.СпособПредоставления
	|ИЗ
	|	УсловияПредоставления КАК УсловияПредоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|		ПО УсловияПредоставления.УсловиеПредоставления = УсловияПредоставленияСкидокНаценок.Ссылка
	|ГДЕ
	|	УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ор_ПоДиапазонуНомеровКарт)
	|	И УсловияПредоставленияСкидокНаценок.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаУсловия.Ссылка
	|			ИЗ
	|				УсловияПредоставленияПоПрефиксамКарт КАК ТаблицаУсловия)";
	
	ВидДисконтнойКарты = Объект.ДисконтнаяКарта.Владелец;
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", ВидДисконтнойКарты);
	
	Если ВидДисконтнойКарты.ТипКарты = Перечисления.ТипыКарт.Магнитная Тогда
		Запрос.УстановитьПараметр("НомерКарты", Объект.ДисконтнаяКарта.КодКартыМагнитный);
		Запрос.УстановитьПараметр("ТипКарты"  , Перечисления.ТипыКодовКарт.МагнитныйКод);
	Иначе
		Запрос.УстановитьПараметр("НомерКарты", Объект.ДисконтнаяКарта.КодКартыШтрихкод);
		Запрос.УстановитьПараметр("ТипКарты"  , Перечисления.ТипыКодовКарт.Штрихкод);
	КонецЕсли;
	
	СписокСумм      = Новый СписокЗначений;
	СписокПроцентов = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент Тогда
			СписокПроцентов.Добавить(Выборка.ЗначениеСкидкиНаценки);
		ИначеЕсли Выборка.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
			СписокСумм.Добавить(Выборка.ЗначениеСкидкиНаценки);
		КонецЕсли;
		
	КонецЦикла;
	
	СписокСумм.СортироватьПоЗначению();
	СписокПроцентов.СортироватьПоЗначению();
	
	СуммаСкидки = "";
	Если СписокСумм.Количество() > 0 Тогда
		Если СписокСумм.Количество() = 1
			Или СписокСумм[0].Значение = СписокСумм[СписокСумм.Количество()-1] Тогда
			СуммаСкидки = СуммаСкидки + СтрШаблон(НСтр("ru = '%1 р.'"), СписокСумм[0].Значение);
		Иначе
			СуммаСкидки = СуммаСкидки
				+ СтрШаблон(НСтр("ru = 'от %1 до %2 р.'"), СписокСумм[0].Значение, СписокСумм[СписокСумм.Количество() - 1]);
		КонецЕсли;
	КонецЕсли;
	
	ПроцентСкидки = "";
	Если СписокПроцентов.Количество() > 0 Тогда
		Если СписокПроцентов.Количество() = 1
			Или СписокПроцентов[0].Значение = СписокПроцентов[СписокПроцентов.Количество()-1] Тогда
			ПроцентСкидки = ПроцентСкидки + Строка(СписокПроцентов[0].Значение);
		Иначе
			ПроцентСкидки = ПроцентСкидки
				+ СтрШаблон(НСтр("ru = 'от %1 до %2'"),
					СписокПроцентов[0].Значение,
					СписокПроцентов[СписокПроцентов.Количество() - 1].Значение);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураСкидки = Новый Структура;
	СтруктураСкидки.Вставить("СуммаСкидки", СуммаСкидки);
	СтруктураСкидки.Вставить("ПроцентСкидки", ПроцентСкидки);
	
	Возврат СтруктураСкидки;
	
КонецФункции

&НаСервере
Функция ЗапросДляАвтоматическихСкидок(СпособыПредоставления = Неопределено)
	
	Если СпособыПредоставления = Неопределено Тогда
		СпособыПредоставления = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = &ТипМагазинГруппаСкладов
	|	И СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы В(&МассивТиповСтруктурныхЕдиниц)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтоматическиеСкидки.Ссылка КАК Ссылка,
	|	АвтоматическиеСкидки.Наименование КАК Наименование,
	|	АвтоматическиеСкидки.ЕстьРасписание КАК ЕстьРасписание,
	|	АвтоматическиеСкидки.ДатаОкончания КАК ДатаОкончания,
	|	АвтоматическиеСкидки.Назначение КАК Назначение,
	|	АвтоматическиеСкидки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	АвтоматическиеСкидки.СпособПредоставления КАК СпособПредоставления,
	|	АвтоматическиеСкидки.Комментарий КАК Комментарий,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямКонтрагентам КАК ЕстьОграниченияПоПолучателямКонтрагентам,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямСегментам КАК ЕстьОграниченияПоПолучателямСегментам,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямСкладам КАК ЕстьОграниченияПоПолучателямСкладам
	|ПОМЕСТИТЬ АвтоматическиеСкидки
	|ИЗ
	|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|ГДЕ
	|	НЕ АвтоматическиеСкидки.ПометкаУдаления
	|	И НЕ АвтоматическиеСкидки.ЭтоГруппа
	|	И АвтоматическиеСкидки.Действует
	|	И АвтоматическиеСкидки.Назначение В(&Назначения)
	|	И (НЕ &ОтборПоСпособуПредоставления
	|			ИЛИ АвтоматическиеСкидки.СпособПредоставления В (&СпособыПредоставления))
	|	И (АвтоматическиеСкидки.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ &ТекущаяДата >= НАЧАЛОПЕРИОДА(АвтоматическиеСкидки.ДатаНачала, ДЕНЬ))
	|	И (АвтоматическиеСкидки.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ &ТекущаяДата <= КОНЕЦПЕРИОДА(АвтоматическиеСкидки.ДатаОкончания, ДЕНЬ))
	|	И НЕ АвтоматическиеСкидки.ЕстьУсловияАктивацииВручную
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка КАК Ссылка,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямКонтрагентам КАК ЕстьОграниченияПоПолучателямКонтрагентам,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямСегментам КАК ЕстьОграниченияПоПолучателямСегментам,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямСкладам КАК ЕстьОграниченияПоПолучателямСкладам
	|ПОМЕСТИТЬ ОтфильтрованныеПоДнямНедели
	|ИЗ
	|	Справочник.АвтоматическиеСкидки.ВремяПоДнямНедели КАК АвтоматическиеСкидкиВремяПоДнямНедели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|		ПО АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка = АвтоматическиеСкидки.Ссылка
	|ГДЕ
	|	АвтоматическиеСкидки.ЕстьРасписание
	|	И АвтоматическиеСкидкиВремяПоДнямНедели.ДеньНедели = &ДеньНедели
	|	И АвтоматическиеСкидкиВремяПоДнямНедели.ВремяНачала <= &ТекущаяДата
	|	И АвтоматическиеСкидкиВремяПоДнямНедели.ВремяОкончания >= &ТекущаяДата
	|	И АвтоматическиеСкидкиВремяПоДнямНедели.Выбран
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АвтоматическиеСкидки.Ссылка,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямКонтрагентам,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямСегментам,
	|	АвтоматическиеСкидки.ЕстьОграниченияПоПолучателямСкладам
	|ИЗ
	|	АвтоматическиеСкидки КАК АвтоматическиеСкидки
	|ГДЕ
	|	НЕ АвтоматическиеСкидки.ЕстьРасписание
	|	И АвтоматическиеСкидки.СпособПредоставления <> ЗНАЧЕНИЕ(Перечисление.СпособыПредоставленияСкидокНаценок.Округление)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтфильтрованныеПоДнямНедели.Ссылка КАК СкидкаНаценка,
	|	ОтфильтрованныеПоДнямНедели.ЕстьОграниченияПоПолучателямКонтрагентам КАК ЕстьОграниченияПоПолучателямКонтрагентам,
	|	ОтфильтрованныеПоДнямНедели.ЕстьОграниченияПоПолучателямСегментам КАК ЕстьОграниченияПоПолучателямСегментам
	|ПОМЕСТИТЬ ОтфильтрованныеПоСкладам
	|ИЗ
	|	ОтфильтрованныеПоДнямНедели КАК ОтфильтрованныеПоДнямНедели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АвтоматическиеСкидки.ПолучателиСкидкиСклады КАК АвтоматическиеСкидкиПолучателиСкидки
	|		ПО ОтфильтрованныеПоДнямНедели.Ссылка = АвтоматическиеСкидкиПолучателиСкидки.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОтфильтрованныеПоДнямНедели.ЕстьОграниченияПоПолучателямСкладам
	|					И НЕ АвтоматическиеСкидкиПолучателиСкидки.Получатель ЕСТЬ NULL
	|				ТОГДА АвтоматическиеСкидкиПолучателиСкидки.Получатель В
	|						(ВЫБРАТЬ
	|							ТаблицаСклады.Склад КАК Склад
	|						ИЗ
	|							ТаблицаСклады КАК ТаблицаСклады)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СкидкаНаценка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АвтоматическиеСкидкиПолучателиСкидки.Ссылка КАК СкидкаНаценка
	|ПОМЕСТИТЬ ОтфильтрованныеПоПолучателям
	|ИЗ
	|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиКонтрагенты КАК АвтоматическиеСкидкиПолучателиСкидки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтфильтрованныеПоСкладам КАК ОтфильтрованныеПоСкладам
	|		ПО АвтоматическиеСкидкиПолучателиСкидки.Ссылка = ОтфильтрованныеПоСкладам.СкидкаНаценка
	|			И (АвтоматическиеСкидкиПолучателиСкидки.Получатель = &Контрагент)
	|ГДЕ
	|	&ОтборПоКонтрагенту
	|	И ОтфильтрованныеПоСкладам.ЕстьОграниченияПоПолучателямКонтрагентам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвтоматическиеСкидкиПолучателиСегменты.Ссылка
	|ИЗ
	|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиСегменты КАК АвтоматическиеСкидкиПолучателиСегменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтфильтрованныеПоСкладам КАК ОтфильтрованныеПоСкладам
	|		ПО АвтоматическиеСкидкиПолучателиСегменты.Ссылка = ОтфильтрованныеПоСкладам.СкидкаНаценка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставСегментаКонтрагентов КАК СоставСегментаКонтрагентов
	|		ПО АвтоматическиеСкидкиПолучателиСегменты.Получатель = СоставСегментаКонтрагентов.Сегмент
	|			И (СоставСегментаКонтрагентов.Контрагент = &Контрагент)
	|ГДЕ
	|	&ОтборПоКонтрагенту
	|	И ОтфильтрованныеПоСкладам.ЕстьОграниченияПоПолучателямСегментам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтфильтрованныеПоСкладам.СкидкаНаценка
	|ИЗ
	|	ОтфильтрованныеПоСкладам КАК ОтфильтрованныеПоСкладам
	|ГДЕ
	|	(НЕ ОтфильтрованныеПоСкладам.ЕстьОграниченияПоПолучателямКонтрагентам
	|				И НЕ ОтфильтрованныеПоСкладам.ЕстьОграниченияПоПолучателямСегментам
	|			ИЛИ НЕ &ОтборПоКонтрагенту)";
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("ТорговыйОбъект", Объект.ТорговыйОбъект);
	Запрос.УстановитьПараметр("ДеньНедели", Перечисления.ДниНедели.Получить(ДеньНедели(ТекущаяДата) - 1));
	
	Назначения = Новый Массив;
	Назначения.Добавить(Перечисления.НазначенияАвтоматическихСкидок.Розница);
	Назначения.Добавить(Перечисления.НазначенияАвтоматическихСкидок.Везде);
	Запрос.УстановитьПараметр("Назначения", Назначения);
	
	МассивТиповСтруктурныхЕдиниц = Новый Массив;
	МассивТиповСтруктурныхЕдиниц.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	МассивТиповСтруктурныхЕдиниц.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	Запрос.УстановитьПараметр("ТипМагазинГруппаСкладов", Перечисления.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов);
	Запрос.УстановитьПараметр("МассивТиповСтруктурныхЕдиниц", МассивТиповСтруктурныхЕдиниц);
	
	// Отбор по контрагенту ведем если заполена дисконтная карта,
	// так как без карты контрагент всегда заполнен значением по умолчанию.
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту", ЗначениеЗаполнено(Объект.ДисконтнаяКарта));
	
	Запрос.УстановитьПараметр("СпособыПредоставления", СпособыПредоставления);
	Запрос.УстановитьПараметр("ОтборПоСпособуПредоставления", СпособыПредоставления.Количество() > 0);
	
	Возврат Запрос;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРодителейНоменклатурыИерархически(Номенклатура)
	
	МассивСсылок = Новый Массив;
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат МассивСсылок;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ");
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;
	
КонецФункции

&НаСервере
Функция ОпределитьМинМаксЦеныТовара(СсылкаНаНоменклатуру)
	
	МинМаксЦена = Неопределено;
	Если СсылкаНаНоменклатуру.ИспользоватьХарактеристики
		Или СсылкаНаНоменклатуру.КатегорияНоменклатуры.ИспользоватьХарактеристики Тогда
		
		Запрос = ЗапросЦенИОстатков(СсылкаНаНоменклатуру);
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеДанные.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(ОсновныеДанные.Цена) КАК ЦенаМин,
		|	МАКСИМУМ(ОсновныеДанные.Цена) КАК ЦенаМакс
		|ИЗ
		|	ОсновныеДанные КАК ОсновныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеДанные.Номенклатура";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			МинМаксЦена = ?(
				Выборка.ЦенаМин = Выборка.ЦенаМакс,
				Выборка.ЦенаМин,
				СтрШаблон("%1 - %2", Выборка.ЦенаМин, Выборка.ЦенаМакс));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МинМаксЦена = Неопределено Тогда
		МинМаксЦена = ПолучитьЦенуТовара(СсылкаНаНоменклатуру, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	
	Возврат МинМаксЦена;
	
КонецФункции

&НаСервере
Функция ЗапросЦенИОстатков(СсылкаНаНоменклатуру)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.ЭтоНабор КАК ЭтоНабор,
	|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СпрНоменклатура.Номинал КАК Номинал
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|	КОНЕЦ КАК Упаковка,
	|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК Период,
	|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
	|	0 КАК Номинал,
	|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ПОМЕСТИТЬ ТаблицаМаксПериодЦен
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	ЦеныНоменклатуры.Период <= &Дата
	|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
	|	И ЦеныНоменклатуры.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|	КОНЕЦ,
	|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
	|	ТаблицаНоменклатура.ТипНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ТаблицаНоменклатура.ЕдиницаИзмерения,
	|	&Дата,
	|	&ВидЦены,
	|	0,
	|	ТаблицаНоменклатура.ТипНоменклатуры
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	ТаблицаНоменклатура.ЭтоНабор
	|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатура.Номенклатура,
	|	ТаблицаНоменклатура.ЕдиницаИзмерения,
	|	ТаблицаНоменклатура.ТипНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ТаблицаНоменклатура.ЕдиницаИзмерения,
	|	&Дата,
	|	&ВидЦены,
	|	ТаблицаНоменклатура.Номинал,
	|	ТаблицаНоменклатура.ТипНоменклатуры
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	ТаблицаНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатура.Номенклатура,
	|	ТаблицаНоменклатура.ЕдиницаИзмерения,
	|	ТаблицаНоменклатура.Номинал,
	|	ТаблицаНоменклатура.ТипНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидЦен,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаМаксПериодЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаМаксПериодЦен.Характеристика КАК Характеристика,
	|	ТаблицаМаксПериодЦен.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ТаблицаМаксПериодЦен.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|			ТОГДА ТаблицаМаксПериодЦен.Номинал
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ТаблицаИтоговыхЦен
	|ИЗ
	|	ТаблицаМаксПериодЦен КАК ТаблицаМаксПериодЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаМаксПериодЦен.Период = ЦеныНоменклатуры.Период
	|			И ТаблицаМаксПериодЦен.ВидЦен = ЦеныНоменклатуры.ВидЦен
	|			И ТаблицаМаксПериодЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаМаксПериодЦен.Характеристика = ЦеныНоменклатуры.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИтоговыхЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаИтоговыхЦен.Характеристика КАК Характеристика,
	|	ТаблицаИтоговыхЦен.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаИтоговыхЦен.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ТаблицаКоэффициентыУпаковок
	|ИЗ
	|	ТаблицаИтоговыхЦен КАК ТаблицаИтоговыхЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТаблицаИтоговыхЦен.Упаковка = ЕдиницыИзмерения.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = &ТипМагазинГруппаСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТорговогоОбъекта.Ссылка КАК ТорговыйОбъект,
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Ссылка = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы В(&МассивТиповСтруктурныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСклады.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	СУММА(ОстаткиТоваров.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	ТаблицаСклады КАК ТаблицаСклады
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
	|		ПО ТаблицаСклады.Склад = ОстаткиТоваров.СтруктурнаяЕдиница
	|ГДЕ
	|	ОстаткиТоваров.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСклады.ТорговыйОбъект,
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ТаблицаОстатки.ТорговыйОбъект, &ТорговыйОбъект) КАК ТорговыйОбъект,
	|	ТаблицаКоэффициентыУпаковок.Номенклатура КАК Номенклатура,
	|	ТаблицаКоэффициентыУпаковок.Характеристика КАК Характеристика,
	|	ТаблицаКоэффициентыУпаковок.Цена КАК Цена,
	|	ТаблицаКоэффициентыУпаковок.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(ТаблицаОстатки.Количество, 0) / ТаблицаКоэффициентыУпаковок.КоэффициентУпаковки КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОсновныеДанные
	|ИЗ
	|	ТаблицаКоэффициентыУпаковок КАК ТаблицаКоэффициентыУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
	|		ПО ТаблицаКоэффициентыУпаковок.Номенклатура = ТаблицаОстатки.Номенклатура
	|			И ТаблицаКоэффициентыУпаковок.Характеристика = ТаблицаОстатки.Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", СсылкаНаНоменклатуру);
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦен);
	Запрос.УстановитьПараметр("ТорговыйОбъект", Объект.ТорговыйОбъект);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	МассивТиповСтруктурныхЕдиниц = Новый Массив;
	МассивТиповСтруктурныхЕдиниц.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	МассивТиповСтруктурныхЕдиниц.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	Запрос.УстановитьПараметр("ТипМагазинГруппаСкладов", Перечисления.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов);
	Запрос.УстановитьПараметр("МассивТиповСтруктурныхЕдиниц", МассивТиповСтруктурныхЕдиниц);
	
	Возврат Запрос;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВладельцевХарактеристики(Номенклатура)
	
	МассивВладельцев = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат МассивВладельцев;
	ИначеЕсли НЕ ТипЗнч(Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат МассивВладельцев;
	ИначеЕсли НЕ ЗначениеЗаполнено(Номенклатура.КатегорияНоменклатуры) Тогда
		Возврат МассивВладельцев;
	КонецЕсли;
	
	Если Номенклатура.ИспользоватьХарактеристики Тогда
		МассивВладельцев.Добавить(Номенклатура);
	КонецЕсли;
	
	Если Номенклатура.КатегорияНоменклатуры.ИспользоватьХарактеристики Тогда
		МассивВладельцев.Добавить(Номенклатура.КатегорияНоменклатуры);
	КонецЕсли;
	
	Возврат МассивВладельцев;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОбъектКорзиныНаJS()
	
	СтрокиСкрипта = Новый Массив;
	СтрокиСкрипта.Добавить("let AGoods = {};");
	
	Если ФОКиоска.Корзина Тогда
		
		СчС = 0;
		Для Каждого ТоварКорзины Из Корзина Цикл
			
			СтрокиСкрипта.Добавить("AGoods = {};");
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.IDAGoods         = '%1';", ТоварКорзины.ИДНоменклатуры));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.IDCharacteristic = '%1';", ТоварКорзины.ИДХарактеристики));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.Name             = '%1';", ТоварКорзины.Наименование));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.Price            = %1;", ПривестиЧислоКФорматуJS(ТоварКорзины.Цена)));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.Count            = %1;", ПривестиЧислоКФорматуJS(ТоварКорзины.Количество)));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.DiscountValue    = '%1';", ТоварКорзины.СкидкаЗначение));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.Sum              = %1;", ПривестиЧислоКФорматуJS(ТоварКорзины.Сумма)));
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.TotalSum         = %1;", ПривестиЧислоКФорматуJS(ТоварКорзины.ИтогоПоЗаказу)));
			
			СтрокиСкрипта.Добавить(СтрШаблон("AGoods.IsPresent = %1;",
				ПривестиБулевоКФорматуJS(ТоварКорзины.Свойство("ПродажаПодарка") И ТоварКорзины.ПродажаПодарка)));
			
			СтрокиСкрипта.Добавить(СтрШаблон("Basket[%1] = AGoods;", Формат(СчС, "ЧН=; ЧГ=")));
			
			СчС = СчС + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрСоединить(СтрокиСкрипта, Символы.ПС);
	
КонецФункции

// Процедура выводит дополнительные отраслевые характеристики товара в строку
//
&НаСервере
Функция ПолучитьДополнительныеХарактеристикиТовара(ВыборкаТовар)
	
	// Дополнительные характеристики.
	Артикул             = СтрЗаменить(ВыборкаТовар.Артикул, "'", "");
	Производитель       = СтрЗаменить(Строка(ВыборкаТовар.ор_Производитель), "'", "");
	СтранаПроисхождения = СтрЗаменить(Строка(ВыборкаТовар.СтранаПроисхождения), "'", "");
	
	СтрокаДопХарактеристик = "";
	Если ЗначениеЗаполнено(Артикул) Тогда
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>Артикул</strong>: <span>%1</span></br>", Артикул);
	КонецЕсли;
	Если ЗначениеЗаполнено(Производитель) Тогда
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>Производитель</strong>: <span>%1</span></br>", Производитель);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>Страна происхождения</strong>: <span>%1</span></br>", СтранаПроисхождения);
	КонецЕсли;
	
	// Аптека.
	Если ЗначениеЗаполнено(ВыборкаТовар.ор_МНН) Тогда
		МНН = СтрЗаменить(Строка(ВыборкаТовар.ор_МНН), "'", "");
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>МНН</strong>: <span>%1</span></br>", МНН);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаТовар.ор_ЕГК) Тогда
		ЕГК = СтрЗаменить(Строка(ВыборкаТовар.ор_ЕГК), "'", "");
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>ЕГК</strong>: <span>%1</span></br>", ЕГК);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаТовар.ор_ФТГ) Тогда
		ФТГ = СтрЗаменить(Строка(ВыборкаТовар.ор_ФТГ), "'", "");
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>Фармако-терапевтическая группа</strong>: <span>%1</span></br>", ФТГ);
	КонецЕсли;
	
	ДопПризнаки = "";
	Если ВыборкаТовар.ор_ЖНВЛС Тогда
		ДопПризнаки = НСтр("ru = 'ЖНВЛП'");
	КонецЕсли;
	Если ВыборкаТовар.ор_Яд Тогда
		ДопПризнаки = ?(ПустаяСтрока(ДопПризнаки), "", ";" + Символы.НПП) + НСтр("ru = 'Яд'");
	КонецЕсли;
	Если ВыборкаТовар.ор_НаркотическоеСредство Тогда
		ДопПризнаки = ?(ПустаяСтрока(ДопПризнаки), "", ";" + Символы.НПП) + НСтр("ru = 'Наркотическое cредство'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДопПризнаки) Тогда
		СтрокаДопХарактеристик = СтрокаДопХарактеристик
			+ СтрШаблон("<strong>Дополнительные признаки</strong>: <span>%1</span></br>", ДопПризнаки);
	КонецЕсли;
	// Конец Аптека.
	
	Возврат СтрокаДопХарактеристик;
	
КонецФункции

// Процедура получает текст отраслевого запроса
//
&НаСервере
Функция ПолучитьТекстЗапросаПоДополнительнымХарактеристикам()
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	СУММА(ОсновныеДанные.КоличествоОстаток) КАК Количество,
	|	МАКСИМУМ(ОсновныеДанные.Цена) КАК Цена
	|ПОМЕСТИТЬ ОсаткиИЦеныНоменклатуры
	|ИЗ
	|	ОсновныеДанные КАК ОсновныеДанные
	|ГДЕ
	|	ОсновныеДанные.ТорговыйОбъект = &ТорговыйОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеДанные.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Ссылка,
	|	СпрНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	СпрНоменклатура.Родитель КАК Родитель,
	|	СпрНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	СпрНоменклатура.Код КАК Код,
	|	СпрНоменклатура.Наименование КАК Наименование,
	|	СпрНоменклатура.Комментарий КАК Описание,
	|	СпрНоменклатура.ФайлКартинки КАК ФайлКартинки,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТовар,
	|	СпрНоменклатура.Производитель КАК Производитель,
	|	СпрНоменклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ОсаткиИЦеныНоменклатуры.Количество, 0) КАК Количество,
	// Аптека.
	|	СпрНоменклатура.ор_МНН КАК ор_МНН,
	|	СпрНоменклатура.ор_ЕГК КАК ор_ЕГК,
	|	СпрНоменклатура.ор_Производитель КАК ор_Производитель,
	|	СпрНоменклатура.ор_ФТГ КАК ор_ФТГ,
	|	СпрНоменклатура.ор_ЖНВЛС КАК ор_ЖНВЛС,
	|	СпрНоменклатура.ор_Яд КАК ор_Яд,
	|	СпрНоменклатура.ор_НаркотическоеСредство КАК ор_НаркотическоеСредство,
	// Конец Аптека.
	|	ЕСТЬNULL(ОсаткиИЦеныНоменклатуры.Цена, 0) КАК Цена
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОсаткиИЦеныНоменклатуры КАК ОсаткиИЦеныНоменклатуры
	|		ПО СпрНоменклатура.Ссылка = ОсаткиИЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ИдентификацияЭлементовHTML

// Функция выполняет рекурсивный поиск элемента HTML и его обработчика
//
&НаКлиенте
Функция ПолучитьКлавишиНавигации(ЭлементКонтейнера, НомерИтерации = 0, МассивОбрабатываемыхID = Неопределено)
	
	Если МассивОбрабатываемыхID = Неопределено Тогда
		
		// Создадим массив элементами которого являются составляющие id элементов которые подлежат обработке.
		МассивОбрабатываемыхID = Новый Массив;
		МассивОбрабатываемыхID.Добавить("shop actions");
		МассивОбрабатываемыхID.Добавить("prev nav");
		МассивОбрабатываемыхID.Добавить("next nav");
		МассивОбрабатываемыхID.Добавить("about shop");
		МассивОбрабатываемыхID.Добавить("find-goods");
		МассивОбрабатываемыхID.Добавить("issue-order");
	КонецЕсли;
	
	МассивОбрабатываемыхClass = Неопределено;
	Если МассивОбрабатываемыхClass = Неопределено Тогда
		
		// Создадим массив элементами которого являются составляющие class элементов которые подлежат обработке.
		МассивОбрабатываемыхClass = Новый Массив;
		МассивОбрабатываемыхClass.Добавить("custom-button");
		МассивОбрабатываемыхClass.Добавить("buy-button");
		МассивОбрабатываемыхClass.Добавить("item");
		МассивОбрабатываемыхClass.Добавить("delete-count count-block");
		МассивОбрабатываемыхClass.Добавить("count-block add-count");
		МассивОбрабатываемыхClass.Добавить("delete-item");
	КонецЕсли;
	
	Если ЭлементКонтейнера.tagName = "BODY" Тогда
		Структура = Новый Структура;
		Структура.Вставить("ИдентификаторОбработки", "");
		
		Возврат Структура;
	КонецЕсли;
	
	идИмя = ЭлементКонтейнера.id;
	
	Если идИмя <> NULL Тогда
		Для Каждого ОсознанныйЭлемент Из МассивОбрабатываемыхID Цикл
			// Если нашли соответствие id какому-нибудь из обрабатываемых элементов,
			// то возвращаем найденный элемент и соответствующее ему событие.
			Если Найти(идИмя, ОсознанныйЭлемент) Тогда
				Структура = Новый Структура;
				Структура.Вставить("ИскомыйЭлемент", ЭлементКонтейнера);
				Структура.Вставить("ИдентификаторОбработки", ОсознанныйЭлемент);
				Если идИмя = "shop actions" Тогда
					идНоменклатуры = Элементы.ИнфоКиоск.Документ.getElementById("execution").getAttribute("paramID");
					Структура.Вставить("ЭтоКнопкаАкций", Истина);
					Структура.Вставить("ЭтоАкцииВсегоМагазина", ?(идИмя = "shop actions", Истина, Ложь));
					Структура.Вставить("НоменклатураИД", идНоменклатуры);
				Иначе
					Структура.Вставить("ЭтоКнопкаАкций", Ложь);
				КонецЕсли;
				
				Если идИмя = "prev nav" ИЛИ идИмя = "next nav" Тогда
					Структура.Вставить("ЭтоКнопкаПерехода", Истина);
					Структура.Вставить("ЭтоКнопкаПереходаНазад", ?(идИмя = "prev nav", Истина, Ложь));
				Иначе
					Структура.Вставить("ЭтоКнопкаПерехода", Ложь);
				КонецЕсли;
				
				Если идИмя = "about shop" Тогда
					Структура.Вставить("ЭтоКнопкаОМагазине", Истина);
				Иначе
					Структура.Вставить("ЭтоКнопкаОМагазине", Ложь);
				КонецЕсли;
				
				Если идИмя = "find-goods" Тогда
					ЭлемСТекстом = Элементы.ИнфоКиоск.Документ.getElementById("search-text");
					// Заменим неразрывной пробел на обычный, которые использует 1С Предприятие
					// в противном случае поиск не даст результатов при вводе значения с цифровой клавиатуры.
					ТекстДляПоиска = СокрЛП(СтрЗаменить(ЭлемСТекстом.value, Символ(160), Символ(32)));
					ТекстПоУмолчанию = СокрЛП(ЭлемСТекстом.placeholder); // Текст по умолчанию "Нажмите на поле для вызова клавиатуры".
					Если ЗначениеЗаполнено(ТекстДляПоиска) И ТекстДляПоиска <> ТекстПоУмолчанию Тогда
						ПолучитьТоварыДляПоиска = Истина;
						
						СтрокаСкрипта = ПолучитьСтраницуКаталога(, ТекстДляПоиска);
						
						ЭлементВыполнения = Элементы.ИнфоКиоск.Документ.getElementById("execution");
						ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
						ВыполнитьСобытиеOnclick(ЭлементВыполнения);
						
						// Запоминание истории поиска.
						Для Каждого историяПерехода Из стекПереходов Цикл
							Если историяПерехода.Пометка Тогда
								
								КодСкрипта = историяПерехода.Значение.КодСкрипта;
								КодСкрипта = ЭлементВыполнения.getAttribute("paramKod");
								историяПерехода.Значение.КодСкрипта = КодСкрипта;
								
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				// Оформление заказа
				Если идИмя = "issue-order" Тогда
					
					Если Корзина.Количество() Тогда
						ОтветОформления = ОформитьЗаказНаКлиенте();
						
						КнопкаЗаказать = Элементы.ИнфоКиоск.Документ.getElementById("issue-order");
						Если ОтветОформления.ДокументОформлен Тогда
							Корзина.Очистить();
							КнопкаЗаказать.setAttribute("paramOrderIssued", ОтветОформления.НомерЗаказа);
							ВыполнитьСобытиеOnclick(КнопкаЗаказать);
							НапечататьЗаказ();
						Иначе
							КнопкаЗаказать.setAttribute("paramOrderIssued", "");
							// Перенаправим на страницу с ошибкой.
							ОсуществитьПереходНаСтраницу("error.html");
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Возврат Структура;
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	классИмя = ЭлементКонтейнера.ClassName;
	
	Если классИмя <> NULL Тогда
		Для Каждого ОсознанныйЭлемент Из МассивОбрабатываемыхClass Цикл
			// Если нашли соответствие id какому-нибудь из обрабатываемых элементов,
			// то возвращаем найденный элемент и соответствующее ему событие.
			Если ВРег(классИмя)=ВРег(ОсознанныйЭлемент) Тогда
				классИмя = ОсознанныйЭлемент;
				Структура = Новый Структура;
				Структура.Вставить("ИскомыйЭлемент", ЭлементКонтейнера);
				Структура.Вставить("ИдентификаторОбработки", ОсознанныйЭлемент);
				// Обработка нажатия кнопки ВКорзину в карточке товара.
				Если классИмя = "buy-button" ИЛИ классИмя = "custom-button" Тогда
					
					ЭлементСвязи   = Элементы.ИнфоКиоск.Документ.getElementById("execution");
					
					ЭлементВКорзину = Элементы.ИнфоКиоск.Документ.getElementById("buy-button");
					идНоменклатуры = ЭлементВКорзину.getAttribute("paramIDAGoods");
					
					Если классИмя = "custom-button" Тогда
						идХарактеристики = ЭлементКонтейнера.getAttribute("paramIDCharacteristic");
					Иначе
						идХарактеристики = Строка(ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка").УникальныйИдентификатор());
					КонецЕсли;
					
					СтрокаТовара = Неопределено;
					ВКорзинеУжеЕстьДобавляемыйТовар = Ложь;
					
					Для Каждого ТоварКорзины Из Корзина Цикл
						Если ТоварКорзины.ИДНоменклатуры = идНоменклатуры И ТоварКорзины.ИДХарактеристики = идХарактеристики Тогда
							ТоварКорзины.Количество = ТоварКорзины.Количество + 1;
							ТоварКорзины.Сумма = ТоварКорзины.Цена * ТоварКорзины.Количество;
							ПересчитатьИтогоКорзины();
							РассчитатьСкидкиКорзины();
							ВКорзинеУжеЕстьДобавляемыйТовар = Истина;
						КонецЕсли;
					КонецЦикла;
					
					Если НЕ ВКорзинеУжеЕстьДобавляемыйТовар Тогда
						
						ДанныеТовара = ПолучитьДанныеДляПомещенияТовараВКорзину(идНоменклатуры, идХарактеристики);
						
						ТоварКорзины = Новый Структура();
						ТоварКорзины.Вставить("ИДНоменклатуры",   идНоменклатуры);
						ТоварКорзины.Вставить("ИДХарактеристики", идХарактеристики);
						ТоварКорзины.Вставить("Наименование",     ДанныеТовара.Наименование);
						ТоварКорзины.Вставить("Цена",             ДанныеТовара.Цена);
						ТоварКорзины.Вставить("Количество",       1);
						ТоварКорзины.Вставить("СкидкаЗначение",   "");
						ТоварКорзины.Вставить("СкидкаИД",         "");
						ТоварКорзины.Вставить("Сумма",            ДанныеТовара.Цена);
						ТоварКорзины.Вставить("ПродажаПодарка",   Ложь);
						ТоварКорзины.Вставить("ИтогоПоЗаказу",    ДанныеТовара.Цена);
						
						Корзина.Добавить(ТоварКорзины);
						ПересчитатьИтогоКорзины();
						РассчитатьСкидкиКорзины();
						
					КонецЕсли;
					
					Структура.Вставить("ЭтоКнопкаВКорзину", Истина);
					// Обновить количество товаров.
					ЭлементСвязи.setAttribute("paramBasketCount", ПолучитьКоличествоТовараВКорзине());
					
					Если классИмя = "custom-button" Тогда
						ВыполнитьСобытиеOnclick(ЭлементКонтейнера);
					ИначеЕсли классИмя = "buy-button" Тогда
						ВыполнитьСобытиеOnclick(Элементы.ИнфоКиоск.Документ.getElementById("buy-button"));
					КонецЕсли;
					
				Иначе
					Структура.Вставить("ЭтоКнопкаАкций", Ложь);
					Структура.Вставить("ЭтоКнопкаПерехода", Ложь);
					Структура.Вставить("ЭтоКнопкаОМагазине", Ложь);
				КонецЕсли;
				
				Если классИмя = "item" Тогда
					парам1с = ЭлементКонтейнера.getAttribute("param1c");
					Если парам1с = "CatalogItem" Тогда
						Структура = Новый Структура;
						Структура.Вставить("ИскомыйЭлемент", ЭлементКонтейнера);
						Структура.Вставить("ИдентификаторОбработки", парам1с);
						Структура.Вставить("ИД", ЭлементКонтейнера.getAttribute("paramID"));
						СтруктураТовара = ПолучитьСтруктуруПоИД(
							?(ФОКиоска.КаталогИзПрайсЛиста, "ПрайсЛист", "Номенклатура"), Структура.ИД);
						Структура.Вставить("СсылкаНаЭлемент", СтруктураТовара.СсылкаНаЭлемент);
						Структура.Вставить("ЭтоГруппа", СтруктураТовара.ЭтоГруппа);
						Структура.Вставить("ЭтоКнопкаВКаталоге", Истина);
					КонецЕсли;
				КонецЕсли;
				
				Если классИмя = "delete-count count-block" ИЛИ классИмя = "count-block add-count" Тогда
					
					Слагаемое = ?(классИмя = "delete-count count-block", -1, 1);
					
					идНоменклатуры   = ЭлементКонтейнера.getAttribute("paramIDAGoods");
					идХарактеристики = ЭлементКонтейнера.getAttribute("paramIDCharacteristic");
					
					ТоварУдалили = Ложь;
					
					Для Каждого ТоварКорзины Из Корзина Цикл
						Если ТоварКорзины.ИДНоменклатуры = идНоменклатуры И ТоварКорзины.ИДХарактеристики = идХарактеристики Тогда
							ТоварКорзины.Количество = ТоварКорзины.Количество + Слагаемое;
							ТоварКорзины.Сумма = ТоварКорзины.Цена * ТоварКорзины.Количество;
							Если ТоварКорзины.Количество = 0 Тогда
								Индекс = Корзина.Найти(ТоварКорзины);
								Если Индекс <> Неопределено Тогда
									Корзина.Удалить(Индекс);
									ТоварУдалили = Истина;
								КонецЕсли;
							КонецЕсли;
							ПересчитатьИтогоКорзины();
							РассчитатьСкидкиКорзины();
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					ЭлементВыполнения = Элементы.ИнфоКиоск.Документ.getElementById("execution");
					
					СтрокаСкрипта     = ПолучитьОбъектКорзиныНаJS();
					ЭлементВыполнения.setAttribute("paramID", "");
				
					ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
					ВыполнитьСобытиеOnclick(ЭлементВыполнения);
					
				КонецЕсли;
				
				Если классИмя = "delete-item" Тогда
					
					идНоменклатуры   = ЭлементКонтейнера.getAttribute("paramIDAGoods");
					идХарактеристики = ЭлементКонтейнера.getAttribute("paramIDCharacteristic");
					
					Для Каждого ТоварКорзины Из Корзина Цикл
						Если ТоварКорзины.ИДНоменклатуры = идНоменклатуры И ТоварКорзины.ИДХарактеристики = идХарактеристики Тогда
							Индекс = Корзина.Найти(ТоварКорзины);
							Если Индекс <> Неопределено Тогда
								Корзина.Удалить(Индекс);
								ТоварУдалили = Истина;
							КонецЕсли;
							ПересчитатьИтогоКорзины();
							РассчитатьСкидкиКорзины();
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					ЭлементВыполнения = Элементы.ИнфоКиоск.Документ.getElementById("execution");
					
					СтрокаСкрипта     = ПолучитьОбъектКорзиныНаJS();
					ЭлементВыполнения.setAttribute("paramID", "");
				
					ЭлементВыполнения.setAttribute("paramKod", ЭкранироватьСимволы(СтрокаСкрипта));
					ВыполнитьСобытиеOnclick(ЭлементВыполнения);
					
				КонецЕсли;
				
				Возврат Структура;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НомерИтерации = НомерИтерации + 1;
	
	Если НомерИтерации = 5 Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("ИдентификаторОбработки", "");
		
		Возврат Структура;
	КонецЕсли;
	
	ЭлементКонтейнера = ЭлементКонтейнера.parentElement;
	
	Возврат ПолучитьКлавишиНавигации(ЭлементКонтейнера, НомерИтерации, МассивОбрабатываемыхID)
	
КонецФункции

#КонецОбласти

#Область ОформлениеЗаказа

&НаКлиенте
Функция ОформитьЗаказНаКлиенте()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту"          , Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет", Ложь);
	СтруктураПараметры.Вставить("РабочееМесто"               , РабочееМесто);
	СтруктураПараметры.Вставить("Корзина"                    , Корзина);
	
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	
	Возврат ОформитьЗаказНаСервере();
	
КонецФункции

&НаСервере
Функция ОформитьЗаказНаСервере()
	
	ДокументОформлен = Ложь;
	
	ДокументЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	ДокументЗаказ.Дата = ТекущаяДатаСеанса();
	
	ДокументЗаказ.Организация = Объект.Организация;
	ДокументЗаказ.НалогообложениеНДС = Объект.НалогообложениеНДС;
	
	ДокументЗаказ.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
	ДокументЗаказ.СостояниеЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЗаказаПокупателя(ДокументЗаказ.ВидЗаказа);
	ДокументЗаказ.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	ДокументЗаказ.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
	
	ДокументЗаказ.Автор = Пользователи.ТекущийПользователь();
	ДокументЗаказ.Ответственный = ПерсональныеНастройкиРУНФ.Прочитать(
		"ОсновнойОтветственный",,
		ДокументЗаказ.Автор);
	
	ДокументЗаказ.СтруктурнаяЕдиницаРезерв  = Объект.СтруктурнаяЕдиницаРезерв;
	ДокументЗаказ.СтруктурнаяЕдиницаПродажи = Объект.СтруктурнаяЕдиницаПродажи;
	
	ДокументЗаказ.Контрагент = Объект.Контрагент;
	ДокументЗаказ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ДокументЗаказ.Контрагент);
	
	ДокументЗаказ.ДатаОтгрузки = Документы.ЗаказПокупателя.РассчитатьДатуОтгрузки(ДокументЗаказ.Дата, ДокументЗаказ.Договор);
	Если Не ЗначениеЗаполнено(ДокументЗаказ.ДатаОтгрузки) Тогда
		ДокументЗаказ.ДатаОтгрузки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		ДокументЗаказ.ДисконтнаяКарта                = Объект.ДисконтнаяКарта;
		ДокументЗаказ.ВидСкидкиНаценки               = Объект.ВидСкидкиНаценки;
		ДокументЗаказ.ПроцентСкидкиПоДисконтнойКарте = Объект.ПроцентСкидкиПоДисконтнойКарте;
		
		ДанныеОсновногоКонтактногоЛица = ДанныеОсновногоКонтактногоЛица(ДокументЗаказ.Контрагент);
		Если ЗначениеЗаполнено(ДанныеОсновногоКонтактногоЛица) Тогда
			Объект.КонтактноеЛицо = ДанныеОсновногоКонтактногоЛица.Представление;
			Объект.КонтактныйТелефон = ДанныеОсновногоКонтактногоЛица.КонтактныйТелефон;
			Объект.ЗапаснойТелефон = ДанныеОсновногоКонтактногоЛица.ЗапаснойТелефон;
			Объект.ПочтаПолучателя = ДанныеОсновногоКонтактногоЛица.ПочтаПолучателя;
		Иначе
			Для Каждого ТекЭлемент Из ДанныеКонтактныхЛиц(ДокументЗаказ.Контрагент) Цикл
				Объект.КонтактноеЛицо = ТекЭлемент.Значение.Представление;
				Объект.КонтактныйТелефон = ТекЭлемент.Значение.КонтактныйТелефон;
				Объект.ЗапаснойТелефон = ТекЭлемент.Значение.ЗапаснойТелефон;
				Объект.ПочтаПолучателя = ТекЭлемент.Значение.ПочтаПолучателя;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		
		АдресаДоставки = АдресаДоставки(ДокументЗаказ.Контрагент);
		Если ЗначениеЗаполнено(АдресаДоставки) Тогда
			Объект.АдресДоставки = АдресаДоставки[0].АдресДоставки;
			Объект.АдресДоставкиЗначение = АдресаДоставки[0].АдресДоставкиЗначение;
			Объект.АдресДоставкиЗначенияПолей = АдресаДоставки[0].АдресДоставкиЗначенияПолей;
		КонецЕсли;
	КонецЕсли;
	
	ДокументЗаказ.ВалютаДокумента = Объект.ВалютаДокумента;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних");
	Запрос.УстановитьПараметр("Период", ДокументЗаказ.Дата);
	Запрос.УстановитьПараметр("Валюта", ДокументЗаказ.Договор.ВалютаРасчетов);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДокументЗаказ.Курс      = ВыборкаДетальныеЗаписи.Курс;
		ДокументЗаказ.Кратность = ВыборкаДетальныеЗаписи.Кратность;
	Иначе
		ДокументЗаказ.Курс      = 1;
		ДокументЗаказ.Кратность = 1;
	КонецЕсли;
	
	ДокументЗаказ.ВидЦен = Объект.ВидЦен;
	ДокументЗаказ.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
	
	ЗначениеНастройки = ПерсональныеНастройкиРУНФ.Прочитать("ПоложениеДатыОтгрузкиВЗаказеПокупателя");
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Если ДокументЗаказ.ПоложениеДатыОтгрузки <> ЗначениеНастройки Тогда
			ДокументЗаказ.ПоложениеДатыОтгрузки = ЗначениеНастройки;
		КонецЕсли;
	Иначе
		ДокументЗаказ.ПоложениеДатыОтгрузки = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	КонецЕсли;
	
	ДокументЗаказ.СкидкиРассчитаны = Объект.СкидкиНаценки;
	ДокументЗаказ.СуммаДокумента   = Объект.СуммаДокумента;
	
	ВесИтог   = 0;
	ОбъемИтог = 0;
	
	Для Каждого ТекущиеДанные Из Объект.Запасы Цикл
		НоваяСтрока = ДокументЗаказ.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
		
		НоваяСтрока.ДатаОтгрузки = ДокументЗаказ.ДатаОтгрузки;
		
		СтруктураДанные = СтруктураДанныхДляНомеклатуры();
		СтруктураДанные.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", НоваяСтрока.Характеристика);
		
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		НоваяСтрока.ТипНоменклатурыЗапас = ДанныеНоменклатуры.ЭтоЗапас;
		
		НоваяСтрока.Вес   = ДанныеНоменклатуры.ВесЕдиницыТовара * НоваяСтрока.Количество;
		НоваяСтрока.Объем = ДанныеНоменклатуры.ОбъемЕдиницыТовара * НоваяСтрока.Количество;
		ВесИтог   = ВесИтог + НоваяСтрока.Вес;
		ОбъемИтог = ОбъемИтог + НоваяСтрока.Объем;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВесИтог) Тогда
		ДокументЗаказ.Вес = ВесИтог;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъемИтог) Тогда
		ДокументЗаказ.Объем = ОбъемИтог;
	КонецЕсли;
	
	Для Каждого ТекущиеДанные Из Объект.СкидкиНаценки Цикл
		НоваяСтрока = ДокументЗаказ.СкидкиНаценки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	КонецЦикла;
	
	Для Каждого ТекущиеДанные Из Объект.Подарки Цикл
		НоваяСтрока = ДокументЗаказ.Подарки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	КонецЦикла;
	
	Для Каждого ТекущиеДанные Из Объект.ДобавленныеНаборы Цикл
		НоваяСтрока = ДокументЗаказ.ДобавленныеНаборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	КонецЦикла;
	
	Для Каждого ТекущиеДанные Из Объект.БонусныеБаллыКНачислению Цикл
		НоваяСтрока = ДокументЗаказ.БонусныеБаллыКНачислению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	КонецЦикла;
	
	Попытка
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		ДокументОформлен = Истина;
	Исключение
		ЗаписьЖурналаРегистрации(
			"Инфо-киоск.Заказ покупателя",
			УровеньЖурналаРегистрации.Ошибка,
			,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		ДокументОформлен = Ложь;
	КонецПопытки;
	
	ОтветОформления = Новый Структура;
	ОтветОформления.Вставить("ДокументОформлен", ДокументОформлен);
	Если ДокументОформлен Тогда
		ОчиститьДанныеПоЗаказу();
		
		ОтветОформления.Вставить("НомерЗаказа", ДокументЗаказ.Номер);
		
		ЗаказПокупателя = ДокументЗаказ.Ссылка;
	КонецЕсли;
	
	Возврат ОтветОформления;
	
КонецФункции

&НаСервере
Процедура ОчиститьДанныеПоЗаказу()
	
	Объект.Запасы.Очистить();
	Объект.ДобавленныеНаборы.Очистить();
	Объект.БонусныеБаллыКНачислению.Очистить();
	Объект.СкидкиНаценки.Очистить();
	Объект.Подарки.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеОсновногоКонтактногоЛица(Контрагент)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.КонтактноеЛицо,
	|	ПРЕДСТАВЛЕНИЕ(Контрагенты.КонтактноеЛицо) КАК Представление,
	|	КонтактныеЛицаКонтактнаяИнформация.Тип,
	|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|		ПО (КонтактныеЛицаКонтактнаяИнформация.Ссылка = Контрагенты.КонтактноеЛицо И Контрагенты.Ссылка = &Контрагент)
	|ГДЕ
	|	(КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ИЛИ КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|	И Контрагенты.Ссылка = &Контрагент");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Результат = НовыеДанныеКонтактногоЛица();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Результат.Представление) Тогда
			Результат.Представление = Выборка.Представление;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.КонтактныйТелефон)
			И ЗначениеЗаполнено(Результат.ЗапаснойТелефон)
			И ЗначениеЗаполнено(Результат.ПочтаПолучателя) Тогда
			Прервать;
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты
			И Не ЗначениеЗаполнено(Результат.ПочтаПолучателя) Тогда
			Результат.ПочтаПолучателя = Выборка.АдресЭП;
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И Не ЗначениеЗаполнено(Результат.КонтактныйТелефон) Тогда
			Результат.КонтактныйТелефон = Выборка.НомерТелефона;
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И Не ЗначениеЗаполнено(Результат.ЗапаснойТелефон) Тогда
			Результат.ЗапаснойТелефон = Выборка.НомерТелефона;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыеДанныеКонтактногоЛица()
	
	Результат = Новый Структура;
	Результат.Вставить("Представление");
	Результат.Вставить("КонтактныйТелефон");
	Результат.Вставить("ЗапаснойТелефон");
	Результат.Вставить("ПочтаПолучателя");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеКонтактныхЛиц(Контрагент)
	
	Результат = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛица.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(КонтактныеЛица.Ссылка) КАК Представление,
	|	КонтактныеЛицаКонтактнаяИнформация.Тип КАК Тип,
	|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ПО СвязиКонтрагентКонтакт.Контакт = КонтактныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|		ПО (КонтактныеЛицаКонтактнаяИнформация.Ссылка = КонтактныеЛица.Ссылка)
	|ГДЕ
	|	(КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ИЛИ КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|	И СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Результат[Выборка.Ссылка] = Неопределено Тогда
			Результат[Выборка.Ссылка] = НовыеДанныеКонтактногоЛица();
			Результат[Выборка.Ссылка].Представление = Выборка.Представление;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат[Выборка.Ссылка].КонтактныйТелефон)
			И ЗначениеЗаполнено(Результат[Выборка.Ссылка].ЗапаснойТелефон)
			И ЗначениеЗаполнено(Результат[Выборка.Ссылка].ПочтаПолучателя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты
			И Не ЗначениеЗаполнено(Результат[Выборка.Ссылка].ПочтаПолучателя) Тогда
			Результат[Выборка.Ссылка].ПочтаПолучателя = Выборка.АдресЭП;
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И Не ЗначениеЗаполнено(Результат[Выборка.Ссылка].КонтактныйТелефон) Тогда
			Результат[Выборка.Ссылка].КонтактныйТелефон = Выборка.НомерТелефона;
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И Не ЗначениеЗаполнено(Результат[Выборка.Ссылка].ЗапаснойТелефон) Тогда
			Результат[Выборка.Ссылка].ЗапаснойТелефон = Выборка.НомерТелефона;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция АдресаДоставки(Контрагент)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивКонтрагент = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контрагент);
	Адреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивКонтрагент,
		,
		ВидыКИАдресаДоставки(),
		ТекущаяДатаСеанса());
	
	УникальныеЗначения = Новый Соответствие;
	Для Каждого АдресКонтрагента Из Адреса Цикл
		Если УникальныеЗначения[АдресКонтрагента.Представление] = Неопределено Тогда
			УникальныеЗначения[АдресКонтрагента.Представление] = Новый Структура;
			УникальныеЗначения[АдресКонтрагента.Представление].Вставить("Значение", АдресКонтрагента.Значение);
			УникальныеЗначения[АдресКонтрагента.Представление].Вставить("ЗначенияПолей", АдресКонтрагента.ЗначенияПолей);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из УникальныеЗначения Цикл
		ДобавляемоеЗначение = Новый Структура;
		ДобавляемоеЗначение.Вставить("АдресДоставки", ТекЭлемент.Ключ);
		ДобавляемоеЗначение.Вставить("АдресДоставкиЗначение", ТекЭлемент.Значение.Значение);
		ДобавляемоеЗначение.Вставить("АдресДоставкиЗначенияПолей", ТекЭлемент.Значение.ЗначенияПолей);
		Результат.Добавить(ДобавляемоеЗначение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидыКИАдресаДоставки()
	
	Результат = Новый Массив;
	Результат.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Результат.Добавить(Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСтраниц

&НаСервере
Функция ПолучитьСтраницуКаталога(Родитель = Неопределено, ТекстДляПоиска = "", СписокОтображаемойНоменклатуры = Неопределено)
	
	Запрос = Новый Запрос;
	Если ФОКиоска.КаталогИзПрайсЛиста Тогда
		
		лРодитель = ПолучитьСсылкуНаСправочник("ПрайсЛист", Родитель);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СпрПрайсЛисты.Ссылка КАК Ссылка,
		|	СпрПрайсЛисты.Номенклатура КАК Номенклатура,
		|	СпрПрайсЛисты.Родитель КАК Родитель,
		|	СпрПрайсЛисты.ЭтоГруппа КАК ЭтоГруппа,
		|	СпрПрайсЛисты.Код КАК Код,
		|	СпрПрайсЛисты.Наименование КАК Наименование,
		|	СпрНоменклатура.Комментарий КАК Описание,
		|	СпрНоменклатура.ФайлКартинки КАК ФайлКартинки,
		|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ПОМЕСТИТЬ ОсновныеДанные
		|ИЗ
		|	Справочник.ор_ПрайсЛистИнформационногоКиоска КАК СпрПрайсЛисты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СпрПрайсЛисты.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	НЕ СпрПрайсЛисты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеДанные.Ссылка КАК Ссылка,
		|	ОсновныеДанные.Номенклатура КАК Номенклатура,
		|	ОсновныеДанные.Родитель КАК Родитель,
		|	ОсновныеДанные.ЭтоГруппа КАК ЭтоГруппа,
		|	ОсновныеДанные.Код КАК Код,
		|	ОсновныеДанные.Наименование КАК Наименование,
		|	ОсновныеДанные.Описание КАК Описание,
		|	ОсновныеДанные.ФайлКартинки КАК ФайлКартинки
		|ИЗ
		|	ОсновныеДанные КАК ОсновныеДанные
		|ГДЕ
		|	&Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа УБЫВ,
		|	Наименование";
		
	Иначе
		
		лРодитель = ПолучитьСсылкуНаСправочник("Номенклатура", Родитель);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ОсновныеДанные.Ссылка КАК Ссылка,
		|	ОсновныеДанные.Ссылка КАК Номенклатура,
		|	ОсновныеДанные.Родитель КАК Родитель,
		|	ОсновныеДанные.ЭтоГруппа КАК ЭтоГруппа,
		|	ОсновныеДанные.Код КАК Код,
		|	ОсновныеДанные.Наименование КАК Наименование,
		|	ОсновныеДанные.Комментарий КАК Описание,
		|	ОсновныеДанные.ФайлКартинки КАК ФайлКартинки
		|ИЗ
		|	Справочник.Номенклатура КАК ОсновныеДанные
		|ГДЕ
		|	НЕ ОсновныеДанные.ПометкаУдаления
		|	И &Отборы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа УБЫВ,
		|	Наименование";
		
		
	КонецЕсли;
	
	Если СписокОтображаемойНоменклатуры <> Неопределено Тогда
		Запрос.УстановитьПараметр("ДоступныеТипыНоменклатуры", КэшЗначений.ДоступныеТипыНоменклатуры);
		Запрос.УстановитьПараметр("СписокОтображаемойНоменклатуры", СписокОтображаемойНоменклатуры);
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&Отборы",
			"НЕ ОсновныеДанные.ЭтоГруппа
			|	И ОсновныеДанные.ТипНоменклатуры В(&ДоступныеТипыНоменклатуры)
			|	И ОсновныеДанные.Ссылка В(&СписокОтображаемойНоменклатуры)");
	ИначеЕсли ТекстДляПоиска <> "" Тогда
		Запрос.УстановитьПараметр("ДоступныеТипыНоменклатуры", КэшЗначений.ДоступныеТипыНоменклатуры);
		Запрос.УстановитьПараметр("ТекстДляПоиска", ТекстДляПоиска);
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&Отборы",
			"НЕ ОсновныеДанные.ЭтоГруппа
			|	И ОсновныеДанные.ТипНоменклатуры В(&ДоступныеТипыНоменклатуры)
			|	И ОсновныеДанные.Наименование ПОДОБНО ""%"" + &ТекстДляПоиска + ""%""");
	ИначеЕсли лРодитель.ЭтоГруппа ИЛИ лРодитель.Пустая() Тогда
		Запрос.УстановитьПараметр("Родитель", лРодитель);
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&Отборы",
			"ОсновныеДанные.Родитель = &Родитель");
	Иначе
		// Для вывода пустого результата,
		// данная ситуация исключительная и воспроизводиться при нормальной работе не должна.
		Запрос.УстановитьПараметр("Отборы", Ложь);
	КонецЕсли;
	
	СтрокиСкрипта = Новый Массив;
	СтрокиСкрипта.Добавить("let CatalogItem = {};");
	
	ЗаголовокКаталога = ?(лРодитель.Пустая(), "Каталог", Строка(лРодитель));
	ЗаголовокКаталога = ПолучитьСтрокуТекстаДляJS(ЗаголовокКаталога);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		СчС = 0;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СсылкаНаНоменклатуру = Выборка.Номенклатура;
			МинМаксЦена = "";
			Картинка    = "";
			
			Если НЕ Выборка.ЭтоГруппа Тогда
				Картинка = ПолучитьКартинкуТовара(Выборка.ФайлКартинки);
				МинМаксЦена = ОпределитьМинМаксЦеныТовара(СсылкаНаНоменклатуру);
			КонецЕсли;
			
			ВыборкаНаименование = СократитьСтрокуДоНужногоКоличестваСимволов(Выборка.Наименование, 42);
			ВыборкаНаименование = ПолучитьСтрокуТекстаДляJS(ВыборкаНаименование);
			ВыборкаОписание     = ПолучитьСтрокуТекстаДляJS(Выборка.Описание);
			
			СтрокиСкрипта.Добавить("CatalogItem = {};");
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.ID            = '%1';", Выборка.Ссылка.УникальныйИдентификатор()));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.Name          = '%1';", ВыборкаНаименование));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.Group         = %1;", ПривестиБулевоКФорматуJS(Выборка.ЭтоГруппа)));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.Picture       = '%1';", Картинка));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.Description   = '%1';", ВыборкаОписание));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.Price         = '%1';", МинМаксЦена));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.CatalogName   = '%1';", ЗаголовокКаталога));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.SearchingText = '%1';", ТекстДляПоиска));
			СтрокиСкрипта.Добавить(СтрШаблон("CatalogItems[%1] = CatalogItem;", Формат(СчС, "ЧН=; ЧГ=")));
			
			СчС = СчС + 1;
		КонецЦикла;
	Иначе
		
		СтрокиСкрипта.Добавить("CatalogItem = {};");
		СтрокиСкрипта.Добавить(СтрШаблон("CatalogItem.CatalogName = '%1'", ЗаголовокКаталога));
		Если ЗначениеЗаполнено(ТекстДляПоиска)Тогда
			СтрокиСкрипта.Добавить(СтрШаблон(
				"CatalogItem.FindResult = 'По запросу ""%1"" ничего не найдено.';",
				ПолучитьСтрокуТекстаДляJS(ТекстДляПоиска)));
		Иначе
			СтрокиСкрипта.Добавить("CatalogItem.FindResult = '';");
		КонецЕсли;
		СтрокиСкрипта.Добавить("CatalogItem.Name          = 'Пустой заголовок';");
		СтрокиСкрипта.Добавить("CatalogItem.Description   = 'Пустое описание';");
		СтрокиСкрипта.Добавить("CatalogItem.Price         = '0';");
		СтрокиСкрипта.Добавить("CatalogItem.SearchingText = '';");
		СтрокиСкрипта.Добавить("CatalogItems[0] = CatalogItem;");
	КонецЕсли;
	
	Возврат СтрСоединить(СтрокиСкрипта, Символы.ПС);
	
КонецФункции

&НаСервере
Функция ПолучитьСтраницуТовара(ТоварИД, ЭтоСобытиеПодключаемогоОборудования = Ложь)
	
	СтрокиСкрипта = Новый Массив;
	
	Если ФОКиоска.КаталогИзПрайсЛиста
		И Не ЭтоСобытиеПодключаемогоОборудования Тогда
		СсылкаВПрайсЛисте = ПолучитьСсылкуНаСправочник("ПрайсЛист", ТоварИД);
		Товар = СсылкаВПрайсЛисте.Номенклатура;
	Иначе
		Товар = ПолучитьСсылкуНаСправочник("Номенклатура", ТоварИД);
	КонецЕсли;
	
	// Получение скидок на товар.
	СтрокиСкрипта.Добавить("let Actions = [];");
	СтрокиСкрипта.Добавить("let Action = {};");
	
	ТаблицаСкидок = ПолучитьТаблицуАвтоматическихСкидокДляРозничнойТорговли(Товар);
	СчС = 0;
	Для Каждого ТекущиеДанные Из ТаблицаСкидок Цикл
		
		СкидкаНаименование = ПолучитьСтрокуТекстаДляJS(ТекущиеДанные.СкидкаНаценка);
		СкидкаУИД          = ТекущиеДанные.СкидкаНаценка.УникальныйИдентификатор();
		СкидкаДействует    = ?(ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания),
			СтрШаблон(НСтр("ru = 'До %1'"), Формат(ТекущиеДанные.ДатаОкончания, "ДЛФ=ДД")),
			НСтр("ru = 'На постоянной основе'"));
		
		ЗначениеСкидки = "";
		Если ТекущиеДанные.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент Тогда
			ЗначениеСкидки = СтрШаблон(НСтр("ru = '%1 %%.'"), ТекущиеДанные.ЗначениеСкидкиНаценки);
		ИначеЕсли ТекущиеДанные.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
			ЗначениеСкидки = СтрШаблон(НСтр("ru = '%1 р.'"), ТекущиеДанные.ЗначениеСкидкиНаценки);
		ИначеЕсли ТекущиеДанные.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок Тогда
			ЗначениеСкидки = НСтр("ru = 'Подарок'");
		КонецЕсли;
		
		СтрокиСкрипта.Добавить("Action = {};");
		СтрокиСкрипта.Добавить(СтрШаблон("Action.ID    = '%1';", СкидкаУИД));
		СтрокиСкрипта.Добавить(СтрШаблон("Action.Name    = '%1';", СкидкаНаименование));
		СтрокиСкрипта.Добавить(СтрШаблон("Action.Valid    = '%1';", СкидкаДействует));
		СтрокиСкрипта.Добавить(СтрШаблон("Action.Value    = '%1';", ЗначениеСкидки));
		СтрокиСкрипта.Добавить(СтрШаблон("Action.Description = '%1';", ПолучитьСтрокуТекстаДляJS(ТекущиеДанные.Описание)));
		
		СтрокиСкрипта.Добавить(СтрШаблон("Actions[%1] = Action;", Формат(СчС, "ЧН=; ЧГ=")));
		
		СчС = СчС + 1;
	КонецЦикла;
	
	СтрокиСкрипта.Добавить("Item.Actions = Actions;");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = ЗапросЦенИОстатков(Товар);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	// Получение остатков по всем магазинам.
	СтрокиСкрипта.Добавить("let QuantityShops = [];");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОсновныеДанные.ТорговыйОбъект КАК ТорговыйОбъект,
	|	СУММА(ОсновныеДанные.КоличествоОстаток) КАК Количество
	|ИЗ
	|	ОсновныеДанные КАК ОсновныеДанные
	|ГДЕ
	|	НЕ ОсновныеДанные.ТорговыйОбъект = &ТорговыйОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеДанные.ТорговыйОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновныеДанные.ТорговыйОбъект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СчС = 0;
	СтрокиСкрипта.Добавить("let QuantityShop = {};");
	Пока Выборка.Следующий() Цикл
		СтрокиСкрипта.Добавить("QuantityShop = {};");
		
		СтрокиСкрипта.Добавить(СтрШаблон("QuantityShop.ID       = '%1';", Выборка.ТорговыйОбъект.УникальныйИдентификатор()));
		СтрокиСкрипта.Добавить(СтрШаблон("QuantityShop.Name     = '%1';", ПолучитьСтрокуТекстаДляJS(Выборка.ТорговыйОбъект)));
		СтрокиСкрипта.Добавить(СтрШаблон("QuantityShop.Quantity = '%1';", ПривестиЧислоКФорматуJS(Выборка.Количество)));
		
		СтрокиСкрипта.Добавить(СтрШаблон("QuantityShops[%1] = QuantityShop;", Формат(СчС, "ЧН=; ЧГ=")));
		СчС = СчС + 1;
	КонецЦикла;
	СтрокиСкрипта.Добавить("Item.QuantityShops = QuantityShops;");
	
	// Получение данных по характеристикам.
	СтрокиСкрипта.Добавить("let Сharacteristics = [];");
	СтрокиСкрипта.Добавить("let Characteristic = {};");
	
	МинЦена  = 0;
	МаксЦена = 0;
	ВладелецыХарактеристики = ПолучитьВладельцевХарактеристики(Товар);
	ДляТовараХарактеристикиИспользуются = ВладелецыХарактеристики.Количество() > 0;
	Если ДляТовараХарактеристикиИспользуются Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СпрХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ОсновныеДанные.КоличествоОстаток, 0)) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(ОсновныеДанные.Цена, 0)) КАК Цена
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеДанные КАК ОсновныеДанные
		|		ПО СпрХарактеристикиНоменклатуры.Ссылка = ОсновныеДанные.Характеристика
		|			И (ОсновныеДанные.ТорговыйОбъект = &ТорговыйОбъект)
		|ГДЕ
		|	СпрХарактеристикиНоменклатуры.Владелец В (&ВладелецыХарактеристики)
		|
		|СГРУППИРОВАТЬ ПО
		|	СпрХарактеристикиНоменклатуры.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СпрХарактеристикиНоменклатуры.Ссылка";
		
		Запрос.УстановитьПараметр("ВладелецыХарактеристики", ВладелецыХарактеристики);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СчС = 0;
		НоменклатураУИД = Товар.УникальныйИдентификатор();
		Пока Выборка.Следующий() Цикл
			
			ХарактеристикаНаименование = ПолучитьСтрокуТекстаДляJS(Выборка.Характеристика);
			ХарактеристикаУИД          = Выборка.Характеристика.УникальныйИдентификатор();
			ХарактеристикаЦена         = Выборка.Цена;
			
			СтрокиСкрипта.Добавить("Characteristic = {};");
			
			СтрокиСкрипта.Добавить(СтрШаблон("Characteristic.ID       = '%1';", ХарактеристикаУИД));
			СтрокиСкрипта.Добавить(СтрШаблон("Characteristic.IdOwner  = '%1';", НоменклатураУИД));
			СтрокиСкрипта.Добавить(СтрШаблон("Characteristic.Name     = '%1';", ХарактеристикаНаименование));
			СтрокиСкрипта.Добавить(СтрШаблон("Characteristic.Price    = '%1';", ХарактеристикаЦена));
			СтрокиСкрипта.Добавить(СтрШаблон("Characteristic.Quantity = %1;", ПривестиЧислоКФорматуJS(Выборка.Количество)));
			
			СтрокиСкрипта.Добавить(СтрШаблон("Сharacteristics[%1] = Characteristic;", Формат(СчС, "ЧН=; ЧГ=")));
			СчС = СчС + 1;
			
			// Определение макс и мин цены
			Если ХарактеристикаЦена <> 0 Тогда
				Если МинЦена = 0 Тогда
					МинЦена = ХарактеристикаЦена;
				Иначе
					МинЦена = Мин(МинЦена, ХарактеристикаЦена);
				КонецЕсли;
				МаксЦена = Макс(МаксЦена, ХарактеристикаЦена);;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	СтрокиСкрипта.Добавить("Item.Сharacteristics = Сharacteristics;");
	
	// Получение данных по товару.
	Запрос.Текст = ПолучитьТекстЗапросаПоДополнительнымХарактеристикам();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Картинка = ПолучитьКартинкуТовара(Выборка.ФайлКартинки);
		
		СтрокиСкрипта.Добавить(СтрШаблон("Item.ID          = '%1';", Выборка.Ссылка.УникальныйИдентификатор()));
		СтрокиСкрипта.Добавить(СтрШаблон("Item.Name        = '%1';", ПолучитьСтрокуТекстаДляJS(Выборка.Ссылка)));
		СтрокиСкрипта.Добавить(СтрШаблон("Item.Picture     = '%1';", Картинка));
		СтрокиСкрипта.Добавить(СтрШаблон("Item.Description = '%1';", ПолучитьСтрокуТекстаДляJS(Выборка.Описание)));
		
		Если ДляТовараХарактеристикиИспользуются Тогда
			ПодставляемаяЦена = ?(МинЦена = МаксЦена, МинЦена, СтрШаблон("%1 - %2", МинЦена, МаксЦена));
		Иначе
			ПодставляемаяЦена = Выборка.Цена;
		КонецЕсли;
		СтрокиСкрипта.Добавить(СтрШаблон("Item.Price                = '%1';", ПодставляемаяЦена));
		СтрокиСкрипта.Добавить(СтрШаблон("Item.Quantity             = %1;", ПривестиЧислоКФорматуJS(Выборка.Количество)));
		СтрокиСкрипта.Добавить(СтрШаблон("Item.ItIsAGoods           = %1;", ПривестиБулевоКФорматуJS(Выборка.ЭтоТовар)));
		СтрокиСкрипта.Добавить(СтрШаблон("Item.ControlBalancesGoods = %1;", ПривестиБулевоКФорматуJS(КонтролироватьОстаткиТоваров)));
		
		// Дополнительные характеристики.
		СтрокиСкрипта.Добавить(СтрШаблон("Item.DopCharacteristics = '%1';", ПолучитьДополнительныеХарактеристикиТовара(Выборка)));
	КонецЕсли;
	
	Возврат СтрСоединить(СтрокиСкрипта, Символы.ПС);
	
КонецФункции

&НаСервере
Функция ПолучитьСтраницуАкций()
	
	СтрокиСкрипта = Новый Массив;
	СтрокиСкрипта.Добавить("let Action = {};");
	Если ФОКиоска.Акции Тогда
		
		ТаблицаСкидок = ПолучитьТаблицуАвтоматическихСкидокДляРозничнойТорговли();
		
		СчА = 0;
		Для Каждого ТекСтрока Из ТаблицаСкидок Цикл
			СкидкаНаименование = ПолучитьСтрокуТекстаДляJS(ТекСтрока.Наименование);
			
			СкидкаУИД = ТекСтрока.СкидкаНаценка.УникальныйИдентификатор();
			
			СкидкаДействует = ?(ЗначениеЗаполнено(ТекСтрока.ДатаОкончания),
				СтрШаблон(НСтр("ru = 'До %1'"), Формат(ТекСтрока.ДатаОкончания, "ДЛФ=ДД")),
				НСтр("ru = 'На постоянной основе'"));
			
			ЗначениеСкидки = "";
			Если ТекСтрока.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент Тогда
				ЗначениеСкидки = СтрШаблон(НСтр("ru = '%1 %%.'"), ТекСтрока.ЗначениеСкидкиНаценки);
			ИначеЕсли ТекСтрока.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
				ЗначениеСкидки = СтрШаблон(НСтр("ru = '%1 р.'"), ТекСтрока.ЗначениеСкидкиНаценки);
			ИначеЕсли ТекСтрока.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок Тогда
				ЗначениеСкидки = НСтр("ru = 'Подарок'");
			КонецЕсли;
			
			СтрокиСкрипта.Добавить("Action = {};");
			СтрокиСкрипта.Добавить(СтрШаблон("Action.ID    = '%1';", СкидкаУИД));
			СтрокиСкрипта.Добавить(СтрШаблон("Action.Name    = '%1';", СкидкаНаименование));
			СтрокиСкрипта.Добавить(СтрШаблон("Action.Valid    = '%1';", СкидкаДействует));
			СтрокиСкрипта.Добавить(СтрШаблон("Action.Value    = '%1';", ЗначениеСкидки));
			СтрокиСкрипта.Добавить(СтрШаблон("Action.Description = '%1';", ПолучитьСтрокуТекстаДляJS(ТекСтрока.Описание)));
			
			СтрокиСкрипта.Добавить(СтрШаблон("Actions[%1] = Action;", Формат(СчА, "ЧН=; ЧГ=")));
			
			СчА = СчА + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтрСоединить(СтрокиСкрипта, Символы.ПС);
	
КонецФункции

&НаСервере
Функция ПолучитьСтраницуОМагазине()
	
	СтрокиСкрипта = Новый Массив;
	СтрокиСкрипта.Добавить("let ShopsInfo = [];");
	
	ОписаниеЕсть = Ложь;
	Если ФОКиоска.ОМагазине Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Магазин,
		|	ЕСТЬNULL(СтруктурныеЕдиницыКонтактнаяИнформация.Представление, """") КАК ПредставлениеКонтактнойИнформации,
		|	ЕСТЬNULL(СтруктурныеЕдиницыКонтактнаяИнформация.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка)) КАК ТипКонтактнойИнформации,
		|	ВЫБОР
		|		КОГДА СтруктурныеЕдиницы.Ссылка = &ТекущийМагазин
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТекущийМагазинПродажи,
		|	СтруктурныеЕдиницы.Наименование КАК НаименованиеМагазина
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
		|		ПО СтруктурныеЕдиницы.Ссылка = СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка
		|			И (СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|				ИЛИ СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|ГДЕ
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоТекущийМагазинПродажи УБЫВ,
		|	Магазин
		|ИТОГИ
		|	МАКСИМУМ(ЭтоТекущийМагазинПродажи),
		|	МАКСИМУМ(НаименованиеМагазина)
		|ПО
		|	Магазин");
		
		Запрос.УстановитьПараметр("ТекущийМагазин", Объект.ТорговыйОбъект);
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтрокиСкрипта.Добавить("let ShopInfo = {};");
		
		СчС = 0;
		Пока Выборка.Следующий() Цикл
			
			МагазинНаименование = ПолучитьСтрокуТекстаДляJS(Выборка.НаименованиеМагазина);
			Если Выборка.ЭтоТекущийМагазинПродажи Тогда
				СтрокиСкрипта.Добавить(СтрШаблон("AboutShop.Name = '%1';", МагазинНаименование));
				СтрокиСкрипта.Добавить("AboutShop.Logo = 'images\\icons\\logo.png';");
				
				ОписаниеЕсть = Истина;
			КонецЕсли;
			
			СтрокиСкрипта.Добавить("ShopInfo = {};");
			СтрокиСкрипта.Добавить(СтрШаблон("ShopInfo.Name = '%1';", МагазинНаименование));
			СтрокиСкрипта.Добавить(СтрШаблон("ShopInfo.CurrentShop = %1;", ПривестиБулевоКФорматуJS(Выборка.ЭтоТекущийМагазинПродажи)));
			
			ДобавитьДанныеПоГрафикуРаботы(СтрокиСкрипта, Выборка.Магазин);
			
			ВыборкаДетали = Выборка.Выбрать();
			
			АдресМагазина = "";
			ТелефонМагазина = "";
			Пока ВыборкаДетали.Следующий() Цикл
				МагазинКИПредставление = ПолучитьСтрокуТекстаДляJS(ВыборкаДетали.ПредставлениеКонтактнойИнформации);
				
				Если ПустаяСтрока(АдресМагазина)
					И ВыборкаДетали.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
					АдресМагазина = МагазинКИПредставление;
				КонецЕсли;
				
				Если ПустаяСтрока(ТелефонМагазина)
					И ВыборкаДетали.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					ТелефонМагазина = МагазинКИПредставление;
				КонецЕсли;
			КонецЦикла;
			
			СтрокиСкрипта.Добавить(СтрШаблон("ShopInfo.Address = '%1';", АдресМагазина));
			СтрокиСкрипта.Добавить(СтрШаблон("ShopInfo.Telephone = '%1';", ТелефонМагазина));
			
			СтрокиСкрипта.Добавить(СтрШаблон("ShopsInfo[%1] = ShopInfo;", Формат(СчС, "ЧН=; ЧГ=")));
			
			СчС = СчС + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ОписаниеЕсть Тогда
		СтрокиСкрипта.Добавить("AboutShop.Name  = 'Нет заголовка магазина';");
		СтрокиСкрипта.Добавить("AboutShop.Logo = 'images\\icons\\logo.png';");
		СтрокиСкрипта.Добавить("AboutShop.Description = 'Нет описания';");
	КонецЕсли;
	
	СтрокиСкрипта.Добавить("AboutShop.ShopsInfo = ShopsInfo;");
	
	Возврат СтрСоединить(СтрокиСкрипта, Символы.ПС);
	
КонецФункции

&НаСервере
Процедура ДобавитьДанныеПоГрафикуРаботы(СтрокиСкрипта, СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГрафикиРаботыСтруктурныхЕдиниц.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ГрафикиРаботы
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыСтруктурныхЕдиниц КАК ГрафикиРаботыСтруктурныхЕдиниц
	|ГДЕ
	|	ГрафикиРаботыСтруктурныхЕдиниц.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ ГрафикиРаботыСтруктурныхЕдиниц.ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|	И ГОД(ГрафикиРаботыСтруктурныхЕдиниц.Период) = &НомерГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиРаботыРасписаниеРаботы.НомерДняЦикла КАК НомерДня,
	|	ГрафикиРаботыРасписаниеРаботы.ВремяНачала КАК ВремяНачала,
	|	ГрафикиРаботыРасписаниеРаботы.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	ГрафикиРаботы КАК ГрафикиРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботы.РасписаниеРаботы КАК ГрафикиРаботыРасписаниеРаботы
	|		ПО ГрафикиРаботы.ГрафикРаботы = ГрафикиРаботыРасписаниеРаботы.Ссылка
	|ГДЕ
	|	ГрафикиРаботыРасписаниеРаботы.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДняЦикла";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НомерГода", Год(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ТекущаяДатаСеанса()));
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаПоВремени = ТаблицаДанных.Скопировать(, "ВремяНачала, ВремяОкончания");
	ТаблицаПоВремени.Свернуть("ВремяНачала, ВремяОкончания");
	
	СписокИменДней = Новый Массив;
	СписокИменДней.Добавить(НСтр("ru = 'пн'"));
	СписокИменДней.Добавить(НСтр("ru = 'вт'"));
	СписокИменДней.Добавить(НСтр("ru = 'ср'"));
	СписокИменДней.Добавить(НСтр("ru = 'чт'"));
	СписокИменДней.Добавить(НСтр("ru = 'пт'"));
	СписокИменДней.Добавить(НСтр("ru = 'сб'"));
	СписокИменДней.Добавить(НСтр("ru = 'вс'"));
	
	СтрокаВремяРаботы = "";
	Для Каждого ТекущееВремя Из ТаблицаПоВремени Цикл
		
		ВремяРаботы = СтрШаблон("%1-%2", Формат(ТекущееВремя.ВремяНачала, "ДФ=""ЧЧ:мм"""), Формат(ТекущееВремя.ВремяОкончания, "ДФ=""ЧЧ:мм"""));
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ВремяНачала", ТекущееВремя.ВремяНачала);
		СтруктураОтбора.Вставить("ВремяОкончания", ТекущееВремя.ВремяОкончания);
		НайденныеСтроки = ТаблицаДанных.НайтиСтроки(СтруктураОтбора);
		
		СписокДней = Новый Массив;
		ПервыйДеньИнтервала = -1;
		ПоследнийДеньИнтервала = -1;
		Для Каждого ТекущиеДанные Из НайденныеСтроки Цикл
			
			ТекущийНомерДня = ТекущиеДанные.НомерДня - 1;
			
			Если ПервыйДеньИнтервала = -1 Тогда
				ПервыйДеньИнтервала = ТекущийНомерДня;
			КонецЕсли;
			Если ПоследнийДеньИнтервала = -1 Тогда
				ПоследнийДеньИнтервала = ТекущийНомерДня;
			КонецЕсли;
			
			// Строки упорядочены по номеру дня, так что ситуаций
			// когда Текущий номер дня больше Первого дня интервала не должно быть.
			Если ТекущийНомерДня <= ПоследнийДеньИнтервала Тогда
				Продолжить;
			ИначеЕсли ТекущийНомерДня = ПоследнийДеньИнтервала + 1 Тогда
				ПоследнийДеньИнтервала = ТекущийНомерДня;
				Продолжить;
			Иначе
				Если ПервыйДеньИнтервала = ПоследнийДеньИнтервала Тогда
					СписокДней.Добавить(СписокИменДней[ПервыйДеньИнтервала]);
				ИначеЕсли ПервыйДеньИнтервала + 1 = ПоследнийДеньИнтервала Тогда
					// Если это два последовательных дня, то нет смысла записывать их как интервал.
					СписокДней.Добавить(СписокИменДней[ПервыйДеньИнтервала]);
					СписокДней.Добавить(СписокИменДней[ПоследнийДеньИнтервала]);
				Иначе
					СписокДней.Добавить(СтрШаблон("%1-%2", СписокИменДней[ПервыйДеньИнтервала], СписокИменДней[ПоследнийДеньИнтервала]));
				КонецЕсли;
				ПервыйДеньИнтервала    = ТекущийНомерДня;
				ПоследнийДеньИнтервала = ТекущийНомерДня;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаВремяРаботы ="<b>" + СтрСоединить(СписокДней, ", ") + ": </b></br>" + ВремяРаботы;
		
	КонецЦикла;
	
	СтрокиСкрипта.Добавить(СтрШаблон("ShopInfo.OperatingTime = '%1';", СтрокаВремяРаботы));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтраницуИнформацияПоДисконту(ДисконтнаяКарта = Неопределено)
	
	СтрокиДисконта = Новый Массив;
	ДобавитьЗаглушку = Истина;
	
	Если ФОКиоска.ИнформацияПоКарте
		И ДисконтнаяКарта <> Неопределено Тогда
		
		ЗапросПоДисконту = Новый Запрос;
		
		ЗапросПоДисконту.Текст = "ВЫБРАТЬ
		|	ДисконтныеКарты.КодКартыШтрихкод КАК КодКартыШтрихкод,
		|	ДисконтныеКарты.КодКартыМагнитный КАК КодКартыМагнитный,
		|	ДисконтныеКарты.ВладелецКарты КАК ВладелецКарты,
		|	ДисконтныеКарты.Владелец КАК ВидДисконтнойКарты,
		|	ЕСТЬNULL(ПродажиПоКартамОбороты.СуммаОборот, 0) КАК СуммаНакопления
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(, , , ДисконтнаяКарта = &ДисконтнаяКарта) КАК ПродажиПоКартамОбороты
		|		ПО ДисконтныеКарты.Ссылка = ПродажиПоКартамОбороты.ДисконтнаяКарта
		|ГДЕ
		|	ДисконтныеКарты.Ссылка = &ДисконтнаяКарта";
		
		ЗапросПоДисконту.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
		
		Результат = ЗапросПоДисконту.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ВладелецКарты = ПолучитьСтрокуТекстаДляJS(Выборка.ВладелецКарты);
			КодКарты      = ?(ПустаяСтрока(Выборка.КодКартыМагнитный), Выборка.КодКартыШтрихкод, Выборка.КодКартыМагнитный);
			ВидКарты      = ПолучитьСтрокуТекстаДляJS(Выборка.ВидДисконтнойКарты);
			
			СтруктураСкидки = ПолучитьПроцентСкидкиПоДисконтнойКарте();
			
			СтрокиОписанийСкидки = Новый Массив;
			СтрокиОписанийСкидки.Добавить(НСтр("ru = 'В зависимости от проходящих в магазине акций и условий предоставления скидок.'"));
			Если ЗначениеЗаполнено(СтруктураСкидки.СуммаСкидки) Тогда
				СтрокиОписанийСкидки.Добавить(СтрШаблон(НСтр("ru  = 'В денежном выражении %1'"), СтруктураСкидки.СуммаСкидки));
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураСкидки.ПроцентСкидки) Тогда
				СтрокиОписанийСкидки.Добавить(СтрШаблон(НСтр("ru  = 'В процентах %1'"), СтруктураСкидки.ПроцентСкидки));
			КонецЕсли;
			
			ПредоставляемаяСкидка = "";
			Если СтрокиОписанийСкидки.Количество() > 1 Тогда
				ПредоставляемаяСкидка = СтрСоединить(СтрокиОписанийСкидки, Символы.ПС);
			КонецЕсли;
			
			СуммаНакопления = СтрШаблон(НСтр("ru  = 'За весь период %1 р.'"), Выборка.СуммаНакопления);
			
			СтрокиДисконта.Добавить(СтрШаблон("CardInfo.CardHolder = '%1';", ВладелецКарты));
			СтрокиДисконта.Добавить(СтрШаблон("CardInfo.CardCode = '%1';", КодКарты));
			СтрокиДисконта.Добавить(СтрШаблон("CardInfo.CardType = '%1';", ВидКарты));
			СтрокиДисконта.Добавить(СтрШаблон("CardInfo.Discount = '%1';", ПредоставляемаяСкидка));
			СтрокиДисконта.Добавить(СтрШаблон("CardInfo.AccumulatingSum = '%1';", СуммаНакопления));
			
			ДобавитьЗаглушку = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДобавитьЗаглушку Тогда
		СтрокиДисконта.Добавить("CardInfo.CardHolder = '';");
		СтрокиДисконта.Добавить("CardInfo.CardCode = '';");
		СтрокиДисконта.Добавить("CardInfo.CardType = '';");
		СтрокиДисконта.Добавить("CardInfo.Discount = '';");
		СтрокиДисконта.Добавить("CardInfo.AccumulatingSum = '';");
	КонецЕсли;
	
	Возврат СтрСоединить(СтрокиДисконта, Символы.ПС);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭкранироватьСимволы(Знач Строка)
	Результат = СтрЗаменить(Строка, Символы.ПС, " ");
	Результат = СтрЗаменить(Результат, """", "\""");
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьКартинкуТовара(ФайлКартинки)
	
	ДанныеФайла = РаботаСФайлами.ХранилищеФайлаИзИнформационнойБазы(ФайлКартинки);
	Если ДанныеФайла <> Неопределено Тогда
		Картинка = "data:image/" + ФайлКартинки.Расширение + ";base64,"
		+ СтрЗаменить(ПолучитьBase64СтрокуИзДвоичныхДанных(ДанныеФайла.Получить()),
			Символы.ВК + Символы.ПС, "");
	Иначе
		лПутьККиоску = СтрЗаменить(ПутьККиоску, "\", "\\");
		Картинка = "images\\icons\\goods-no-image.png";
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

&НаКлиенте
Функция ПолеHTMLВводДоступен()
	Возврат Элементы.ИнфоКиоск.Документ.hasFocus();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

СписокСтраниц = Новый СписокЗначений();
СписокСтраниц.Добавить("about:blank");
СписокСтраниц.Добавить("main.html");
СписокСтраниц.Добавить("catalog.html");
СписокСтраниц.Добавить("catalog-detail.html");
СписокСтраниц.Добавить("action.html");
СписокСтраниц.Добавить("action-detail.html");
СписокСтраниц.Добавить("basket.html");
СписокСтраниц.Добавить("error.html");
СписокСтраниц.Добавить("search.html");
СписокСтраниц.Добавить("about.html");
СписокСтраниц.Добавить("cardinfo.html");
СписокСтраниц.Добавить("search-code.html");
СписокСтраниц.Добавить("data-transfer.html");
СписокСтраниц.Добавить("terminal-not-work.html");
СписокСтраниц.Добавить("data-transfer-without.html");

стекПереходов = Новый СписокЗначений;

ОбработатьСобытиеПодключаемогоОборудования = "";

резНажатияНавигации = Новый Структура();
резНажатияНавигации.Вставить("ИдентификаторОбработки", "");

Корзина = Новый Массив;

#КонецОбласти