#Область ПрограммныйИнтерфейс

&После("ЗаполнитьОбщиеПараметрыЧекаКоррекцииПоДаннымФискальнойОперации")
Процедура эв_ЗаполнитьОбщиеПараметрыЧекаКоррекцииПоДаннымФискальнойОперации(ОбщиеПараметры, ФискальнаяОперация)
	
	эв_ЗаполнитьСистемуНалогообложенияЧекаКоррекции(ОбщиеПараметры, ФискальнаяОперация.ДокументОснование);
	
КонецПроцедуры

&ИзменениеИКонтроль("ЧекКоррекцииСторно")
Процедура эв_ЧекКоррекцииСторно(Контекст, РезультатЧекСторно)
	
	ЧекОбъект = Документы.ЧекККМКоррекции.СоздатьДокумент();
	ЧекОбъект.Дата = ТекущаяДатаСеанса();
	ЧекОбъект.ЭтоСторно = Истина;
	
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройства.ЗагрузитьДанныеФискализацииИзXML(
		Контекст.ДанныеXMLКорректируемогоЧека);
	#Вставка
	Если (ТипЗнч(Контекст.ДокументОснование) = Тип("ДокументСсылка.ЧекККМ")
		Или ТипЗнч(Контекст.ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат"))
		И ЗначениеЗаполнено(ОбщиеПараметры)
		И Не ЗначениеЗаполнено(ОбщиеПараметры.СистемаНалогообложения) Тогда
		ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	КонецЕсли;
	#КонецВставки
	
	ЗаполнитьЗначенияСвойств(
		ЧекОбъект,
		Контекст,
		"ДатаКоррекции,
		|ДокументОснование,
		|ДокументРасчетов, 
		|ДополнительныйРеквизит,
		|КассаККМ,
		|СтруктурнаяЕдиница,
		|НомерПредписания,
		|ОписаниеКоррекции,
		|Организация,
		|Ответственный,
		|ТипКоррекции,
		|Комментарий,
		|Кассир,
		|КассирИНН");
	
	ЗаполнитьЗначенияСвойств(
		ЧекОбъект,
		ОбщиеПараметры,
		"АдресМагазина,
		|АдресРасчетов,
		|ПокупательEmail,
		|ПокупательНомер,
		|МестоРасчетов,
		|ПризнакАгента,
		|СистемаНалогообложения,
		|ЧасоваяЗона");
	
	ЧекОбъект.РасчетВИнтернете = ОбщиеПараметры.Интернет;
	
	Если ЗначениеЗаполнено(ОбщиеПараметры.Получатель) Тогда
		ЧекОбъект.Покупатель = ОбщиеПараметры.Получатель;
	Иначе
		ЧекОбъект.Покупатель = ОбщиеПараметры.СведенияОПокупателе.Покупатель;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбщиеПараметры.ПолучательИНН) Тогда
		ЧекОбъект.ПокупательИНН = ОбщиеПараметры.ПолучательИНН;
	Иначе
		ЧекОбъект.ПокупательИНН = ОбщиеПараметры.СведенияОПокупателе.ПокупательИНН;
	КонецЕсли;
	
	Если ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
		ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
	ИначеЕсли ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда
		ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ИначеЕсли ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств Тогда
		ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств;
	ИначеЕсли ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств Тогда
		ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
	Иначе
		ТипРасчета = Неопределено;
	КонецЕсли;
	
	ЧекОбъект.ТипРасчета = ТипРасчета;
	
	// Позиции чека
	ЗаполнитьПозицииЧекаКоррекцииНаОсновании(Контекст.ДокументОснование, ОбщиеПараметры, ЧекОбъект.ПозицииЧека);
	
	// Оплаты
	Для Каждого СтрокаОплаты Из ОбщиеПараметры.ТаблицаОплат Цикл
		
		НоваяСтрока = ЧекОбъект.Оплата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);
		
	КонецЦикла;
	
	// Запись чека
	Попытка
		ЧекОбъект.Записать(РежимЗаписиДокумента.Запись);
		РезультатЧекСторно = ЧекОбъект.Ссылка;
	Исключение
		СтрокаОшибки = НСтр("ru = 'Не удалось записать чек коррекции сторно по причине:'") + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки);
		РезультатЧекСторно = Неопределено;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура эв_ЗаполнитьСистемуНалогообложенияЧекаКоррекции(ОбщиеПараметры, ДокументОснование)
	
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ЧекККМ")
		И ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбщиеПараметры)
		Или ЗначениеЗаполнено(ОбщиеПараметры.СистемаНалогообложения) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	
КонецПроцедуры

#КонецОбласти
