
#Область ПрограммныйИнтерфейс

// См. ТранспортМДЛП.ДоступныеТранспортныеМодули.
Функция ДоступныеТранспортныеМодули(Знач Отбор = Неопределено) Экспорт
	
	Возврат ТранспортМДЛП.ДоступныеТранспортныеМодули(Отбор);
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Знач ТранспортныйМодуль, Знач ДанныеЗапроса) Экспорт
	
	Возврат ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ТранспортныйМодуль, ДанныеЗапроса);
	
КонецФункции

Функция ПреобразоватьЗначениеВJSON(Значение, НастройкиСериализации = Неопределено, УдалитьПробелыИПереносыСтрок = Ложь) Экспорт
	
	Возврат ТранспортМДЛПКлиентСервер.ПреобразоватьЗначениеВJSON(Значение, НастройкиСериализации, УдалитьПробелыИПереносыСтрок);
	
КонецФункции

Функция ПреобразоватьJSONВЗначение(Строка, ПрочитатьВСоответствие = Истина, ИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	
	Возврат ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(Строка, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
КонецФункции

#КонецОбласти
