
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет установку дополнительных параметров загрузки.
//
Функция УстановитьДополнительныеПараметрыЗагрузки(ЭтаФорма, Объект = Неопределено, Результат = Неопределено) Экспорт
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаНастройкиДополнительныхПараметров";
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТаблицаДополнительныхПараметров", ЭтаФорма.ТаблицаДополнительныхПараметров);
	ПараметрыФормы.Вставить("ВсегдаФормироватьНовыеСерии",     ?(Объект <> Неопределено, Объект.ВсегдаФормироватьНовыеСерии,ЭтаФорма.ВсегдаФормироватьНовыеСерии));
	ПараметрыФормы.Вставить("СоздаватьСтрануПроисхождения",    ?(Объект <> Неопределено, Объект.СоздаватьСтрануПроисхождения,ЭтаФорма.СоздаватьСтрануПроисхождения));
	
	ПараметрыФормы.Вставить("ЗагружатьGTINДляСерии", ?(Объект <> Неопределено, Объект.ЗагружатьGTINДляСерии,ЭтаФорма.ЗагружатьGTINДляСерии));
	
	ПараметрыФормы.Вставить("СоздаватьПроизводителя",     ?(Объект <> Неопределено, Объект.СоздаватьПроизводителя,ЭтаФорма.СоздаватьПроизводителя));
	ПараметрыФормы.Вставить("ФорматДатыСрокаГодности",    ?(Объект <> Неопределено, Объект.ФорматДатыСрокаГодности,ЭтаФорма.ФорматДатыСрокаГодности));
	ПараметрыФормы.Вставить("НеФормироватьДопНомерСерии", ?(Объект <> Неопределено, Объект.НеФормироватьДопНомерСерии,ЭтаФорма.НеФормироватьДопНомерСерии));
	ПараметрыФормы.Вставить("ЗагружатьШК",                ?(Объект <> Неопределено, Объект.ЗагружатьШК,ЭтаФорма.ЗагружатьШК));
	
	ПараметрыФормы.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры",?(Объект <> Неопределено, Объект.ШКЯвляетсяПолемПоискаНоменклатуры,ЭтаФорма.ШКЯвляетсяПолемПоискаНоменклатуры));
	ПараметрыФормы.Вставить("СоздаватьОбщиеХарактеристики",?(Объект <> Неопределено, Объект.СоздаватьОбщиеХарактеристики,ЭтаФорма.СоздаватьОбщиеХарактеристики));
	Попытка
		ПараметрыФормы.Вставить("ОтображениеТабличногоДокумента",  ЭтаФорма.ОтображениеТабличногоДокумента);
	Исключение
		Попытка
			ПараметрыФормы.Вставить("ОтображениеТабличногоДокумента", ЭтаФорма.ОтображениеНастроекЗагрузки);
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	Попытка
		ПараметрыФормы.Вставить("ТабличныйДокумент", ?(Объект = Неопределено,ЭтаФорма.ТабличныйДокумент, Объект.ТабличныйДокумент));
	Исключение
	КонецПопытки;
	
	ЗагрузкаВСправочникНоменклатура = Ложь;
	Попытка
		Если Объект = Неопределено Тогда
			ЗагрузкаВСправочникНоменклатура = ЭтаФорма.ЭтоЗагрузкаВСправочникНоменклатура;
		Иначе
			ЗагрузкаВСправочникНоменклатура = Объект.РежимЗагрузки = 0 И Объект.СсылкаИсточника<>Неопределено И ТипЗнч(Объект.СсылкаИсточника) = Тип("СправочникСсылка.Номенклатура");
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ПараметрыФормы.Вставить("ЭтоЗагрузкаВСправочникНоменклатура", ЗагрузкаВСправочникНоменклатура);
	СтруктураВозврата = Новый Структура ("ПараметрыФормы,ФормаИмя", ПараметрыФормы, ФормаИмя);
	Возврат СтруктураВозврата;
	
КонецФункции

// Процедура выполняет вычисление номера колонки "цена" в таблице загружаемых реквизитов.
//
Функция ПолучитьНомерКолонкиЦена(ЭтаФорма) Экспорт
	НомерКолонкиЦена = 0;
	Попытка
		СтрокаНастройки = Неопределено;
		ОтборСтрок = Новый Структура("ИмяРеквизита","Цена");
		Строки = ЭтаФорма.ТаблицаДополнительныхПараметров.НайтиСтроки(ОтборСтрок);
		Если Строки.Количество() > 0 Тогда
			НомерКолонкиЦена = Строки[0].НомерКолонки;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если НомерКолонкиЦена<>0 Тогда
		Возврат НомерКолонкиЦена;
	КонецЕсли;
	
	Попытка
		СтрокаНастройки = Неопределено;
		ОтборСтрок = Новый Структура("ИмяРеквизита","Цена");
		Строки = ЭтаФорма.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
		Если Строки.Количество() > 0 Тогда
			НомерКолонкиЦена = Строки[0].НомерКолонки;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат НомерКолонкиЦена;
КонецФункции

// Процедура устанавливает видимость кнопки открытия формы дополнительных параметров.
//
Процедура ОтработатьВидимостьКнопкиДопПараметров(Элементы,РежимЗагрузки, СсылкаИсточника) Экспорт
	Элементы.ТаблицаЗагружаемыхРеквизитовДополнительныеПараметрыЗагрузки.Доступность = (РежимЗагрузки = 3 ИЛИ (ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЧтоЭтоДокумент(СсылкаИсточника) И (РежимЗагрузки = 1))) ИЛИ (РежимЗагрузки = 0 И СсылкаИсточника<>Неопределено И ТипЗнч(СсылкаИсточника) = Тип("СправочникСсылка.Номенклатура"));
КонецПроцедуры

// Процедура устанавливает отбор прайс-листа.
//
Процедура УстановитьОтборПрайсаПоМониторингу(Список) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"ПрайсЛистДляМониторингаЦен",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

// Процедура настраивает видимость элементов формы помощника загрузки данных из табличного документа.
//
Процедура НастроитьВидимостьЭлементовФормыПомощника(СтрокаНастройкиЗагрузкиНоменклатуры, Элементы, НастройкиЗагрузкиНоменклатурыИскатьПо) Экспорт
	
КонецПроцедуры

#КонецОбласти