
&ИзменениеИКонтроль("ПробитьЧек")
&НаКлиенте
Процедура эв_ПробитьЧек()
	
	Если ЗначениеЗаполнено(Объект.ЧекСторно)
		И Не Объект.ЧекСторноПробит Тогда
		
		ЧекКПробитию = Объект.ЧекСторно;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ЧекСкорректированный)
		И Не Объект.ЧекСкорректированныйПробит Тогда
		
		ЧекКПробитию = Объект.ЧекСкорректированный;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	#Вставка
	Если эв_КассаБезПодключенияОборудования(Объект.КассаККМ) Тогда
		ТекстСообщения = эв_ПоставитьЧекКоррекцииВОчередь(ЧекКПробитию);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Элементы.ФормаСоздатьЧеки.Доступность = Истина;
		Возврат;
	КонецЕсли;
	#КонецВставки
	ИдентификаторУстройства = ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "ПодключаемоеОборудование");
	
	ОбщиеПараметры = ДанныеДляПробитияЧекаКоррекции(ЧекКПробитию, ИдентификаторУстройства);
	
	Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") Тогда
		
		ОбщиеПараметры.Вставить("СформироватьЧекКоррекцииСторно", Ложь);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбщиеПараметры",            ОбщиеПараметры);
		ДополнительныеПараметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(
			Оповещение,
			ЭтотОбъект.УникальныйИдентификатор,
			ИдентификаторУстройства,
			ОбщиеПараметры);
		
	Иначе
		
		Элементы.ФормаСоздатьЧеки.Доступность = Истина;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось определить параметры для пробития чека коррекции ""%1""'"),
			Строка(ЧекКПробитию));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция эв_КассаБезПодключенияОборудования(КассаККМ)
	
	Если Не ЗначениеЗаполнено(КассаККМ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		КассаККМ, "ИспользоватьБезПодключенияОборудования") = Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция эв_ПоставитьЧекКоррекцииВОчередь(ЧекКоррекции)
	
	Возврат эв_РаспределеннаяФискализация.эв_ПоставитьЧекКоррекцииБезОборудованияВОчередь(ЧекКоррекции);
	
КонецФункции
