///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Регистрируем событие
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.КонтактыСлужбыПоддержки");
	
	// Заполним список контактной информации
	Контакты     = Новый Массив();
	Сайты        = Новый Массив();
	ГрафикРаботы = "";
	пр_ПоддержкаОтраслевыхРешенийПереопределяемый.ПриПолученииКонтактовСлужбыПоддержки(ГрафикРаботы, Контакты, Сайты);
	
	// Выводим график работы
	Если ПустаяСтрока(ГрафикРаботы) Тогда
		ЭтотОбъект.Элементы.ГрафикРаботы.Видимость = Ложь;
	Иначе
		ЭтотОбъект.Элементы.ГрафикРаботы.Заголовок = ГрафикРаботы;
	КонецЕсли;
	
	// Созданим элементы контактной информации
	СоздатьЭлементыКонтактнойИнформации(Контакты, Сайты);
	
	// Проверяем регистрационную информацию
	ЕстьРегистрационнаяАнкета = Метаданные.НайтиПоПолномуИмени(ЭтотОбъект.ИмяФормы).Родитель().Формы.Найти("РегистрационнаяАнкета")<>Неопределено;
	ЕстьРегистрационныеДанные = пр_ПоддержкаОтраслевыхРешений.РегистрационныеДанныеЗаполнены(ЭтотОбъект.РегНомер, ЭтотОбъект.ИНН);
	ЭтотОбъект.Элементы.ГруппаРегистрацияПродукта.Видимость = ЕстьРегистрационнаяАнкета И (НЕ ЕстьРегистрационныеДанные);
	ЭтотОбъект.Элементы.РегНомер.Видимость = НЕ ЭтотОбъект.Элементы.ГруппаРегистрацияПродукта.Видимость;
	ЭтотОбъект.Элементы.ИНН     .Видимость = НЕ ЭтотОбъект.Элементы.ГруппаРегистрацияПродукта.Видимость;
	
	// Производим сбор и вывод сведений о программе и системе
	ЗаполнитьСведенияОПрограммеНаСервере();
	
	// Скрываем избыточные сведения с формы
	Элементы.СведенияОПродуктеСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Элементы.СтраницаПодробныеСведения.Видимость          = ЛОЖЬ;
	Элементы.СтраницаОборудование     .Видимость          = ЛОЖЬ;
	
	// Возможность управлять идентификатором и служебными командами есть только у админа
	ЭтотОбъект.Элементы.ВерсияПродуктаКонтекстноеМенюГруппа.Видимость = РольДоступна("ПолныеПрава");
	
	// Вызываем переопределяемый обработчик события
	пр_ПоддержкаОтраслевыхРешенийСлужебный.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеИдентификатораЦентрМониторинга" И Параметр <> Неопределено Тогда
		ЭтотОбъект.ИдентификаторБазы = ПолучитьИдентификаторИнформационнойБазы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗапуститьСеансПодключенияКонсультанта(Команда)
	
	// Проверим возможность запуска приложения
	Если НЕ ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		
		ТекстВопроса = НСтр("ru = 'Втроенная программа удаленного подключения может быть запущена только в ОС Windows.
		                          |Перейти на страницу производителя для скачивания нужной версии?'");
		
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "RarusDesk");
		Если Ответ<>КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		СтраницаRarusDeskНажатие(Неопределено);
		Возврат;
		
	КонецЕсли;
	
	// Производим подключение расширения для работы с файлами
	Подключено = Ждать ПодключитьРасширениеРаботыСФайламиАсинх();
	Если НЕ Подключено Тогда
		Ждать УстановитьРасширениеРаботыСФайламиАсинх();
		ТекстСообщения = НСтр("ru = 'Необходимо установить расширение для работы с файлами.
		                            |Повторите команду запуска после установки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Определим каталог программы и имя файла
	КаталогПрограммы = Ждать КаталогВременныхФайловАсинх();
	ИмяМакета        = "RarusDesk";
	ИмяФайла         = СтрШаблон("%1%2%3.exe", КаталогПрограммы, ИмяМакета, Формат(ТекущаяДата(),"ДФ=yyyyММdd_ЧЧммсс"));
	
	// Получаем данные программы из макета
	Состояние(НСтр("ru='Получение файла запуска на сервере'"), 0);
	АдресДанных = ПолучитьДвоичныеДанныеПрограммыRarusDesk(ИмяМакета, ЭтотОбъект.УникальныйИдентификатор);
	
	// Записываем программу на копьютер клиента и запускаем
	Попытка
		Состояние(НСтр("ru='Сохранение файла запуска на клиенте'"),50);
		ДанныеПрограммы = ПолучитьИзВременногоХранилища(АдресДанных);
		Ждать ДанныеПрограммы.ЗаписатьАсинх(ИмяФайла);
		
		Состояние(НСтр("ru='Начало запуска файла'"),98);
		Ждать ЗапуститьПриложениеАсинх(ИмяФайла, КаталогПрограммы, ИСТИНА);
	Исключение
		пр_ПоддержкаОтраслевыхРешений.ОбработатьОшибку(ИнформацияОбОшибке(), "RarusDesk");
	КонецПопытки;
	
КонецПроцедуры // ЗапуститьСеансПодключенияКонсультанта()

&НаКлиенте
Процедура СтраницаRarusDeskНажатие(Элемент)
	
	Попытка
		ПерейтиПоНавигационнойСсылке(Элементы.СтраницаRarusDesk.Подсказка);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Ошибка перехода по адресу производителя'"));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура РегНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗарегистрироватьПродукт(Неопределено);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРегистрацииПродукта(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Элементы.ГруппаРегистрацияПродукта.Видимость = НЕ РегистрационныеДанныеЗаполнены(ЭтотОбъект.РегНомер, ЭтотОбъект.ИНН);
	ЭтотОбъект.Элементы.РегНомер.Видимость = НЕ ЭтотОбъект.Элементы.ГруппаРегистрацияПродукта.Видимость;
	ЭтотОбъект.Элементы.ИНН     .Видимость = НЕ ЭтотОбъект.Элементы.ГруппаРегистрацияПродукта.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьПродукт(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеРегистрацииПродукта", ЭтотОбъект);
	ОткрытьФорму("Обработка.пр_ПоддержкаОтраслевыхРешений.Форма.РегистрационнаяАнкета",,,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СайтНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ПослеСайтНажатие", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, Элемент.Заголовок);
	
КонецПроцедуры

&НаСервере
Функция СохранитьПакетНаСервере(Ошибка=ЛОЖЬ)
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	ПараметрыЦентраМониторинга = Новый Структура();
	ПараметрыЦентраМониторинга.Вставить("ИдентификаторИнформационнойБазы");
	ПараметрыЦентраМониторинга.Вставить("ДатаКрайнегоПакета");
	ПараметрыЦентраМониторинга.Вставить("НомерКрайнегоПакета");
	ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
	
	// Производим настройку параметров подсистемы
	пр_ПоддержкаОтраслевыхРешений.ВключитьОтправкуСтатистики(ИСТИНА, ИСТИНА, "127.0.0.-1");
	
	// Инициализируем ключевые параметры клиента
	пр_ПоддержкаОтраслевыхРешений.ОбновитьПараметрыПоДаннымСеанса(ИСТИНА);
	
	РаботаСВнешнимиРесурсамиЗаблокирована = ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована;
	ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = ЛОЖЬ;
	
	Попытка
		ЦентрМониторингаСлужебный.ЦентрМониторингаРегламентноеЗадание();
	Исключение
		Причина = ИнформацияОбОшибке();
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(Причина),,,, Ошибка);
	КонецПопытки;
	
	ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = РаботаСВнешнимиРесурсамиЗаблокирована;
	
	пр_ПоддержкаОтраслевыхРешений.ВключитьОтправкуСтатистики();
	
	НомерПакетаДоФормирования = ПараметрыЦентраМониторинга.НомерКрайнегоПакета;
	ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
	
	Ошибка = Ошибка ИЛИ (НомерПакетаДоФормирования=ПараметрыЦентраМониторинга.НомерКрайнегоПакета);
	
	Если Ошибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пакет = РегистрыСведений.ПакетыДляОтправки.ПолучитьПакет(ПараметрыЦентраМониторинга.НомерКрайнегоПакета);
	Если Пакет=Неопределено Тогда
		Ошибка = ИСТИНА;
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяФайла = Строка(ПараметрыЦентраМониторинга.ИдентификаторИнформационнойБазы) + "-null-" + Формат(ПараметрыЦентраМониторинга.ДатаКрайнегоПакета, "ДФ='гггг-ММ-ддTЧЧ-мм-сс'") + ".json";
	Пакет.Вставить("ИмяФайла", ИмяФайла);
	Пакет.Вставить("Длина",    СтрДлина(Пакет.ТелоПакета));
	
	ПакетАдрес = ПоместитьВоВременноеХранилище(Пакет, ЭтотОбъект.УникальныйИдентификатор);
	Возврат ПакетАдрес;
	
КонецФункции // СохранитьПакетНаСервере()

&НаКлиенте
Процедура СохранитьПакет(Команда, Ошибка=ЛОЖЬ)
	
	// Выполняем обработку на сервере
	ПакетАдрес = СохранитьПакетНаСервере(Ошибка);
	
	Если Ошибка ИЛИ ПакетАдрес=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пакет = ПолучитьИзВременногоХранилища(ПакетАдрес);
	Если Пакет=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла     = Пакет.ИмяФайла;
	Диалог.Фильтр             = НСтр("ru = 'Пакет статистики (*.json)'") + Символы.ПС + "*.json";
	Диалог.Заголовок          = НСтр("ru = 'Сохранение пакета статистики'");
	Диалог.МножественныйВыбор = ЛОЖЬ;
	
	Диалог.Показать(Новый ОписаниеОповещения("Подключаемый_СохранитьПакетЗавершение", ЭтотОбъект, Пакет));
	
КонецПроцедуры // СохранитьПакет()

&НаСервере
Процедура ОтправитьПакетНаСервере(Ошибка=ЛОЖЬ)
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	// Производим настройку параметров подсистемы
	пр_ПоддержкаОтраслевыхРешений.ВключитьОтправкуСтатистики(ИСТИНА, ИСТИНА);
	
	// Инициализируем ключевые параметры клиента
	пр_ПоддержкаОтраслевыхРешений.ОбновитьПараметрыПоДаннымСеанса(ИСТИНА);
	
	РаботаСВнешнимиРесурсамиЗаблокирована = ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована;
	ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = ЛОЖЬ;
	
	Попытка
		ЦентрМониторингаСлужебный.ЦентрМониторингаРегламентноеЗадание();
	Исключение
		Причина = ИнформацияОбОшибке();
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(Причина),,,, Ошибка);
	КонецПопытки;
	
	ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = РаботаСВнешнимиРесурсамиЗаблокирована;
	
КонецПроцедуры // ОтправитьПакетНаСервере()

&НаКлиенте
Процедура ОтправитьПакет(Команда, Ошибка=ЛОЖЬ)
	
	// Выполняем обработку на сервере
	ОтправитьПакетНаСервере(Ошибка);
	
КонецПроцедуры // ОтправитьПакет()

&НаКлиенте
Процедура ПодробныеСведения(Команда)
	
	Элементы.СведенияОПродуктеСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Авто;
	Элементы.СтраницаПодробныеСведения.Видимость          = ИСТИНА;
	Элементы.СтраницаОборудование     .Видимость          = ИСТИНА;
	
	Элементы.ДополнительныеКоманды.Объединенная = ЛОЖЬ;
	Элементы.ПодробныеСведения    .Видимость    = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторБазыОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьФорму("Обработка.НастройкиЦентраМониторинга.Форма.НастройкиЦентраМониторинга",, ЭтотОбъект);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьИнформациюОПродукте(Команда)
	
	ТехническиеСведения = Новый Массив();
	ТехническиеСведения.Добавить(НСтр("ru = '[Основные сведения]'"));
	ТехническиеСведения.Добавить(НСтр("ru = 'Рег.номер = '")     + РегНомер);
	ТехническиеСведения.Добавить(НСтр("ru = 'ИНН = '")           + ИНН);
	ТехническиеСведения.Добавить(НСтр("ru = 'Продукт = '")       + ПрограммныйПродукт);
	ТехническиеСведения.Добавить(НСтр("ru = 'Версия = '")        + ВерсияПродукта);
	ТехническиеСведения.Добавить(НСтр("ru = 'Платформа = '")     + ВерсияПлатформы);
	ТехническиеСведения.Добавить(НСтр("ru = 'Тип СУБД = '")      + ТипСУБД);
	ТехническиеСведения.Добавить(НСтр("ru = 'Идентификатор = '") + ИдентификаторБазы + " / " + ИдентификаторПостоянный);
	ТехническиеСведения.Добавить(Символы.ПС);
	
	ТехническиеСведения.Добавить(НСтр("ru = '[Оборудование (клиент)]'"));
	ТехническиеСведения.Добавить(НСтр("ru = 'Строка подключения = '") + ПодключениеКлиент);
	ТехническиеСведения.Добавить(НСтр("ru = 'Версия ОС = '")          + ВерсияОСКлиент);
	ТехническиеСведения.Добавить(НСтр("ru = 'Оперативная память = '") + ПамятьКлиент);
	ТехническиеСведения.Добавить(НСтр("ru = 'Процессор = '")          + ПроцессорКлиент);
	ТехническиеСведения.Добавить(Символы.ПС);
	
	ТехническиеСведения.Добавить(НСтр("ru = '[Оборудование (сервер)]'"));
	ТехническиеСведения.Добавить(НСтр("ru = 'Строка подключения = '") + ПодключениеСервер);
	ТехническиеСведения.Добавить(НСтр("ru = 'Версия ОС = '")          + ВерсияОССервер);
	ТехническиеСведения.Добавить(НСтр("ru = 'Оперативная память = '") + ПамятьСервер);
	ТехническиеСведения.Добавить(НСтр("ru = 'Процессор = '")          + ПроцессорСервер);
	ТехническиеСведения.Добавить(Символы.ПС);
	
	ТехническиеСведения.Добавить(НСтр("ru = '[Дополнительные сведения]'"));
	ТехническиеСведения.Добавить(НСтр("ru = 'Используемый клиент = '")   + ИспользуемыйКлиент);
	ТехническиеСведения.Добавить(НСтр("ru = 'Расширения (активные) = '") + Расширения);
	ТехническиеСведения.Добавить(НСтр("ru = 'Разделение данных = '")     + РазделениеДанных);
	ТехническиеСведения.Добавить(НСтр("ru = 'Вариант интерфейса = '")    + ВариантИнтерфейса);
	ТехническиеСведения.Добавить(НСтр("ru = 'Разрешения экранов = '")    + РазрешенияЭкранов);
	ТехническиеСведения.Добавить(НСтр("ru = 'Разделение данных = '")     + РазделениеДанных);
	ТехническиеСведения.Добавить(НСтр("ru = 'Последний пакет = '")       + ДатаКрайнегоПакета);
	ТехническиеСведения.Добавить(НСтр("ru = 'Следующий пакет = '")       + ОтправкаДанныхСледующееФормирование);
	
	ТекстДанныеБуфера = СтрСоединить(ТехническиеСведения, Символы.ПС);
	
	ЭлементБуфера = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ТекстДанныеБуфера);
	СредстваБуфераОбмена.ПоместитьДанныеАсинх(ЭлементБуфера);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Динамическое создание полей с контактной информацией.
//
// Параметры:
//  Контакты - ТаблицаЗначений - Колонки таблицы значений: Заголовок, Значение.
//  Сайты - Массив - набор сайтов (строки)
//
&НаСервере
Процедура СоздатьЭлементыКонтактнойИнформации(Контакты, Сайты)
	
	// Создаем реквизиты формы
	НовыеРеквизиты = Новый Массив;
	ТипСтрока      = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(0));
	Для Номер=0 По Контакты.ВГраница() Цикл
		ИмяРеквизита = "Контакт"+Формат(Номер+1, "ЧН=0; ЧГ=0");
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, ТипСтрока));
	КонецЦикла;
	ЭтотОбъект.ИзменитьРеквизиты(НовыеРеквизиты);
	
	// Создаем элементы управления
	Для Номер=0 По Контакты.ВГраница() Цикл
		
		ИмяРеквизита = "Контакт"+Формат(Номер+1, "ЧН=0; ЧГ=0");
		Название     = Контакты[Номер].Заголовок;
		Значение     = Контакты[Номер].Значение;
		
		Элемент = ЭтотОбъект.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ЭтотОбъект.Элементы.Контакты);
		Элемент.Вид            = ВидПоляФормы.ПолеВвода;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.Заголовок      = Название;
		Элемент.ПутьКДанным    = ИмяРеквизита;
		
		ЭтотОбъект[Элемент.ПутьКДанным] = Значение;
		
	КонецЦикла;
	
	// Проверим, нужно ли выводить секцию сайтов
	Если Сайты.Количество()=0 Тогда
		ЭтотОбъект.Элементы.ЗаголовокСайты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	// Выводим перечень сайтов
	Для Номер=0 По Сайты.ВГраница() Цикл
		
		ИмяЭлемента = "Сайт"+Формат(Номер+1, "ЧН=0; ЧГ=0");
		Значение    = Сайты[Номер];
		
		Элемент = ЭтотОбъект.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ЭтотОбъект.Элементы.ГруппаСсылки);
		Элемент.Заголовок   = Значение;
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			// Если сайт указан в виде строки без форматирования, то нужно добавить гиперссылку.
			// Если сайт указан в виде форматированной строки, то гиперссылка в нем уже настроена.
			Элемент.Гиперссылка = Истина;
			Элемент.УстановитьДействие("Нажатие", "СайтНажатие");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьЭлементыКонтактнойИнформации()

&НаСервере
Процедура ЗаполнитьСведенияОПрограммеНаСервере()
	
	// Получаем данные о параметрых работы
	ПараметрыКлиента = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере();
	СведенияОКлиенте = ПараметрыКлиента.Получить("СистемнаяИнформация");
	СведенияОСервере = Новый СистемнаяИнформация;
	
	// Определим разрядность платформы
	Платформа32 = Новый Массив();
	Платформа32.Добавить(ТипПлатформы.Windows_x86);
	Платформа32.Добавить(ТипПлатформы.Linux_x86);
	Платформа32.Добавить(ТипПлатформы.Android_ARM);
	Платформа32.Добавить(ТипПлатформы.Android_x86);
	Платформа32.Добавить(ТипПлатформы.iOS_ARM);
	Платформа32.Добавить(ТипПлатформы.MacOS_x86);
	Платформа32.Добавить(ТипПлатформы.WinRT_ARM);
	Платформа32.Добавить(ТипПлатформы.WinRT_x86);
	Разрядность = ?(Платформа32.Найти(СведенияОСервере.ТипПлатформы)=Неопределено, " (х64)", " (х32)");
	
	// Сведения о программном продукте
	ЭтотОбъект.ПрограммныйПродукт = Метаданные.Синоним;
	ЭтотОбъект.ВерсияПродукта     = Метаданные.Версия;
	
	// Сведения о контексте запуска
	ЭтотОбъект.ВерсияПлатформы    = СведенияОСервере.ВерсияПриложения + Разрядность;
	пр_ПоддержкаОтраслевыхРешений.ОпределитьТипСУБД(ЭтотОбъект.ТипСУБД);
	ЭтотОбъект.ИспользуемыйКлиент = ПараметрыКлиента.Получить("ИспользуемыйКлиент");
	ЭтотОбъект.ВариантИнтерфейса  = КлиентскоеПриложение.ТекущийВариантИнтерфейса();
	
	// Сведения о ПК
	ЭтотОбъект.ПодключениеКлиент  = ПараметрыКлиента.Получить("СтрокаСоединенияИнформационнойБазы");
	ЭтотОбъект.ПодключениеСервер  = СтрокаСоединенияИнформационнойБазы();
	ЭтотОбъект.ВерсияОСКлиент     = СведенияОКлиенте.ВерсияОС;
	ЭтотОбъект.ВерсияОССервер     = СведенияОСервере.ВерсияОС;
	ЭтотОбъект.ПамятьКлиент       = Формат(СведенияОКлиенте.ОперативнаяПамять, "ЧГ=0; ЧФ='Ч Mb'");
	ЭтотОбъект.ПамятьСервер       = Формат(СведенияОСервере.ОперативнаяПамять, "ЧГ=0; ЧФ='Ч Mb'");
	ЭтотОбъект.ПроцессорКлиент    = СведенияОКлиенте.Процессор;
	ЭтотОбъект.ПроцессорСервер    = СведенияОСервере.Процессор;
	
	// Сведения о информационной базе
	ЭтотОбъект.ИдентификаторБазы  = ПолучитьИдентификаторИнформационнойБазы();
	ЭтотОбъект.РазделениеДанных   = Строка(ОбщегоНазначения.РазделениеВключено());
	
	// Получим перечень расширений
	ЭтотОбъект.Расширения.Очистить();
	Для каждого Расширение Из РасширенияКонфигурации.Получить() Цикл
		Если НЕ Расширение.Активно Тогда
			Продолжить;
		КонецЕсли;
		Представление = СтрШаблон("%1 %2 (%3)", Расширение.Синоним, Расширение.Версия, Расширение.Назначение);
		ЭтотОбъект.Расширения.Добавить(Расширение.Имя, Представление);
	КонецЦикла;
	
	// Получим параметры экранов
	ЭтотОбъект.РазрешенияЭкранов.Очистить();
	Для каждого Экран Из ПолучитьИнформациюЭкрановКлиента() Цикл
		Представление = СтрШаблон("%1х%2 DPI %3", Формат(Экран.Ширина, "ЧН=0; ЧГ=0"), Формат(Экран.Высота, "ЧН=0; ЧГ=0"), Формат(Экран.DPI, "ЧН=0; ЧГ=0"));
		ЭтотОбъект.РазрешенияЭкранов.Добавить(Представление);
	КонецЦикла;
	
	// Получим сведения о обмене
	ПараметрыЦентраМониторинга = ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторинга();
	ЭтотОбъект.ИдентификаторПостоянный             = ПараметрыЦентраМониторинга.ИдентификаторИнформационнойБазыПостоянный;
	ЭтотОбъект.ДатаКрайнегоПакета                  = ПараметрыЦентраМониторинга.ДатаКрайнегоПакета;
	ЭтотОбъект.ОтправкаДанныхСледующееФормирование = ПараметрыЦентраМониторинга.ОтправкаДанныхСледующееФормирование;
	
	// Локализация, Часовой пояс
	
КонецПроцедуры // ЗаполнитьСведенияОПрограмме()

&НаКлиенте
Процедура ПослеСайтНажатие(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьПакетЗавершение(ВыбранныеФайлы, Пакет) Экспорт
	
	Если ВыбранныеФайлы=Неопределено ИЛИ ВыбранныеФайлы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьПакета = Новый ЗаписьТекста(ВыбранныеФайлы[0], КодировкаТекста.UTF8);
	ЗаписьПакета.ЗаписатьСтроку(Пакет.ТелоПакета);
	ЗаписьПакета.Закрыть();
	
КонецПроцедуры // Подключаемый_СохранитьПакетЗавершение()

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторИнформационнойБазы()
	
	Возврат ЦентрМониторинга.ИдентификаторИнформационнойБазы();
	
КонецФункции

&НаСервереБезКонтекста
Функция РегистрационныеДанныеЗаполнены(РегНомер, ИНН)
	
	Возврат пр_ПоддержкаОтраслевыхРешений.РегистрационныеДанныеЗаполнены(РегНомер, ИНН);
	
КонецФункции // РегистрационныеДанныеЗаполнены()

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеПрограммыRarusDesk(ИмяМакета, УникальныйИдентификатор)
	
	// Регистрируем событие
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.ЗапускRarusDesk");
	
	// Получаем макет и помещаем во временное хранилище
	МакетПрограммы = Обработки.пр_ПоддержкаОтраслевыхРешений.ПолучитьМакет(ИмяМакета);
	АдресПрограммы = ПоместитьВоВременноеХранилище(МакетПрограммы, УникальныйИдентификатор);
	
	Возврат АдресПрограммы;
	
КонецФункции // ПолучитьДвоичныеДанныеПрограммыRarusDesk()

#КонецОбласти
