#Область ОписаниеПеременных

&НаКлиенте
Перем НачалоЗагрузки;

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОтменитьФоновоеЗадание(ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПериодПриказовВыбор(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПериодПриказовВыборЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Отбор_Период;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗагрузки;
		ЗагрузитьЗабракованныеСерииРосздравнадзор();
		
	КонецЕсли;
	
	УстановитьИзмененияВИнтерфейсе();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗагрузки Тогда
		Оповещение = Новый ОписаниеОповещения("ПрерватьВыполнение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Прервать получение данных о забраковке?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗакрытьФормуЗагрузки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПериодПриказовВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор_Период = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗабракованныеСерииРосздравнадзор()
	
	ОчиститьСообщения();
	
	НачалоЗагрузки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	УстановитьСтатусЗагрузки(НСтр("ru = 'Идет получение данных с сайта http://roszdravnadzor.ru/'"));
	
	Задание = ПолучитьДанныеРосздравнадзорСервер();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОтобразитьПрогресс", ЭтотОбъект);
	
	ОповеститьОЗавершении = Новый ОписаниеОповещения("ОбработатьЗагрузкуРосзравнадзор", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, ОповеститьОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗагрузкуРосзравнадзор(Результат, ДополнительныеПараметры) Экспорт
	
	ИдентификаторЗадания = Неопределено;
	Если Результат = Неопределено Тогда
		ВернутсяКНастройкеПараметров();
		Возврат; // Задание отменено.
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		ВернутсяКНастройкеПараметров();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка при получении данных с сайта http://roszdravnadzor.ru/.
			         |%1'"),
			Результат.КраткоеПредставлениеОшибки);
		ВызватьИсключение ТекстОшибки;
		
	Иначе
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если РезультатВыполнения.Статус = "Ошибка" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Ошибка получения файла с сайта http://roszdravnadzor.ru.
				|%1'"),
				РезультатВыполнения.СообщениеОбОшибке));
				ВернутсяКНастройкеПараметров();
			Возврат;
		КонецЕсли;
		
		ОбработатьПолученныйФайлРосздравнадзор(РезультатВыполнения.МассивДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйФайлРосздравнадзор(МассивДанных)
	
	УстановитьСтатусЗагрузки(НСтр("ru = 'Идет загрузка забракованных серий...'"));
	
	Задание = ПолучитьДанныеИзФайлаРосздравнадзорСервер(МассивДанных);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОтобразитьПрогресс", ЭтотОбъект);
	
	ОповеститьОЗавершении = Новый ОписаниеОповещения("ОбработатьЗавершениеЗагрузкиРосздравнадзор", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, ОповеститьОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеИзФайлаРосздравнадзорСервер(Знач МассивДанных)
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка забракованных серий Росздравнадзор'");
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("МассивДанных", МассивДанных);
	
	Задание = ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.ор_ФальсификатыЛекарственныхСредств.ЗагрузитьЗабракованныеСерииРосздравнадзор",
		ПараметрыЗагрузки,
		ПараметрыЗадания);
	
	ИдентификаторЗадания = Задание.ИдентификаторЗадания;
	Возврат Задание;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеЗагрузкиРосздравнадзор(Результат, ДополнительныеПараметры) Экспорт
	
	ИдентификаторЗадания = Неопределено;
	Если Результат = Неопределено Тогда
		Возврат; // Задание отменено.
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		ВернутсяКНастройкеПараметров();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='При загрузке забракованных серий возникла ошибка.
			|%1'"),
			Результат.КраткоеПредставлениеОшибки);
		ВызватьИсключение ТекстОшибки;
		
	Иначе
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ор_ФальсификатыЛекарственныхСредств"));
		
		КоличествоДобавленных = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если КоличествоДобавленных > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Изменено записей: %1'"), КоличествоДобавленных);
		Иначе
			ТекстСообщения = НСтр("ru='Нет новых данных'");
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(ТекстСообщения,,, БиблиотекаКартинок.Информация32);
		
		Закрыть(КодВозвратаДиалога.ОК);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРосздравнадзорСервер()
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных ...'");
	ПараметрыЗадания.ДополнительныйРезультат = Истина;
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("status", Статус);
	ПараметрыЗагрузки.Вставить("length", 200);
	
	Если ЗначениеЗаполнено(Отбор_Период.ДатаНачала) Тогда
		ПараметрыЗагрузки.Вставить("let_from", Формат(Отбор_Период.ДатаНачала,"DF=dd.MM.yyyy"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_Период.ДатаОкончания) Тогда
		ПараметрыЗагрузки.Вставить("let_to", Формат(Отбор_Период.ДатаОкончания,"DF=dd.MM.yyyy"));
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Номер) Тогда
		ПараметрыЗагрузки.Вставить("let_num", СокрЛП(Номер));
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТорговоеНаименование) Тогда
		ПараметрыЗагрузки.Вставить("tn", СокрЛП(ТорговоеНаименование));
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Производитель) Тогда
		ПараметрыЗагрузки.Вставить("producer", СокрЛП(Производитель));
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Серия) Тогда
		ПараметрыЗагрузки.Вставить("series", СокрЛП(Серия));
	КонецЕсли;

	Если НЕ ПустаяСтрока(Страна) Тогда
		ПараметрыЗагрузки.Вставить("country", СокрЛП(Страна));
	КонецЕсли;
	
	Если ПараметрыЗагрузки.Количество() = 0 Тогда
		Если НЕ ЗначениеЗаполнено(Отбор_Период.ДатаНачала) Тогда
			Отбор_Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
			ПараметрыЗагрузки.Вставить("let_from", Формат(Отбор_Период.ДатаНачала,"DF=dd.MM.yyyy"));
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Отбор_Период.ДатаОкончания) Тогда
			Отбор_Период.ДатаОкончания = ТекущаяДатаСеанса();
			ПараметрыЗагрузки.Вставить("let_to", Формат(Отбор_Период.ДатаОкончания,"DF=dd.MM.yyyy"));
		КонецЕсли;
	КонецЕсли;
	
	Задание = ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.ор_ФальсификатыЛекарственныхСредств.ПолучитьДанныеССайтаРосздравназдзор",
		ПараметрыЗагрузки,
		ПараметрыЗадания);
	
	ИдентификаторЗадания = Задание.ИдентификаторЗадания;
	Возврат Задание;
	
КонецФункции

&НаКлиенте
Процедура ПрерватьВыполнение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВернутсяКНастройкеПараметров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутсяКНастройкеПараметров()
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНастройки;
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОтменитьФоновоеЗадание(ИдентификаторЗадания);
		ИдентификаторЗадания = Неопределено;
	КонецЕсли;
	УстановитьИзмененияВИнтерфейсе();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИзмененияВИнтерфейсе()
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		Элементы.Назад.Видимость = Ложь;
		Элементы.Далее.Видимость = Истина;
		
	ИначеЕсли Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗагрузки Тогда
		Элементы.Назад.Видимость = Истина;
		Элементы.Далее.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуЗагрузки()
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОтменитьФоновоеЗадание(ИдентификаторЗадания);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьФоновоеЗадание(Знач ИдентификаторЗадания)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПрогресс(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Прогресс.Прогресс) = Тип("Структура") Тогда
		УстановитьСтатусЗагрузки(Прогресс.Прогресс.Текст);
	Иначе
		ОбновитьВремяРаботы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Возврашает прошедшее время с начала замера в секундах.
//
// Параметры:
//  НачалоЗамера - Число - начало замера в виде универсальной даты в милисекундах.
//
// Возвращаемое значение:
//  Число - количество секун от начала замера.
//
Функция ПрошлоВремени(НачалоЗамера)
	
	ПрошлоВремени = Новый Структура("Часы, Минуты, Секунды");
	ПрошлоВремениВСекундах = Окр((ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамера) / 1000);
	
	Возврат ПрошлоВремениВСекундах;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Возвращает текстовое представление интервала времени, заданного в секундах.
//
// Параметры:
//  Время - Число - интервал времени в секундах.
//
// Возвращаемое значение:
//   Строка - представление интервала времени.
//
Функция ПредставлениеВремени(Знач Время, ВыводитьСекунды = Истина)
	
	ПредставлениеДней   = НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'");
	ПредставлениеЧасов  = НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'");
	ПредставлениеМинут  = НСтр("ru = ';%1 минута;;%1 минуты;%1 минут;%1 минуты'");
	ПредставлениеСекунд = НСтр("ru = ';%1 секунда;;%1 секунды;%1 секунд;%1 секунды'");
	
	Время = Число(Время);
	Если Время < 0 Тогда
		Время = -Время;
	КонецЕсли;
	
	КоличествоДней   = Цел(Время / 60 / 60 / 24);
	КоличествоЧасов  = Цел(Время / 60 / 60);
	КоличествоМинут  = Цел(Время / 60);
	КоличествоСекунд = Цел(Время);
	
	КоличествоСекунд = КоличествоСекунд - КоличествоМинут * 60;
	КоличествоМинут  = КоличествоМинут - КоличествоЧасов * 60;
	КоличествоЧасов  = КоличествоЧасов - КоличествоДней * 24;
	
	Если Не ВыводитьСекунды Тогда
		КоличествоСекунд = 0;
	КонецЕсли;
	
	ПредставлениеВремени = Новый Массив;
	Если КоличествоДней > 0 Тогда
		ДниПрописью = СтрокаСЧислом(ПредставлениеДней, КоличествоДней, ВидЧисловогоЗначения.Количественное);
		ПредставлениеВремени.Добавить(ДниПрописью);
	КонецЕсли;
	
	Если КоличествоЧасов > 0 Тогда
		ЧасыПрописью = СтрокаСЧислом(ПредставлениеЧасов, КоличествоЧасов, ВидЧисловогоЗначения.Количественное);
		ПредставлениеВремени.Добавить(ЧасыПрописью);
	КонецЕсли;
	
	Если КоличествоМинут > 0 Тогда
		МинутыПрописью = СтрокаСЧислом(ПредставлениеМинут, КоличествоМинут, ВидЧисловогоЗначения.Количественное);
		ПредставлениеВремени.Добавить(МинутыПрописью);
	КонецЕсли;
	
	Если КоличествоСекунд > 0 Тогда
		СекундыПрописью = СтрокаСЧислом(ПредставлениеСекунд, КоличествоСекунд, ВидЧисловогоЗначения.Количественное);
		ПредставлениеВремени.Добавить(СекундыПрописью);
	КонецЕсли;
	
	Возврат СтрСоединить(ПредставлениеВремени, " ");
	
КонецФункции

&НаКлиенте
Процедура УстановитьСтатусЗагрузки(Знач Сообщение = "")
	
	СтатусДлительнойОперации = НСтр("ru = 'Пожалуйста, подождите...'") + Символы.ПС + Сообщение;
	ОбновитьВремяРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВремяРаботы()
	
	ПрошлоВремени      = ПрошлоВремени(НачалоЗагрузки);
	ТекущееВремяРаботы = ПредставлениеВремени(ПрошлоВремени);
	Если ВремяРаботы <> ТекущееВремяРаботы Тогда
		ВремяРаботы = ТекущееВремяРаботы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции




