
#Область СлужебныйПрограммныйИнтерфейс

// Определяет заполнено ли переданное значение
//
// Параметры:
//  Значение - Неопределено	- Значение, заполнение которого надо проверить
//
// Возвращаемое значение:
// 	Булево 	- Истина - значение не заполнено, ложь - иначе.
//
Функция ор_ЗначениеНеЗаполнено(Значение) Экспорт

	Результат = Ложь;
	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение = NULL Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Если СокрЛП(Значение) = "" Тогда
			Результат = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Если Значение = 0 Тогда
			Результат = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Если Значение = Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Ложь; // Булево будем считать не пустым
		
	// Отдельное определение, так как конструкторов данного типа не существует.
	ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
		Если Значение = РежимПроведенияДокумента.Неоперативный ИЛИ Значение = РежимПроведенияДокумента.Оперативный Тогда
			Результат = Ложь;
		КонецЕсли;
		
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа.
	Иначе
		Попытка
			Если Значение = Новый(ТипЗначения) Тогда
				Результат = Истина;
			КонецЕсли;
		Исключение
			Результат = Ложь;
		КонецПопытки;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции // ЗначениеНеЗаполнено()

// Заполняет таблицу приемника дополнительными реквизитами номенклатуры
//
Процедура ЗаполнитьТаблицуПриемникаДопРеквизитамиНоменклатуры(ТаблицаЗагружаемыхРеквизитов, КатегорияНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, ТолькоОбщиеДопРеквизитыСведения) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка,
	|	КатегорииНоменклатуры.НаборСвойств
	|ПОМЕСТИТЬ КатегорииНоменклатуры
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	НЕ КатегорииНоменклатуры.ЭтоГруппа
	|	И НЕ КатегорииНоменклатуры.ПометкаУдаления
	|	И НЕ КатегорииНоменклатуры.ТипНоменклатурыПоУмолчанию = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	%УсловиеКатегорииНоменклатуры%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка,
	|	ДополнительныеРеквизиты.Свойство,
	|	ДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизиты.Свойство.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	1 КАК ДопРеквизитСведение,
	|	1 КАК Сортировка
	|ПОМЕСТИТЬ ДопРеквизитыСведения
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	(ДополнительныеРеквизиты.Ссылка.Родитель = &Справочник_Номенклатура И %ДопНоменклатуры%)
	|	И НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Ссылка,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Свойство.ТипЗначения,
	|	ДополнительныеСведения.Свойство.ЗаполнятьОбязательно,
	|	2,
	|	1 КАК Сортировка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	(ДополнительныеСведения.Ссылка.Родитель = &Справочник_Номенклатура И %ДопНоменклатуры%)
	|	И НЕ ДополнительныеСведения.Ссылка.ЭтоГруппа
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопРеквизитыСведения.Ссылка КАК НаборСвойств,
	|	ДопРеквизитыСведения.Свойство,
	|	ДопРеквизитыСведения.ЗаполнятьОбязательно КАК ОбязательныйДляЗаполнения,
	|	ДопРеквизитыСведения.ДопРеквизитСведение,
	|	КатегорииНоменклатуры.Ссылка КАК КатегорияНоменклатурыНабора,
	|	ДопРеквизитыСведения.ТипЗначения
	|ИЗ
	|	ДопРеквизитыСведения КАК ДопРеквизитыСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|		ПО ДопРеквизитыСведения.Ссылка = КатегорииНоменклатуры.НаборСвойств
	|%УсловиеТолькоОбщие%
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДопРеквизитыСведения.Ссылка,
	|	ДопРеквизитыСведения.Свойство,
	|	ДопРеквизитыСведения.ЗаполнятьОбязательно,
	|	ДопРеквизитыСведения.ДопРеквизитСведение,
	|	NULL,
	|	ДопРеквизитыСведения.ТипЗначения
	|ИЗ
	|	ДопРеквизитыСведения КАК ДопРеквизитыСведения
	|ГДЕ
	|	ДопРеквизитыСведения.Ссылка = &Справочник_Номенклатура_Общие";
	
	УсловиеКатегорииНоменклатуры = ?(ЗначениеЗаполнено(КатегорияНоменклатуры), "И КатегорииНоменклатуры.Ссылка В (&КатегорияНоменклатуры)", "");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УсловиеКатегорииНоменклатуры%",УсловиеКатегорииНоменклатуры);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопНоменклатуры%", ?(ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, "Истина","Ложь"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УсловиеТолькоОбщие%", ?(ТолькоОбщиеДопРеквизитыСведения, "ГДЕ Ложь","ГДЕ Истина"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Справочник_Номенклатура", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура"));
	Запрос.УстановитьПараметр("Справочник_Номенклатура_Общие", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие"));
	Запрос.УстановитьПараметр("КатегорияНоменклатуры", КатегорияНоменклатуры);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ПромежуточнаяТаблица = Новый ТаблицаЗначений;
	ПромежуточнаяТаблица.Колонки.Добавить("ИмяРеквизита");
	ПромежуточнаяТаблица.Колонки.Добавить("ПредставлениеРеквизита");
	ПромежуточнаяТаблица.Колонки.Добавить("МожетБытьПолемПоиска");
	ПромежуточнаяТаблица.Колонки.Добавить("ДоступноеОписаниеТипов");
	ПромежуточнаяТаблица.Колонки.Добавить("ЭтоДополнительныйРеквизит");
	ПромежуточнаяТаблица.Колонки.Добавить("СсылкаРеквизита");
	ПромежуточнаяТаблица.Колонки.Добавить("ЭтоСведение");
	
	Пока Выборка.Следующий() Цикл
		
		ЗагружаемыйРеквизит                        = ПромежуточнаяТаблица.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = СтрЗаменить("Н"+Строка(Выборка.Свойство.УникальныйИдентификатор()), "-", "");
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Выборка.Свойство.Наименование;
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Выборка.ТипЗначения;
		ЗагружаемыйРеквизит.ЭтоДополнительныйРеквизит = Истина;
		ЗагружаемыйРеквизит.СсылкаРеквизита           = Выборка.Свойство;
		ЗагружаемыйРеквизит.ЭтоСведение               = Выборка.Свойство.ЭтоДополнительноеСведение;
	КонецЦикла;
	
	ПромежуточнаяТаблица.Свернуть("ИмяРеквизита, ПредставлениеРеквизита, МожетБытьПолемПоиска,ДоступноеОписаниеТипов,ЭтоДополнительныйРеквизит, СсылкаРеквизита,ЭтоСведение");
	Для Каждого СтрокаПромежуточнойТаблицы Из ПромежуточнаяТаблица Цикл
		НовСтр = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаПромежуточнойТаблицы);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет таблицу приемника дополнительными реквизитами характеристик
//
Процедура ЗаполнитьТаблицуПриемникаДопРеквизитамиХарактеристик(ТаблицаЗагружаемыхРеквизитов, КатегорияНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, ТолькоОбщиеДопРеквизитыСведения) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка,
	|	КатегорииНоменклатуры.НаборСвойствХарактеристики
	|ПОМЕСТИТЬ КатегорииНоменклатуры
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	НЕ КатегорииНоменклатуры.ЭтоГруппа
	|	И НЕ КатегорииНоменклатуры.ПометкаУдаления
	|	И НЕ КатегорииНоменклатуры.ТипНоменклатурыПоУмолчанию = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|	%УсловиеКатегорииНоменклатуры%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка,
	|	ДополнительныеРеквизиты.Свойство,
	|	ДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизиты.Свойство.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	1 КАК ДопРеквизитСведение,
	|	1 КАК Сортировка
	|ПОМЕСТИТЬ ДопРеквизитыСведения
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	(ДополнительныеРеквизиты.Ссылка.Родитель = &Справочник_ХарактеристикиНоменклатуры И %ДопХарактеристик%)
	|	И НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Ссылка,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Свойство.ТипЗначения,
	|	ДополнительныеСведения.Свойство.ЗаполнятьОбязательно,
	|	2,
	|	1 КАК Сортировка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	(ДополнительныеСведения.Ссылка.Родитель = &Справочник_ХарактеристикиНоменклатуры И %ДопХарактеристик%)
	|	И НЕ ДополнительныеСведения.Ссылка.ЭтоГруппа
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопРеквизитыСведения.Ссылка КАК НаборСвойств,
	|	ДопРеквизитыСведения.Свойство,
	|	ДопРеквизитыСведения.ЗаполнятьОбязательно КАК ОбязательныйДляЗаполнения,
	|	ДопРеквизитыСведения.ДопРеквизитСведение,
	|	КатегорииНоменклатуры.Ссылка КАК КатегорияНоменклатурыНабора,
	|	ДопРеквизитыСведения.ТипЗначения
	|ИЗ
	|	ДопРеквизитыСведения КАК ДопРеквизитыСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|		ПО ДопРеквизитыСведения.Ссылка = КатегорииНоменклатуры.НаборСвойствХарактеристики";
	
	УсловиеКатегорииНоменклатуры = ?(ЗначениеЗаполнено(КатегорияНоменклатуры), "И КатегорииНоменклатуры.Ссылка В (&КатегорияНоменклатуры)", "");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УсловиеКатегорииНоменклатуры%", УсловиеКатегорииНоменклатуры);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопХарактеристик%", ?(ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, "Истина","Ложь"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Справочник_ХарактеристикиНоменклатуры", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_ХарактеристикиНоменклатуры"));
	Запрос.УстановитьПараметр("КатегорияНоменклатуры", КатегорияНоменклатуры);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ПромежуточнаяТаблица = Новый ТаблицаЗначений;
	ПромежуточнаяТаблица.Колонки.Добавить("ИмяРеквизита");
	ПромежуточнаяТаблица.Колонки.Добавить("ПредставлениеРеквизита");
	ПромежуточнаяТаблица.Колонки.Добавить("МожетБытьПолемПоиска");
	ПромежуточнаяТаблица.Колонки.Добавить("ДоступноеОписаниеТипов");
	ПромежуточнаяТаблица.Колонки.Добавить("ЭтоДополнительныйРеквизит");
	ПромежуточнаяТаблица.Колонки.Добавить("СсылкаРеквизита");
	ПромежуточнаяТаблица.Колонки.Добавить("ЭтоСведение");
	
	Пока Выборка.Следующий() Цикл
		
		ЗагружаемыйРеквизит                        = ПромежуточнаяТаблица.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = СтрЗаменить("Х"+Строка(Выборка.Свойство.УникальныйИдентификатор()), "-", "");
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Выборка.Свойство.Наименование;
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Выборка.ТипЗначения;
		ЗагружаемыйРеквизит.ЭтоДополнительныйРеквизит = Истина;
		ЗагружаемыйРеквизит.СсылкаРеквизита           = Выборка.Свойство;
		ЗагружаемыйРеквизит.ЭтоСведение               = Выборка.Свойство.ЭтоДополнительноеСведение;
	КонецЦикла;
	
	ПромежуточнаяТаблица.Свернуть("ИмяРеквизита, ПредставлениеРеквизита, МожетБытьПолемПоиска,ДоступноеОписаниеТипов,ЭтоДополнительныйРеквизит, СсылкаРеквизита,ЭтоСведение");
	Для Каждого СтрокаПромежуточнойТаблицы Из ПромежуточнаяТаблица Цикл
		НовСтр = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаПромежуточнойТаблицы);
	КонецЦикла;
	
КонецПроцедуры

// Дополняет дополнительные реквизиты в таблицу реквизитов
//
Процедура ДополнитьДополнительныеРеквизитыВТаблицуРеквизитов(МетаданныеИсточникаЗагрузки, ТаблицаЗагружаемыхРеквизитов, КатегорияНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, ТолькоОбщиеДопРеквизитыСведения) Экспорт
	
	Если НЕ (Метаданные.Справочники.Найти(МетаданныеИсточникаЗагрузки.Имя)<>Неопределено И (МетаданныеИсточникаЗагрузки.Имя = "Номенклатура" ИЛИ МетаданныеИсточникаЗагрузки.Имя = "ХарактеристикиНоменклатуры")) Тогда
		Возврат;
	КонецЕсли;
	
	Если МетаданныеИсточникаЗагрузки.Имя = "Номенклатура" Тогда
		ЗаполнитьТаблицуПриемникаДопРеквизитамиНоменклатуры(ТаблицаЗагружаемыхРеквизитов, КатегорияНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, ТолькоОбщиеДопРеквизитыСведения);
	ИначеЕсли МетаданныеИсточникаЗагрузки.Имя = "ХарактеристикиНоменклатуры" Тогда
		ЗаполнитьТаблицуПриемникаДопРеквизитамиХарактеристик(ТаблицаЗагружаемыхРеквизитов, КатегорияНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведенияНоменклатуры, ТолькоОбщиеДопРеквизитыСведения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура переноса табличного файла в табличное поле с помощью внешней обработки
//
Процедура ЗаполнитьТабличныйДокументИзXMLСервер(ПолноеИмяФайла, ОбработкаПреобразования, ТабличныйДокумент, АдресВХранилище, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ОбработкаЗагрузки = Неопределено;
	Попытка
		ОбработкаЗагрузки = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбработкаПреобразования);
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не удалось создать обработку преобразования!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Не удалось создать обработку преобразования!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	ФайлНаДиске = Новый Файл(ПолноеИмяФайла);
	Попытка
		ОбработкаЗагрузки.ИмяФайла = ПолноеИмяФайла;
		ОбработкаЗагрузки.АдресВХранилище = АдресВХранилище;
		ОбработкаЗагрузки.РазложитьФайлВТаблицу();
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(ОбработкаЗагрузки.ПеренестиДанныеВТабличноеПоле());
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не удалось преобразовать файл в таблицу!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Не удалось преобразовать файл в таблицу!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

// Заполняет настройки колонок по умолчанию для справочника
//
Процедура ПрочитатьТабличныйДокумент(ТабличныйДокумент, РасширениеФайла, ИмяБезРасширения, АдресВоВременномХранилище, Табуляция, Кодировка, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Расширение = НРег(РасширениеФайла);
	
	Если Расширение = ".mxl" Тогда
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
		ВременныйФайл = КаталогВременныхФайлов() + "testUA.mxl";
		ДанныеФайла.Записать(ВременныйФайл);
		
		Попытка
			ТабличныйДокумент.Прочитать(ВременныйФайл);
		Исключение
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка открытия файла.'"));
			Иначе
				ДобавитьВЛог(НСтр("ru= 'Ошибка открытия файла.'"), 1, СтруктураПараметровЛогирования);
			КонецЕсли;
		КонецПопытки;
		
		Попытка
			УдалитьФайлы(ВременныйФайл);
		Исключение
		КонецПопытки;
		
	ИначеЕсли Расширение = ".xls" ИЛИ Расширение = ".xlsx" ИЛИ Расширение = ".xlsm" ИЛИ Расширение = ".xlsb"
		ИЛИ Расширение = ".ods" Тогда
		
		ПрочитатьТабличныйДокументИзЭлектроннойТаблицы(ТабличныйДокумент, АдресВоВременномХранилище, Расширение, СтруктураПараметровЛогирования);
		
	ИначеЕсли (Расширение = ".txt") ИЛИ (Расширение = ".sst") ИЛИ (Расширение = ".mmo") Тогда
		
		Разделитель = СокрЛП(Табуляция);
		Если ВРег(Разделитель) = "ТАБ" ИЛИ ВРег(Разделитель) = "TAB" Тогда
			Разделитель = Символы.Таб;
		ИначеЕсли НЕ СтрДлина(Разделитель)=1 Тогда
			Разделитель = Неопределено;
		КонецЕсли;
		ПрочитатьТабличныйДокументИзТекста(ТабличныйДокумент, АдресВоВременномХранилище, Расширение, Кодировка, Разделитель, СтруктураПараметровЛогирования);
		
	ИначеЕсли Расширение = ".dbf" Тогда
		
		ПрочитатьТабличныйДокументИзDBF(ТабличныйДокумент, АдресВоВременномХранилище, Кодировка, ИмяБезРасширения, СтруктураПараметровЛогирования);
		
	Иначе
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неизвестный формат файла (*"+Расширение+").");
		Иначе
			ДобавитьВЛог("Неизвестный формат файла (*"+Расширение+").", 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПрочитатьТабличныйДокумент()

// Функция считывает в табличный документ данные из файла в формате Excel
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент	- ТабличныйДокумент, в который необходимо прочитать данные
//  ИмяФайла           - Строка				- Имя файла в формате Excel, из которого необходимо прочитать данные
//  НомерЛистаExcel    - Число				- Номер листа книги Excel, из которого необходимо прочитать данные
//
// Возвращаемое значение:
//  Булево			- Истина, если файл прочитан, Ложь - иначе
//
Функция ПрочитатьТабличныйДокументИзЭлектроннойТаблицы(ТабличныйДокумент, АдресВоВременномХранилище, ПереданноеРасширение = ".xls", СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUA"+ПереданноеРасширение;
	ДанныеФайла.Записать(ВременныйФайл);
	ИмяФайла = ВременныйФайл;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Файл не существует!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Файл не существует!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	ТабличныйДокумент.Очистить();
	
	Попытка
		ТабличныйДокумент.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		
		ОписаниеОшибки = НСтр("ru = 'Ошибка чтения табличного документа причине: %1.'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ОписаниеОшибки());
		
		ИмяСобытия = НСтр("ru = 'Ошибка чтения'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
		Если СтруктураПараметровЛогирования <> Неопределено Тогда
			ДобавитьВЛог(ОписаниеОшибки, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ПрочитатьТабличныйДокументИзЭлектроннойТаблицы()

// Функция считывает в табличный документ данные из файла в формате TXT
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент	- ТабличныйДокумент, в который необходимо прочитать данные
//  ИмяФайла           - Строка				- Имя файла в формате TXT, из которого необходимо прочитать данные
//  Разделитель           - Строка			- Разделитель
//
// Возвращаемое значение:
//  Булево			- Истина, если файл прочитан, Ложь - иначе
//
Функция ПрочитатьТабличныйДокументИзТекста(ТабличныйДокумент, АдресВоВременномХранилище, Расширение, Кодировка, Разделитель = Неопределено, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUA" + Расширение;
	ДанныеФайла.Записать(ВременныйФайл);
	ИмяФайла = ВременныйФайл;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Файл не существует!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Файл не существует!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;	
	Попытка
		Если ПустаяСтрока(Кодировка) Тогда
			ТекстовыйДокумент.Прочитать(ИмяФайла);	
		ИначеЕсли Кодировка = "cpCP866" Тогда
			ТекстовыйДокумент.Прочитать(ИмяФайла, КодировкаТекста.OEM);
		Иначе
			ТекстовыйДокумент.Прочитать(ИмяФайла, КодировкаТекста.ANSI); // По умолчанию открываем в "cpCP1251", в т.ч. для перекодировки
		КонецЕсли;
 	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка открытия файла!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Ошибка открытия файла!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;
	
	НеобходимаПерекодировка = Кодировка = "cpKOI8" ИЛИ Кодировка = "cpISO8859";

	Попытка
		Если Разделитель = Неопределено Тогда
			СимволТабуляции = ?(нРег(ВыбФайл.Расширение)=".sst",";",Символы.Таб); 
		Иначе
			СимволТабуляции = Разделитель;
		КонецЕсли;
		ТабличныйДокумент.Очистить();
		Для ТекущаяСтрока = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
			ТекущаяКолонка = 0;
			Для каждого Значение Из РазложитьСтрокуВМассивПодстрок(ТекстовыйДокумент.ПолучитьСтроку(ТекущаяСтрока),СимволТабуляции) Цикл
				ТекущаяКолонка = ТекущаяКолонка + 1;
				
				Текст = Значение;
				ТабличныйДокумент.Область("R" + Формат(ТекущаяСтрока, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = Текст;
			КонецЦикла;
		КонецЦикла;
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка открытия файла!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Ошибка открытия файла!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ПрочитатьТабличныйДокументИзТекста()

// Функция считывает в табличный документ данные из файла в формате dBase III (*.dbf)
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент	- ТабличныйДокумент, в который необходимо прочитать данные
//  ИмяФайла           - Строка				- Имя файла в формате TXT, из которого необходимо прочитать данные
//  ИмяБезРасширения   - Строка				- Имя файла в формате TXT, из которого необходимо прочитать данные
//
// Возвращаемое значение:
//  Булево	-	Истина, если файл прочитан, Ложь - иначе
//
Функция ПрочитатьТабличныйДокументИзDBF(ТабличныйДокумент, АдресВоВременномХранилище, Кодировка, ИмяБезРасширения = "", СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUA.dbf";
	ДанныеФайла.Записать(ВременныйФайл);
	ИмяФайла = ВременныйФайл;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Файл не существует!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Файл не существует!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	XBase  = Новый XBase;
	// Если кодировка установлена в Авто, по умолчанию открываем в DOS.
	XBase.Кодировка = КодировкаXBase.OEM;
	
	// Выполним проверку превышения длины имени файла > 8 символов.
	Если СтрДлина(ИмяБезРасширения) > 8 Тогда
		Попытка
			ИмяВременногоФайла = КаталогВременныхФайлов()+"tempUA.dbf";
			КопироватьФайл(ИмяФайла,ИмяВременногоФайла);
			ИмяЗагружаемогоФайла = ИмяВременногоФайла;
		Исключение
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Невозможно создать временный файл!'"));
			Иначе
				ДобавитьВЛог(НСтр("ru= 'Невозможно создать временный файл!'"), 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Возврат Ложь;
		КонецПопытки;
	Иначе
		ИмяЗагружаемогоФайла = ИмяФайла;
	КонецЕсли;
	
	Попытка
		XBase.ОткрытьФайл(ИмяЗагружаемогоФайла);
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка открытия файла!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Ошибка открытия файла!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;
	
	Если ПустаяСтрока(Кодировка) Тогда
		// Ничего не меняем
	ИначеЕсли Кодировка = "cpCP866" Тогда
		XBase.Кодировка = КодировкаXBase.OEM;
	Иначе
		XBase.Кодировка = КодировкаXBase.ANSI; // В т.ч. для перекодировки
	КонецЕсли;
	НеобходимаПерекодировка = Кодировка = "cpKOI8" ИЛИ Кодировка = "cpISO8859";

	ТабличныйДокумент.Очистить();
	ТекущаяСтрока = 1;
	
	
	ТекущаяКолонка = 0;
	Для каждого Поле Из XBase.поля Цикл
		ТекущаяКолонка = ТекущаяКолонка + 1;
		ТабличныйДокумент.Область("R" + Формат(ТекущаяСтрока, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = Поле.Имя;
	КонецЦикла;
	
	Попытка 
		Рез = XBase.Первая();
		Пока НЕ XBase.ВКонце() Цикл
			ТекущаяСтрока = ТекущаяСтрока + 1;
			
			ТекущаяКолонка = 0;
			Для каждого Поле Из XBase.поля Цикл
				ТекущаяКолонка = ТекущаяКолонка + 1;
				
				Текст = XBase.ПолучитьЗначениеПоля(ТекущаяКолонка - 1);
				ТабличныйДокумент.Область("R" + Формат(ТекущаяСтрока, "ЧГ=") +"C" + Формат(ТекущаяКолонка, "ЧГ=")).Текст = Текст;
			КонецЦикла;
			
			XBase.Следующая();
		КонецЦикла;
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка открытия файла!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Ошибка открытия файла!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки; 
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ПрочитатьТабличныйДокументИзDBF()

// Процедура формирует структуру колонок загружаемых реквизитов из табличной части "ТаблицаЗагружаемыхРеквизитов"
//
// Параметры:
//  нет
//
Процедура СформироватьСтруктуруКолонок(СтруктураРеквизитов) 
	
	НомерКолонки = 1;
	Колонки = Новый Структура;
	ТаблицаЗагружаемыхРеквизитов = СтруктураРеквизитов.ТаблицаЗагружаемыхРеквизитов.Скопировать();
	Для каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		Колонка = Новый Структура;
		Для каждого КолонкаЗагружаемыхРеквизитов Из ТаблицаЗагружаемыхРеквизитов.Колонки Цикл
			Колонка.Вставить(КолонкаЗагружаемыхРеквизитов.Имя,ЗагружаемыйРеквизит[КолонкаЗагружаемыхРеквизитов.Имя]);
		КонецЦикла;
		
		Колонки.Вставить(Колонка.ИмяРеквизита,Колонка);
		
	КонецЦикла;
	СтруктураРеквизитов.Вставить("Колонки", Колонки);
	
	НомерКолонки = 1;
	КолонкиШапки = Новый Структура;
	ТаблицаЗагружаемыхРеквизитовШапки = СтруктураРеквизитов.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать();
	Для каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
		КолонкаШапки = Новый Структура;
		Для каждого КолонкаЗагружаемыхРеквизитов Из ТаблицаЗагружаемыхРеквизитовШапки.Колонки Цикл
			КолонкаШапки.Вставить(КолонкаЗагружаемыхРеквизитов.Имя,ЗагружаемыйРеквизит[КолонкаЗагружаемыхРеквизитов.Имя]);
		КонецЦикла;
		
		КолонкиШапки.Вставить(КолонкаШапки.ИмяРеквизита,КолонкаШапки);
		
	КонецЦикла;
	СтруктураРеквизитов.Вставить("КолонкиШапки", КолонкиШапки);
	
КонецПроцедуры // СформироватьСтруктуруКолонок()

// Процедура формирует шапку табличного документа, в соответствии с таблицей загружаемых реквизитов
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, у которого необходимо сформировать шапку
//
Процедура СформироватьШапкуТабличногоДокумента(СтруктураРеквизитов, ТабличныйДокумент) 
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	Колонки = СтруктураРеквизитов.Колонки;
	
	НомерКолонки = 0;
	Для Каждого КлючИЗначение Из Колонки Цикл
		ЗагружаемыйРеквизит = КлючИЗначение.Значение;
		Если НЕ ЗагружаемыйРеквизит.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураРеквизитов.РучнаяНумерацияКолонокТабличногоДокумента Тогда
			НомерКолонки = ЗагружаемыйРеквизит.НомерКолонки;
		Иначе
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если НомерКолонки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗагружаемыйРеквизит.ШиринаКолонки = 0 Тогда
			
			ШиринаКолонки = 40;
			Если ЗагружаемыйРеквизит.ОписаниеТипов.Типы().Количество() = 1 Тогда
				ПервыйТип = ЗагружаемыйРеквизит.ОписаниеТипов.Типы()[0];
				Если ПервыйТип = Тип("Строка") Тогда
					Если ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина = 0 Тогда
						ШиринаКолонки = 80;
					Иначе
						ШиринаКолонки = Мин(Макс(ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина,10),80);
					КонецЕсли;
				ИначеЕсли ПервыйТип = Тип("Число") Тогда
					ШиринаКолонки = Макс(ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.Разрядность,10);
				ИначеЕсли ПервыйТип = Тип("Булево") Тогда
					ШиринаКолонки = 10;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ШиринаКолонки = ЗагружаемыйРеквизит.ШиринаКолонки;
		КонецЕсли;
		
		Область = ТабличныйДокумент.Область("R1C"+НомерКолонки);
		БылТекст = НЕ ПустаяСтрока(Область.Текст);
		Область.Текст       = ?(БылТекст,Область.Текст + Символы.ПС,"") + ЗагружаемыйРеквизит.ПредставлениеРеквизита;
		Область.Расшифровка = ЗагружаемыйРеквизит.ИмяРеквизита;
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		ОбластьКолонки = ТабличныйДокумент.Область("C"+НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ?(БылТекст,Макс(ОбластьКолонки.ШиринаКолонки,ШиринаКолонки),ШиринаКолонки);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьШапкуТабличногоДокумента()

// Функция возвращает метаданные источника данных
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   ОбъектМетаданныхКонфигурация	- Объект метаданных
//
Функция ПолучитьМетаданныеИсточника(СтруктураРеквизитов) Экспорт 
	
	РежимЗагрузки           = СтруктураРеквизитов.РежимЗагрузки;
	СсылкаИсточника         = СтруктураРеквизитов.СсылкаИсточника;
	ТабличнаяЧастьИсточника = СтруктураРеквизитов.ТабличнаяЧастьИсточника;
	ИмяВидаРегистра         = СтруктураРеквизитов.ИмяВидаРегистра;
	ИмяСправочника          = СтруктураРеквизитов.ИмяСправочника;
	
	Если РежимЗагрузки = 0 Тогда
		
		Если НЕ СсылкаИсточника = Неопределено Тогда
			Возврат СсылкаИсточника.Метаданные();
		КонецЕсли;
		
	ИначеЕсли РежимЗагрузки = 1 ИЛИ РежимЗагрузки = 3 Тогда
		
		Если НЕ СсылкаИсточника = Неопределено и НЕ ТабличнаяЧастьИсточника = Неопределено Тогда
			Возврат СсылкаИсточника.Метаданные().ТабличныеЧасти.Найти(ТабличнаяЧастьИсточника);
		ИначеЕсли НЕ ПустаяСтрока(ИмяВидаРегистра) Тогда
			Возврат Метаданные.РегистрыСведений[ИмяВидаРегистра];
		ИначеЕсли НЕ ПустаяСтрока(ИмяСправочника) Тогда
			Возврат Метаданные.Справочники[ИмяСправочника];
		КонецЕсли;
		
	ИначеЕсли РежимЗагрузки = 2 Тогда
		
		Если НЕ ПустаяСтрока(ИмяВидаРегистра) Тогда
			Возврат Метаданные.РегистрыСведений[ИмяВидаРегистра];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьМетаданныеИсточника()

// Процедура обновляет содержимое табличного документа, в соответствии с таблицей загружаемых реквизитов
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, который необходимо обновить
//  БезВопросов       - Булево				- Если Ложь, спрашивать об очистке табличного документа, 
//  если он не пустой, Истина - иначе
//  ЗаполнитьИзТЧДокумента - Булево         - табличный документ будет заполнен текущими значениями 
//  табличной части документа (имеет значение при РежимЗагрузки=1,3)
//
Процедура ОбновитьДанныеТабличногоДокумента(СтруктураРеквизитов, ТабличныйДокумент, БезВопросов = Ложь, ЗаполнитьИзТЧДокумента=Истина) Экспорт
	
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруКолонок(СтруктураРеквизитов);
	СформироватьШапкуТабличногоДокумента(СтруктураРеквизитов, ТабличныйДокумент);
	
	НомерСтроки = СтруктураРеквизитов.ПерваяСтрокаДанныхТабличногоДокумента;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураРеквизитов);
	
	Если СтруктураРеквизитов.РежимЗагрузки = 0 Или СтруктураРеквизитов.РежимЗагрузки = 2
		Или МетаданныеИсточника = Неопределено Или Не ЗаполнитьИзТЧДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураРеквизитов.ТЧДокумента=Неопределено И СтруктураРеквизитов.СсылкаИсточника<>Неопределено Тогда
		Источник = СтруктураРеквизитов.СсылкаИсточника[СтруктураРеквизитов.ТабличнаяЧастьИсточника];
	ИначеЕсли СтруктураРеквизитов.ТЧДокумента<>Неопределено тогда
		Источник = СтруктураРеквизитов.ТЧДокумента;
	Иначе
		// Очистим тип загружаемого объекта, он явно поменялся.
		СтруктураРеквизитов.ИмяСправочника = "";
		СтруктураРеквизитов.ИмяВидаРЕгистра = "";
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Источник Цикл
		
		НомерКолонки = 0;
		
		Для Каждого ЗагружаемыйРеквизит Из СтруктураРеквизитов.ТаблицаЗагружаемыхРеквизитов Цикл
			
			Если Не ЗагружаемыйРеквизит.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтруктураРеквизитов.РучнаяНумерацияКолонокТабличногоДокумента Тогда
				НомерКолонки = ЗагружаемыйРеквизит.НомерКолонки;
			Иначе
				НомерКолонки = НомерКолонки + 1;
			КонецЕсли;
			
			Если НомерКолонки > 0 Тогда
				Область = ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C"+НомерКолонки);
				Значение = Строка[ЗагружаемыйРеквизит.ИмяРеквизита];
				
				Если ПустаяСтрока(ЗагружаемыйРеквизит.ИскатьПо) Тогда
					Представление = Значение;
				Иначе
					Попытка
						Представление = Значение[ЗагружаемыйРеквизит.ИскатьПо];
					Исключение
						Представление = Значение;
					КонецПопытки;
				КонецЕсли;
				
				Область.Текст = Представление;
				Область.Расшифровка = Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьДанныеТабличногоДокумента(()

// Функция выполняет инициализацию структуры параметров
//
Функция Инициализация() Экспорт
	
	МенеджерыОбъектовМетаданных = Новый Структура;
	МенеджерыОбъектовМетаданных.Вставить("Справочники", Справочники);
	МенеджерыОбъектовМетаданных.Вставить("Перечисления", Перечисления);
	МенеджерыОбъектовМетаданных.Вставить("Документы", Документы);
	МенеджерыОбъектовМетаданных.Вставить("ПланыВидовХарактеристик", ПланыВидовХарактеристик);
	МенеджерыОбъектовМетаданных.Вставить("ПланыСчетов", ПланыСчетов);
	МенеджерыОбъектовМетаданных.Вставить("ПланыВидовРасчета", ПланыВидовРасчета);
	МенеджерыОбъектовМетаданных.Вставить("БизнесПроцессы", БизнесПроцессы);
	МенеджерыОбъектовМетаданных.Вставить("Задачи", Задачи);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МенеджерыОбъектовМетаданных", МенеджерыОбъектовМетаданных);
	
	СтруктураПараметров.Вставить("КешМенеджеровПоТипу", Новый Соответствие);
	
	ПримитивныеТипы = Новый Структура;
	ПримитивныеТипы.Вставить("Число", Тип("Число"));
	ПримитивныеТипы.Вставить("Строка", Тип("Строка"));
	ПримитивныеТипы.Вставить("Дата", Тип("Дата"));
	ПримитивныеТипы.Вставить("Булево", Тип("Булево"));
	
	СтруктураПараметров.Вставить("ПримитивныеТипы", ПримитивныеТипы);
	
	Возврат СтруктураПараметров;
	
КонецФункции
// Функция проверки того, что переданная ссылка является ссылкой на документ
//
Функция ПроверитьЧтоЭтоДокумент(СсылкаИсточника) Экспорт
	Возврат Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаИсточника));
КонецФункции

// Функция получения списка значений имен табличных частей по переданной ссылке
//
Функция ПолучитьСписокТабличныхЧастей(СсылкаИсточника) Экспорт
	СписокВыбора = Новый СписокЗначений;
	
	Если СсылкаИсточника = Неопределено Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	Для Каждого ТабличнаяЧасть Из СсылкаИсточника.Метаданные().ТабличныеЧасти Цикл
		СписокВыбора.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Представление());
	КонецЦикла;
	
	Возврат СписокВыбора;
КонецФункции

// Функция возвращает список, элементами которого выступают возможные имена представления загружаемого реквизита
//
// Параметры:
//  ЗагружаемыйРеквизит - Строка	- Строка таблицы значений загружаемого реквизита
//
// Возвращаемое значение:
//  СписокЗначений		- Список значений; значение списка - строка имя представления
//
Функция ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	Если ЗагружаемыйРеквизит.ОписаниеТипов.Типы().Количество() = 1 Тогда
		
		Тип = ЗагружаемыйРеквизит.ОписаниеТипов.Типы()[0];
		
		МетаданныеТипа      = Метаданные.НайтиПоТипу(Тип);
		ЭтоСправочник       = Справочники.ТипВсеСсылки().СодержитТип(Тип);
		ЭтоСчет             = ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип);
		ЭтоВидХарактеристик = ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип);
		Если ЭтоСправочник Или ЭтоСчет Или ЭтоВидХарактеристик Тогда
			
			ЕстьКод = МетаданныеТипа.ДлинаКода > 0;
			ЕстьИмя = МетаданныеТипа.ДлинаНаименования > 0;
			
			ВидОсновногоПредставление = ?(ЭтоСправочник, Метаданные.СвойстваОбъектов.ОсновноеПредставлениеСправочника,
			?(ЭтоСчет,Метаданные.СвойстваОбъектов.ОсновноеПредставлениеСчета,Метаданные.СвойстваОбъектов.ОсновноеПредставлениеВидаХарактеристики));
			
			ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьСписокВыбораИменПредставлений(Тип, СписокВыбора);
			
			Если МетаданныеТипа.ОсновноеПредставление = ВидОсновногоПредставление.ВВидеКода Тогда
				
				Если ЕстьКод Тогда
					СписокВыбора.Добавить("Код", "Код");
				КонецЕсли;
				
				Если ЕстьИмя Тогда
					СписокВыбора.Добавить("Наименование", "Наименование");
				КонецЕсли;
				
			Иначе
				
				Если ЕстьИмя Тогда
					СписокВыбора.Добавить("Наименование", "Наименование");
				КонецЕсли;
				
				Если ЕстьКод Тогда
					СписокВыбора.Добавить("Код", "Код");
				КонецЕсли;
				
			КонецЕсли;
			
			Для Каждого Реквизит Из МетаданныеТипа.Реквизиты Цикл
				
				Если Не Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать
					И Реквизит.Тип.Типы().Количество() = 1 И Реквизит.Тип.Типы()[0] = Тип ("Строка")
					И Не НРег(Реквизит.Имя) = "штрихкод" Тогда
					
					СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Представление());
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если (Тип = Тип("СправочникСсылка.Номенклатура")) ИЛИ (Тип = Тип("СправочникСсылка.ХарактеристикиНоменклатуры")) Тогда
				СписокВыбора.Добавить("ШтрихКод", "Штрих-код");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции // ПолучитьСписокИменПредставлений()

// Функция возвращает список, элементами которого выступают возможные связи по владельцу для загружаемого реквизита
//
// Параметры:
//  ЗагружаемыйРеквизит - Строка	- Строка таблицы значений загружаемого реквизита
//
// Возвращаемое значение:
//  СписокЗначений		- Список значений; значение списка - строка имя колонки связи или ссылка на элемент связи
//
Функция ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов) Экспорт
	
	ЕстьТипСамогоОбъекта = Ложь;
	ОписаниеТиповСправочника = Неопределено;
	
	СписокВыбора = Новый СписокЗначений;
	ТипыВладельцев = Новый Соответствие;
	
	Если ЗагружаемыйРеквизит.ОписаниеТипов.Типы()[0] = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		СписокВыбора.Добавить("Вычисляется по категории номенклатуры", "Вычисляется по категории номенклатуры");
	КонецЕсли;
		
	Для Каждого ТипКолонки Из ЗагружаемыйРеквизит.ОписаниеТипов.Типы() Цикл
		Если Справочники.ТипВсеСсылки().СодержитТип(ТипКолонки) Тогда
			ТекВладельцыКолонки = Метаданные.НайтиПоТипу(ТипКолонки).Владельцы;
			Для Каждого ТекВладелец Из ТекВладельцыКолонки Цикл
				ТипВладельца   = Тип(СтрЗаменить(ТекВладелец.ПолноеИмя(), ".", "Ссылка."));
				Если ТипыВладельцев[ТипВладельца] = Неопределено Тогда
 					Если ТипВладельца = ОписаниеТиповСправочника Тогда
						ЕстьТипСамогоОбъекта = Истина;
					КонецЕсли;
					ТипыВладельцев.Вставить(ТипВладельца, ТекВладелец.ПолноеИмя());
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ТипыВладельцев Цикл
		Для Каждого КолонкаСвязиПоВладельцу Из ТаблицаЗагружаемыхРеквизитов Цикл
			Для Каждого ТекТипВладельца Из КолонкаСвязиПоВладельцу.ОписаниеТипов.Типы() Цикл
				Если ТекТипВладельца = КлючИЗначение.Ключ Тогда
					СписокВыбора.Добавить(КолонкаСвязиПоВладельцу.ИмяРеквизита,КолонкаСвязиПоВладельцу.ИмяРеквизита);
					Для Каждого ТекРеквизитВладельца Из Метаданные.НайтиПоТипу(ТекТипВладельца).Реквизиты Цикл
						Для Каждого ТекПроверкаТипов Из ТипыВладельцев Цикл
							Если ТекРеквизитВладельца.Тип.СодержитТип(ТекПроверкаТипов.Ключ) Тогда
								СписокВыбора.Добавить(КолонкаСвязиПоВладельцу.ИмяРеквизита+"."+ТекРеквизитВладельца.Имя, КолонкаСвязиПоВладельцу.ИмяРеквизита+"."+ТекРеквизитВладельца.Имя);
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции // ПолучитьСписокСвязейПоВладельцу()

// Функция возвращает список, элементами которого выступают возможные связи по типу для загружаемого реквизита
//
// Параметры:
//  ЗагружаемыйРеквизит - Строка	- Строка таблицы значений загружаемого реквизита
//
// Возвращаемое значение:
//  СписокЗначений		- Список значений; значение списка - строка имя колонки связи или ссылка на элемент связи
//
Функция ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит,ТаблицаЗагружаемыхРеквизитов) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	ВозможныеПланыСчетов = Новый Структура;
	Для Каждого ПланСчетов Из Метаданные.ПланыСчетов Цикл
		Если ПланСчетов.ВидыСубконто = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ПланСчетов.ВидыСубконто.Тип = ЗагружаемыйРеквизит.ОписаниеТипов Тогда
			ВозможныеПланыСчетов.Вставить(ПланСчетов.Имя,ПланыСчетов[ПланСчетов.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПланСчетов Из ВозможныеПланыСчетов Цикл
		ТипЗНЧПланСчетов = ТипЗНЧ(ПланСчетов.Значение.ПустаяСсылка());
		Для Каждого КолонкаСвязиПоТипу Из ТаблицаЗагружаемыхРеквизитов Цикл
			Если КолонкаСвязиПоТипу.ОписаниеТипов.Типы()[0] = ТипЗНЧПланСчетов Тогда
				СписокВыбора.Добавить(КолонкаСвязиПоТипу.ИмяРеквизита,КолонкаСвязиПоТипу.ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ ВозможныеПланыСчетов.Количество() = 0 Тогда
		СписокВыбора.Добавить(Неопределено, "< пустое значение >");
	КонецЕсли;
	
	Для Каждого ПланСчетов Из ВозможныеПланыСчетов Цикл
		СписокВыбора.Добавить("ПланСчетовСсылка."+ПланСчетов.Ключ,"<"+ПланСчетов.Ключ+">");
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции // ПолучитьСписокСвязейПоТипу()

// Функция "расщепляет" строку на подстроки, используя заданный
//		разделитель. Разделитель может иметь любую длину.
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//
//	Параметры:
//		Стр - 			Строка	- Строка, которую необходимо разложить на подстроки.
//								Параметр передается по значению.
//		Разделитель - 	Строка	- Строка-разделитель, по умолчанию - запятая.
//
//	Возвращаемое значение:
//		Массив 	- Массив значений, элементы которого подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	ЭтоПробел = Разделитель = " ";
	Если ЭтоПробел Тогда
		Стр = СокрЛП(Стр);
		ДлинаРазделителя = 0;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
	КонецЕсли;
	
	МассивСтрок = Новый Массив();
	Пока СтрДлина(Стр) > 0 Цикл
		Поз = Найти(Стр, Разделитель);
		Если Поз = 0 Тогда
			МассивСтрок.Добавить(Стр);
			Прервать;
		КонецЕсли;
		МассивСтрок.Добавить(Лев(Стр, Поз - 1));
		Стр = Сред(Стр, Поз + ДлинаРазделителя);
		Если ЭтоПробел Тогда
			Стр = СокрЛ(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции // РазложитьСтрокуВМассивПодстрок

// Функция приводит строковое представление числа к его значению
//
// Параметры:
//  Представление - Строка			- Представление числа
//  ОписаниеТипов - ОписаниеТипов	- Допустимое описание типов численного значения
//  Примечание    - Строка			- Примечание (необязательный).
//
// Возвращаемое значение:
//  Число		- Значение типа число
//
Функция ПривестиКЧислу(Представление, Знач ОписаниеТипов = Неопределено, Примечание = "") Экспорт
	
	Если ОписаниеТипов = Неопределено Тогда
		ОписаниеТипов = Новый ОписаниеТипов("Число");
	КонецЕсли;
	
	Представление = СтрЗаменить(Представление, " ", "");
	НРегПредставление = НРег(Представление);
	
	Если НРегПредставление = "да"
	 ИЛИ НРегПредставление = "истина"
	 ИЛИ НРегПредставление = "включено"
	 ИЛИ НРегПредставление = "true"
	 ИЛИ НРегПредставление = "1" Тогда
		Возврат 1;
	ИначеЕсли НРегПредставление = "нет"
	 ИЛИ НРегПредставление = "ложь"
	 ИЛИ НРегПредставление = "выключено"
	 ИЛИ НРегПредставление = "false"
	 ИЛИ НРегПредставление = "0" Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат = СтрЗаменить(Представление, Символ(160), ""); // Пробел без перерыва.
	Проверка = СтрЗаменить(Результат, ".", "");
	Проверка = СтрЗаменить(Проверка, ",", "");
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Проверка,, Ложь) Тогда
		Для Счетчик = 0 По 9 Цикл
			Проверка = СтрЗаменить(Проверка, Строка(Счетчик), "");
		КонецЦикла;
		Для Счетчик = 1 По СтрДлина(Проверка) Цикл
			Если Не СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Сред(Проверка, Счетчик, 1))) Тогда
				Примечание = НСтр("ru = 'Неправильный формат числа'");
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Результат = ОписаниеТипов.ПривестиЗначение(Результат);
	Возврат Результат;
	
КонецФункции // мПривестиКЧислу()

// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  Настройки - ТабличныйДокумент	- Табличный документ или неопределено
//
Процедура ЗаполнитьНастройкиКолонок(Настройки, СтруктураПараметров, МетаданныеДляЗагрузки = Неопределено, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	СтруктураПараметров.ПередЗаписьюОбъекта   = "";
	СтруктураПараметров.ПриЗаписиОбъекта      = "";
	СтруктураПараметров.ПослеДобавленияСтроки = "";
	
	Если ТипЗнч(Настройки) = Тип("ТабличныйДокумент") Тогда
		
		ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст);
		
		ПараметрыДляОбработки = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьПараметрыПоВерсииОбработки(ВерсияОбработки, Настройки);		
		ТекущаяСтрока = ПараметрыДляОбработки.ТекущаяСтрока;
		ТекущаяСтрокаШапка = ПараметрыДляОбработки.ТекущаяСтрокаШапка;
		
		Попытка
			
			ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область("R2C5").Текст);
			Если ТекстВосстановленногоРежимаЗагрузки = "в справочник" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "" Тогда
				ВосстановленныйРежимЗагрузки = 0;
			ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "Х" Тогда
				Если ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" Тогда
					ТекстОбъекта = СокрЛП(Настройки.Область("R3C5").Текст);
					Если Лев(ТекстОбъекта, 16) = "РегистрСведений." Тогда
						ВосстановленныйРежимЗагрузки = 2;
					Иначе
						ВосстановленныйРежимЗагрузки = 1;
					КонецЕсли;
				Иначе
					ВосстановленныйРежимЗагрузки = 1;
				КонецЕсли;
			ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в регистр сведений" Тогда
				ВосстановленныйРежимЗагрузки = 2;
			КонецЕсли;
			
			Если СтруктураПараметров.РежимЗагрузки = 3 Тогда
				Если ВосстановленныйРежимЗагрузки = 1 ИЛИ ВосстановленныйРежимЗагрузки = 2 Тогда
					ВосстановленныйРежимЗагрузки = 3;
				ИначеЕсли ВосстановленныйРежимЗагрузки = 0 Тогда
				Иначе
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			ВерсияОбъектовМетаданных = СокрЛП(Настройки.Область("R31C5").Текст);
			
			МетаданныеОбъектаИмя = Настройки.Область("R3C5").Текст;
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(МетаданныеОбъектаИмя);
			
			ТекстСообщения = "";
			
			Если МетаданныеОбъекта = Неопределено Тогда
				МетаданныеОбъекта = ПреобразоватьЗагружаемоеМетаданное(МетаданныеОбъектаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
				Если МетаданныеОбъекта = Неопределено Тогда
					ВызватьИсключение "Неправильный формат файла";
				КонецЕсли;
			КонецЕсли;
			
			Если ВосстановленныйРежимЗагрузки = 0 Тогда
				ВосстановленныйСсылкаИсточника = Новый(СтрЗаменить(МетаданныеОбъекта.ПолноеИмя(),".","Ссылка."));
			ИначеЕсли ВосстановленныйРежимЗагрузки = 1 Тогда
				ВосстановленныйСсылкаИсточника = Новый(СтрЗаменить(МетаданныеОбъекта.Родитель().ПолноеИмя(),".","Ссылка."));
			ИначеЕсли ВосстановленныйРежимЗагрузки = 3 Тогда
				ВосстановленныйСсылкаИсточника = СтруктураПараметров.СсылкаИсточника;
			Иначе
				ВосстановленныйСсылкаИсточника = Неопределено;
			КонецЕсли;
			
			СтруктураУмолчаний = Новый Структура;
			ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
			Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
				СтруктураУмолчанияРеквизита = Новый Структура;
				СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
				СтруктураУмолчанияРеквизита.Вставить("Пометка",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
				СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
				
				Типы = Новый Массив;
				ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст;
				
				Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
					
					кс = Неопределено;кч = Неопределено;кд = Неопределено;
					МассивЧастейТипа = РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
					Если МассивЧастейТипа.Количество() = 0 Тогда
						Продолжить;
					ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
						Тип = ?(Метаданные.НайтиПоПолномуИмени(МассивЧастейТипа[0]) <> Неопределено, Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка.")), Неопределено);
						Если Тип = Неопределено Тогда
							Продолжить;
						КонецЕсли;
					ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
						Тип = Тип("Строка");
						Если МассивЧастейТипа.Количество() = 2 Тогда
							кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
						ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
							кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
						Иначе
							кс = Новый КвалификаторыСтроки;
						КонецЕсли;
					ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
						Тип = Тип("Число");
						кч = Новый КвалификаторыЧисла(ПривестиКЧислу(МассивЧастейТипа[1]),ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
					ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
						Тип = Тип("Булево");
					ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.Дата);
					ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
					ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
					Иначе
						Продолжить;
					КонецЕсли;
					Типы.Добавить(Тип);
				КонецЦикла;
				
				ОписаниеТипов = Новый ОписаниеТипов(Типы, кч, кс, кд);
				СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
				
				РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст;
				
				СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
				СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст);
				ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст;
				СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
				НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбласти + "C13").Текст;
				СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
				ЭтоДополнительныйРеквизит = ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C14").Текст);
				ЭтоСведение = ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C16").Текст);
				СсылкаРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C15").Текст;
				СтруктураУмолчанияРеквизита.Вставить("СсылкаРеквизита",?(ПустаяСтрока(СсылкаРеквизита), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(СсылкаРеквизита)));
				СтруктураУмолчанияРеквизита.Вставить("ЭтоДополнительныйРеквизит",ЭтоДополнительныйРеквизит);
				СтруктураУмолчанияРеквизита.Вставить("ЭтоСведение",ЭтоСведение);
				
				Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
					СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
				Иначе
					СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
					
					СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбласти + "C9").Текст;
					СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
					
					СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбласти + "C10").Текст;
					СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
					
					СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбласти + "C11").Текст));
				КонецЕсли;
				
				СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст), "По равному значению", Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст));
				
				// проверим загруженный реквизит
				ПроверитьЗагружаемыйРеквизит(СтруктураУмолчанияРеквизита, МетаданныеОбъектаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
				
				// Имя реквизита могло измениться
				ИмяРеквизита = СтруктураУмолчанияРеквизита.ИмяРеквизита;
					
				СтруктураУмолчаний.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
				ТекущаяСтрока = ТекущаяСтрока + 1;
				ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
				ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
				
			КонецЦикла;
			
			СтруктураУмолчанийШапки = Новый Структура;
			Если ТекущаяСтрокаШапка<>0 Тогда
				ТекущаяСтрокаШапка = ТекущаяСтрока+5;
				ТекущаяСтрокаОбластиШапкиДокумента = "R" + Формат(ТекущаяСтрокаШапка, "ЧГ=");
				ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C2").Текст;
				Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
					СтруктураУмолчанияРеквизита = Новый Структура;
					СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
					СтруктураУмолчанияРеквизита.Вставить("Пометка",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C1").Текст));
					СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C3").Текст));
					
					Типы = Новый Массив;
					ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C4").Текст;
					
					Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
						
						кс = Неопределено;кч = Неопределено;кд = Неопределено;
						МассивЧастейТипа = РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
						Если МассивЧастейТипа.Количество() = 0 Тогда
							Продолжить;
						ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
							Тип = ?(Метаданные.НайтиПоПолномуИмени(МассивЧастейТипа[0]) <> Неопределено, Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка.")), Неопределено);
							Если Тип = Неопределено Тогда
								Продолжить;
							КонецЕсли;
						ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
							Тип = Тип("Строка");
							Если МассивЧастейТипа.Количество() = 2 Тогда
								кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
							ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
								кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
							Иначе
								кс = Новый КвалификаторыСтроки;
							КонецЕсли;
						ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
							Тип = Тип("Число");
							кч = Новый КвалификаторыЧисла(ПривестиКЧислу(МассивЧастейТипа[1]),ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
						ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
							Тип = Тип("Булево");
						ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
							Тип = Тип("Дата");
							кд = Новый КвалификаторыДаты(ЧастиДаты.Дата);
						ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
							Тип = Тип("Дата");
							кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
						ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
							Тип = Тип("Дата");
							кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
						Иначе
							Продолжить;
						КонецЕсли;
						Типы.Добавить(Тип);
					КонецЦикла;
					
					ОписаниеТипов = Новый ОписаниеТипов(Типы, кч, кс, кд);
					СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
					
					РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C5").Текст;
					
					СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
					СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C6").Текст);
					ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C7").Текст;
					СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
					НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C13").Текст;
					СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
					
					Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
						СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C8").Текст);
					Иначе
						СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C8").Текст);
						
						СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C9").Текст;
						СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
						
						СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C10").Текст;
						СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
						
						СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C11").Текст));
					КонецЕсли;
					
					СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C12").Текст), "По равному значению", Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C12").Текст));
					
					// проверим загруженный реквизит
					ПроверитьЗагружаемыйРеквизит(СтруктураУмолчанияРеквизита, МетаданныеОбъектаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
					
					// Имя реквизита могло измениться
					ИмяРеквизита = СтруктураУмолчанияРеквизита.ИмяРеквизита;
					
					СтруктураУмолчанийШапки.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
					ТекущаяСтрокаШапка = ТекущаяСтрокаШапка + 1;
					ТекущаяСтрокаОбластиШапкиДокумента = "R" + Формат(ТекущаяСтрокаШапка, "ЧГ=");
					ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C2").Текст;
					
				КонецЦикла;
			КонецЕсли;
			
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ОписаниеОшибки());
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Иначе
				ДобавитьВЛог(ТекстОшибки, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Возврат;
		КонецПопытки;
		
		// Проверим структуры с загруженными реквизитами из настройки - есть ли эти реквизиты в метаданных объекта
		ВыполнитьПроверкуПолученныхРеквизитовИзНастройки(МетаданныеОбъекта, СтруктураУмолчаний, СтруктураУмолчанийШапки, ТекстСообщения);
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ТекстНачало = "В связи с изменением структуры метаданных конфигурации были актуализированы следующие настройки загрузки:";
			ТекстСообщения = ТекстНачало + Символы.ПС + ТекстСообщения;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
		Если МетаданныеИсточника = Неопределено И МетаданныеДляЗагрузки = Неопределено Тогда
			Возврат;
		ИначеЕсли МетаданныеИсточника = Неопределено Тогда
			МетаданныеИсточника = МетаданныеДляЗагрузки;
			СтруктураПараметров.ИмяСправочника  = МетаданныеДляЗагрузки.Имя;
			ВосстановленныйРежимЗагрузки = 3;
			СтруктураПараметров.РежимЗагрузки = 3;
		КонецЕсли;
		
		Если Метаданные.Документы.Содержит(МетаданныеИсточника) Тогда
			
			СтруктураПараметров.РежимЗагрузки   = ВосстановленныйРежимЗагрузки;
			СтруктураПараметров.СсылкаИсточника = ВосстановленныйСсылкаИсточника;
			СтруктураПараметров.ТабличнаяЧастьИсточника = ?(ВосстановленныйРежимЗагрузки,МетаданныеОбъекта.Имя,Неопределено);
			
			Если СтруктураПараметров.РежимЗагрузки = 3 Тогда
				СтруктураПараметров.ТЧДокумента = СтруктураПараметров.ТабличнаяЧастьДокументаОбъекта.Выгрузить();
			КонецЕсли;
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
			
			СтруктураПараметров.РежимЗагрузки   = ВосстановленныйРежимЗагрузки;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ПараметрыДляОбработки);
		Если ПараметрыДляОбработки.ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек<>Неопределено Тогда
			СтруктураПараметров.ДополнительныеРеквизитыПоКатегорииНоменклатуры = ПараметрыДляОбработки.ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек.Скопировать();
		Иначе
			СтруктураПараметров.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Очистить();
		КонецЕсли;
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиДополнительныхПараметров(СтруктураПараметров, Настройки, ВерсияОбработки);
		
		СтруктураПараметров.ПередЗаписьюОбъекта = Настройки.Область("R" + Формат(ТекущаяСтрока + 2, "ЧГ=") + "C3").Текст;
		СтруктураПараметров.ПриЗаписиОбъекта    = Настройки.Область("R" + Формат(ТекущаяСтрока + 3, "ЧГ=") + "C3").Текст;
		
		Если СтруктураПараметров.РежимЗагрузки Тогда
			СтруктураПараметров.ПослеДобавленияСтроки = Настройки.Область("R" + Формат(ТекущаяСтрока + 4, "ЧГ=") + "C3").Текст;
		КонецЕсли;
		
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
	КонецЕсли;
		
	Оформление = Неопределено;
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Очистить();
	СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Очистить();
	
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметров.РежимЗагрузки = 0 Тогда 
		
		ЗаполнитьНастройкиКолонокСправочника(СтруктураПараметров);
		
		Если СтруктураПараметров.Свойство("ТаблицаДополнительныхПараметров") И СтруктураПараметров.ТаблицаДополнительныхПараметров<>Неопределено Тогда
			Если СтруктураПараметров.СсылкаИсточника<>Неопределено И ТипЗнч(СтруктураПараметров.СсылкаИсточника) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если СтруктураПараметров.ТаблицаДополнительныхПараметров.Количество() = 0 Тогда
					ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДополнительныхПараметров(СтруктураПараметров);
				КонецЕсли;
			Иначе
				СтруктураПараметров.ТаблицаДополнительныхПараметров.Очистить();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 1 ИЛИ СтруктураПараметров.РежимЗагрузки = 3 Тогда
		
		Если НЕ СтруктураПараметров.ИмяВидаРегистра = "" Тогда
			ЗаполнитьНастройкиКолонокРегистраСведений(СтруктураПараметров);
		ИначеЕсли НЕ СтруктураПараметров.ИмяСправочника = "" Тогда
			ЗаполнитьНастройкиКолонокСправочника(СтруктураПараметров);
		Иначе
			Если СтруктураПараметров.Свойство("ТаблицаДополнительныхПараметров") И СтруктураПараметров.ТаблицаДополнительныхПараметров<>Неопределено Тогда
				Если СтруктураПараметров.ТаблицаДополнительныхПараметров.Количество()=0 Тогда
					ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДополнительныхПараметров(СтруктураПараметров);
				КонецЕсли;
			КонецЕсли;
			ЗаполнитьНастройкиКолонокТабличнойЧасти(СтруктураПараметров);
			ЗаполнитьНастройкиШапки(СтруктураПараметров);
		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
		ЗаполнитьНастройкиКолонокРегистраСведений(СтруктураПараметров);
	КонецЕсли;
	
	Если НЕ СтруктураУмолчаний = Неопределено Тогда
		
		НомерКолонкиОформления = 0;
		Для Каждого КлючИЗначение Из СтруктураУмолчаний Цикл
			Колонка = КлючИЗначение.Значение;
			
			ЗагружаемыйРеквизит = Неопределено;
			ОтборСтрок = Новый Структура("ИмяРеквизита",Колонка.ИмяРеквизита);
			СтрокиТаблицы = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
			Если СтрокиТаблицы.Количество() > 0 Тогда
				ЗагружаемыйРеквизит = СтрокиТаблицы[0];
			КонецЕсли;
			
			Если НЕ ЗагружаемыйРеквизит = Неопределено Тогда
				Индекс = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗаполнитьЗначенияСвойств(ЗагружаемыйРеквизит, Колонка);
					
					СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Сдвинуть(Индекс, НомерКолонкиОформления - Индекс);
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		НомерКолонки = 1;
		Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
			
			ЗагружаемыйРеквизит.Пометка      = Истина;
			ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ СтруктураУмолчанийШапки = Неопределено Тогда
		
		НомерКолонкиОформления = 0;
		Для Каждого КлючИЗначение Из СтруктураУмолчанийШапки Цикл
			Колонка = КлючИЗначение.Значение;
			
			ЗагружаемыйРеквизит = Неопределено;
			ОтборСтрок = Новый Структура("ИмяРеквизита",Колонка.ИмяРеквизита);
			СтрокиТаблицы = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(ОтборСтрок);
			Если СтрокиТаблицы.Количество() > 0 Тогда
				ЗагружаемыйРеквизит = СтрокиТаблицы[0];
			КонецЕсли;
			
			Если НЕ ЗагружаемыйРеквизит = Неопределено Тогда
				Индекс = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗаполнитьЗначенияСвойств(ЗагружаемыйРеквизит, Колонка);
					
					СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Сдвинуть(Индекс, НомерКолонкиОформления - Индекс);
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		НомерКолонки = 1;
		Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки Цикл
			
			ЗагружаемыйРеквизит.Пометка      = Истина;
			ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонок()

// Функция выполняет загрузку данных из табличного документа в справочник или табличную часть документа
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, у которого необходимо сформировать шапку
//  ДопПараметры	  – Структура		    – Структура, содержащая дополнительные параметры обработки
//  ТаблицаРеквизитов – Таблица значений    – Таблица реквизитов
//  ОписаниеОшибок	  – Строка			    – Описание ошибок
//
// Возвращаемое значение:
//  Булево	- Истина, если загрузка прошла без ошибок, Ложь - иначе
//
Функция ЗагрузитьДанные(ТабличныйДокумент,СтруктураПараметров, ВернутьЗагруженнуюСсылку = Ложь, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок;
	КЭШЗначений = Новый ТаблицаЗначений;
	КЭШЗначений.Колонки.Добавить("ТипРеквизита");
	КЭШЗначений.Колонки.Добавить("ИскатьПо");
	КЭШЗначений.Колонки.Добавить("Представление");
	КЭШЗначений.Колонки.Добавить("Ссылка");
	КЭШЗначений.Колонки.Добавить("ЗначениеРеквизита");
	КЭШЗначений.Колонки.Добавить("СписокСлов");
	СтруктураПараметров.Вставить("КЭШЗначений", КЭШЗначений);
	Если СтруктураПараметров.ТЧДокумента <> Неопределено Тогда
		СтруктураПараметров.ТЧДокумента.Очистить();
	КонецЕсли;
	
	// Если передали этот параметр Истина- эти данные уже есть в структуре
	Если Не ВернутьЗагруженнуюСсылку Тогда
		СтруктураИнициализации = Инициализация();
		Для Каждого ЭлементСтруктуры ИЗ СтруктураИнициализации Цикл
			СтруктураПараметров.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьПараметрыПоСрокамГодностиПриЗагрузке(СтруктураПараметров);
	
	Если СтруктураПараметров.ДопПараметры=Неопределено Тогда
		СтруктураПараметров.ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ЗаписыватьОбъект = Истина;
	
	СформироватьСтруктуруКолонок(СтруктураПараметров);
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	
	Если СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("Пометка",Истина)).Количество() = 0 Тогда
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Не отмечен ни один загружаемый реквизит!" + Символы.ПС;
		Возврат Ложь;
	КонецЕсли;
	
	КоличествоЭлементов = ТабличныйДокумент.ВысотаТаблицы - СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента - СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок + 1;
	Если КоличествоЭлементов <= 0 Тогда
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Нет данных для загрузки" + Символы.ПС;
		Возврат Ложь;
	КонецЕсли;
	
	МаксимальныНомерКолонки = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов[0].НомерКолонки; // Строки должны быть (см. проверку пометки)
	Для сч=1 по (СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Количество()-1) Цикл
		Строка = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов[сч];
		Если Строка.Пометка И МаксимальныНомерКолонки < Строка.НомерКолонки Тогда
			МаксимальныНомерКолонки = Строка.НомерКолонки;
		КонецЕсли;	
	КонецЦикла;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.РасширитьДоМаксимальнойКолонкиСУчетомТаблицыДопПараметров(СтруктураПараметров,МаксимальныНомерКолонки);
	
	Если МаксимальныНомерКолонки > ТабличныйДокумент.ШиринаТаблицы Тогда
		// Свойство ШиринаТаблицы не доступно на запись, выполняем фиктивное обращение к ячейке.
		ТабличныйДокумент.Область("R1C"+Формат(МаксимальныНомерКолонки,"ЧН=0; ЧГ=0")).Текст = "";
	КонецЕсли;	
	
	Если СтруктураПараметров.РежимЗагрузки = 0 ИЛИ (СтруктураПараметров.РежимЗагрузки = 3 И НЕ ПустаяСтрока(СтруктураПараметров.ИмяСправочника)) Тогда
		Источник = СтруктураПараметров.СсылкаИсточника;
		ТекстВопросаИсточника = " элементов в справочник: """ + МетаданныеИсточника.Представление() + """";
		
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 1 Тогда
		
		Если СтруктураПараметров.СсылкаИсточника.Пустая() Тогда
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не выбрана ссылка'"));
			Иначе
				ДобавитьВЛог(НСтр("ru= 'Не выбрана ссылка'"), 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
		 
		ОбъектИсточника = СтруктураПараметров.СсылкаИсточника.ПолучитьОбъект();
		Источник = ОбъектИсточника[СтруктураПараметров.ТабличнаяЧастьИсточника];
		ТекстВопросаИсточника = " строк в табличную часть: """ + МетаданныеИсточника.Представление() + """";
		
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
		
		ТекстВопросаИсточника = " записей в регистр сведений: """ + МетаданныеИсточника.Представление() + """";
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 Тогда
		
		ТекстВопросаИсточника = " строк в табличную часть: """ + МетаданныеИсточника.Представление() + """";
		
	КонецЕсли;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗагрузитьЗаводскиеШК(СтруктураПараметров, СтруктураПараметровЛогирования);
	
	ПересекатьСоШтрихКодами = Ложь;
	Если ((СтруктураПараметров.РежимЗагрузки = 0
				И СтруктураПараметров.СсылкаИсточника <> Неопределено
				И ТипЗнч(СтруктураПараметров.СсылкаИсточника) = Тип("СправочникСсылка.Номенклатура"))
			Или (СтруктураПараметров.РежимЗагрузки = 3
				И НЕ ПустаяСтрока(СтруктураПараметров.ИмяСправочника)
				И СтруктураПараметров.ИмяСправочника = "Номенклатура"))
		И СтруктураПараметров.Свойство("ШКЯвляетсяПолемПоискаНоменклатуры")
		И СтруктураПараметров.ШКЯвляетсяПолемПоискаНоменклатуры Тогда
		ПересекатьСоШтрихКодами = Истина;
	КонецЕсли;
	
	// Загрузим шапку
	Если СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Количество()<>0 
		И СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество()<>0  Тогда 
		
		Если СтруктураПараметров.РежимЗагрузки = 1 Тогда
			ЗагрузитьДанныеШапки(ТабличныйДокумент, СтруктураПараметров, ОбъектИсточника, ЗаписыватьОбъект, СтруктураПараметровЛогирования);
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 И СтруктураПараметров.ИмяСправочника="" И СтруктураПараметров.ИмяВидаРегистра="" Тогда
			ЗагрузитьДанныеШапки(ТабличныйДокумент, СтруктураПараметров, СтруктураПараметров.РеквизитыШапкиДокумента, ЗаписыватьОбъект, СтруктураПараметровЛогирования);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Неопределено;
	Если СтруктураПараметров.РежимЗагрузки = 0 ИЛИ (СтруктураПараметров.РежимЗагрузки = 3 И НЕ ПустаяСтрока(СтруктураПараметров.ИмяСправочника)) Тогда
		
		СтрокиПоиска = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("ПолеПоиска,Пометка",Истина,Истина));
		Если НЕ СтрокиПоиска.Количество() = 0 Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|Справочник.Ссылка КАК Ссылка
			|ИЗ Справочник." + МетаданныеИсточника.Имя + " КАК Справочник
			|ГДЕ";
			
			ЕстьХотьОдноУсловиеТочногоПоиска = Ложь;
			Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
				Если СтрокаПоиска.РежимПоиска = "По равному значению" ИЛИ СтрокаПоиска.РежимПоиска = "" Тогда
					ЕстьХотьОдноУсловиеТочногоПоиска = Истина;
					ТекстЗапроса = ТекстЗапроса +"
					|Справочник."+СтрокаПоиска.ИмяРеквизита+" = &" + СтрокаПоиска.ИмяРеквизита + "
					|И";
				КонецЕсли;
				
			КонецЦикла;
			
			ТекстЗапроса = Лев(ТекстЗапроса,СтрДлина(ТекстЗапроса) - ?(ЕстьХотьОдноУсловиеТочногоПоиска,2, 3));
			Запрос = Новый Запрос (ТекстЗапроса);
		КонецЕсли;
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 1 Тогда
		
		Источник.Очистить();
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
		
		ИзмеренияРегистра = Новый Структура;
		Для каждого Колонка Из СтруктураПараметров.Колонки Цикл
			Если Колонка.Значение.МожетБытьПолемПоиска Тогда
				ИзмеренияРегистра.Вставить(Колонка.Ключ,Колонка.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 Тогда
		
	КонецЕсли;
	
	СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Выполняется загрузка"+ ТекстВопросаИсточника  + Символы.ПС;
	СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Всего: " + КоличествоЭлементов  + Символы.ПС;
	
	Загружено = 0;
	НомерТекущейСтроки = 0;
	
	Для К = СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента По ТабличныйДокумент.ВысотаТаблицы - СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок Цикл
	
		Если ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.НадоПрерватьОперациюИзЗаПросроченныхСерий(СтруктураПараметров) Тогда
			Прервать;
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		ТекстыЯчеек = Неопределено;
		Отказ = Ложь;
		ТекущаяСтрока = КонтрольЗаполненияСтроки(ТабличныйДокумент, К, СтруктураПараметров, ТекстыЯчеек,,,СтруктураПараметровЛогирования);
		Если СтруктураПараметров.РежимЗагрузки = 0 ИЛИ (СтруктураПараметров.РежимЗагрузки = 3 И НЕ ПустаяСтрока(СтруктураПараметров.ИмяСправочника)) Тогда
			
			Объект = Неопределено;
			
			СписокШк = Новый Массив;
			// Если это загрузка номенклатуры, то надо "пересечь" выборку со штрихкодами.
			Если ПересекатьСоШтрихКодами Тогда
				ШтрихКодДляПоиска = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьШтрихкодИзПараметров(ТабличныйДокумент, СтруктураПараметров, ТекстыЯчеек, СтруктураПараметровЛогирования);
				ЗапросПоШк = Новый Запрос;
				ЗапросПоШк.Текст = "ВЫБРАТЬ
				|	ВЫРАЗИТЬ(Штрихкоды.Номенклатура КАК Справочник.Номенклатура) КАК Ссылка
				|ИЗ
				|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
				|ГДЕ
				|	Штрихкоды.Штрихкод = &Штрихкод";
				ЗапросПоШк.УстановитьПараметр("Штрихкод", ШтрихКодДляПоиска);
				СписокШК = ЗапросПоШк.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			КонецЕсли;

			Если Запрос = Неопределено Тогда
				Если СписокШк.Количество()<>0 Тогда
					Попытка
						Объект = СписокШк[0].ПолучитьОбъект();
						Если ТипЗнч(Объект)<>Тип("СправочникОбъект.Номенклатура") Тогда
							Объект = Неопределено;
						КонецЕсли;
					Исключение
						Объект = Неопределено;
					КонецПопытки;
				КонецЕсли;
			Иначе
				СтрокаОшибок = "";
				Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
					
					ЗначениеРеквизита = Неопределено;
					
					ТекущаяСтрока.Свойство(СтрокаПоиска.ИмяРеквизита,ЗначениеРеквизита);
					Если ПустаяСтрока(ЗначениеРеквизита) Тогда
						СтрокаОшибок = ?(ПустаяСтрока(СтрокаОшибок),"",СтрокаОшибок + ", ") + СтрокаПоиска.ПредставлениеРеквизита;
					Иначе
						Запрос.УстановитьПараметр(СтрокаПоиска.ИмяРеквизита,ТекущаяСтрока[СтрокаПоиска.ИмяРеквизита]);
					КонецЕсли;
					
				КонецЦикла;
				
				Если НЕ ПустаяСтрока(СтрокаОшибок) Тогда
					СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Строка " + НомерТекущейСтроки + " не может быть записана.Не указано значение ключевых реквизитов: "  + Символы.ПС;
					Продолжить;
				КонецЕсли;
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если ПересекатьСоШтрихКодами Тогда
					Пока Выборка.Следующий() Цикл
						Если СписокШк.Найти(Выборка.Ссылка)<>Неопределено Тогда
							Объект = Выборка.Ссылка.ПолучитьОбъект();
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					Если Выборка.Следующий() Тогда
						Объект = Выборка.Ссылка.ПолучитьОбъект();
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			ОбъектНайден = НЕ Объект = Неопределено;
			
			Если НЕ ОбъектНайден Тогда
				Если СтруктураПараметров.НеСоздаватьНовыхЭлементов Тогда
					Продолжить;
				Иначе
					ОбъектЯвляетсяГруппой = ТекущаяСтрока.Свойство("ЭтоГруппа") И ТекущаяСтрока.ЭтоГруппа;
					Если ОбъектЯвляетсяГруппой Тогда
						Объект = Справочники[МетаданныеИсточника.Имя].СоздатьГруппу();
					Иначе
						Объект = Справочники[МетаданныеИсточника.Имя].СоздатьЭлемент();
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если СтруктураПараметров.НеОбновлятьСуществующиеЭлементы Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// Для номенклатуры нужно подтянуть параметры Категории.
			Если Объект <> Неопределено
				И СтруктураПараметров.ИмяСправочника = "Номенклатура"
				И ТекущаяСтрока.Свойство("КатегорияНоменклатуры")
				И ЗначениеЗаполнено(ТекущаяСтрока.КатегорияНоменклатуры) Тогда
				Объект.КатегорияНоменклатуры = ТекущаяСтрока.КатегорияНоменклатуры;
				Если ТекущаяСтрока.Свойство("ТипНоменклатуры")
					И ЗначениеЗаполнено(ТекущаяСтрока.ТипНоменклатуры) Тогда
					Объект.ТипНоменклатуры = ТекущаяСтрока.ТипНоменклатуры;
				Иначе
					Объект.ТипНоменклатуры = ТекущаяСтрока.КатегорияНоменклатуры.ТипНоменклатурыПоУмолчанию;
				КонецЕсли;
				КатегорииНоменклатурыСервер.ЗаполнитьСвойстваНоменклатурыПоКатегории(Объект, Истина);
			КонецЕсли;
			
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 1 Тогда
			Объект = Источник.Добавить();
			ОбъектНайден = Ложь;
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
			Объект = РегистрыСведений[МетаданныеИсточника.Имя].СоздатьМенеджерЗаписи();
			Для каждого КлючИЗначение Из ТекущаяСтрока Цикл
				
				Если ИзмеренияРегистра.Свойство(КлючИЗначение.Ключ) Тогда
					Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ СтруктураПараметров.ЗамещатьСуществующиеЗаписи Тогда
				Объект.Прочитать();
				ОбъектНайден = Объект.Выбран();
			Иначе
				ОбъектНайден = Ложь;
			КонецЕсли;
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 Тогда
			Объект = СтруктураПараметров.ТЧДокумента.Добавить();
			ОбъектНайден = Ложь;
		КонецЕсли;
		
		СтруктураПараметров.ВладелецСерии = Неопределено;
		
		Для Каждого КлючИЗначение Из ТекущаяСтрока Цикл
			
			Если НЕ ОбъектНайден
				ИЛИ КлючИЗначение.Ключ = "ДополнительныеРеквизитыИСведенияДляЗагрузки"
				ИЛИ СтруктураПараметров.Колонки[КлючИЗначение.Ключ].Пометка Тогда
				Попытка
					Если (СтруктураПараметров.РежимЗагрузки = 3)
						ИЛИ (ПроверитьЧтоЭтоДокумент(СтруктураПараметров.СсылкаИсточника) И (СтруктураПараметров.РежимЗагрузки = 1)) Тогда
						Если НЕ ор_ЗначениеНеЗаполнено(КлючИЗначение.Значение) Тогда 
							Если КлючИЗначение.Ключ<>"ЭтоГруппа" Тогда
								Если КлючИЗначение.Ключ = "ДополнительныеРеквизитыИСведенияДляЗагрузки" Тогда
									Попытка
										Объект.ДополнительныеСвойства.Вставить("ДополнительныеРеквизитыИСведенияДляЗагрузки", КлючИЗначение.Значение);
									Исключение
									КонецПопытки;
								Иначе
									Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
								КонецЕсли;
							КонецЕсли;
							Попытка
								Если КлючИЗначение.Ключ = "СтавкаНДС" Тогда
									Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
										СтавкаНДСНоменклатуры = Справочники.СтавкиНДС.СтавкаНДС(Объект.Номенклатура.ВидСтавкиНДС);
										Если СтавкаНДСНоменклатуры <> Объект.СтавкаНДС Тогда
											ТекстСообщения = НСтр("ru = 'Для номенклатуры %1 ставка НДС в карточке (%2) отличается от ставки НДС в накладной (%3).'");
											ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(Объект.Номенклатура), СтавкаНДСНоменклатуры, Объект.СтавкаНДС);
											Если СтруктураПараметровЛогирования = Неопределено Тогда
												ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
											Иначе
												ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							Исключение
							КонецПопытки;
						КонецЕсли;
						
					Иначе
						Если КлючИЗначение.Ключ<>"ЭтоГруппа" Тогда
							Если КлючИЗначение.Ключ = "ДополнительныеРеквизитыИСведенияДляЗагрузки" Тогда
								Попытка
									Объект.ДополнительныеСвойства.Вставить("ДополнительныеРеквизитыИСведенияДляЗагрузки", КлючИЗначение.Значение);
								Исключение
								КонецПопытки;
							Иначе
								Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Исключение
					СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Ошибка при установке значения реквизита """ + КлючИЗначение.Ключ + "" + ОписаниеОшибки() + Символы.ПС;
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если СтруктураПараметров.РежимЗагрузки = 0 ИЛИ (СтруктураПараметров.РежимЗагрузки = 3 И НЕ ПустаяСтрока(СтруктураПараметров.ИмяСправочника)) Тогда
			Если НЕ Отказ и ЗаписатьОбъект(Объект, СтруктураПараметров, ТекстыЯчеек, СтруктураПараметровЛогирования) Тогда
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + ?(ОбъектНайден,"Изменен","Загружен") + " элемент справочника: " + Объект.ссылка + Символы.ПС;
				Загружено = Загружено + 1;
			Иначе
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Объект не " + ?(ОбъектНайден,"изменен","загружен") + ". Элемент справочника: " + Объект + "." + Символы.ПС;
			КонецЕсли;
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 1 Тогда
			
			Если НЕ ОбработатьСобытиеПослеДобавленияСтроки(ОбъектИсточника, Объект, ТекстыЯчеек, СтруктураПараметров, СтруктураПараметровЛогирования) Тогда
				Отказ = Истина;
			КонецЕсли;
			
			Если НЕ Отказ Тогда
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Обработана строка: " + (Загружено + 1) + Символы.ПС;
			Иначе
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "При добавлении строки " + (Загружено + 1) + " возникли ошибки. " + Символы.ПС;
				ЗаписыватьОбъект = Ложь;
			КонецЕсли;
			
			Загружено = Загружено + 1;
			
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
			Если НЕ Отказ и ЗаписатьОбъект(Объект, СтруктураПараметров, ТекстыЯчеек, СтруктураПараметровЛогирования) Тогда
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + ?(ОбъектНайден,"Изменена","Добавлена") + " запись № " + НомерТекущейСтроки + "." + Символы.ПС;
				Загружено = Загружено + 1;
			Иначе
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Запись не " + ?(ОбъектНайден,"изменена","загружена") + ". № записи: " + НомерТекущейСтроки + "." + Символы.ПС;
			КонецЕсли;
		ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 Тогда
			
			Если НЕ ОбработатьСобытиеПослеДобавленияСтроки(СтруктураПараметров.СсылкаИсточника, Объект, ТекстыЯчеек, СтруктураПараметров, СтруктураПараметровЛогирования) Тогда
				Отказ = Истина;
			КонецЕсли;
			
			Если НЕ Отказ Тогда
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Обработана строка: " + (Загружено + 1) + Символы.ПС;
			Иначе
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "При добавлении строки " + (Загружено + 1) + " возникли ошибки. " + Символы.ПС;
				ЗаписыватьОбъект = Ложь;
			КонецЕсли;
			
			Загружено = Загружено + 1;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПроверитьНовыеПросроченныеСерии(ОбъектИсточника, СтруктураПараметров, СтруктураПараметровЛогирования);
	
	Если СтруктураПараметров.РежимЗагрузки = 1 Тогда
		Если ОбъектИсточника.Метаданные().Реквизиты.Найти("Контрагент")<>Неопределено И НЕ ЗначениеЗаполнено(ОбъектИсточника.Контрагент) И СтруктураПараметров.Свойство("Поставщик") И ЗначениеЗаполнено(СтруктураПараметров.Поставщик) Тогда
			ОбъектИсточника.Контрагент = СтруктураПараметров.Поставщик;
		КонецЕсли;
		Если ЗаписыватьОбъект и ЗаписатьОбъект(ОбъектИсточника, СтруктураПараметров, , СтруктураПараметровЛогирования) Тогда
			
			ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДобавитьВОписаниеОшибокСтрокуОЗагрузкеСправочника(СтруктураПараметров, ТекстВопросаИсточника, Загружено, КоличествоЭлементов,,СтруктураПараметровЛогирования);
			
			Возврат Истина;
		Иначе
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Объект не записан: " + Объект + "." + Символы.ПС;
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибок);
			Иначе
				ДобавитьВЛог(СтруктураПараметров.ОписаниеОшибок, 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 0 Тогда
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Выполнена обработка"+ 	ТекстВопросаИсточника + Символы.ПС;
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "" +Загружено +" из "+ КоличествоЭлементов + " элементов." + Символы.ПС;
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибок);
		Иначе
			ДобавитьВЛог(СтруктураПараметров.ОписаниеОшибок, 3, СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Выполнена обработка"+ 	ТекстВопросаИсточника + Символы.ПС;
		СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "" +Загружено +" из "+ КоличествоЭлементов + " записей." + Символы.ПС;
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибок);
		Иначе
			ДобавитьВЛог(СтруктураПараметров.ОписаниеОшибок, 3, СтруктураПараметровЛогирования);
		КонецЕсли;
		
		Возврат Истина;
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 Тогда
		
		Если ВернутьЗагруженнуюСсылку Тогда
			Попытка
				ВозвращаемоеЗначениеТекущее = Объект.Ссылка;
			Исключение
				ВозвращаемоеЗначениеТекущее = Неопределено;
			КонецПопытки;
			Возврат ВозвращаемоеЗначениеТекущее;
		КонецЕсли;
		
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДобавитьВОписаниеОшибокСтрокуОЗагрузкеСправочника(СтруктураПараметров, ТекстВопросаИсточника, Загружено, КоличествоЭлементов,,СтруктураПараметровЛогирования);
		
		СтруктураРезультата = Новый Структура("ОписаниеОшибок,ТЧДокумента,РеквизитыШапкиДокумента");
		СтруктураРезультата.ТЧДокумента = СтруктураПараметров.ТЧДокумента;
		
		Если СтруктураПараметров.Свойство("РеквизитыШапкиДокумента") Тогда
			РеквизитыШапкиДокумента = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПараметров.РеквизитыШапкиДокумента);
			// Удаляем реквизиты не помеченые к загрузке, иначе они перезатерут данные на форме.
			Для Каждого ТекущаяКолонка Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки Цикл
				Если Не ТекущаяКолонка.Пометка И РеквизитыШапкиДокумента.Свойство(ТекущаяКолонка.ИмяРеквизита) Тогда
					РеквизитыШапкиДокумента.Удалить(ТекущаяКолонка.ИмяРеквизита);
				КонецЕсли;
			КонецЦикла;
			СтруктураРезультата.РеквизитыШапкиДокумента = РеквизитыШапкиДокумента;
		КонецЕсли;
		
		СтруктураРезультата.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок;
		
		Возврат СтруктураРезультата;
		
	КонецЕсли;
	
КонецФункции // ЗагрузитьДанные()

// Процедура выполняет контроль заполнения данных табличного документа
// сообщает об ошибках и устанавливает комментарии к ошибочным ячейкам
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, у которого необходимо сформировать шапку
//
Процедура КонтрольЗаполнения(ТабличныйДокумент, СтруктураПараметров, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	СтруктураИнициализации = Инициализация();
	Для Каждого ЭлементСтруктуры ИЗ СтруктураИнициализации Цикл
		СтруктураПараметров.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;
	КЭШЗначений = Новый ТаблицаЗначений;
	КЭШЗначений.Колонки.Добавить("ТипРеквизита");
	КЭШЗначений.Колонки.Добавить("ИскатьПо");
	КЭШЗначений.Колонки.Добавить("Представление");
	КЭШЗначений.Колонки.Добавить("Ссылка");
	КЭШЗначений.Колонки.Добавить("ЗначениеРеквизита");
	КЭШЗначений.Колонки.Добавить("СписокСлов");
	СтруктураПараметров.Вставить("КЭШЗначений", КЭШЗначений);
	
	СформироватьСтруктуруКолонок(СтруктураПараметров);
	КоличествоОшибок = 0;
	
	Если СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Количество()<>0 
		И СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество()<>0 
		И (СтруктураПараметров.РежимЗагрузки = 1 ИЛИ СтруктураПараметров.РежимЗагрузки = 3 И СтруктураПараметров.ИмяСправочника="" И СтруктураПараметров.ИмяВидаРегистра="") Тогда
		
		КонтрольЗаполненияСтроки(ТабличныйДокумент, СтруктураПараметров.ПерваяСтрокаДанныхШапки, СтруктураПараметров,,КоличествоОшибок, Истина, СтруктураПараметровЛогирования);
		
	КонецЕсли;
	
	КоличествоЭлементов = ТабличныйДокумент.ВысотаТаблицы - СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента - СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок+ 1;
	
	Для К = 0  По КоличествоЭлементов - СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок - 1 Цикл
		КонтрольЗаполненияСтроки(ТабличныйДокумент, К + СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента, СтруктураПараметров,,КоличествоОшибок,,СтруктураПараметровЛогирования);
	КонецЦикла;
	
	Если КоличествоОшибок Тогда
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Выявлены ячейки, содержащие ошибки/неоднозначное представление'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Выявлены ячейки, содержащие ошибки/неоднозначное представление'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	Иначе
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ячеек, содержащих ошибки, не выявлено'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Ячеек, содержащих ошибки, не выявлено'"), 3, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // КонтрольЗаполнения()

// Функция обрабатывает событие "После добавления строки",
// определенное пользователем в форме редактирования событий
//
// Параметры:
//  Объект      	- ТабличныйДокумент	- Записываемый объект
//  ТекущиеДанные  	- Структура			- Структура загруженных значений
//  ТекстыЯчеек    	- Массив			- Массив текстов ячеек строки
//
// Возвращаемое значение:
//  Булево			- Истина, если в событие "После добавления строки" не был установлен Отказ, Ложь - иначе
//
Функция ОбработатьСобытиеПослеДобавленияСтроки(Объект, ТекущиеДанные, ТекстыЯчеек, СтруктураПараметров, СтруктураПараметровЛогирования = Неопределено)
	
	Попытка
		
		СсылкаИсточника = СтруктураПараметров.СсылкаИсточника;
		ТаблицаЗагружаемыхРеквизитов = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов;
		ТаблицаДополнительныхПараметров = СтруктураПараметров.ТаблицаДополнительныхПараметров;
		
		Выполнить(СтруктураПараметров.ПослеДобавленияСтроки);
		
		// Рассчитаем количество
		Если ЕстьРеквизитТЧОбъекта("Количество", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника)
		   И ЕстьРеквизитТЧОбъекта("КоличествоУпаковок", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника)Тогда
			
			Если ТекущиеДанные.КоличествоУпаковок<>0 Тогда
				Если ЗначениеЗаполнено(ТекущиеДанные.Упаковка) Тогда
					ТекущиеДанные.Количество = ТекущиеДанные.КоличествоУпаковок * ТекущиеДанные.Упаковка.Коэффициент;
				Иначе
					ТекущиеДанные.Количество = ТекущиеДанные.КоличествоУпаковок;
				КонецЕсли;
			ИначеЕсли ТекущиеДанные.Количество<>0 Тогда
				Если ЗначениеЗаполнено(ТекущиеДанные.Упаковка) Тогда
					ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество / ТекущиеДанные.Упаковка.Коэффициент;
				Иначе
					ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Рассчитаем цену и сумму в строке
		Если ЕстьРеквизитТЧОбъекта("Цена", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника) Тогда
			Если ЕстьРеквизитТЧОбъекта("Сумма", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника) Тогда
				// Если сумма не заполнена, а цена заполнена, то рассчитаем сумму по цене
				Если ТекущиеДанные.Цена<>0 Тогда
					Если ТекущиеДанные.Количество = 0 Тогда
						ТекущиеДанные.Сумма = ТекущиеДанные.Цена;
					Иначе
						ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество, 2);
					КонецЕсли;
					
				// Если сумма заполнена, а цена - нет, то рассчитаем цену от суммы
				ИначеЕсли ТекущиеДанные.Сумма<>0 Тогда
					Если ТекущиеДанные.Количество = 0 Тогда
						ТекущиеДанные.Цена = ТекущиеДанные.Сумма;
					Иначе
						ТекущиеДанные.Цена = Окр(ТекущиеДанные.Сумма / ТекущиеДанные.Количество, 2);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Рассчитаем НДС
		Если ЕстьРеквизитТЧОбъекта("СтавкаНДС", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника) И ЕстьРеквизитТЧОбъекта("Номенклатура", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника) И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
			
			Если (ТекущиеДанные.СтавкаНДС = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.СтавкаНДС)) Тогда
				
				СтавкаНДСВНоменклатуре = ТекущиеДанные.Номенклатура.ВидСтавкиНДС;
				ТекущиеДанные.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(СтавкаНДСВНоменклатуре, ТекущаяДатаСеанса());
				
			КонецЕсли;
			
			// Рассчитаем сумму НДС
			Если ЕстьРеквизитТЧОбъекта("СуммаНДС", Объект.Метаданные(), СтруктураПараметров.ТабличнаяЧастьИсточника) Тогда
				ЗначениеСтавкиНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(ТекущиеДанные.СтавкаНДС);
				
				Если Объект.СуммаВключаетНДС Тогда
					ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма - (ТекущиеДанные.Сумма) / ((ЗначениеСтавкиНДС + 100) / 100);
				Иначе
					ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * ЗначениеСтавкиНДС / 100;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Иначе
			ДобавитьВЛог(ОписаниеОшибки(), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ОбработатьСобытиеПослеДобавленияСтроки()

// Функция выполняет контроль заполнения строки данных табличного документа
// сообщает об ошибках и устанавливает комментарии к ошибочным ячейкам
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, у которого необходимо сформировать шапку
//  НомерСтроки       - Число				- Число, номер строки табличного документа
//  ТекстыЯчеек    	  - Массив				- Возвращает массив текстов ячеек строки,
//
// Возвращаемое значение:
//  Структура	- Структура, ключ - Имя загружаемого реквизита, Значение - Значение загружаемого реквизита
//
Функция КонтрольЗаполненияСтроки(ТабличныйДокумент, НомерСтроки, СтруктураПараметров, ТекстыЯчеек = Неопределено, КоличествоОшибок = 0, ГрузимШапку = Ложь, СтруктураПараметровЛогирования = Неопределено)
	
	ТекстыЯчеек = Новый Массив;
	ТекстыЯчеек.Добавить(Неопределено);
	Для к = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ТекстыЯчеек.Добавить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(К,"ЧГ=")).Текст));
	КонецЦикла;
	
	ТекущаяСтрока     = Новый Структура;
	ДополнительныеРеквизитыИСведения = Новый ТаблицаЗначений;
	ДополнительныеРеквизитыИСведения.Колонки.Добавить("СсылкаРеквизита");
	ДополнительныеРеквизитыИСведения.Колонки.Добавить("Результат");
	ДополнительныеРеквизитыИСведения.Колонки.Добавить("ЭтоСведение");
	
	Если ГрузимШапку Тогда
		СоответствиеКолонок = СтруктураПараметров.КолонкиШапки;
	Иначе
		СоответствиеКолонок = СтруктураПараметров.Колонки;
	КонецЕсли;
	
	Для каждого КлючИЗначение Из СоответствиеКолонок Цикл
		
		Колонка = КлючИЗначение.Значение;
		
		Если Колонка.Пометка Тогда
			
			Если Колонка.РежимЗагрузки = "Устанавливать" Тогда
				
				Результат = Колонка.ЗначениеПоУмолчанию;
				
				Если НЕ ГрузимШапку И Колонка.ЭтоДополнительныйРеквизит Тогда
					НовСтр                 = ДополнительныеРеквизитыИСведения.Добавить();
					НовСтр.СсылкаРеквизита = Колонка.СсылкаРеквизита;
					НовСтр.Результат       = Результат;
					НовСтр.ЭтоСведение     = Колонка.ЭтоСведение;
				Иначе
					ТекущаяСтрока.Вставить(Колонка.ИмяРеквизита,Результат);
				КонецЕсли;
				
				Если КлючИЗначение.Ключ = "Номенклатура" Тогда
					СтруктураПараметров.ВладелецСерии = ТекущаяСтрока.Номенклатура;
				КонецЕсли;
				
			ИначеЕсли Колонка.РежимЗагрузки = "Искать" И НЕ Колонка.НомерКолонки = 0 Тогда
				
				Если НЕ ОбработатьОбласть(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(Колонка.НомерКолонки,"ЧГ=")), Колонка, ТекущаяСтрока, ТекстыЯчеек, СтруктураПараметров, ДополнительныеРеквизитыИСведения, ГрузимШапку, СтруктураПараметровЛогирования) Тогда
					КоличествоОшибок = КоличествоОшибок + 1;
				КонецЕсли;
				Если НЕ ГрузимШапку И КлючИЗначение.Ключ = "Номенклатура" И Не Колонка.ЭтоДополнительныйРеквизит Тогда
					СтруктураПараметров.ВладелецСерии = ТекущаяСтрока.Номенклатура;
				КонецЕсли;
				
			ИначеЕсли Колонка.РежимЗагрузки = "Вычислять" Тогда
				
				Вычисление = ВычислитьЗначениеЯчейки(Колонка.Выражение,ТекущаяСтрока,?(Колонка.НомерКолонки = 0, "", ТекстыЯчеек[Колонка.НомерКолонки]),ТекстыЯчеек,Колонка.ЗначениеПоУмолчанию, СтруктураПараметров.флКонтрольЗаполнения, СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
				Результат  = Вычисление.Результат;
				Примечание = Вычисление.ОписаниеОшибки;
				
				Если ор_ЗначениеНеЗаполнено(Результат) Тогда
					Результат = Колонка.ЗначениеПоУмолчанию;
				КонецЕсли;
				
				Если НЕ ГрузимШапку И Колонка.ЭтоДополнительныйРеквизит Тогда
					НовСтр                 = ДополнительныеРеквизитыИСведения.Добавить();
					НовСтр.СсылкаРеквизита = Колонка.СсылкаРеквизита;
					НовСтр.Результат       = Результат;
					НовСтр.ЭтоСведение     = Колонка.ЭтоСведение;
				Иначе
					ТекущаяСтрока.Вставить(Колонка.ИмяРеквизита,Результат);
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Примечание) Тогда
					ТекстСообщения = НСтр("ru = 'Строка %1 (%2): %3'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомерСтроки, Колонка.ПредставлениеРеквизита, Примечание);
					Если СтруктураПараметровЛогирования = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Иначе
						ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
					КонецЕсли;
					КоличествоОшибок = КоличествоОшибок + 1;
				КонецЕсли;
				Если КлючИЗначение.Ключ = "Номенклатура" Тогда
					СтруктураПараметров.ВладелецСерии = ТекущаяСтрока.Номенклатура;
				КонецЕсли;
				
			ИначеЕсли Колонка.РежимЗагрузки = "Загружать" И ЗначениеЗаполнено(Колонка.НастройкаЗагрузки) Тогда
				
				ТаблицаЗагружаемыхРеквизитов    = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.СкопироватьКолонки();
				Если СтруктураПараметров.ТаблицаДополнительныхПараметров <> Неопределено Тогда
					ТаблицаДополнительныхПараметров = СтруктураПараметров.ТаблицаДополнительныхПараметров.СкопироватьКолонки();
				Иначе
					ТаблицаДополнительныхПараметров = Неопределено;
				КонецЕсли;
				ТаблицаЗагружаемыхРеквизитовШапки = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.СкопироватьКолонки();
				Попытка
					МетаданныеДляЗагрузки = Колонка.ЗначениеПоУмолчанию.Метаданные();
					Если НЕ Метаданные.Справочники.Содержит(МетаданныеДляЗагрузки) Тогда
						МетаданныеДляЗагрузки = Неопределено;
					КонецЕсли;
				Исключение
					МетаданныеДляЗагрузки = Неопределено;
				КонецПопытки;
				
				Результат = ЗагрузитьРеквизитПоНастройке(
					ТабличныйДокумент,
					НомерСтроки,
					Колонка.НастройкаЗагрузки,
					ТаблицаЗагружаемыхРеквизитов,
					ТаблицаДополнительныхПараметров,
					ТаблицаЗагружаемыхРеквизитовШапки,
					СтруктураПараметров.СоответствиеНоменклатуры.СкопироватьКолонки(), 
					МетаданныеДляЗагрузки,
					СтруктураПараметровЛогирования);
				Если НЕ ГрузимШапку И Колонка.ЭтоДополнительныйРеквизит Тогда
					НовСтр                 = ДополнительныеРеквизитыИСведения.Добавить();
					НовСтр.СсылкаРеквизита = Колонка.СсылкаРеквизита;
					НовСтр.Результат       = Результат;
					НовСтр.ЭтоСведение     = Колонка.ЭтоСведение;
				Иначе
					ТекущаяСтрока.Вставить(Колонка.ИмяРеквизита,Результат);
				КонецЕсли;
				
				Если НЕ ГрузимШапку И КлючИЗначение.Ключ = "Номенклатура"  И Не Колонка.ЭтоДополнительныйРеквизит Тогда
					СтруктураПараметров.ВладелецСерии = ТекущаяСтрока.Номенклатура;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверим номенклатуру на ведение характеристик
		// если они не ведутся - надо разобраться со штрихкодом.
		Если СтруктураПараметров.Свойство("флКонтрольЗаполнения") И СтруктураПараметров.флКонтрольЗаполнения Тогда
			ЭтоКонтрольЗаполнения = Истина;
		Иначе
			ЭтоКонтрольЗаполнения = Ложь;
		КонецЕсли;
		
		Если КлючИЗначение.Значение.Пометка
			И (НЕ ЭтоКонтрольЗаполнения)
			И КлючИЗначение.Ключ = "Номенклатура"
			И ТекущаяСтрока.Свойство("Номенклатура")
			И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
			И (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока.Номенклатура, "КатегорияНоменклатуры")
					И Не ТекущаяСтрока.Номенклатура.КатегорияНоменклатуры.ИспользоватьХарактеристики
				ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики")) Тогда
			Попытка
				СтрокаШтрихКод   = СтруктураПараметров.ТаблицаДополнительныхПараметров.Найти("ШтрихКод","ИмяРеквизита");
				НомерКолонкиШтрихКод = СтрокаШтрихКод.НомерКолонки;
			Исключение
				СтрокаШтрихКод = Неопределено;
				НомерКолонкиШтрихКод = 0;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(СтрокаШтрихКод) Тогда
				ШтрихКодСерии = "";
				Если СтрокаШтрихКод.РежимЗагрузки = "Искать"
					И ЗначениеЗаполнено(НомерКолонкиШтрихКод)
					И ЗначениеЗаполнено(ТекстыЯчеек[НомерКолонкиШтрихКод]) Тогда
					ШтрихКодСерии = ТекстыЯчеек[НомерКолонкиШтрихКод];
				ИначеЕсли СтрокаШтрихКод.РежимЗагрузки = "Вычислять" Тогда
					Вычисление = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ВычислитьЗначениеДляХарактеристики(
						СтрокаШтрихКод.Выражение,
						?(СтрокаШтрихКод.НомерКолонки = 0, "", ТекстыЯчеек[СтрокаШтрихКод.НомерКолонки]),
						ТекстыЯчеек,
						"",
						СтруктураПараметров.СсылкаИсточника,
						СтруктураПараметровЛогирования);
					Если ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
						ШтрихКодСерии = Вычисление.Результат;
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ШтрихКодСерии) Тогда
					ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗарегистрироватьШтрихКод(ШтрихКодСерии,ТекущаяСтрока.Номенклатура,Неопределено,Неопределено, СтруктураПараметровЛогирования, ЛОЖЬ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущаяСтрока.Вставить("ДополнительныеРеквизитыИСведенияДляЗагрузки", ДополнительныеРеквизитыИСведения);
	
	Возврат ТекущаяСтрока;
	
КонецФункции // КонтрольЗаполненияСтроки()

// Функция выполняет загрузку реквизита по настройке и возвращает результат загрузки.
//
Функция ЗагрузитьРеквизитПоНастройке(ИсходныйТабличныйДокумент, НомерСтроки, НастройкаЗагрузки, ТаблицаЗагружаемыхРеквизитов, ТаблицаДополнительныхПараметров, ТаблицаЗагружаемыхРеквизитовШапки, СоответствиеНоменклатуры, МетаданныеДляЗагрузки = Неопределено, СтруктураПараметровЛогирования = Неопределено)
	// Подготовим табличный документ с единственной текущей строкой
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ОбластьСтрока = ИсходныйТабличныйДокумент.ПолучитьОбласть("R"+Формат(НомерСтроки,"ЧГ="));
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	
	// Инициализируем параметры, которые считаем из настройки/
	СтруктураПараметров = Инициализация();
	СтруктураПараметров.Вставить("СсылкаИсточника", 							Неопределено);
	СтруктураПараметров.Вставить("РежимЗагрузки", 								0);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника", 					"");
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 							"");
	СтруктураПараметров.Вставить("ИмяСправочника", 								"");
	СтруктураПараметров.Вставить("ТабличнаяЧастьДокументаОбъекта",				Неопределено);
	СтруктураПараметров.Вставить("ТЧДокумента",									Неопределено);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов",					Ложь);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",				Ложь);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи",					Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",	Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",		1);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",				0);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						"");
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",					Ложь);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",				Ложь);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",						Ложь);
	СтруктураПараметров.Вставить("НеФормироватьДопНомерСерии",					Ложь);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом",					"");
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",					Ложь);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов",				"");
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",						Ложь);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",Ложь);
	СтруктураПараметров.Вставить("ОбработкаПреобразования",						Неопределено);
	СтруктураПараметров.Вставить("Кодировка",									"");
	СтруктураПараметров.Вставить("Табуляция",									"");
	СтруктураПараметров.Вставить("ИмяТаблицы",									"");
	СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров",				ТаблицаДополнительныхПараметров);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",							"");
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",							"");
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",						"");
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов",				ТаблицаЗагружаемыхРеквизитов);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",								"");
	СтруктураПараметров.Вставить("ИмяСправочника",								"");
	
	СтруктураПараметров.Вставить("ЗагружатьШК",									Ложь);
	СтруктураПараметров.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры",			Ложь);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики",				Ложь);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",	Новый СписокЗначений);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", 0);
	
	// Заполним параметры
	ЗаполнитьНастройкиКолонок(НастройкаЗагрузки.НастройкиЗагрузкиВыгрузки.Получить(), СтруктураПараметров, МетаданныеДляЗагрузки, СтруктураПараметровЛогирования);
	// Снова установим первую строку принудительно.
	СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента = 1;
	
	// Дополним нужные параметры для загрузки.
	СтруктураПараметров.Вставить("флКонтрольЗаполнения", 						Ложь);
	СтруктураПараметров.Вставить("ОписаниеОшибок", 								"");
	СтруктураПараметров.Вставить("ДопПараметры", 								Неопределено);
	СтруктураПараметров.Вставить("ВладелецСерии", 								Неопределено);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 					СоответствиеНоменклатуры);
	
	Рез = ЗагрузитьДанные(ТабличныйДокумент,СтруктураПараметров, Истина, СтруктураПараметровЛогирования);
	Возврат  Рез;
	
КонецФункции

// Процедура выполняет обработку области табличного документа:
// заполняет расшифровку по представлению ячейки в соответствии со структурой загружаемых реквизитов
// сообщает об ошибке и устанавливает комментарий, если ячейка содержит ошибку
//
// Параметры:
//  Область 		- ТабличныйДокумент	- Область табличного документа
//  Колонка 		- Структура			- Структура, свойства, в соответствии с которыми необходимо выполнить обработку области
//  ТекущиеДанные  	- Структура			- Структура загруженных значений
//  ТекстыЯчеек    	- Массив			- Массив текстов ячеек строки
//
Функция ОбработатьОбласть(Область, Колонка, ТекущиеДанные, ТекстыЯчеек, СтруктураПараметров, ДополнительныеРеквизитыИСведения, ГрузимШапку = Ложь, СтруктураПараметровЛогирования = Неопределено)
	
	Представление = СокрЛП(Область.Текст);
	Примечание = "";
	ЗначенийБольшеОдного = Ложь;
	Если Колонка.РежимЗагрузки = "Вычислять" Тогда
		
		Вычисление = ВычислитьЗначениеЯчейки(Колонка.Выражение,ТекущиеДанные,Представление, ТекстыЯчеек, Колонка.ЗначениеПоУмолчанию,СтруктураПараметров.флКонтрольЗаполнения, СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
		Если НЕ ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
			Результат   = Неопределено;
			Примечание = ""+ Вычисление.ОписаниеОшибки;
		Иначе
			Результат = Вычисление.Результат;
		КонецЕсли;
		
	ИначеЕсли ПустаяСтрока(Представление) Тогда
		Результат = Неопределено;
	Иначе
		
		НайденныеЗначения = ПолучитьВозможныеЗначения(Колонка, Представление, Примечание, ТекущиеДанные, ТекстыЯчеек, СтруктураПараметров,,, ГрузимШапку, СтруктураПараметровЛогирования);
		
		Если НайденныеЗначения.Количество() = 0 Тогда
			
			Примечание = "Не найден"+?(Примечание = "","", Символы.ПС+Примечание);
			Результат = Неопределено;
			
		ИначеЕсли НайденныеЗначения.Количество() = 1 Тогда
			
			Результат = НайденныеЗначения[0];
			
		Иначе
			ЗначенийБольшеОдного = Истина;
			Примечание = "Не однозначное представление. Вариантов: "+НайденныеЗначения.Количество()+?(Примечание = "","", Символы.ПС+Примечание);
			
			Нашли = Ложь;
			НашлиЗначениеПоУмолчанию = Ложь;
			Для каждого НайденноеЗначение Из НайденныеЗначения Цикл
				Если НайденноеЗначение = Область.Расшифровка Тогда
					Нашли = Истина;
					Прервать;
				КонецЕсли;
				Если НайденноеЗначение = Колонка.ЗначениеПоУмолчанию Тогда
					НашлиЗначениеПоУмолчанию = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Нашли Тогда
				
				Если НашлиЗначениеПоУмолчанию Тогда
					НайденноеЗначение = Колонка.ЗначениеПоУмолчанию;
				Иначе
					НайденноеЗначение = НайденныеЗначения[0];
				КонецЕсли;
			КонецЕсли;
			Результат = НайденноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Если ор_ЗначениеНеЗаполнено(Результат) Тогда
		Результат = Колонка.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если НЕ ГрузимШапку И Колонка.ЭтоДополнительныйРеквизит Тогда
		НовСтр                 = ДополнительныеРеквизитыИСведения.Добавить();
		НовСтр.СсылкаРеквизита = Колонка.СсылкаРеквизита;
		НовСтр.Результат       = Результат;
		НовСтр.ЭтоСведение     = Колонка.ЭтоСведение;
	Иначе
		ТекущиеДанные.Вставить(Колонка.ИмяРеквизита,Результат);
	КонецЕсли;
	
	Область.Расшифровка = Результат;
	Область.Примечание.Текст = Примечание;
	Если ЗначенийБольшеОдного Тогда
		Область.ЦветФона = WebЦвета.ГолубойСоСтальнымОттенком;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Примечание) Тогда
		ТекстСообщения = НСтр("ru = 'Ячейка[%1] (%2): %3'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Область.Имя, Колонка.ПредставлениеРеквизита, Примечание);
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПустаяСтрока(Примечание);
	
КонецФункции // ОбработатьОбласть()

// Функция вычисляет значение ячейки для режима "Вычислять"
//
// Параметры:
//  Выражение 		- Строка	- Программный код, который необходимо выполнить
//  ТекущиеДанные  	- Структура	- Структура загруженных значений
//  ТекстЯчейки    	- Строка	- Текст текущей ячейки
//  ТекстыЯчеек    	- Массив	- Массив текстов ячеек строки
//  Результат      	- Число		- Результат вычисления
//
// Возвращаемое значение:
//  Структура		- Структура, содержащая Результат и ОписаниеОшибки
//
Функция ВычислитьЗначениеЯчейки(Знач Выражение,Знач ТекущиеДанные,Знач ТекстЯчейки, Знач ТекстыЯчеек,Знач Результат, Знач флКонтрольЗаполнения, Знач ДокументОбъект, СтруктураПараметровЛогирования = Неопределено) Экспорт 
	
	ТекстЯчейки = СокрЛП(ТекстЯчейки);
	ТекстСообщения = "";
	Попытка
		Выполнить(Выражение);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка при вычислении выражения %1: %2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выражение, ОписаниеОшибки());
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ДобавитьВЛог(ТекстСообщения, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Новый Структура("Результат,ОписаниеОшибки",Результат,ТекстСообщения);
	
КонецФункции // ВычислитьЗначениеЯчейки()

// Функция возвращает менеджер по типу значения
//
// Параметры:
//  ТипЗначения - Неопределено	- Тип значения, по которому нужна вернуть менеджер
//
// Возвращаемое значение:
//  Строка		- Менеджер
//
Функция ПолучитьМенеджераПоТипу(ТипЗначения, СтруктураПараметров) Экспорт
	
	Если НЕ ТипЗначения = Неопределено Тогда
		Менеджер = СтруктураПараметров.КешМенеджеровПоТипу[ТипЗначения];
		Если Менеджер = Неопределено Тогда
			Для Каждого МенеджерОбъектаМетаданных Из СтруктураПараметров.МенеджерыОбъектовМетаданных Цикл
				Если МенеджерОбъектаМетаданных.Значение.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
					Менеджер = МенеджерОбъектаМетаданных.Значение[Метаданные.НайтиПоТипу(ТипЗначения).Имя];
					Прервать;
				КонецЕсли;
			КонецЦикла;
			СтруктураПараметров.КешМенеджеровПоТипу.Вставить(ТипЗначения, Менеджер);
		КонецЕсли;
		Возврат Менеджер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //ПолучитьМенеджераПоТипу()

// Поиск номенклатуры по прайсу поставщика
//
// Параметры:
//  Текст         - Строка			- значение поиска
//  ИскатьПо      - Строка			- поле поиска
//  Контрагент    - СправочникСсылка.Контрагенты - Владелец прайса
//  Реквизит      - Строка			- реквизит поиска
//  Дополнительно - Структура		- дополнительные параметры поиска
//
// Возвращаемое значение:
//  Список		- Список найденных товаров
//
Функция НайтиЗначениеВПрайсеПоставщика(Текст, ИскатьПо, Контрагент, Реквизит, Дополнительно=неопределено, флПоискПоПрайсуПоставщика = Ложь, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Если флПоискПоПрайсуПоставщика И ИскатьПо <> "ор_ЕГК" Тогда
		// Проверки.
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Если СтруктураПараметровЛогирования = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не указан поставщик!'"));
			Иначе
				ДобавитьВЛог(НСтр("ru= 'Не указан поставщик!'"), 1, СтруктураПараметровЛогирования);
			КонецЕсли;
			Возврат Неопределено;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Текст) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЗначениеПоиска =Лев(СокрЛП(Текст),150) + "%";
		
		// Ищем.
		Запрос=Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрайсЛисты." 
		+ Реквизит + " КАК " + Реквизит + "
		|ИЗ
		|	РегистрСведений.ор_ПрайсЛистыПоставщиков КАК ПрайсЛисты
		|
		|ГДЕ
		|	ПрайсЛисты.ПрайсЛист.Владелец=&Контрагент
		|	И ПрайсЛисты.Номенклатура <> &ПустаяСсылка
		| И ПрайсЛисты." +?(ИскатьПо="Код","Артикул",ИскатьПо)+" ПОДОБНО &ЗначениеПоиска ";
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ЗначениеПоиска",ЗначениеПоиска);
		Запрос.УстановитьПараметр("ПустаяСсылка",Справочники.Номенклатура.ПустаяСсылка());
		
		
		Если ТипЗнч(Дополнительно)=Тип("Структура") Тогда
			Производитель = "";
			Дополнительно.Свойство("Производитель",Производитель);
			Если ЗначениеЗаполнено(Производитель) Тогда
				Запрос.Текст = Запрос.Текст + "
				|   И ПрайсЛисты.ПроизводительЛС ПОДОБНО &Производитель";
				Запрос.УстановитьПараметр("Производитель",СокрЛП(Строка(Производитель)));
			КонецЕсли;
		КонецЕсли;
		РезультатПоиска=Запрос.Выполнить();
		// Смотрим, что в результате.
		Если РезультатПоиска.Пустой() Тогда
			// Ничего не нашли - выходим.
			Возврат Неопределено;
		Иначе
			СписокНайденныхТоваров=Новый СписокЗначений();
			СписокНайденныхТоваров.ЗагрузитьЗначения(РезультатПоиска.Выгрузить().ВыгрузитьКолонку(Реквизит));
			// Возвращаем первый.
			Возврат СписокНайденныхТоваров[0].Значение;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // НайтиНоменклатурыПоПрайсуПоставщика()

// Функция возвращает массив возможных значений для текущей колонки по представлению
//
// Параметры:
//  Колонка 		- Структура	- Структура, свойства, в соответствии с которыми необходимо получить возможные значения
//  Представление 	- Строка	- Строка, по которой необходимо вернуть массив значений
//  Примечание    	- Массив	- Массив текстов ячеек строки
//  ТекущиеДанные  	- Структура	- Структура загруженных значений
//
// Возвращаемое значение:
//  Массив			- Массив возможных значений
//
Функция ПолучитьВозможныеЗначения(Колонка, Представление, Примечание, ТекущиеДанные, ТекстыЯчеек, СтруктураПараметров, НеИспользоватьТаблицуСоответствий=0,Дополнительно=Неопределено, ГрузимШапку = Ложь, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Примечание = "";
	Представление = СокрЛП(Представление);
	НормаЗначений = 50;
	НайденныеЗначения = Новый Массив;
	ТаблицаСлов = Новый ТаблицаЗначений;
	ТаблицаСлов.Колонки.Добавить("Ссылка");
	ТаблицаСлов.Колонки.Добавить("ЗначениеРеквизита");
	ТаблицаСлов.Колонки.Добавить("СписокСлов");
	
	ПримитивныеТипы = СтруктураПараметров.ПримитивныеТипы;
	ТаблицаЗагружаемыхРеквизитов = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов;
	ТаблицаЗагружаемыхРеквизитовШапки = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки;
	РежимЗагрузки = СтруктураПараметров.РежимЗагрузки;
	СсылкаИсточника = СтруктураПараметров.СсылкаИсточника;
	флПоискПоПрайсуПоставщика = СтруктураПараметров.флПоискПоПрайсуПоставщика;
	ТЧДокумента = СтруктураПараметров.ТЧДокумента;
	флКонтрольЗаполнения = СтруктураПараметров.флКонтрольЗаполнения;
	КЭШЗначений = СтруктураПараметров.КЭШЗначений;
	ТаблицаДополнительныхПараметров = СтруктураПараметров.ТаблицаДополнительныхПараметров;
	Если СтруктураПараметров.Свойство("Поставщик") Тогда
		Поставщик = СтруктураПараметров.Поставщик;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ВсегдаФормироватьНовыеСерии") Тогда
		ВсегдаФормироватьНовыеСерии = СтруктураПараметров.ВсегдаФормироватьНовыеСерии;
	Иначе
		ВсегдаФормироватьНовыеСерии = Ложь;
	КонецЕсли;
		
	Если ПустаяСтрока(Представление) Тогда
		
		Возврат НайденныеЗначения;
		
	Иначе
		СвязьПоТипу = Неопределено;
		Если НЕ ПустаяСтрока(Колонка.СвязьПоТипу)  Тогда
			
			Если ТипЗНЧ(Колонка.СвязьПоТипу) = Тип("Строка") Тогда
				ТекущиеДанные.Свойство(Колонка.СвязьПоТипу,СвязьПоТипу);
			Иначе
				СвязьПоТипу = Колонка.СвязьПоТипу;
			КонецЕсли;
			Если НЕ СвязьПоТипу = Неопределено Тогда
				
				ЭлементСвязиПоТипу = Колонка.ЭлементСвязиПоТипу;
				Если ЭлементСвязиПоТипу = 0 Тогда
					ЭлементСвязиПоТипу = 1;
				КонецЕсли;
				ВидыСубконто = СвязьПоТипу.ВидыСубконто;
				Если ЭлементСвязиПоТипу > ВидыСубконто.Количество() Тогда
					Возврат НайденныеЗначения;
				КонецЕсли;
				Тип = СвязьПоТипу.ВидыСубконто[ЭлементСвязиПоТипу-1].ВидСубконто.ТипЗначения;
			Иначе
				Тип = Колонка.ОписаниеТипов;
			КонецЕсли;
			
		Иначе
			Тип = Колонка.ОписаниеТипов;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ТипРеквизита Из Тип.Типы() Цикл
		
		Если ТипРеквизита = ПримитивныеТипы.Число Или ТипРеквизита = ПримитивныеТипы.Булево Тогда
			НайденныеЗначения.Добавить(ПривестиКЧислу(Представление, Колонка.ОписаниеТипов, Примечание));
		ИначеЕсли ТипРеквизита = ПримитивныеТипы.Строка ИЛИ ТипРеквизита = ПримитивныеТипы.Дата Тогда
			НайденныеЗначения.Добавить(ПривестиКДате(Представление, Колонка.ОписаниеТипов, Примечание));
			
		Иначе
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипРеквизита);
			
			Если Перечисления.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
				
				// Это Перечисление
				Для каждого Перечисление Из ПолучитьМенеджераПоТипу(ТипРеквизита, СтруктураПараметров) Цикл
					Если Строка(Перечисление) = Представление Тогда
						НайденныеЗначения.Добавить(Перечисление);
					КонецЕсли;
				КонецЦикла;
				
				Если НайденныеЗначения.Количество() = 0 
					И ТипРеквизита = Тип("ПеречислениеСсылка.ВидыСтавокНДС") Тогда
					
					ТекстПримечания = "";
					ВидСтавкиНДС = ПривестиКЧислу(Представление,, ТекстПримечания);
					Если ВидСтавкиНДС = 0 И ПустаяСтрока(ТекстПримечания) Тогда
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.БезНДС);
					ИначеЕсли ВидСтавкиНДС = 10 Тогда
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
					ИначеЕсли ВидСтавкиНДС = 18 Тогда
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.Общая);
					ИначеЕсли ВидСтавкиНДС = 20 Тогда
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.Общая);
					ИначеЕсли ВидСтавкиНДС = 5 Тогда
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяУСН);
					ИначеЕсли ВидСтавкиНДС = 7 Тогда
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяУСН);
					Иначе
						НайденныеЗначения.Добавить(Перечисления.ВидыСтавокНДС.ПустаяСсылка());
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
				
				// Это документ
				
				Менеджер = ПолучитьМенеджераПоТипу(ТипРеквизита, СтруктураПараметров);
				Если Колонка.ИскатьПо = "Номер" Тогда
					// НайденноеЗначение = Менеджер.НайтиПоКоду(Представление);
				ИначеЕсли Колонка.ИскатьПо = "Дата" Тогда
					// НайденноеЗначение = Менеджер.Найти
				Иначе
						
					ДлинаСинонима = СтрДлина(""+МетаданныеТипа);
						
					Если Лев(Представление, ДлинаСинонима) = ""+МетаданныеТипа Тогда
						НомерИДата = СокрЛП(Сред(Представление, ДлинаСинонима+1));
						ПозицияОт = Найти(НомерИДата, " от ");
						Если НЕ ПозицияОт = 0 Тогда
							НомерДок = Лев(НомерИДата, ПозицияОт-1);
							Попытка
								ДатаДок = Дата(Сред(НомерИДата, ПозицияОт+4));
							Исключение
								ДатаДок = Неопределено;
							КонецПопытки;
							Если НЕ ДатаДок = Неопределено Тогда
								НайденноеЗначение = Менеджер.НайтиПоНомеру(НомерДок, ДатаДок);
								Если НЕ НайденноеЗначение.Пустая() Тогда
									НайденныеЗначения.Добавить(НайденноеЗначение);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
						
				КонецЕсли;
				
			ИначеЕсли НЕ МетаданныеТипа = Неопределено Тогда
				
				ИскатьПо = Колонка.ИскатьПо;
				ИскатьПоСерииИСрокуГодности = Ложь;
				Если ИскатьПо = "СерияПроизводителяИСрокГодности" Тогда
					 ИскатьПо = "ор_СерияПроизводителя";
					 ИскатьПоСерииИСрокуГодности = Истина;
				КонецЕсли;
				ЭтоСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипРеквизита);
				Если ГрузимШапку Тогда
					СтрокаНастройки = ТаблицаЗагружаемыхРеквизитовШапки.Найти(Колонка.ИмяРеквизита, "ИмяРеквизита");
				Иначе
					СтрокаНастройки = ТаблицаЗагружаемыхРеквизитов.Найти(Колонка.ИмяРеквизита, "ИмяРеквизита");
				КонецЕсли;
				ПоискПоСхожести = Ложь;
				Если СтрокаНастройки<>Неопределено И СтрокаНастройки.РежимПоиска = "По похожим словам" Тогда
					// Ищем по схожести значений
					ПоискПоСхожести = Истина;
				КонецЕсли;
				Если ПустаяСтрока(ИскатьПо) Тогда
					СтрокаОсновногоПредставления = Строка(МетаданныеТипа.ОсновноеПредставление);
					
					Если СтрокаОсновногоПредставления = "ВВидеКода" Тогда
						ИскатьПо = "Код";
					ИначеЕсли СтрокаОсновногоПредставления = "ВВидеНаименования" Тогда
						ИскатьПо = "Наименование";
					ИначеЕсли СтрокаОсновногоПредставления = "ВВидеНомера" Тогда
						ИскатьПо = "Номер";
					КонецЕсли;
				КонецЕсли;
				
				// Обрежем наименование до максимально допустимого.
				Если ЭтоСправочник И (ТипРеквизита = Тип("СправочникСсылка.Номенклатура")) Тогда
					Представление = Лев(Представление,150);
				КонецЕсли;
				
				// Попробуем найти номенклатуру по таблице соответствия.
				Если СтруктураПараметров.Свойство("СоответствиеНоменклатуры") Тогда
					ТаблицаСоответствияНоменклатуры = СтруктураПараметров.СоответствиеНоменклатуры;
				Иначе
					ТаблицаСоответствияНоменклатуры = Неопределено;
				КонецЕсли;
					
				Если (ТаблицаСоответствияНоменклатуры <> Неопределено) И (НеИспользоватьТаблицуСоответствий=0) И ЭтоСправочник
					 И (ТипРеквизита = Тип("СправочникСсылка.Номенклатура")) И ((РежимЗагрузки = 3) ИЛИ (Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаИсточника)) И (РежимЗагрузки = 1))) Тогда
					НайденнаяСтрока = ТаблицаСоответствияНоменклатуры.Найти(Представление,"ЗначениеДляПоиска");
					Если  (НайденнаяСтрока <> Неопределено) И (НЕ НайденнаяСтрока.Номенклатура.Пустая()) Тогда 
						НайденныеЗначения.Добавить(НайденнаяСтрока.Номенклатура);
						Возврат НайденныеЗначения;
					КонецЕсли;
				КонецЕсли;
				
				// Найдем номенклатуру по прайс листу контрагентов.
				Если флПоискПоПрайсуПоставщика И ЭтоСправочник И (ТипРеквизита = Тип("СправочникСсылка.Номенклатура")) Тогда
					Если (РежимЗагрузки = 1) Тогда
						Попытка
							Поставщик = СсылкаИсточника.Контрагент;
						Исключение
						КонецПопытки;
					КонецЕсли;
					Если ЗначениеЗаполнено(Поставщик) Тогда
						НоменклатураПрайса = НайтиЗначениеВПрайсеПоставщика(Представление, ИскатьПо, Поставщик, "Номенклатура" , Дополнительно, СтруктураПараметров.флПоискПоПрайсуПоставщика, СтруктураПараметровЛогирования);
						Если НоменклатураПрайса <> Неопределено  Тогда 
							НайденныеЗначения.Добавить(НоменклатураПрайса); 
							Возврат НайденныеЗначения;
						КонецЕсли;
					Иначе
						Если СтруктураПараметровЛогирования = Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не найден контрагент! Невозможно выполнить поиск по прайс-листу контрагента.'"));
						Иначе
							ДобавитьВЛог(НСтр("ru= 'Не найден контрагент! Невозможно выполнить поиск по прайс-листу контрагента.'"), 1, СтруктураПараметровЛогирования);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				// Найдем номенклатуру/характеристики по штрих-коду.
				Если (ИскатьПо = "ШтрихКод") и ЭтоСправочник  Тогда
					ТаблицаНоменклатурыИХарактеристик = ПолучитьШтрихкоды(Представление);
					ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ОтработатьПоискСправочникаПоШК(
						СтруктураПараметров,
						ТаблицаНоменклатурыИХарактеристик,
						НайденныеЗначения,
						ТЧДокумента,
						ТекстыЯчеек,
						ТипРеквизита,
						флКонтрольЗаполнения,
						СтруктураПараметровЛогирования);
					Возврат НайденныеЗначения;
				КонецЕСли;
				
				КЭШЗаполнен = Ложь;
				Запрос = новый Запрос;
				Если Не ЭтоСправочник ИЛИ (ЭтоСправочник И Не ПоискПоСхожести) Тогда
					Запрос.Текст =
					"ВЫБРАТЬ
					|	Врем_Таблица.Ссылка
					|ИЗ
					|	" + МетаданныеТипа.ПолноеИмя() + " КАК Врем_Таблица
					|ГДЕ";
					Если ЭтоСправочник
						И МетаданныеТипа.Иерархический
						И МетаданныеТипа.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
						Запрос.Текст = Запрос.Текст + "
						|	Врем_Таблица.ЭтоГруппа = ЛОЖЬ И 
						|	Врем_Таблица.ПометкаУдаления = ЛОЖЬ И ";
					КонецЕсли;
					Запрос.Текст = Запрос.Текст + "
					|	Врем_Таблица." + ИскатьПо + " = &Представление";
					
					Запрос.УстановитьПараметр("Представление",Представление);
					
				Иначе
					ТаблицаСлов.Очистить();
					СтруктураОтбораВКЭШе = Новый Структура("ТипРеквизита, ИскатьПо, Представление", ТипРеквизита, ИскатьПо, Представление);
					МассивСтрокКЭШа = КЭШЗначений.НайтиСтроки(СтруктураОтбораВКЭШе);
					Если МассивСтрокКЭШа.Количество()=0 Тогда
						// КЭШ пустой, заполним его.
						МетаданныеСправочника = Метаданные.НайтиПоТипу(ТипРеквизита);
						СтрокаУпорядочивания = МетаданныеСправочника.ВводПоСтроке;
						Если НЕ ПустаяСтрока(СтрокаУпорядочивания) Тогда
							СтрокаУпорядочивания = "УПОРЯДОЧИТЬ ПО " + СтрокаУпорядочивания;
						КонецЕсли;
						Запрос.Текст = "
						|ВЫБРАТЬ Ссылка,
						|" + ИскатьПо + " КАК ЗначениеРеквизита 
						|Из " + МетаданныеСправочника.ПолноеИмя() + " КАК Спр1
						|ГДЕ
						|Спр1."+ИскатьПо+" ПОДОБНО &Представление И
						|	Спр1.ПометкаУдаления = ЛОЖЬ
						|"+?(МетаданныеСправочника.Иерархический
							И МетаданныеСправочника.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов, " И Спр1.ЭтоГруппа = ЛОЖЬ", "")+"
						|" + СтрокаУпорядочивания + "
						|	{ГДЕ Спр1.Ссылка.* КАК Элемент}";
						Запрос.УстановитьПараметр("Представление", "%"+Представление+"%");
						Выборка = Запрос.Выполнить().Выбрать();
						
						Пока Выборка.Следующий() Цикл
							НоваяСтрокаКЭШа = КЭШЗначений.Добавить();
							НоваяСтрокаКЭШа.ТипРеквизита = ТипРеквизита;
							НоваяСтрокаКЭШа.ИскатьПо = ИскатьПо;
							НоваяСтрокаКЭШа.Представление = Представление;
							НоваяСтрокаКЭШа.Ссылка = Выборка.Ссылка;
							НоваяСтрокаКЭШа.ЗначениеРеквизита = Выборка.ЗначениеРеквизита;
							СписокСлов = Новый СписокЗначений;
							СписокСлов = ПолучитьСписокСлов(Выборка.ЗначениеРеквизита);
							НоваяСтрокаКЭШа.СписокСлов = СписокСлов.Скопировать();
							// Добавим сразу строку в таблицу слов.
							НовСтр = ТаблицаСлов.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, НоваяСтрокаКЭШа);
						КонецЦикла;
					Иначе
						// КЭШ уже есть, возьмем его.
						Для Каждого СтрокаМассива Из МассивСтрокКЭШа Цикл
							НовСтр = ТаблицаСлов.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, СтрокаМассива);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			
				Если ЭтоСправочник и НЕ ПустаяСтрока(Колонка.СвязьПоВладельцу) и МетаданныеТипа.Владельцы.Количество() Тогда
					
					СвязьПоВладельцу = Неопределено;
					Если ВРег(Колонка.СвязьПоВладельцу) = "ВЫЧИСЛЯЕТСЯ ПО КАТЕГОРИИ НОМЕНКЛАТУРЫ" Тогда
						Если ТекущиеДанные.Свойство("Номенклатура") Тогда
							ТекНоменклатура = ТекущиеДанные.Номенклатура;
						ИначеЕсли ТекущиеДанные.Свойство("НоменклатураПредпосылка") И НЕ ТекущиеДанные.Свойство("ХарактеристикаПредпосылка") Тогда
							 ТекНоменклатура = ТекущиеДанные.НоменклатураПредпосылка;
						 ИначеЕсли ТекущиеДанные.Свойство("НоменклатураСледствие") И ТекущиеДанные.Свойство("ХарактеристикаПредпосылка") Тогда
							 ТекНоменклатура = ТекущиеДанные.НоменклатураСледствие;
						ИначеЕсли ТекущиеДанные.Свойство("Владелец") Тогда
							ТекНоменклатура = ТекущиеДанные.Владелец;
						КонецЕсли;
						Если Колонка.ОписаниеТипов.Типы()[0] = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
							
							Если НЕ СтруктураПараметров.Свойство("НоменклатураДляЗаписиШК") Тогда
								СтруктураПараметров.Вставить("НоменклатураДляЗаписиШК", ТекНоменклатура);
							Иначе
								СтруктураПараметров.НоменклатураДляЗаписиШК = ТекНоменклатура;
							КонецЕсли;
							
							ЭтоНоменклатура = Ложь;
							Если ТекНоменклатура <> Неопределено Тогда
								ЭтоНоменклатура = ТипЗнч(ТекНоменклатура) = Тип("СправочникСсылка.Номенклатура");
							КонецЕсли;
							
							Если ЭтоНоменклатура И Не СтруктураПараметров.СоздаватьОбщиеХарактеристики Тогда
								СвязьПоВладельцу = ТекНоменклатура;
								СтруктураПараметров.ВладелецСерии = ТекНоменклатура;
							ИначеЕсли ЭтоНоменклатура И СтруктураПараметров.СоздаватьОбщиеХарактеристики Тогда
								СвязьПоВладельцу = ТекНоменклатура.КатегорияНоменклатуры;
								СтруктураПараметров.ВладелецСерии = ТекНоменклатура.КатегорияНоменклатуры;
							Иначе
								НайденныеЗначения.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(Колонка.СвязьПоВладельцу) = Тип("Строка") Тогда
						ПозицияТочки = Найти(Колонка.СвязьПоВладельцу,".");
						Если ПозицияТочки>0 Тогда
							СвязьПоВладельцу = ТекущиеДанные[Лев(Колонка.СвязьПоВладельцу,ПозицияТочки-1)];
							СвязьПоВладельцу = СвязьПоВладельцу[Сред(Колонка.СвязьПоВладельцу,ПозицияТочки+1)];
						Иначе
							ТекущиеДанные.Свойство(Колонка.СвязьПоВладельцу,СвязьПоВладельцу);
						КонецЕсли;
					Иначе
						СвязьПоВладельцу = Колонка.СвязьПоВладельцу;
					КонецЕсли;
					
					Запрос.Текст = Запрос.Текст + Символы.ПС+ " И Врем_Таблица.Владелец = &СвязьПоВладельцу";
					Запрос.УстановитьПараметр("СвязьПоВладельцу", СвязьПоВладельцу);
				КонецЕсли;
				
				Если Не ПоискПоСхожести Тогда
					Выборка = Запрос.Выполнить().Выбрать();
				Иначе
					Выборка = Неопределено;
				КонецЕсли;
				
				ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ОбработатьВсеНайденныеЗначения(
					ТипРеквизита,
					СтруктураПараметров,
					ТекстыЯчеек,
					Выборка,
					НайденныеЗначения,
					ИскатьПо,
					Представление,
					НормаЗначений,
					Запрос,
					ТаблицаСлов,
					ПоискПоСхожести,
					ЭтоСправочник,
					ИскатьПоСерииИСрокуГодности,
					СтруктураПараметровЛогирования);
				
			Иначе
				Примечание = НСтр("ru = 'Не описан способ поиска'");
				Примечание = НСтр("ru = 'Для Колонки не определен тип значения'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныеЗначения;
	
КонецФункции // ПолучитьВозможныеЗначения()

// Разбивает строку на слова. Возвращает список полученных слов.
//
// Параметры:
//	ЗначениеРеквизита - Строка
//
// Возвращаемое значение:
//	СписокСлов - СписокЗначений - список полученных слов.
//
Функция ПолучитьСписокСлов(ЗначениеРеквизита) Экспорт
	
	СписокСлов = Новый СписокЗначений;
	Слово = "";
	Для индекс = 1 По СтрДлина(ЗначениеРеквизита) Цикл
		Символ = Сред(ЗначениеРеквизита, индекс, 1);
		Если ЭтоБуква(Символ) Тогда
			Слово = Слово + Символ;
		Иначе
			Если Слово<>"" Тогда
			СписокСлов.Добавить(ВРЕГ(Слово));
			Слово = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Слово<>"" Тогда
		СписокСлов.Добавить(ВРЕГ(Слово));
	КонецЕсли;
	СписокСлов.СортироватьПоЗначению();
	Возврат СписокСлов;
	
КонецФункции

// Возвращает степень соответствия
//
// Параметры:
//  СписокСлов1  - Список	- список слов
//  СписокСлов2  – Список	– список слов
//
// Возвращаемое значение:
//  Число	- процент, степень соответствия списков
//
Функция ВернутьСтепеньСоответствияСписковСлов(СписокСлов1, СписокСлов2) Экспорт
	СовпавшихЭлементов = 0;
	
	НачалоЗапроса = "";
	КонецЗапроса = "";
	
	МассивКодов1 = Новый Массив();
	Для Каждого Слово Из СписокСлов1 Цикл
		МассивСлова = Новый Массив();
		Для Сч = 1 По СтрДлина(Слово) Цикл
			МассивСлова.Добавить(КодСимвола(ВРег(Сред(Слово, Сч, 1))));
		КонецЦикла;
		МассивКодов1.Добавить(МассивСлова);
	КонецЦикла;
	
	МассивКодов2 = Новый Массив();
	Для Каждого Слово Из СписокСлов2 Цикл
		МассивСлова = Новый Массив();
		Для Сч = 1 По СтрДлина(Слово) Цикл
			МассивСлова.Добавить(КодСимвола(ВРег(Сред(Слово, Сч, 1))));
		КонецЦикла;
		МассивКодов2.Добавить(МассивСлова);
	КонецЦикла;
	
	
	Для Каждого ПервоеСлово Из МассивКодов1 Цикл
		ДлинаПервогоСлова = ПервоеСлово.Количество();
		СовпалоСПервымСловом = 0;
		Для Каждого ВтороеСлово Из МассивКодов2 Цикл
			ДлинаВторогоСлова = ВтороеСлово.Количество();
			КоличествоПолей = ДлинаПервогоСлова + 2 * (ДлинаВторогоСлова - 1);
			Таблица1 = Новый ТаблицаЗначений();
			Для Сч = 1 По КоличествоПолей Цикл
				Таблица1.Колонки.Добавить("Поле" + СокрЛП(Сч), Новый ОписаниеТипов("Число"));
			КонецЦикла;
			Таблица2 = Таблица1.Скопировать();
			
			СтрокаТаблицы = Таблица1.Добавить();
			Для Сч = 1 По КоличествоПолей Цикл
				СтрокаТаблицы["Поле" + СокрЛП(Сч)] = ?((Сч>=ДлинаВторогоСлова) И (Сч <= ДлинаВторогоСлова + ДлинаПервогоСлова - 1), ПервоеСлово[Сч - ДлинаВторогоСлова], 0);
			КонецЦикла;
			
			Для ВнешнийСчетчик = 1 По ДлинаПервогоСлова + ДлинаВторогоСлова - 1 Цикл
				СтрокаТаблицы = Таблица2.Добавить();
				Для Сч = 1 По КоличествоПолей Цикл
					СтрокаТаблицы["Поле" + СокрЛП(Сч)] = ?((Сч>=ВнешнийСчетчик) И (Сч <= ВнешнийСчетчик + ДлинаВторогоСлова - 1), ВтороеСлово[Сч - ВнешнийСчетчик], 0);
				КонецЦикла;
			КонецЦикла;
			
			ТекстПоля = "";
			Разделитель = "";
			Для Сч = 1 По КоличествоПолей Цикл
				ТекстСчетчика = СокрЛП(Сч);
				ТекстПоля = ТекстПоля + Разделитель + "ВЫБОР КОГДА Таблица1.Поле" + ТекстСчетчика + " = Таблица2.Поле" + ТекстСчетчика + " И (Таблица1.Поле" + ТекстСчетчика + " + Таблица2.Поле" + ТекстСчетчика + ") > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ";
				Разделитель = " + ";
			КонецЦикла;
			
			ТекстПоля = ТекстПоля + " КАК ЧислоСовпадений";
			
			ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ Таблица1 ИЗ &Таблица1 КАК Табл1; ВЫБРАТЬ * ПОМЕСТИТЬ Таблица2 ИЗ &Таблица2 КАК Табл2; ";
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	" + ТекстПоля + "
			|ИЗ Таблица1 КАК Таблица1
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таблица2 КАК Таблица2
			|		ПО ИСТИНА
			|УПОРЯДОЧИТЬ ПО
			|	ЧислоСовпадений УБЫВ";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
			Запрос.УстановитьПараметр("Таблица1", Таблица1);
			Запрос.УстановитьПараметр("Таблица2", Таблица2);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЧислоСовпадений = Выборка.ЧислоСовпадений;
			Иначе
				ЧислоСовпадений = 0;
			КонецЕсли;
			
			Если ЧислоСовпадений > СовпалоСПервымСловом Тогда
				СовпалоСПервымСловом = ЧислоСовпадений;
			КонецЕсли;
		КонецЦикла;
		СовпавшихЭлементов = СовпавшихЭлементов + СовпалоСПервымСловом;
	КонецЦикла;
	
	ДлинаПервогоСписка = 0;
	Для Каждого ПервоеСлово Из МассивКодов1 Цикл
		ДлинаПервогоСписка = ДлинаПервогоСписка + ПервоеСлово.Количество();
	КонецЦикла;
	
	ДлинаВторогоСписка = 0;
	Для Каждого ВтороеСлово Из МассивКодов2 Цикл
		ДлинаВторогоСписка = ДлинаВторогоСписка + ВтороеСлово.Количество();
	КонецЦикла;
	
	Возврат СовпавшихЭлементов / Макс(ДлинаПервогоСписка, ДлинаВторогоСписка);
	
КонецФункции

// Функция выполняет проверку символа
//
// Параметры:
//	Символ - Строка
//
// Возвращаемое значение:
//	Булево - Истина - Это буква
//
Функция ЭтоБуква(Символ)
	
	Код = КодСимвола(Символ);
	
	Если (Код<=47) ИЛИ (Код>=58 И Код<=64) ИЛИ (Код>=91 И Код<=96)  ИЛИ (Код>=123 И Код<=126) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Функция записывает объект в информационную базу данных, используя
// события определенные пользователем в форме редактирования событий
//
// Параметры:
//  Объект      - ДокументСсылка	- Записываемый объект
//  ТекстыЯчеек - Массив			- Массив текстов ячеек, загружаемой строки
//
// Возвращаемое значение:
//  Булево		- Результат
//
Функция ЗаписатьОбъект(Объект, СтруктураПараметров, ТекстыЯчеек = Неопределено, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	Попытка
		Объект.ОбменДанными.Загрузка=Истина;
	Исключение
	КонецПопытки;
	Если НЕ ПустаяСтрока(СтруктураПараметров.ПередЗаписьюОбъекта) Тогда
		Попытка
			Выполнить(СтруктураПараметров.ПередЗаписьюОбъекта);
			Если Отказ Тогда
				ОписаниеОшибки = ""; // Установлен отказ перед записью объекта.
			КонецЕсли;
		Исключение
			Отказ = Истина;
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	// Если это загрузка не в регистр сведений, то пытаемся установить код.
	Если (НЕ Отказ) И (СтруктураПараметров.РежимЗагрузки<>2) Тогда
		Попытка
			Код = Объект.Код;
			Попытка
				Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
					Объект.УстановитьНовыйКод("");
				КонецЕсли;
				Объект.Записать();
			Исключение
				Отказ = Истина;
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;
		Исключение
		КонецПопытки; 
	КонецЕсли;
	
	Если НЕ Отказ и НЕ ПустаяСтрока(СтруктураПараметров.ПриЗаписиОбъекта) Тогда
		Попытка
			Выполнить(СтруктураПараметров.ПриЗаписиОбъекта);
			Если Отказ Тогда
				ОписаниеОшибки = ""; // Установлен отказ при записи объекта.
			КонецЕсли;
			
		Исключение
			Отказ = Истина;
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ Отказ  Тогда
		Попытка
			Объект.Записать();
		Исключение
			Отказ = Истина;
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	ЭтоЗагрузкаВНоменклатуру = (СтруктураПараметров.РежимЗагрузки = 3 И СтруктураПараметров.ИмяСправочника = "Номенклатура") ИЛИ (СтруктураПараметров.РежимЗагрузки = 0 И СтруктураПараметров.СсылкаИсточника<>Неопределено И ТипЗнч(СтруктураПараметров.СсылкаИсточника) = Тип("СправочникСсылка.Номенклатура"));
	Если Не Отказ И ЭтоЗагрузкаВНоменклатуру И СтруктураПараметров.ЗагружатьШК Тогда
		ШкДляЗаписи = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьШКНоменклатурыИзНастроек(СтруктураПараметров, ТекстыЯчеек, СтруктураПараметровЛогирования);
		Если ЗначениеЗаполнено(ШкДляЗаписи) Тогда
			ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗарегистрироватьШтрихКод(ШкДляЗаписи,Объект.Ссылка,Неопределено,Объект.ЕдиницаИзмерения, СтруктураПараметровЛогирования, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Иначе
			ДобавитьВЛог(ОписаниеОшибки, 1, СтруктураПараметровЛогирования);
		КонецЕсли;
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Попытка
			ЕстьДопРеквизитыИСведения  = ТипЗнч(Объект.ДополнительныеСвойства.ДополнительныеРеквизитыИСведенияДляЗагрузки) = Тип("ТаблицаЗначений");
		Исключение
			ЕстьДопРеквизитыИСведения = Ложь;
		КонецПопытки;
		
		Если ЕстьДопРеквизитыИСведения Тогда
			
			// Дополнительные сведения.
			МассивСведений = Объект.ДополнительныеСвойства.ДополнительныеРеквизитыИСведенияДляЗагрузки.НайтиСтроки(Новый Структура("ЭтоСведение", Истина));
			Для Каждого СтрокаДопПараметров Из МассивСведений Цикл
				Попытка
					Набор = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
					Набор.Отбор.Объект.Установить(Объект.Ссылка);
					Набор.Отбор.Свойство.Установить(СтрокаДопПараметров.СсылкаРеквизита);
					Набор.Прочитать();
					Если Набор.Количество() = 0 Тогда
						Запись = Набор.Добавить();
						Запись.Свойство = СтрокаДопПараметров.СсылкаРеквизита;
						Запись.Значение = СтрокаДопПараметров.Результат;
						Запись.Объект   = Объект.Ссылка;
					Иначе
						Набор[0].Значение = СтрокаДопПараметров.Результат;
					КонецЕсли;
					Набор.Записать();
				Исключение
				КонецПопытки
			КонецЦикла;
			
			// Дополнительные реквизиты.
			Попытка
				ТаблицаДопРеквизитов = Объект.ДополнительныеРеквизиты.Выгрузить();
			Исключение
				ТаблицаДопРеквизитов = Неопределено;
			КонецПопытки;
			
			Если ТаблицаДопРеквизитов<>Неопределено Тогда
				МассивРеквизитов = Объект.ДополнительныеСвойства.ДополнительныеРеквизитыИСведенияДляЗагрузки.НайтиСтроки(Новый Структура("ЭтоСведение", Ложь));
				Для Каждого СтрокаДопПараметров Из МассивРеквизитов Цикл
					Попытка
						СтрокаСвойства = ТаблицаДопРеквизитов.Найти(СтрокаДопПараметров.СсылкаРеквизита, "Свойство");
						Если СтрокаСвойства = Неопределено Тогда
							СтрокаСвойства = ТаблицаДопРеквизитов.Добавить();
						КонецЕсли;
						СтрокаСвойства.Свойство = СтрокаДопПараметров.СсылкаРеквизита;
						СтрокаСвойства.Значение = СтрокаДопПараметров.Результат;
					Исключение
					КонецПопытки
				КонецЦикла;
				
				// Если доп. реквизиты не используются для групп, игнорируем.
				Попытка
					Объект.ДополнительныеРеквизиты.Загрузить(ТаблицаДопРеквизитов);
				Исключение
				КонецПопытки;
				
				Попытка
					Объект.Записать();
				Исключение
					Отказ = Истина;
					ОписаниеОшибки = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		Объект.ОбменДанными.Загрузка=Ложь;
	Исключение
	КонецПопытки;
	
	Возврат НЕ Отказ;
	
КонецФункции // ЗаписатьОбъект()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
Функция ПолучитьНастройки(СтруктураПараметров) Экспорт
	Если НЕ СтруктураПараметров.Свойство("МетаданныеИсточникаИзСправочника") Тогда
		МетаданныеОбъекта = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	Иначе
		МетаданныеОбъекта = СтруктураПараметров.МетаданныеИсточникаИзСправочника;
	КонецЕсли;
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	ДокументРезультат = Новый ТабличныйДокумент;
	Макет = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетСохраненияНастроек");
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	
	Если СтруктураПараметров.РежимЗагрузки = 0 Тогда
		ОбластьШапки.Параметры.РежимЗагрузки = "в справочник";
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 1 ИЛИ СтруктураПараметров.РежимЗагрузки = 3 Тогда
		ОбластьШапки.Параметры.РежимЗагрузки = "в табличную часть";
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 2 Тогда
		ОбластьШапки.Параметры.РежимЗагрузки = "в регистр сведений";
	КонецЕсли;
	
	ОбластьШапки.Параметры.ВидОбъекта                                = ВидОбъекта;
	ОбластьШапки.Параметры.НеСоздаватьНовыхЭлементов                 = ?(СтруктураПараметров.НеСоздаватьНовыхЭлементов, "Х","");
	ОбластьШапки.Параметры.НеОбновлятьСуществующиеЭлементы           = ?(СтруктураПараметров.НеОбновлятьСуществующиеЭлементы, "Х","");
	ОбластьШапки.Параметры.ЗамещатьСуществующиеЗаписи                = ?(СтруктураПараметров.ЗамещатьСуществующиеЗаписи, "Х","");
	ОбластьШапки.Параметры.РучнаяНумерацияКолонокТабличногоДокумента = ?(СтруктураПараметров.РучнаяНумерацияКолонокТабличногоДокумента, "Х","");
	ОбластьШапки.Параметры.ПерваяСтрокаДанныхТабличногоДокумента     = СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента;
	ОбластьШапки.Параметры.ДействиеСЗагружаемымФайлом                = СтруктураПараметров.ДействиеСЗагружаемымФайлом;
    ОбластьШапки.Параметры.флПоискПоПрайсуПоставщика                 = ?(СтруктураПараметров.флПоискПоПрайсуПоставщика, "Х","");
    ОбластьШапки.Параметры.КаталогАрхиваЗагруженныхФайлов            = СтруктураПараметров.КаталогАрхиваЗагруженныхФайлов;
	ОбластьШапки.Параметры.Кодировка                                 = СтруктураПараметров.Кодировка;
	ОбластьШапки.Параметры.Табуляция                                 = СтруктураПараметров.Табуляция;
	ОбластьШапки.Параметры.ИспользоватьВнешнийМодульПреобразованияФайла = ?(СтруктураПараметров.ИспользоватьВнешнийМодульПреобразованияФайла, "Х","");
	ОбластьШапки.Параметры.ОбработкаПреобразования                   = Строка(СтруктураПараметров.ОбработкаПреобразования.УникальныйИдентификатор());
	ОбластьШапки.Параметры.ЗагружатьДополнительныеРеквизитыИСведения = ?(СтруктураПараметров.ЗагружатьДополнительныеРеквизитыИСведения, "Х","");
	ОбластьШапки.Параметры.ДополнительныеРеквизитыИСведенияТолькоОбщие = ?(СтруктураПараметров.ДополнительныеРеквизитыИСведенияТолькоОбщие, "Х","");
	ОбластьШапки.Параметры.ДополнительныеРеквизитыПоКатегорииНоменклатуры  = ?(СтруктураПараметров.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Количество() = 0, "", ЗначениеВСтрокуВнутр(СтруктураПараметров.ДополнительныеРеквизитыПоКатегорииНоменклатуры));
	
	ОбластьШапки.Параметры.ПерваяСтрокаДанныхШапки                           = СтруктураПараметров.ПерваяСтрокаДанныхШапки;
	ОбластьШапки.Параметры.РучнаяНумерацияКолонокТабличногоДокументаДляШапки = ?(СтруктураПараметров.РучнаяНумерацияКолонокТабличногоДокументаДляШапки, "Х","");
	
	ОбластьШапки.Параметры.КоличествоНеОбрабатываемыхСтрок = СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьТабличныйДокументНастройкамиДопПараметров(ОбластьШапки, СтруктураПараметров);
		
	ДокументРезультат.Вывести(ОбластьШапки);
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
		ОбластьСтроки = Макет.ПолучитьОбласть("Строка" + ?(ЗагружаемыйРеквизит.РежимЗагрузки = "Вычислять","Выражение",""));
		
		ОбластьСтроки.Параметры.Пометка      = ?(ЗагружаемыйРеквизит.Пометка, "Х","");
		ОбластьСтроки.Параметры.ИмяРеквизита = ЗагружаемыйРеквизит.ИмяРеквизита;
		ОбластьСтроки.Параметры.ПолеПоиска   = ?(ЗагружаемыйРеквизит.ПолеПоиска, "Х","");
		ОбластьСтроки.Параметры.ЭтоДополнительныйРеквизит   = ?(ЗагружаемыйРеквизит.ЭтоДополнительныйРеквизит, "Х","");
		ОбластьСтроки.Параметры.ЭтоСведение  = ?(ЗагружаемыйРеквизит.ЭтоСведение, "Х","");
		ОписаниеТипов = "";
		Для Каждого Тип Из ЗагружаемыйРеквизит.ОписаниеТипов.Типы() Цикл
			МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
			Если НЕ МетаданныеТипа = Неопределено Тогда
				ОписаниеТипа = МетаданныеТипа.ПолноеИмя();
			ИначеЕсли Тип = Тип("Строка") Тогда
				
				ОписаниеТипа = "Строка";
				Если ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина Тогда
					ОписаниеТипа = ОписаниеТипа + ", " + ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина;
					Если ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Фиксированная Тогда
						ОписаниеТипа = ОписаниеТипа + ", " + ДопустимаяДлина.Фиксированная;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Тип = Тип("Число") Тогда
				ОписаниеТипа = "Число"
				+ ", "+ ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.Разрядность
				+ ", "+ ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти
				+ ?(ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный,", Неотрицательный","");
			ИначеЕсли Тип = Тип("Дата") Тогда
				ОписаниеТипа = "" + ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыДаты.ЧастиДаты;
			ИначеЕсли Тип = Тип("Булево") Тогда
				ОписаниеТипа = "Булево";
			Иначе
				Продолжить;
			КонецЕсли;
			
			ОписаниеТипов = ?(ПустаяСтрока(ОписаниеТипов),"",ОписаниеТипов +Символы.ПС) + ОписаниеТипа;
			
		КонецЦикла;
		ОбластьСтроки.Параметры.ОписаниеТипов       = ОписаниеТипов;
		ОбластьСтроки.Параметры.РежимЗагрузки       = ЗагружаемыйРеквизит.РежимЗагрузки;
		ОбластьСтроки.Параметры.НомерКолонки        = ЗагружаемыйРеквизит.НомерКолонки;
		Если ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено) = ЗагружаемыйРеквизит.ЗначениеПоУмолчанию Тогда
			ОбластьСтроки.Параметры.ЗначениеПоУмолчанию = "";
		Иначе
			ОбластьСтроки.Параметры.ЗначениеПоУмолчанию = ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.ЗначениеПоУмолчанию);
		КонецЕсли;
		
		Если ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено) = ЗагружаемыйРеквизит.СсылкаРеквизита Тогда
			ОбластьСтроки.Параметры.СсылкаРеквизита = "";
		Иначе
			ОбластьСтроки.Параметры.СсылкаРеквизита = ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.СсылкаРеквизита);
		КонецЕсли;
		
		Если ор_ЗначениеНеЗаполнено(ЗагружаемыйРеквизит.НастройкаЗагрузки) Тогда
			ОбластьСтроки.Параметры.НастройкаЗагрузки = "";
		Иначе
			ОбластьСтроки.Параметры.НастройкаЗагрузки = ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.НастройкаЗагрузки);
		КонецЕсли;
		
		Если ЗагружаемыйРеквизит.РежимЗагрузки = "Вычислять" Тогда
			
			ОбластьСтроки.Параметры.Выражение           = ЗагружаемыйРеквизит.Выражение;
			
		Иначе
			ОбластьСтроки.Параметры.ИскатьПо            = ЗагружаемыйРеквизит.ИскатьПо;
			ОбластьСтроки.Параметры.СвязьПоВладельцу    = ?(ТипЗнч(ЗагружаемыйРеквизит.СвязьПоВладельцу) = Тип("Строка"),ЗагружаемыйРеквизит.СвязьПоВладельцу,ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.СвязьПоВладельцу));
			ОбластьСтроки.Параметры.СвязьПоТипу         = ?(ТипЗнч(ЗагружаемыйРеквизит.СвязьПоТипу) = Тип("Строка"),ЗагружаемыйРеквизит.СвязьПоТипу,ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.СвязьПоТипу));
			ОбластьСтроки.Параметры.ЭлементСвязиПоТипу  = ЗагружаемыйРеквизит.ЭлементСвязиПоТипу;
		КонецЕсли;
		ОбластьСтроки.Параметры.РежимПоиска        = ЗагружаемыйРеквизит.РежимПоиска;
		ДокументРезультат.Вывести(ОбластьСтроки);
		
	КонецЦикла;
	
	ОбластьПодвала = Макет.ПолучитьОбласть("События");
	ОбластьПодвала.Параметры.ПередЗаписьюОбъекта = СтруктураПараметров.ПередЗаписьюОбъекта;
	ОбластьПодвала.Параметры.ПриЗаписиОбъекта = СтруктураПараметров.ПриЗаписиОбъекта;
	ДокументРезультат.Вывести(ОбластьПодвала);
	ОбластьПодвала = Макет.ПолучитьОбласть("СобытияПослеДобавленияСтроки");
	ОбластьПодвала.Параметры.ПослеДобавленияСтроки = СтруктураПараметров.ПослеДобавленияСтроки;
	ДокументРезультат.Вывести(ОбластьПодвала);
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки Цикл
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаШапка" + ?(ЗагружаемыйРеквизит.РежимЗагрузки = "Вычислять","Выражение",""));
		
		ОбластьСтроки.Параметры.Пометка      = ?(ЗагружаемыйРеквизит.Пометка, "Х","");
		ОбластьСтроки.Параметры.ИмяРеквизита = ЗагружаемыйРеквизит.ИмяРеквизита;
		ОбластьСтроки.Параметры.ПолеПоиска   = ?(ЗагружаемыйРеквизит.ПолеПоиска, "Х","");
		
		ОписаниеТипов = "";
		Для Каждого Тип Из ЗагружаемыйРеквизит.ОписаниеТипов.Типы() Цикл
			МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
			Если НЕ МетаданныеТипа = Неопределено Тогда
				ОписаниеТипа = МетаданныеТипа.ПолноеИмя();
			ИначеЕсли Тип = Тип("Строка") Тогда
				
				ОписаниеТипа = "Строка";
				Если ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина Тогда
					ОписаниеТипа = ОписаниеТипа + ", " + ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.Длина;
					Если ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Фиксированная Тогда
						ОписаниеТипа = ОписаниеТипа + ", " + ДопустимаяДлина.Фиксированная;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Тип = Тип("Число") Тогда
				ОписаниеТипа = "Число"
				+ ", "+ ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.Разрядность
				+ ", "+ ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти
				+ ?(ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный,", Неотрицательный","");
			ИначеЕсли Тип = Тип("Дата") Тогда
				ОписаниеТипа = "" + ЗагружаемыйРеквизит.ОписаниеТипов.КвалификаторыДаты.ЧастиДаты;
			ИначеЕсли Тип = Тип("Булево") Тогда
				ОписаниеТипа = "Булево";
			Иначе
				Продолжить;
			КонецЕсли;
			
			ОписаниеТипов = ?(ПустаяСтрока(ОписаниеТипов),"",ОписаниеТипов +Символы.ПС) + ОписаниеТипа;
			
		КонецЦикла;
		ОбластьСтроки.Параметры.ОписаниеТипов       = ОписаниеТипов;
		ОбластьСтроки.Параметры.РежимЗагрузки       = ЗагружаемыйРеквизит.РежимЗагрузки;
		ОбластьСтроки.Параметры.НомерКолонки        = ЗагружаемыйРеквизит.НомерКолонки;
		Если ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено) = ЗагружаемыйРеквизит.ЗначениеПоУмолчанию Тогда
			ОбластьСтроки.Параметры.ЗначениеПоУмолчанию = "";
		Иначе
			ОбластьСтроки.Параметры.ЗначениеПоУмолчанию = ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.ЗначениеПоУмолчанию);
		КонецЕсли;
		
		Если ор_ЗначениеНеЗаполнено(ЗагружаемыйРеквизит.НастройкаЗагрузки) Тогда
			ОбластьСтроки.Параметры.НастройкаЗагрузки = "";
		Иначе
			ОбластьСтроки.Параметры.НастройкаЗагрузки = ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.НастройкаЗагрузки);
		КонецЕсли;
		
		Если ЗагружаемыйРеквизит.РежимЗагрузки = "Вычислять" Тогда
			
			ОбластьСтроки.Параметры.Выражение           = ЗагружаемыйРеквизит.Выражение;
			
		Иначе
			ОбластьСтроки.Параметры.ИскатьПо            = ЗагружаемыйРеквизит.ИскатьПо;
			ОбластьСтроки.Параметры.СвязьПоВладельцу    = ?(ТипЗнч(ЗагружаемыйРеквизит.СвязьПоВладельцу) = Тип("Строка"),ЗагружаемыйРеквизит.СвязьПоВладельцу,ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.СвязьПоВладельцу));
			ОбластьСтроки.Параметры.СвязьПоТипу         = ?(ТипЗнч(ЗагружаемыйРеквизит.СвязьПоТипу) = Тип("Строка"),ЗагружаемыйРеквизит.СвязьПоТипу,ЗначениеВСтрокуВнутр(ЗагружаемыйРеквизит.СвязьПоТипу));
			ОбластьСтроки.Параметры.ЭлементСвязиПоТипу  = ЗагружаемыйРеквизит.ЭлементСвязиПоТипу;
		КонецЕсли;
		ОбластьСтроки.Параметры.РежимПоиска             = ЗагружаемыйРеквизит.РежимПоиска;
		ДокументРезультат.Вывести(ОбластьСтроки);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции // ПолучитьНастройки()

// Процедура сохраняет данные таблицы соответствия номенклатуры в прайс-лист поставщика
//
// Параметры:
//  ПрайсЛистКонтрагента	              – СправочникСсылка.ПрайсЛистКонтрагента	– прайс лист контрагента.
//  НастройкиЗагрузкиНоменклатурыИскатьПо – Строка	– Строка поиска реквизит номенклатуры.
//
Процедура СохранитьТаблицуСоответствия(ПрайсЛистКонтрагента, НастройкиЗагрузкиНоменклатурыИскатьПо, ТаблицаЗагружаемыхРеквизитов, СоответствиеНоменклатуры, ТаблицаДополнительныхПараметров = Неопределено) Экспорт
	
	РезультатЗагрузки=Истина;
	
	ИскатьПо = НастройкиЗагрузкиНоменклатурыИскатьПо;
	
	// Получим набор записей регистра сведений.
	РегистрПрайсЛистов=РегистрыСведений.ор_ПрайсЛистыПоставщиков.СоздатьНаборЗаписей();
	РегистрПрайсЛистов.Отбор.ПрайсЛист.Значение=ПрайсЛистКонтрагента; 
	РегистрПрайсЛистов.Отбор.ПрайсЛист.Использование=Истина;
	
	ТекстСообщения = НСтр("ru = 'Выполняется сохранение таблицы соответствия в прайс-лист <%1>'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(ПрайсЛистКонтрагента));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	НачатьТранзакцию();
	
	РегистрПрайсЛистов.Прочитать();
	
	ТЗПрайсЛиста=РегистрПрайсЛистов.Выгрузить(); 
	
	ТЗПрайсЛиста.Колонки.Добавить("СтрокаОбновлена");
	ТЗПрайсЛиста.ЗаполнитьЗначения(Ложь, "СтрокаОбновлена");
	ТЗПрайсЛиста.Колонки.Добавить("НаименованиеВРег");
	Для Каждого СтрокаТЗ Из ТЗПрайсЛиста Цикл
		СтрокаТЗ.НаименованиеВРег = ВРег(СокрЛП(СтрокаТЗ.Наименование));
	КонецЦикла;
	
	// Дата регистрации цены.
	ДатаЗагрузки = ТекущаяДата();
	
	ОтборПоПроизводителю = Ложь;
	Если ТаблицаДополнительныхПараметров<>Неопределено Тогда
		СтрокаПроизводитель = ТаблицаДополнительныхПараметров.Найти("Производитель");
		Если НЕ СтрокаПроизводитель = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаПроизводитель.НомерКолонки) Тогда
				ОтборПоПроизводителю = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаСоответствия Из СоответствиеНоменклатуры Цикл
		Если Не СтрокаСоответствия.Номенклатура.Пустая()  Тогда 
			
			сНоменклатура = СтрокаСоответствия.Номенклатура;
			ЗначениеДляПоиска = СтрокаСоответствия.ЗначениеДляПоиска;
			СтруктураПоиска=Новый Структура();
			Если ИскатьПо = "Наименование" Тогда
				СтруктураПоиска.Вставить("НаименованиеВРег",ВРег(СокрЛП(ЗначениеДляПоиска)));
			Иначе
				Если ТЗПрайсЛиста.Колонки.Найти(ИскатьПо)<>Неопределено Тогда
					СтруктураПоиска.Вставить(ИскатьПо,ЗначениеДляПоиска);
				КонецЕсли;
			КонецЕсли;
			
			Если ОтборПоПроизводителю Тогда
				Попытка
					СтруктураПоиска.Вставить("Производитель",СтрокаСоответствия.Производитель);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			НоваяПозицияПрайсЛиста = Неопределено;
			Если СтруктураПоиска.Количество()>0 Тогда
				МассивПозицийПрайсЛиста=ТЗПрайсЛиста.НайтиСтроки(СтруктураПоиска);
				Если МассивПозицийПрайсЛиста.Количество()>0 Тогда
					НоваяПозицияПрайсЛиста=МассивПозицийПрайсЛиста[0];
				КонецЕсли; 
			КонецЕсли; 
			Если НоваяПозицияПрайсЛиста = Неопределено Тогда
				НоваяПозицияПрайсЛиста  = ТЗПрайсЛиста.Добавить();
				НоваяПозицияПрайсЛиста.ПрайсЛист    = ПрайсЛистКонтрагента;
				НоваяПозицияПрайсЛиста.Контрагент   = ПрайсЛистКонтрагента.Владелец; 
				НоваяПозицияПрайсЛиста.Номенклатура = сНоменклатура; 
				НоваяПозицияПрайсЛиста.Наименование = сНоменклатура.Наименование;
				НоваяПозицияПрайсЛиста.Единица      = сНоменклатура.ЕдиницаИзмерения;
				НоваяПозицияПрайсЛиста.СтрокаОбновлена = Истина;
				Если (ИскатьПо = "Код") ИЛИ (ИскатьПо = "Артикул")  Тогда
					НоваяПозицияПрайсЛиста.Артикул      = ЗначениеДляПоиска;
				ИначеЕсли (ИскатьПо = "ШтрихКод") Тогда
					ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаписатьОтраслевыеПараметрыВПрайс(
						НоваяПозицияПрайсЛиста,
						ЗначениеДляПоиска);
				ИначеЕсли (ИскатьПо = "Наименование") Тогда
					НоваяПозицияПрайсЛиста.Наименование = ЗначениеДляПоиска;
				КонецЕсли;
				
				ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаписатьОтраслевыеПараметрыВПрайс(
					НоваяПозицияПрайсЛиста,
					ЗначениеДляПоиска,
					СтрокаСоответствия);
				
			ИначеЕсли НоваяПозицияПрайсЛиста.Номенклатура <> сНоменклатура Тогда
				НоваяПозицияПрайсЛиста.Номенклатура = сНоменклатура;
				НоваяПозицияПрайсЛиста.СтрокаОбновлена = Истина;
			КонецЕсли;
			
			СтрокаНастройки = ТаблицаЗагружаемыхРеквизитов.Найти("Цена");
			Если СтрокаНастройки = Неопределено Тогда
				НомерКолонкиЦена = 0;
			Иначе
				НомерКолонкиЦена = СтрокаНастройки.НомерКолонки;
			КонецЕсли;
			
			Если НомерКолонкиЦена>1 И СтрокаСоответствия.Цена>0 Тогда
				НоваяПозицияПрайсЛиста.Цена = СтрокаСоответствия.Цена;
			КонецЕсли;
			
			НоваяПозицияПрайсЛиста.ДатаЗагрузки = ДатаЗагрузки;
			
		КонецЕсли;
	КонецЦикла;
	
	ТЗПрайсЛиста.Колонки.Удалить("НаименованиеВРег");
	
	Для Каждого СтрокаТаблицы Из ТЗПрайсЛиста Цикл
		Если СтрокаТаблицы.СтрокаОбновлена Тогда
			НоваяЗапись = РегистрыСведений.ор_ПрайсЛистыПоставщиков.СоздатьМенеджерЗаписи();
			НоваяЗапись.ПрайсЛист    = ПрайсЛистКонтрагента;
			НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура; 
			НоваяЗапись.Артикул      = СтрокаТаблицы.Артикул;
			НоваяЗапись.Единица      = СтрокаТаблицы.Единица;
			НоваяЗапись.Наименование = СтрокаТаблицы.Наименование;

			НоваяЗапись.Цена         = СтрокаТаблицы.Цена;
			НоваяЗапись.Количество   = СтрокаТаблицы.Количество;
			НоваяЗапись.СрокПоставки = СтрокаТаблицы.СрокПоставки;
			НоваяЗапись.Контрагент   = СтрокаТаблицы.Контрагент;
			НоваяЗапись.ДатаЗагрузки = СтрокаТаблицы.ДатаЗагрузки;
			
			ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаписатьОтраслевыеПараметрыВПрайс(
				НоваяЗапись,
				Неопределено,
				СтрокаТаблицы);
			
			Попытка
				НоваяЗапись.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка записи таблицы соответствия в прайс-лист: <%1>'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОписаниеОшибки());
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ОтменитьТранзакцию(); Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	ТекстСообщения = НСтр("ru = 'Обработка таблицы соответствия завершена'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Функция выполняет загрузку данных из табличного документа в табличную часть соответствия
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, у которого необходимо сформировать шапку
//
// Возвращаемое значение:
//  Булево	- Истина, если загрузка прошла без ошибок, Ложь - иначе
//
Функция ЗагрузитьСоответствиеНоменклатуры(ТабличныйДокумент, СтруктураПараметров, НомерКолонкиНаименованиеТабличногоДокумента = 0, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	СтруктураИнициализации = Инициализация();
	Для Каждого ЭлементСтруктуры ИЗ СтруктураИнициализации Цикл
		СтруктураПараметров.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	КЭШЗначений = Новый ТаблицаЗначений;
	КЭШЗначений.Колонки.Добавить("ТипРеквизита");
	КЭШЗначений.Колонки.Добавить("ИскатьПо");
	КЭШЗначений.Колонки.Добавить("Представление");
	КЭШЗначений.Колонки.Добавить("Ссылка");
	КЭШЗначений.Колонки.Добавить("ЗначениеРеквизита");
	КЭШЗначений.Колонки.Добавить("СписокСлов");
	СтруктураПараметров.Вставить("КЭШЗначений", КЭШЗначений);
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	СтрокаНастройкиЗагрузкиНоменклатуры =  СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Найти("Номенклатура","ПредставлениеРеквизита"); 
	Если (СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено) ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.Пометка = Ложь)  Тогда
		ТекстСообщения = НСтр("ru = 'Не отмечен реквизит номенклатура!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	// Если номенклатуру ищем по наименованию, тогда скроем соответствующую колонку.
	Если СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо <> "Наименование" Тогда
		
		НомерКолонкиНеНайден = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.НомерКолонкиНаименованияНеНайден(
			СтруктураПараметров,
			НомерКолонкиНаименованиеТабличногоДокумента);
		
		Если НомерКолонкиНеНайден Тогда
			ТекстСообщения = НСтр("ru = 'Не указан номер колонки наименования номенклатуры в настройках дополнительных параметров.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	КоличествоЭлементов = ТабличныйДокумент.ВысотаТаблицы - СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента - СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок + 1;
	
	Если КоличествоЭлементов <= 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет данных для загрузки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	СохранятьПроставленные = СтруктураПараметров.Свойство("СохранятьПроставленные") И СтруктураПараметров.СохранятьПроставленные;
	
	ТаблицаПроставленных = СтруктураПараметров.СоответствиеНоменклатуры.Скопировать();
	
	СтруктураПараметров.СоответствиеНоменклатуры.Очистить();
	
	Загружено = 0;
	
	СтруктураОтраслевыхДополнительныхПараметров = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьСтруктуруОтраслевыхДопПараметров(СтруктураПараметров);
	
	НомерТекущейСтроки = 0;
	Для К = СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента По ТабличныйДокумент.ВысотаТаблицы -СтруктураПараметров.КоличествоНеобрабатываемыхСтрок Цикл
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		ТекстыЯчеек = Неопределено;
		ЗначенийБольшеОдного = Ложь;
		ТекущаяСтрока = ПолучитьСтрокуТаблицыСоответствия(ТабличныйДокумент, К, СтруктураПараметров, ТекстыЯчеек,,СтруктураПараметровЛогирования);
		
		Если СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо = "Наименование" Тогда
			Если СтрокаНастройкиЗагрузкиНоменклатуры.НомерКолонки<>0 Тогда
				Наименование      = СокрЛП(ТекущаяСтрока.Представление);
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе	
			Наименование = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьНаименованиеДляТаблицыСоответствия(
				СтруктураПараметров,
				ТабличныйДокумент,
				ТекстыЯчеек,
				НомерКолонкиНаименованиеТабличногоДокумента,
				К,
				СтруктураПараметровЛогирования);
		КонецЕсли;
		
		Если СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо = "ШтрихКод" Тогда
			НайденнаяСтрока = СтруктураПараметров.СоответствиеНоменклатуры.Найти(ТекущаяСтрока.Представление,"ЗначениеДляПоиска");
		Иначе
			НайденнаяСтрока = СтруктураПараметров.СоответствиеНоменклатуры.Найти(Наименование,"Наименование");
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрокаТаблСоответсвия                   = СтруктураПараметров.СоответствиеНоменклатуры.Добавить();
			НоваяСтрокаТаблСоответсвия.ЗначениеДляПоиска = ?(СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо = "Наименование", Наименование, СокрЛП(ТекущаяСтрока.Представление));
			НоваяСтрокаТаблСоответсвия.Номенклатура      = ТекущаяСтрока.Результат;
			НоваяСтрокаТаблСоответсвия.ЗначенийБольшеОдного  = ТекущаяСтрока.ЗначенийБольшеОдного;
			НоваяСтрокаТаблСоответсвия.Наименование      = Наименование;
			Если ТекущаяСтрока.Результат = Справочники.Номенклатура.ПустаяСсылка() Тогда
				НоваяСтрокаТаблСоответсвия.Загружать = Истина;
			Иначе 
				НоваяСтрокаТаблСоответсвия.Загружать = Ложь;
			КонецЕсли;
			
			ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьСтрокуТаблицыСоответствияПоДопПараметрам(
				СтруктураПараметров,
				НоваяСтрокаТаблСоответсвия,
				СтруктураОтраслевыхДополнительныхПараметров,
				ТабличныйДокумент,
				К,
				ТекстыЯчеек,
				СтруктураПараметровЛогирования);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не СохранятьПроставленные Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаСоответствия ИЗ СтруктураПараметров.СоответствиеНоменклатуры Цикл
		Если Не СтрокаСоответствия.Загружать Тогда
			Продолжить;
		КонецЕсли;
		СтрокаВПроставленных = ТаблицаПроставленных.Найти(СтрокаСоответствия.ЗначениеДляПоиска, "ЗначениеДляПоиска");
		Если СтрокаВПроставленных<>Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаСоответствия, СтрокаВПроставленных);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЗагрузитьСоответствиеНоменклатуры()

// Функция заполнения номенклатуры в таблице соответствия табличного документа
// сообщает об ошибках и устанавливает комментарии к ошибочным ячейкам
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент	- ТабличныйДокумент, у которого необходимо сформировать шапку
//  НомерСтроки       - Число				- Число, номер строки табличного документа
//  ТекстыЯчеек    	  - Массив				- Возвращает массив текстов ячеек строки,
//
// Возвращаемое значение:
//  Структура	- Структура, ключ - Имя загружаемого реквизита, Значение - Значение загружаемого реквизита
//
Функция ПолучитьСтрокуТаблицыСоответствия(ТабличныйДокумент, НомерСтроки, СтруктураПараметров, ТекстыЯчеек = Неопределено, КоличествоОшибок = 0, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	Если НомерСтроки < 1 Тогда
		ТекстСообщения = НСтр("ru = 'Первая строка данных табличного документа должна быть больше нуля!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаТаблицыСоответствия = Новый Структура;
	ТекстыЯчеек = Новый Массив;
	ТекстыЯчеек.Добавить(Неопределено);
	
	Для к = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ТекстыЯчеек.Добавить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(К,"ЧГ=")).Текст));
	КонецЦикла;
	
	НайденнаяСтрока =  СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Найти("Номенклатура","ПредставлениеРеквизита");
	
	Если НайденнаяСтрока = Неопределено ИЛИ НЕ НайденнаяСтрока.Пометка Тогда	
		ТекстСообщения = НСтр("ru = 'Не отмечен реквизит номенклатура!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Если НайденнаяСтрока.НомерКолонки=0 Тогда
		ТекстСообщения = НСтр("ru = 'Не указан номер колонки номенклатура!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеОПроизводителе = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьДанныеПроизводителяИзДопПараметров(СтруктураПараметров);

	Если НЕ НайденнаяСтрока.НомерКолонки = 0 Тогда
		
		Область = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НайденнаяСтрока.НомерКолонки,"ЧГ="));	
		Представление = Область.Текст;
		Примечание = "";
		
		ЗначенийБольшеОдного = Ложь;
		Если НайденнаяСтрока.РежимЗагрузки = "Вычислять" Тогда
			
			Вычисление = ВычислитьЗначениеЯчейки(НайденнаяСтрока.Выражение,НайденнаяСтрока,Представление, ТекстыЯчеек, НайденнаяСтрока.ЗначениеПоУмолчанию, СтруктураПараметров.флКонтрольЗаполнения, СтруктураПараметров.СсылкаИсточника, СтруктураПараметровЛогирования);
			Если НЕ ПустаяСтрока(Вычисление.ОписаниеОшибки) Тогда
				Результат   = Неопределено;
				Примечание = ""+ Вычисление.ОписаниеОшибки;
			Иначе
				Результат = Вычисление.Результат;
			КонецЕсли;
			
		ИначеЕсли ПустаяСтрока(Представление) Тогда
			Результат = Неопределено;
		Иначе
			НайденныеЗначения = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьЗначенияПоПроизводителю(
				ТабличныйДокумент,
				ТекстыЯчеек,
				Примечание,
				Представление,
				НайденнаяСтрока,
				НомерСтроки,
				ДанныеОПроизводителе,
				СтруктураПараметров,
				СтруктураПараметровЛогирования);
			
			Если НайденныеЗначения.Количество() = 0 Тогда
				Примечание = "Не найден"+?(Примечание = "","", Символы.ПС+Примечание);
				Результат = Неопределено;
			ИначеЕсли НайденныеЗначения.Количество() = 1 Тогда
				Результат = НайденныеЗначения[0];
			Иначе
				ЗначенийБольшеОдного = Истина;
				Примечание = "Не однозначное представление. Вариантов: "+НайденныеЗначения.Количество()+?(Примечание = "","", Символы.ПС+Примечание);
				Нашли = Ложь;
				НашлиЗначениеПоУмолчанию = Ложь;
				Для каждого НайденноеЗначение Из НайденныеЗначения Цикл
					Если НайденноеЗначение = Область.Расшифровка Тогда
						Нашли = Истина;
						Прервать;
					КонецЕсли;
					Если НайденноеЗначение = НайденнаяСтрока.ЗначениеПоУмолчанию Тогда
						НашлиЗначениеПоУмолчанию = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ Нашли Тогда
					НайденноеЗначение = Справочники.Номенклатура.ПустаяСсылка();
					Если НашлиЗначениеПоУмолчанию Тогда
						НайденноеЗначение = НайденнаяСтрока.ЗначениеПоУмолчанию;
					Иначе
						Для Каждого Значение Из НайденныеЗначения Цикл
							Если НЕ Значение.ЭтоГруппа Тогда
								НайденноеЗначение = Значение;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				Результат = НайденноеЗначение;
			КонецЕсли;
		КонецЕсли;
		
		Если ор_ЗначениеНеЗаполнено(Результат) Тогда
			Результат = НайденнаяСтрока.ЗначениеПоУмолчанию;
		КонецЕсли;
		
		СтрокаТаблицыСоответствия.Вставить("Представление",Представление);
		СтрокаТаблицыСоответствия.Вставить("Результат",Результат);
		СтрокаТаблицыСоответствия.Вставить("ЗначенийБольшеОдного",ЗначенийБольшеОдного);
		
		Область.Расшифровка = Результат;
		Область.Примечание.Текст = Примечание;
		Если ЗначенийБольшеОдного Тогда
			Область.ЦветФона = WebЦвета.ГолубойСоСтальнымОттенком;
		КонецЕсли;
	КонецЕсли;
		
	Возврат СтрокаТаблицыСоответствия;
	
КонецФункции // ПолучитьСтрокуТаблицыСоответствия()

// Выполняет создание элемента справочника Номенклатура по переданным данным.
//
Процедура СоздатьНоменклатуру(СоответствиеНоменклатуры, ГруппаНоменклатуры, КатегорияНоменклатуры, ЕдиницаИзмерения, ЦеноваяГруппа, ВидСтавкиНДС, СтранаПроисхождения) Экспорт
	Для Каждого СтрокаТаблицыСоответствия Из СоответствиеНоменклатуры Цикл
		
		// Попробуем создать новую номенклатуру или связать с существующей.
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыСоответствия.Номенклатура) И (СтрокаТаблицыСоответствия.Загружать) Тогда
			
			// Номенклатура не прописана - поищем с таким артикулом.
			Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаТаблицыСоответствия.Наименование, Истина);
			Если Номенклатура.Пустая() Тогда
				
				// Нет номенклатуры с таким артикулом - создаем новую.
				Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
				
				Номенклатура.ТипНоменклатуры = КатегорияНоменклатуры.ТипНоменклатурыПоУмолчанию;
				Номенклатура.КатегорияНоменклатуры = КатегорияНоменклатуры;
				КатегорииНоменклатурыСервер.ЗаполнитьСвойстваНоменклатурыПоКатегории(Номенклатура, Истина);
				
				Номенклатура.Родитель           = ГруппаНоменклатуры;
				Номенклатура.Наименование       = СтрокаТаблицыСоответствия.Наименование;
				Номенклатура.НаименованиеПолное = СтрокаТаблицыСоответствия.Наименование;
				Номенклатура.УстановитьНовыйКод();
				Номенклатура.НаименованиеПолное = Номенклатура.Наименование;
				Номенклатура.ЕдиницаИзмерения   = ЕдиницаИзмерения;
				Номенклатура.ЦеноваяГруппа      = ЦеноваяГруппа;
				Номенклатура.ВидСтавкиНДС = ?(ЗначениеЗаполнено(СтрокаТаблицыСоответствия.ВидСтавкиНДС), СтрокаТаблицыСоответствия.ВидСтавкиНДС, ВидСтавкиНДС);
				
				ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДописатьПараметрыВСоздаваемуюНоменклатуру(Номенклатура,СтрокаТаблицыСоответствия, СтранаПроисхождения);
				
				Попытка
					Номенклатура.Записать();
				Исключение
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Ошибка записи номенклатуры ""%1""'"), Номенклатура.Наименование);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
				
				СтрокаТаблицыСоответствия.Номенклатура = Номенклатура.Ссылка;
				СтрокаТаблицыСоответствия.Загружать    = Ложь;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицыСоответствия.ВидСтавкиНДС) Тогда
					СтрокаТаблицыСоответствия.ВидСтавкиНДС = Номенклатура.ВидСтавкиНДС;
				КонецЕсли;
				
			Иначе
				// Добавим найденную позицию.
				СтрокаТаблицыСоответствия.Номенклатура = Номенклатура.Ссылка;
				СтрокаТаблицыСоответствия.Загружать    = Ложь;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицыСоответствия.ВидСтавкиНДС) Тогда
					СтрокаТаблицыСоответствия.ВидСтавкиНДС = Номенклатура.ВидСтавкиНДС;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

// Выполняет создание элемента справочника Номенклатура по переданной настройке.
//
Функция СоздатьНоменклатуруПоНастройке(ТабличныйДокументОбъекта, Настройка, НомерКолонкиНоменклатуры, СоответствиеНоменклатуры, ТаблицаЗагружаемыхРеквизитов, ТаблицаДополнительныхПараметров, ПерваяСтрокаДанныхТабличногоДокумента, ТаблицаЗагружаемыхРеквизитовШапки, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ЕстьЧтоЗагружать = Ложь;
	
	ТабличныйДокументНоменклатуры = Новый ТабличныйДокумент;
	
	Для Каждого СтрокаСоответствия Из СоответствиеНоменклатуры Цикл
		Если СтрокаСоответствия.Загружать Тогда
			ЕстьЧтоЗагружать = Истина;
			ТабличныйДокумент = ТабличныйДокументОбъекта;
			Для К = ПерваяСтрокаДанныхТабличногоДокумента По ТабличныйДокумент.ВысотаТаблицы Цикл
				Область = ТабличныйДокумент.Область("R"+Формат(К,"ЧГ=")+"C"+Формат(НомерКолонкиНоменклатуры,"ЧГ="));
				Представление = СокрЛП(Область.Текст);
				Если Представление = СтрокаСоответствия.ЗначениеДляПоиска Тогда
					ОбластьСтрока = ТабличныйДокумент.ПолучитьОбласть("R"+Формат(К,"ЧГ="));
					ТабличныйДокументНоменклатуры.Вывести(ОбластьСтрока);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров = Инициализация();
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 			ТаблицаЗагружаемыхРеквизитов);
	СтруктураПараметров.Вставить("ТаблицаДополнительныхПараметров", 		ТаблицаДополнительныхПараметров);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 	1);
	СтруктураПараметров.Вставить("РежимЗагрузки", 							3);
	СтруктураПараметров.Вставить("ИмяСправочника", 							"Номенклатура");
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 						"");
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 					"");
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 						"");
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 					"");
	СтруктураПараметров.Вставить("СсылкаИсточника", 						Неопределено);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника", 				Неопределено);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 				Ложь);
    СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",			Ложь);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 				Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 	1);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",			0);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности", 				"");
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии", 			Ложь);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",			Ложь);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",					Ложь);
	СтруктураПараметров.Вставить("НеФормироватьДопНомерСерии", 				Ложь);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом", 				"");
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 				Ложь);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов", 			"");
	СтруктураПараметров.Вставить("СоздаватьПроизводителя", 					Ложь);
	СтруктураПараметров.Вставить("Табуляция", 								Неопределено);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", Ложь);
	СтруктураПараметров.Вставить("ОбработкаПреобразования", 				Неопределено);
	СтруктураПараметров.Вставить("Кодировка",				 				"");
	СтруктураПараметров.Вставить("ИмяТаблицы",				 				"");
	СтруктураПараметров.Вставить("ОписаниеОшибок",				 			"");
	СтруктураПараметров.Вставить("ТЧДокумента",				 				Неопределено);
	СтруктураПараметров.Вставить("ДопПараметры",				 			Неопределено);
	СтруктураПараметров.Вставить("флКонтрольЗаполнения", 					Ложь);
	СтруктураПараметров.Вставить("ВладелецСерии",				 			Неопределено);
	СтруктураПараметров.Вставить("ЗагружатьШК",									Ложь);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",	Новый СписокЗначений);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры",				Новый ТаблицаЗначений);
	
	СтруктураПараметров.Вставить("ШКЯвляетсяПолемПоискаНоменклатуры",			Ложь);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики",				Ложь);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           0);
	
	ЗаполнитьНастройкиКолонок(Настройка.НастройкиЗагрузкиВыгрузки.Получить(), СтруктураПараметров,,СтруктураПараметровЛогирования);
	СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента = 1;
	
	ЗагрузитьДанные(ТабличныйДокументНоменклатуры,СтруктураПараметров,,СтруктураПараметровЛогирования);
	Если ЗначениеЗаполнено(СтруктураПараметров.ОписаниеОшибок) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеОшибок);
	КонецЕсли;
	
	Возврат ЕстьЧтоЗагружать;
	
КонецФункции

// Функция определить возможность установки режима поиска для текущих данных
//
// Параметры:
//  РеквизитПоиска              - Строка			- реквизит поиска
//  ОписаниеТиповРеквизита      - ОписаниеТипов		- Допустимое описание типов численного значения
//  РеквизитИскатьПо            - Строка			- реквизит поиска
//  РеквизитЗначениеПоУмолчанию - Строка			- значение реквизита по умолчанию
//
// Возвращаемое значение:
// 	Булево 	- Истина - есть возможность установки режима поиска для текущих данных, ложь - иначе.
//
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию) Экспорт
		// Режим поиска по похожим словам.
		Если РеквизитПоиска="Владелец"
			ИЛИ РеквизитПоиска="Родитель" Тогда
				
			Возврат Ложь;
			
		ИначеЕсли РеквизитПоиска="Наименование" Тогда	 
			
			Возврат Истина;
			
		Иначе
			Если НЕ ОписаниеТиповРеквизита.СодержитТип(Тип("Строка")) Тогда
				МассивТипов = ОписаниеТиповРеквизита.Типы();
				Если МассивТипов.Количество()<>0 Тогда
					ТипРеквизита = МассивТипов[0];
					Если ТипРеквизита = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
						Возврат Ложь;
					КонецЕсли;
					Попытка
						Если ТипЗнч(РеквизитЗначениеПоУмолчанию[РеквизитИскатьПо]) = Тип("Строка") Тогда
							Возврат Истина;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЕсли;
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
	Возврат Истина;
	
КонецФункции //ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных()

// Функция определить возможность установки режима загрузки для текущих данных
//
// Параметры:
//  ОписаниеТиповРеквизита      - ОписаниеТипов		- Допустимое описание типов численного значения
//
// Возвращаемое значение:
// 	Булево 	- Истина - есть возможность установки режима загрузки для текущих данных, ложь - иначе.
//
Функция ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, ЗначениеПоУмолчанию) Экспорт
	МассивТипов = ОписаниеТиповРеквизита.Типы();
	ВсеОк = Ложь;
	Если МассивТипов.Количество()<>0 Тогда
		ТипРеквизита = МассивТипов[0];
		Попытка
			Если ТипРеквизита = ТипЗнч(ЗначениеПоУмолчанию) И Метаданные.Справочники.Содержит(ЗначениеПоУмолчанию.Метаданные()) Тогда
				ВсеОк = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат ВсеОк;
КонецФункции //ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных()

// Функция получает настройку из хранилища
//
Функция ПолучитьНастройкуИзХранилища(НастройкиСсылка) Экспорт
	
	ОбъектНастройка = НастройкиСсылка.ПолучитьОбъект();
	
	Настройки = ОбъектНастройка.НастройкиЗагрузкиВыгрузки.Получить();
	
	Возврат Настройки;
	
КонецФункции

// Процедура устанавливает флаг таблицы
//
Процедура УстановитьФлагТаблицыСоответствий(ЗначениеФлага, ТаблицаСоответствий) Экспорт
	
	Для Каждого Элемент Из ТаблицаСоответствий Цикл
		Если ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
			Элемент.Загружать = Ложь;
		Иначе
			Элемент.Загружать = ЗначениеФлага;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция получения настроек для всех контрагентов.
//
Функция ПолучитьНастройкиДляВсехКонтрагентов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокументаКонтрагенты.Ссылка,
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокументаКонтрагенты.Контрагент
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Контрагенты КАК ор_НастройкиЗагрузкиДанныхИзТабличногоДокументаКонтрагенты
	|ГДЕ
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокументаКонтрагенты.Контрагент <> &ПустойКонтрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Ссылка
	|ИЗ
	|	Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента КАК ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента
	|ГДЕ
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЭтоГруппа = ЛОЖЬ
	|	И НЕ ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Ссылка В
	|				(ВЫБРАТЬ
	|					Таб.Ссылка
	|				ИЗ
	|					Таб)";
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

// Функция выполняет загрузку данных из табличного документа в шапку документа
//
Функция ЗагрузитьДанныеШапки(ТабличныйДокумент, СтруктураПараметров, Объект, ЗаписыватьОбъект, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Выполняется загрузка реквизитов шапки документа" + Символы.ПС;
	
	// Расширим табличный документ до максимальной колонки.
	МаксимальныНомерКолонки = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки[0].НомерКолонки; // Строки должны быть (см. проверку пометки).
	Для сч=1 по (СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Количество()-1) Цикл
		Строка = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки[сч];
		Если Строка.Пометка И МаксимальныНомерКолонки < Строка.НомерКолонки Тогда
			МаксимальныНомерКолонки = Строка.НомерКолонки;
		КонецЕсли;
	КонецЦикла;
	
	Если МаксимальныНомерКолонки > ТабличныйДокумент.ШиринаТаблицы Тогда
		// Свойство ШиринаТаблицы не доступно на запись, выполняем фиктивное обращение к ячейке.
		ТабличныйДокумент.Область("R1C"+Формат(МаксимальныНомерКолонки,"ЧН=0; ЧГ=0")).Текст = "";
	КонецЕсли;
	
	ПерваяСтрока = СтруктураПараметров.ПерваяСтрокаДанныхШапки;
	ТекстыЯчеек = Неопределено;
	Отказ = Ложь;
	ТекущаяСтрока = КонтрольЗаполненияСтроки(ТабличныйДокумент, ПерваяСтрока, СтруктураПараметров, ТекстыЯчеек,, Истина, СтруктураПараметровЛогирования);
	ОбъектНайден = Ложь;
	Для Каждого КлючИЗначение Из ТекущаяСтрока Цикл
		Если НЕ ОбъектНайден ИЛИ КлючИЗначение.Ключ = "ДополнительныеРеквизитыИСведенияДляЗагрузки" ИЛИ СтруктураПараметров.Колонки[КлючИЗначение.Ключ].Пометка  Тогда
			Попытка
				Если (СтруктураПараметров.РежимЗагрузки = 3) ИЛИ (ПроверитьЧтоЭтоДокумент(СтруктураПараметров.СсылкаИсточника) И (СтруктураПараметров.РежимЗагрузки = 1)) Тогда
					Если НЕ ор_ЗначениеНеЗаполнено(КлючИЗначение.Значение) Тогда 
						Если КлючИЗначение.Ключ<>"ЭтоГруппа" Тогда
							Если КлючИЗначение.Ключ = "ДополнительныеРеквизитыИСведенияДляЗагрузки" Тогда
								Попытка
									Объект.ДополнительныеСвойства.Вставить("ДополнительныеРеквизитыИСведенияДляЗагрузки", КлючИЗначение.Значение);
								Исключение
								КонецПопытки;
							Иначе
								Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
								СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Обработан реквизит " +"'"+ КлючИЗначение.Ключ +"'"+ Символы.ПС;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если КлючИЗначение.Ключ<>"ЭтоГруппа" Тогда
						Если КлючИЗначение.Ключ = "ДополнительныеРеквизитыИСведенияДляЗагрузки" Тогда
							Попытка
								Объект.ДополнительныеСвойства.Вставить("ДополнительныеРеквизитыИСведенияДляЗагрузки", КлючИЗначение.Значение);
							Исключение
							КонецПопытки;
						Иначе
							Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
							СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Обработан реквизит " +"'"+ КлючИЗначение.Ключ +"'"+ Символы.ПС;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Исключение
				СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Ошибка при установке значения реквизита """ + КлючИЗначение.Ключ + "" + ОписаниеОшибки() + Символы.ПС;
				Отказ = Истина;
				Прервать;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтруктураПараметров.РежимЗагрузки = 1 Тогда
		
		Если НЕ Отказ Тогда
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Загружены реквизиты шапки документа" + Символы.ПС;
		Иначе
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "При загрузке шапки документа возникли ошибки." + Символы.ПС;
			ЗаписыватьОбъект = Ложь;
		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.РежимЗагрузки = 3 Тогда
		
		Если НЕ Отказ Тогда
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "Загружены реквизиты шапки документа" + Символы.ПС;
		Иначе
			СтруктураПараметров.ОписаниеОшибок = СтруктураПараметров.ОписаниеОшибок + "При загрузке шапки документа возникли ошибки." + Символы.ПС;
			ЗаписыватьОбъект = Ложь;
		КонецЕсли;
		
	КонецЕсли
	
КонецФункции // ЗагрузитьДанныеШапки()

// Процедура регламентного задания "ор_АвтоматическаяЗагрузкаИзЭлектронныхДокументов"
//
Процедура ЗагрузитьДанныеПоРегламентномуЗаданию(Контрагент, НастройкаЗагрузки, Каталог) Экспорт
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ор_НастройкиГрупповойЗагрузкиДанныхИзЭлектронныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Отбор.НастройкаЗагрузки.Установить(НастройкаЗагрузки);
	НаборЗаписей.Отбор.Каталог.Установить(Каталог);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ТекЗапись = НаборЗаписей[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Не ТекЗапись.ИспользоватьРегламентноеЗадание Тогда
		Возврат;
	КонецЕсли;
	
	КаталогПоиска = СтрЗаменить(Каталог, "\", "/");
	МассивФайлов = Новый Массив;
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("*.dbf");
	МассивРасширений.Добавить("*.xls");
	МассивРасширений.Добавить("*.txt");
	МассивРасширений.Добавить("*.mxl");
	МассивРасширений.Добавить("*.mdb");
	МассивРасширений.Добавить("*.sst");
	МассивРасширений.Добавить("*.mmo");
	МассивРасширений.Добавить("*.xml");
	МассивРасширений.Добавить("*.ods");
	МассивРасширений.Добавить("*.xlsx");
	Для Каждого Расширение Из МассивРасширений Цикл
		МассивФайловПоРасширению = НайтиФайлы(КаталогПоиска, Расширение, Ложь);
		Для Каждого Файл Из МассивФайловПоРасширению Цикл
			МассивФайлов.Добавить(Файл);
		КонецЦикла;
	КонецЦикла;
	
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ПолучитьНастройкуИзХранилища(НастройкаЗагрузки);
	
	// Получение данных из настроек.
	ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст);
	ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область("R2C5").Текст);
	РежимЗагрузки = 0;
	Если ТекстВосстановленногоРежимаЗагрузки = "в справочник" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "" Тогда
		РежимЗагрузки = 0;
	ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "Х" Тогда
		Если ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" Тогда
			ТекстОбъекта = СокрЛП(Настройки.Область("R3C5").Текст);
			Если Лев(ТекстОбъекта, 16) = "РегистрСведений." Тогда
				РежимЗагрузки = 2;
			Иначе
				РежимЗагрузки = 1;
			КонецЕсли;
		Иначе
			РежимЗагрузки = 1;
		КонецЕсли;
	ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в регистр сведений" Тогда
		РежимЗагрузки = 2;
	КонецЕсли;
	
	// Формирование структуры логирования.
	СтруктураПараметровЛогирования = Новый Структура();
	СтруктураПараметровЛогирования.Вставить("НастройкаЗагрузки",    НастройкаЗагрузки);
	СтруктураПараметровЛогирования.Вставить("ИмяЗагружаемогоФайла", "");
	СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", Неопределено);
	СтруктураПараметровЛогирования.Вставить("ФоноваяЗагрузка",      Истина);
	СтруктураПараметровЛогирования.Вставить("Контрагент",           Контрагент);
	СтруктураПараметровЛогирования.Вставить("Каталог",              Каталог);
	СтруктураПараметровЛогирования.Вставить("ДатаНачалаЗагрузки",   ТекущаяДата());
	СтруктураПараметровЛогирования.Вставить("НумераторСообщений",   0);
	СтруктураПараметровЛогирования.Вставить("ЕстьОшибки",           Ложь);
	
	ОбъектЗагрузки = Настройки.Область("R3C5").Текст;
	ИмяСправочника = "";
	ИмяВидаРегистра = "";
	СсылкаИсточника = Неопределено;
	ТабличнаяЧастьИсточника = Неопределено;
	ДокументОбъект = Неопределено;
	
	// Заполнение метаданных.
	Попытка
		Если РежимЗагрузки = 0 Тогда
			// Загрузка в справочник.
			ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "Справочник.", ""));
			ИмяСправочника = ОбъектЗагрузки;
			СсылкаИсточника = Справочники[ОбъектЗагрузки].ПустаяСсылка();
			РежимЗагрузки = 3;
		ИначеЕсли РежимЗагрузки = 1 тогда
			// Загрузка в  документ.
			ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "Документ.", ""));
			Попытка
				ИмяДокумента = Лев(ОбъектЗагрузки,Найти(ОбъектЗагрузки,".ТабличнаяЧасть")-1);
				ДокументОбъект = Документы[ИмяДокумента].СоздатьДокумент();
				ДокументОбъект.Дата = ТекущаяДата();
				ДокументОбъект.Комментарий = "Документ создан автоматически при загрузке из электронного документа";
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать();
				ДокументОбъект.ОбменДанными.Загрузка = Ложь;
				СсылкаИсточника = ДокументОбъект.Ссылка;
				ТабличнаяЧастьИсточника = СтрЗаменить(ОбъектЗагрузки,ИмяДокумента+".ТабличнаяЧасть.","");
				
				// Обновление данных структуры параметров логирования.
				СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", ДокументОбъект.Ссылка);
			Исключение
				ДобавитьВЛог(ОписаниеОшибки(), 1, СтруктураПараметровЛогирования);
			КонецПопытки;
		ИначеЕсли РежимЗагрузки = 2 Тогда
			// Загрузка в регистр сведений.
			ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "РегистрСведений.", ""));
			ИмяВидаРегистра = ОбъектЗагрузки;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	
	СтруктураТаблиц = СформироватьСтруктуруТаблиц();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СсылкаИсточника",                                   СсылкаИсточника);
	СтруктураПараметров.Вставить("РежимЗагрузки",                                     РежимЗагрузки);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",                           ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",                                   ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",                                    ИмяСправочника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьДокументаОбъекта",                    Неопределено);
	СтруктураПараметров.Вставить("ТЧДокумента",                                       ?(ЗначениеЗаполнено(ТабличнаяЧастьИсточника), СсылкаИсточника[ТабличнаяЧастьИсточника].Выгрузить(), Неопределено));
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов",                         Ложь);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",                   Ложь);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи",                        Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",         Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",             0);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",                   0);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",                           "");
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",                       Ложь);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",                      Ложь);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",                             Ложь);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом",                        0);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",                         Ложь);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов",                    "");
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",                            Ложь);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",      Ложь);
	СтруктураПараметров.Вставить("ОбработкаПреобразования",                           Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	СтруктураПараметров.Вставить("Кодировка",                                         "");
	СтруктураПараметров.Вставить("Табуляция",                                         "");
	СтруктураПараметров.Вставить("ИмяТаблицы",                                        "");
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",                               "");
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",                                  "");
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",                             "");
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов",                      СтруктураТаблиц.ТаблицаЗагружаемыхРеквизитов);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",         Новый СписокЗначений);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",         Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",       Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           0);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 СтруктураТаблиц.ТаблицаЗагружаемыхРеквизитовШапки);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметрыАвтозагрузка(СтруктураПараметров, СтруктураТаблиц);
	ЗаполнитьНастройкиКолонок(Настройки, СтруктураПараметров, СтруктураПараметровЛогирования);
	
	// Проверка наличия ошибок при заполнении настроек.
	Если СтруктураПараметровЛогирования.ЕстьОшибки Тогда
		СсылкаИсточника = Неопределено;
		Попытка
			ДокументОбъект.Удалить();
			ДокументОбъект = Неопределено;
		Исключение
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	// Проверка настройки загрузки.
	ОтборСтрок = Новый Структура("Пометка", Истина);
	СтрокиТаблицы = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
	Если СтрокиТаблицы.Количество() = 0 Тогда
		ДобавитьВЛог("В настройке загрузки <"+НастройкаЗагрузки+"> не отмечен ни один загружаемый реквизит", 1, СтруктураПараметровЛогирования);
		СсылкаИсточника = Неопределено;
		Попытка
			ДокументОбъект.Удалить();
			ДокументОбъект = Неопределено;
		Исключение
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметров.ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(СтруктураПараметров.ОбработкаПреобразования) Тогда 
		ДобавитьВЛог("В настройке загрузки указано, что файл преобразовывается в табличный документ внешней обработкой, но обработка не указана!", 1, СтруктураПараметровЛогирования);
		СсылкаИсточника = Неопределено;
		Попытка
			ДокументОбъект.Удалить();
			ДокументОбъект = Неопределено;
		Исключение
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	// Разберемся с каждым файлом.
	Для Каждого ФайлДанных Из МассивФайлов Цикл
		// Обновление данных структуры параметров логирования.
		СтруктураПараметровЛогирования.Вставить("ИмяЗагружаемогоФайла", ФайлДанных.ПолноеИмя);
		СтруктураПараметровЛогирования.Вставить("ЕстьОшибки",           Ложь);
		
		Если НЕ ФайлДанных.Существует() ИЛИ ФайлДанных.ЭтоКаталог() Тогда
			ДобавитьВЛог("Файл данных <"+ФайлДанных.Имя+"> не существует или является каталогом", 1, СтруктураПараметровЛогирования);
			Продолжить;
		КонецЕсли;
		
		ДанныеФайла = Новый ДвоичныеДанные(ФайлДанных.ПолноеИмя);
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДанныеФайла);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Если СтруктураПараметров.ИспользоватьВнешнийМодульПреобразованияФайла И ЗначениеЗаполнено(СтруктураПараметров.ОбработкаПреобразования) Тогда
			ЗаполнитьТабличныйДокументИзXMLСервер(ФайлДанных, СтруктураПараметров.ОбработкаПреобразования, ТабличныйДокумент, АдресВоВременномХранилище, СтруктураПараметровЛогирования);
		Иначе
			ПрочитатьТабличныйДокумент(ТабличныйДокумент, ФайлДанных.Расширение, ФайлДанных.ИмяБезРасширения, АдресВоВременномХранилище, СтруктураПараметров.Табуляция, СтруктураПараметров.Кодировка, СтруктураПараметровЛогирования);
		КонецЕсли;
		
		Если СтруктураПараметровЛогирования.ЕстьОшибки Тогда
			СтруктураПараметровЛогирования.ЕстьОшибки = Ложь;
			Продолжить;
		КонецЕсли;
		
		КоличествоЭлементов = ТабличныйДокумент.ВысотаТаблицы - СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента - СтруктураПараметров.КоличествоНеОбрабатываемыхСтрок + 1;
		Если КоличествоЭлементов <= 0 Тогда
			ДобавитьВЛог("В файле <"+ФайлДанных.Имя+"> нет данных для загрузки", 1, СтруктураПараметровЛогирования);
			Продолжить;
		КонецЕсли;
		
		// Выполним загрузку.
		СтруктураПараметров.Вставить("СсылкаИсточника",          СсылкаИсточника);
		СтруктураПараметров.Вставить("ТЧДокумента",              ?(ЗначениеЗаполнено(ТабличнаяЧастьИсточника), СсылкаИсточника[ТабличнаяЧастьИсточника].Выгрузить(), Неопределено));
		СтруктураПараметров.Вставить("флКонтрольЗаполнения",     Ложь);
		СтруктураПараметров.Вставить("ОписаниеОшибок",           "");
		СтруктураПараметров.Вставить("ДопПараметры",             Новый Структура());
		СтруктураПараметров.Вставить("ВладелецСерии",            Неопределено);
		СтруктураПараметров.Вставить("СоответствиеНоменклатуры", СтруктураТаблиц.СоответствиеНоменклатуры);
		СтруктураПараметров.Вставить("Поставщик",                Контрагент);
		
		ЗагрузитьДанные(ТабличныйДокумент,СтруктураПараметров,,СтруктураПараметровЛогирования);
		
		Если РежимЗагрузки = 1 тогда
			// Попробуем провести документ, который мы создали.
			Если ТекЗапись.ПроводитьДокументы Тогда
				ДокОбъект = СсылкаИсточника.ПолучитьОбъект();
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					ДобавитьВЛог("Документ """+ДокОбъект+""" проведен", 3, СтруктураПараметровЛогирования);
				Исключение
					ДобавитьВЛог("Не удалось провести документ """+ДокОбъект+"""", 1, СтруктураПараметровЛогирования);
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			Если ТекЗапись.ДействияСФайлами = 0 Тогда
				КаталогАрхиваПеремещаемыхФайлов = ТекЗапись.КаталогПеремещения+"\"+Строка(Формат(ТекущаяДата(),"ДФ=""дд-ММ-гггг"""));
				СоздатьКаталог(КаталогАрхиваПеремещаемыхФайлов);
				ПереместитьФайл(ФайлДанных.ПолноеИмя, КаталогАрхиваПеремещаемыхФайлов+"\"+ФайлДанных.Имя);
				ДобавитьВЛог("Файл """+Файл.Имя+""" перемещен в каталог "+ КаталогАрхиваПеремещаемыхФайлов, 3, СтруктураПараметровЛогирования);
			ИначеЕсли ТекЗапись.ДействияСФайлами = 1 Тогда
				УдалитьФайлы(ФайлДанных.ПолноеИмя);
				ДобавитьВЛог("Файл """+Файл.Имя+""" удален.", 3, СтруктураПараметровЛогирования);
			Иначе
				ЗагрузкаСОшибками = СтруктураПараметровЛогирования.ЕстьОшибки;
				Если НЕ ЗагрузкаСОшибками Тогда
					Если ТекЗапись.ДействияСФайлами = 3 Тогда
						КаталогАрхиваПеремещаемыхФайлов = ТекЗапись.КаталогПеремещения+"\"+Строка(Формат(ТекущаяДата(),"ДФ=""дд-ММ-гггг"""));
						СоздатьКаталог(КаталогАрхиваПеремещаемыхФайлов);
						ПереместитьФайл(ФайлДанных.ПолноеИмя,КаталогАрхиваПеремещаемыхФайлов+"\"+ФайлДанных.Имя);
						ДобавитьВЛог("Файл """+Файл.Имя+""" перемещен в каталог "+ КаталогАрхиваПеремещаемыхФайлов, 3, СтруктураПараметровЛогирования);
					ИначеЕсли ТекЗапись.ДействияСФайлами = 4 Тогда
						УдалитьФайлы(ФайлДанных.ПолноеИмя);
						ДобавитьВЛог("Файл """+Файл.Имя+""" удален.", 3, СтруктураПараметровЛогирования);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			СтрокаОшибки ="Ошибка при выполнении действий с файлом после загрузки"+Символы.ПС+Символы.ПС;
			ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			Пока ИнформацияОбОшибке<>Неопределено Цикл
				СтрокаОшибки = СтрокаОшибки+"   "+ИнформацияОбОшибке.Описание+Символы.ПС;
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			КонецЦикла;
			ДобавитьВЛог(СтрокаОшибки, 1, СтруктураПараметровЛогирования);
		КонецПопытки;
		
		Если РежимЗагрузки = 1 тогда
			
			// Если грузим в документ, то надо создать новый документ для загрузки в него следующего файла.
			ОбъектЗагрузки = СокрЛП(СтрЗаменить(ОбъектЗагрузки, "Документ.", ""));
			СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", Неопределено);
			Попытка
				ИмяДокумента = Лев(ОбъектЗагрузки,Найти(ОбъектЗагрузки,".ТабличнаяЧасть")-1);
				ДокументОбъект = Документы[ИмяДокумента].СоздатьДокумент();
				ДокументОбъект.Дата = ТекущаяДата();
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Комментарий = "Документ создан автоматически при загрузке из электронного документа";
				ДокументОбъект.Записать();
				СсылкаИсточника = ДокументОбъект.Ссылка;
				СтруктураПараметровЛогирования.Вставить("ОбъектДляЛогирования", ДокументОбъект.Ссылка);
			Исключение
				ДобавитьВЛог(ОписаниеОшибки(), 1, СтруктураПараметровЛогирования);
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если РежимЗагрузки = 1 Тогда
		Попытка 
			СсылкаИсточника = Неопределено;
			ДокументОбъект.Удалить();
			ДокументОбъект = Неопределено;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру таблиц, необходимых для выполнения загрузки данных из табличного документа
//
Функция СформироватьСтруктуруТаблиц() Экспорт
	
	ТипЛюбаяСсылка = Новый ОписаниеТипов();
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, Справочники.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, Документы.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, Перечисления.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, ПланыВидовХарактеристик.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, ПланыСчетов.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, ПланыВидовРасчета.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, БизнесПроцессы.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, Задачи.ТипВсеСсылки().Типы());
	ТипЛюбаяСсылка = Новый ОписаниеТипов(ТипЛюбаяСсылка, ПланыОбмена.ТипВсеСсылки().Типы());
	
	ТаблицаЗагружаемыхРеквизитов = Новый ТаблицаЗначений;
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ПредставлениеРеквизита", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("МожетБытьПолемПоиска", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ПолеПоиска", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ДоступноеОписаниеТипов", Новый ОписаниеТипов("ОписаниеТипов"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ОписаниеТипов", Новый ОписаниеТипов("ОписаниеТипов"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("РежимЗагрузки", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("НомерКолонки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЗначениеПоУмолчанию", Новый ОписаниеТипов(Новый ОписаниеТипов("Строка, Число, дата, Булево, ОписаниеТипов"), ТипЛюбаяСсылка.Типы()));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("Выражение", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ИскатьПо", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("СвязьПоВладельцу", Новый ОписаниеТипов(Новый ОписаниеТипов("Строка"), ТипЛюбаяСсылка.Типы()));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("СвязьПоТипу", ТипЛюбаяСсылка);
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЭлементСвязиПоТипу", ТипЛюбаяСсылка);
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ШиринаКолонки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("РежимПоиска", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("НастройкаЗагрузки", Новый ОписаниеТипов("СправочникСсылка.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ПодсвечиватьСтроку", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЭтоДополнительныйРеквизит", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("СсылкаРеквизита", Новый ОписаниеТипов(Новый ОписаниеТипов("Строка, Число, Дата, Булево, ОписаниеТипов"), ТипЛюбаяСсылка.Типы()));
	ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЭтоСведение", Новый ОписаниеТипов("Булево"));
	
	ТаблицаЗагружаемыхРеквизитовШапки = Новый ТаблицаЗначений;
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ПредставлениеРеквизита", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("МожетБытьПолемПоиска", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ПолеПоиска", Новый ОписаниеТипов("Булево"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ДоступноеОписаниеТипов", Новый ОписаниеТипов("ОписаниеТипов"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ОписаниеТипов", Новый ОписаниеТипов("ОписаниеТипов"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("РежимЗагрузки", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("НомерКолонки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ЗначениеПоУмолчанию", Новый ОписаниеТипов(Новый ОписаниеТипов("Строка, Число, Дата, Булево, ОписаниеТипов"), ТипЛюбаяСсылка.Типы()));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("Выражение", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ИскатьПо", Новый ОписаниеТипов("Строка"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("СвязьПоВладельцу", Новый ОписаниеТипов(Новый ОписаниеТипов("Строка"), ТипЛюбаяСсылка.Типы()));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("СвязьПоТипу", ТипЛюбаяСсылка);
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ЭлементСвязиПоТипу", ТипЛюбаяСсылка);
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ШиринаКолонки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("РежимПоиска", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("НастройкаЗагрузки", Новый ОписаниеТипов("СправочникСсылка.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента"));
	ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ПодсвечиватьСтроку", Новый ОписаниеТипов("Булево"));
	
	ТаблицаДополнительныхПараметров = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПараметров.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ТаблицаДополнительныхПараметров.Колонки.Добавить("НомерКолонки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДополнительныхПараметров.Колонки.Добавить("РежимЗагрузки", Новый ОписаниеТипов("Строка"));
	ТаблицаДополнительныхПараметров.Колонки.Добавить("Выражение", Новый ОписаниеТипов("Строка"));
	
	СоответствиеНоменклатуры = Новый ТаблицаЗначений;
	СоответствиеНоменклатуры.Колонки.Добавить("ЗначениеДляПоиска", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	СоответствиеНоменклатуры.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	СоответствиеНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СоответствиеНоменклатуры.Колонки.Добавить("Цена",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	СоответствиеНоменклатуры.Колонки.Добавить("Загружать", Новый ОписаниеТипов("Булево"));
	СоответствиеНоменклатуры.Колонки.Добавить("ВидСтавкиНДС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСтавокНДС"));
	СоответствиеНоменклатуры.Колонки.Добавить("ЗначенийБольшеОдного", Новый ОписаниеТипов("Булево"));
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаЗагружаемыхРеквизитов", ТаблицаЗагружаемыхРеквизитов);
	СтруктураТаблиц.Вставить("ТаблицаЗагружаемыхРеквизитовШапки", ТаблицаЗагружаемыхРеквизитовШапки);
	СтруктураТаблиц.Вставить("ТаблицаДополнительныхПараметров", ТаблицаДополнительныхПараметров);
	СтруктураТаблиц.Вставить("СоответствиеНоменклатуры", СоответствиеНоменклатуры);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

// Формирует запись в регистре "История загрузки"
//
Процедура ДобавитьВЛог(ТекстСообщения, Статус, СтруктураПараметровЛогирования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкаЗагрузки    = СтруктураПараметровЛогирования.НастройкаЗагрузки;
	ДатаЗагрузки         = ТекущаяДата();
	ИмяЗагружаемогоФайла = СтруктураПараметровЛогирования.ИмяЗагружаемогоФайла;
	Объект               = СтруктураПараметровЛогирования.ОбъектДляЛогирования;
	ФоноваяЗагрузка      = СтруктураПараметровЛогирования.ФоноваяЗагрузка;
	Контрагент           = СтруктураПараметровЛогирования.Контрагент;
	Каталог              = СтруктураПараметровЛогирования.Каталог;
	ДатаНачалаЗагрузки   = СтруктураПараметровЛогирования.ДатаНачалаЗагрузки;
	
	Если Статус = 1 Тогда
		СтатусОшибки = Перечисления.ор_СтатусыОшибок.Ошибка;
		СтруктураПараметровЛогирования.ЕстьОшибки = Истина;
	ИначеЕсли Статус = 2 Тогда
		СтатусОшибки = Перечисления.ор_СтатусыОшибок.Замечание;
	Иначе
		СтатусОшибки = Перечисления.ор_СтатусыОшибок.Сообщение;
	КонецЕсли;
	
	СтруктураПараметровЛогирования.НумераторСообщений = СтруктураПараметровЛогирования.НумераторСообщений + 1;
	НумераторСообщений = СтруктураПараметровЛогирования.НумераторСообщений;
	
	МенеджерЗаписи = РегистрыСведений.ор_ИсторияЗагрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НастройкаЗагрузки    = НастройкаЗагрузки;
	МенеджерЗаписи.ДатаЗагрузки         = ДатаЗагрузки;
	МенеджерЗаписи.ИмяЗагружаемогоФайла = ИмяЗагружаемогоФайла;
	МенеджерЗаписи.СтатусОшибки         = СтатусОшибки;
	МенеджерЗаписи.Объект               = Объект;
	МенеджерЗаписи.ФоноваяЗагрузка      = ФоноваяЗагрузка;
	МенеджерЗаписи.Контрагент           = Контрагент;
	МенеджерЗаписи.Каталог              = Каталог;
	МенеджерЗаписи.ДатаНачалаЗагрузки   = ДатаНачалаЗагрузки;
	МенеджерЗаписи.НумераторСообщений   = НумераторСообщений;
	МенеджерЗаписи.Сообщение            = ТекстСообщения;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Процедура очищает содержимое табличного документа
//
Процедура ОчиститьТабличныйДокумент(ТабличныйДокумент) Экспорт
	ТабличныйДокумент.Очистить();
КонецПроцедуры

// Функция выполняет формирование нового документа по имени
//
Функция СформироватьДокументГрупповаяЗагрузка(ИмяДокумента) Экспорт
	
	ДокументОбъект = Документы[ИмяДокумента].СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Комментарий = НСтр("ru = 'Документ создан автоматически при загрузке из электронного документа'");
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	ДокументОбъект.ОбменДанными.Загрузка = Ложь;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

// Процедура выполняет удаление документа по переданной ссылке
//
Процедура УдалитьДокументПриАвтоматическойЗагрузке(СсылкаИсточника) Экспорт
	
	ДокументОбъект = СсылкаИсточника.ПолучитьОбъект();
	ДокументОбъект.Удалить();
	
КонецПроцедуры

// Процедура выполняет проведение документа по переданной ссылке
//
Процедура ПровестиДокументПриАвтоматическойЗагрузке(СсылкаИсточника, ДокументНеПроведен=Ложь) Экспорт
	
	ДокументОбъект = СсылкаИсточника.ПолучитьОбъект();
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("АвтоЗагрузкаДокумента");
	КонецЕсли;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// Если при проведении документ не был проведен, а был просто записан, тогда вернем соответствующий признак.
	Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) И НЕ ДокументОбъект.Проведен Тогда
		ДокументНеПроведен = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Функция выполняет проверку настройки загрузки данных и возвращает результат
//
Функция ВыполнитьПроверкуНастройки(Настройки, НастройкаЗагрузки, СтруктураПараметровОбщая, СтруктураПараметровЛогирования) Экспорт 
	
	СтруктураТаблиц = СформироватьСтруктуруТаблиц();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СсылкаИсточника",                                   СтруктураПараметровОбщая.СсылкаИсточника);
	СтруктураПараметров.Вставить("РежимЗагрузки",                                     СтруктураПараметровОбщая.РежимЗагрузки);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",                           СтруктураПараметровОбщая.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",                                   СтруктураПараметровОбщая.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",                                    СтруктураПараметровОбщая.ИмяСправочника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьДокументаОбъекта",                    Неопределено);
	СтруктураПараметров.Вставить("ТЧДокумента",                                       ?(ЗначениеЗаполнено(СтруктураПараметровОбщая.ТабличнаяЧастьИсточника), СтруктураПараметровОбщая.СсылкаИсточника[СтруктураПараметровОбщая.ТабличнаяЧастьИсточника].Выгрузить(), Неопределено));
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов",                         Ложь);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",                   Ложь);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи",                        Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",         Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",             0);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",                   0);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",                           "");
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",                       Ложь);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",                      Ложь);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",                             Ложь);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом",                        0);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",                         Ложь);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов",                    "");
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",                            Ложь);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",      Ложь);
	СтруктураПараметров.Вставить("ОбработкаПреобразования",                           Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	СтруктураПараметров.Вставить("Кодировка",                                         "");
	СтруктураПараметров.Вставить("Табуляция",                                         "");
	СтруктураПараметров.Вставить("ИмяТаблицы",                                        "");
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",                               "");
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",                                  "");
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",                             "");
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов",                      СтруктураТаблиц.ТаблицаЗагружаемыхРеквизитов);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",         Новый СписокЗначений);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",         Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",       Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           0);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 СтруктураТаблиц.ТаблицаЗагружаемыхРеквизитовШапки);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметрыАвтозагрузка(СтруктураПараметров, СтруктураТаблиц);
	
	ЗаполнитьНастройкиКолонок(Настройки, СтруктураПараметров,,СтруктураПараметровЛогирования);
	
	// Проверка наличия ошибок при заполнении настроек.
	Если СтруктураПараметровЛогирования.ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка настройки загрузки.
	ОтборСтрок = Новый Структура("Пометка", Истина);
	СтрокиТаблицы = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
	Если СтрокиТаблицы.Количество() = 0 Тогда
		ДобавитьВЛог("В настройке загрузки <"+НастройкаЗагрузки+"> не отмечен ни один загружаемый реквизит", 1, СтруктураПараметровЛогирования);
		Возврат Ложь;
	КонецЕсли;
	
	Если СтруктураПараметров.ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(СтруктураПараметров.ОбработкаПреобразования) Тогда 
		ДобавитьВЛог("В настройке загрузки указано, что файл преобразовывается в табличный документ внешней обработкой, но обработка не указана!", 1, СтруктураПараметровЛогирования);
		Возврат Ложь;
	КонецЕсли;
	
	// Добавим в общую структуру параметров данные, необходимые для выполнения проверок на клиенте.
	СтруктураПараметровОбщая.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", СтруктураПараметров.ИспользоватьВнешнийМодульПреобразованияФайла);
	СтруктураПараметровОбщая.Вставить("ОбработкаПреобразования",                      СтруктураПараметров.ОбработкаПреобразования);
	СтруктураПараметровОбщая.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",        СтруктураПараметров.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметровОбщая.Вставить("Табуляция",                                    СтруктураПараметров.Табуляция);
	СтруктураПараметровОбщая.Вставить("Кодировка",                                    СтруктураПараметров.Кодировка);
	
	Возврат Истина;
	
КонецФункции

// Процедура выполняет загрузку данных из табличного документа
//
Процедура ВыполнитьЗагрузкуИзТабличногоДокумента(ТабличныйДокумент, Настройки, НастройкаЗагрузки, СтруктураПараметровОбщая, СтруктураПараметровЛогирования) Экспорт 
	
	СтруктураТаблиц = СформироватьСтруктуруТаблиц();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СсылкаИсточника",                                   СтруктураПараметровОбщая.СсылкаИсточника);
	СтруктураПараметров.Вставить("РежимЗагрузки",                                     СтруктураПараметровОбщая.РежимЗагрузки);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",                           СтруктураПараметровОбщая.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",                                   СтруктураПараметровОбщая.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",                                    СтруктураПараметровОбщая.ИмяСправочника);
	СтруктураПараметров.Вставить("Поставщик",                                         СтруктураПараметровОбщая.Поставщик);
	СтруктураПараметров.Вставить("ТабличнаяЧастьДокументаОбъекта",                    Неопределено);
	СтруктураПараметров.Вставить("ТЧДокумента",                                       ?(ЗначениеЗаполнено(СтруктураПараметровОбщая.ТабличнаяЧастьИсточника), СтруктураПараметровОбщая.СсылкаИсточника[СтруктураПараметровОбщая.ТабличнаяЧастьИсточника].Выгрузить(), Неопределено));
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов",                         Ложь);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",                   Ложь);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи",                        Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",         Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",             0);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",                   0);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",                           "");
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",                       Ложь);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",                      Ложь);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",                             Ложь);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом",                        0);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",                         Ложь);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов",                    "");
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",                            Ложь);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",      Ложь);
	СтруктураПараметров.Вставить("ОбработкаПреобразования",                           Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	СтруктураПараметров.Вставить("Кодировка",                                         "");
	СтруктураПараметров.Вставить("Табуляция",                                         "");
	СтруктураПараметров.Вставить("ИмяТаблицы",                                        "");
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",                               "");
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",                                  "");
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",                             "");
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов",                      СтруктураТаблиц.ТаблицаЗагружаемыхРеквизитов);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",         Новый СписокЗначений);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",         Ложь);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",       Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Ложь);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           0);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 СтруктураТаблиц.ТаблицаЗагружаемыхРеквизитовШапки);
	СтруктураПараметров.Вставить("флКонтрольЗаполнения",                              Ложь);
	СтруктураПараметров.Вставить("ОписаниеОшибок",                                    "");
	СтруктураПараметров.Вставить("ДопПараметры",                                      Новый Структура());
	СтруктураПараметров.Вставить("ВладелецСерии",                                     Неопределено);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры",                          СтруктураТаблиц.СоответствиеНоменклатуры);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметрыАвтозагрузка(СтруктураПараметров, СтруктураТаблиц);
	
	ЗаполнитьНастройкиКолонок(Настройки, СтруктураПараметров,,СтруктураПараметровЛогирования);
	
	ЗагрузитьДанные(ТабличныйДокумент,СтруктураПараметров,,СтруктураПараметровЛогирования);
	
КонецПроцедуры

// Процедура выполняет чтение табличного документа формата MXL
//
Процедура ПрочитатьТабличныйДокументИзMXL(ТабличныйДокумент, АдресВоВременномХранилище, СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUA.mxl";
	ДанныеФайла.Записать(ВременныйФайл);
	
	Попытка
		ТабличныйДокумент.Прочитать(ВременныйФайл);
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка открытия файла!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Ошибка открытия файла!'"), 1, СтруктураПараметровЛогирования);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

Функция ПрочитатьДанныеВТабличныйДокумент(ТабличныйДокумент, АдресВоВременномХранилище, ПереданноеРасширение = ".xls", СтруктураПараметровЛогирования = Неопределено) Экспорт
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUA"+ПереданноеРасширение;
	ДанныеФайла.Записать(ВременныйФайл);
	ИмяФайла = ВременныйФайл;
	
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Файл не существует!'"));
		Иначе
			ДобавитьВЛог(НСтр("ru= 'Файл не существует!'"),1,СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		ТабличныйДокумент.Прочитать(ИмяФайла);
		
	Исключение
		Если СтруктураПараметровЛогирования = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Иначе
			ДобавитьВЛог(ОписаниеОшибки(),1,СтруктураПараметровЛогирования);
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

Функция ПерезаполнитьДанныеВТабличномДокументе (ТабличныйДокумент, НачалоСтраницы, КонецСтраницы) Экспорт
	
	ВыводимаяОбласть = "R"+НачалоСтраницы+":R"+КонецСтраницы;
	ВременныйТабДок = ТабличныйДокумент.ПолучитьОбласть(ВыводимаяОбласть);
	
	Возврат ВременныйТабДок;
	
КонецФункции

// Процедура проверяет загружаемые реквизиты объектов метаданных на соответствие
// текущим реквизитам объекта метаданных дерева конфигурации.
// Для переданных параметров реквизита в СтруктураЗагружаемогоРеквизита производится замена старых параметров
// на актуальные.
// Для реквизитов какого объекта метаданных необходимо производит замену, указывается в условии проверки и,
// Соответственно, версии ВерсияОбъектовМетаданных.
Процедура ПроверитьЗагружаемыйРеквизит(СтруктураЗагружаемогоРеквизита, МетаданныеИсточникаИмя, ВерсияОбъектовМетаданных, ТекстСообщения = "") Экспорт
	
	Макет = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетСохраненияНастроек");
	ТекущаяВерсияОбъектовМетаданных = Макет.Область("R31C5").Текст;
	
	Если ТекущаяВерсияОбъектовМетаданных = ВерсияОбъектовМетаданных Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает по переданному строковому значению МетаданныеИсточникаИмя актуальный объект метаданных.
// Для выполнения замены несуществующего метаданного на актуальное необходимо в функцию передать полученное
// из настроек загрузки (Табличный документ) текстовое значение имени метаданных:
// МетаданныеОбъектаИмя = Настройки.Область(?(ВерсияОбработки = "1.1","R2","R3") + "C5").Текст.
// Соответственно в функции, для переданного имени и при условии ВерсияОбъектовМетаданных меньше актуальной
// Произвести присвоение для МетаданныеИсточника нового объекта метаданных
Функция ПреобразоватьЗагружаемоеМетаданное(МетаданныеИсточникаИмя, ВерсияОбъектовМетаданных, ТекстСообщения = "") Экспорт
	
	МетаданныеИсточника = Неопределено;
	
	Если ВерсияОбъектовМетаданных < "1.0" Тогда
		Если МетаданныеИсточникаИмя = "Документ.ТоварноТранспортнаяНакладнаяЕГАИС.ТабличнаяЧасть.Товары" Тогда
			МетаданныеИсточника = Метаданные.Документы.ТТНВходящаяЕГАИС.ТабличныеЧасти.Товары;
			Текст = "В настройках загрузки изменен объект метаданных " + МетаданныеИсточникаИмя + " на " + "" + МетаданныеИсточника.Родитель() + "";
			ТекстСообщения = ?(ТекстСообщения = "", Текст, ТекстСообщения + Символы.ПС + Текст);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МетаданныеИсточника;
	
КонецФункции

// Процедура выполняет групповую обработку настроек загрузки
//
Процедура ВыполнитьГрупповуюОбработкуНастроекЗагрузки(МассивНастроек, ТекстСообщения) Экспорт
	Для Каждого НастройкаСсылка ИЗ МассивНастроек Цикл
		НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
		Настройка = НастройкаОбъект.НастройкиЗагрузкиВыгрузки.Получить();
		Если ТипЗнч(Настройка) <> Тип("ТабличныйДокумент") Тогда
			ТекстСообщения = "Для " + НастройкаСсылка + " указан неверный формат настроек Загрузки/Выгрузки!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		// Получим текущую версию обработки и версию объектов метаданных.
		Макет = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетСохраненияНастроек");
		ТекущаяВерсияОбработки = Макет.Область("R1C5").Текст;
		ТекущаяВерсияОбъектовМетаданных = Макет.Область("R31C5").Текст;
		
		// Получим версию обработки и версию объектов метаданных настройки.
		ВерсияОбработки = СокрЛП(Настройка.Область("R1C5").Текст);
		ВерсияОбъектовМетаданных = СокрЛП(Настройка.Область("R31C5").Текст);
		Если ВерсияОбработки = ТекущаяВерсияОбработки И ВерсияОбъектовМетаданных = ТекущаяВерсияОбъектовМетаданных Тогда
			// Проверять настройку не нужно, она актуальна.
			Продолжить;
		КонецЕсли;
		
		МетаданныеИсточникаИмя = Настройка.Область("R3C5").Текст;
		МетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(МетаданныеИсточникаИмя);
		
		ТекстСообщения = ?(ТекстСообщения = "", "" + НастройкаСсылка + " :", ТекстСообщения + Символы.ПС + "" + НастройкаСсылка + ":");
		
		Если МетаданныеИсточника = Неопределено Тогда
			МетаданныеИсточника = ПреобразоватьЗагружаемоеМетаданное(МетаданныеИсточникаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
			Если МетаданныеИсточника = Неопределено Тогда
				ВызватьИсключение "Неправильный формат файла";
			КонецЕсли;
		КонецЕсли;
		
		СтруктураНастройки = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьПараметрыПоВерсииОбработки(ВерсияОбработки, Настройка);
		
		СтруктураНастройки.Вставить("МетаданныеИсточникаИзСправочника", МетаданныеИсточника);
		Если Метаданные.Справочники.Содержит(МетаданныеИсточника) Тогда
			РежимЗагрузки = 0;
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
			РежимЗагрузки = 2;
		Иначе
			РежимЗагрузки = 1;
		КонецЕсли;
		
		ТаблицаЗагружаемыхРеквизитов = Новый ТаблицаЗначений;
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("Пометка");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ПредставлениеРеквизита");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ИмяРеквизита");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("МожетБытьПолемПоиска");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ПолеПоиска");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ДоступноеОписаниеТипов");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ОписаниеТипов");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("РежимЗагрузки");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("НомерКолонки");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЗначениеПоУмолчанию");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("Выражение");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ИскатьПо");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("СвязьПоВладельцу");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("СвязьПоТипу");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЭлементСвязиПоТипу");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ШиринаКолонки");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("РежимПоиска");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("НастройкаЗагрузки");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ПодсвечиватьСтроку");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЭтоДополнительныйРеквизит");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("СсылкаРеквизита");
		ТаблицаЗагружаемыхРеквизитов.Колонки.Добавить("ЭтоСведение");
		
		ТаблицаЗагружаемыхРеквизитовШапки = Новый ТаблицаЗначений;
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("Пометка");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ПредставлениеРеквизита");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ИмяРеквизита");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("МожетБытьПолемПоиска");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ПолеПоиска");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ДоступноеОписаниеТипов");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ОписаниеТипов");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("РежимЗагрузки");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("НомерКолонки");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ЗначениеПоУмолчанию");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("Выражение");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ИскатьПо");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("СвязьПоВладельцу");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("СвязьПоТипу");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ЭлементСвязиПоТипу");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ШиринаКолонки");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("РежимПоиска");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("НастройкаЗагрузки");
		ТаблицаЗагружаемыхРеквизитовШапки.Колонки.Добавить("ПодсвечиватьСтроку");
		
		ТаблицаДополнительныхПараметров = Новый ТаблицаЗначений;
		ТаблицаДополнительныхПараметров.Колонки.Добавить("ИмяРеквизита");
		ТаблицаДополнительныхПараметров.Колонки.Добавить("НомерКолонки");
		ТаблицаДополнительныхПараметров.Колонки.Добавить("РежимЗагрузки");
		ТаблицаДополнительныхПараметров.Колонки.Добавить("Выражение");
		
		ДополнительныеРеквизитыПоКатегорииНоменклатуры = Новый СписокЗначений;
		
		СтруктураНастройки.Вставить("РежимЗагрузки", РежимЗагрузки);
		
		// Добавляем "пустые" свойства, заполним их позднее.
		СтруктураНастройки.Вставить("ТаблицаЗагружаемыхРеквизитов", ТаблицаЗагружаемыхРеквизитов);
		СтруктураНастройки.Вставить("ТаблицаЗагружаемыхРеквизитовШапки", ТаблицаЗагружаемыхРеквизитовШапки);
		СтруктураНастройки.Вставить("ТаблицаДополнительныхПараметров", ТаблицаДополнительныхПараметров);
		СтруктураНастройки.Вставить("ПередЗаписьюОбъекта", "");
		СтруктураНастройки.Вставить("ПриЗаписиОбъекта", "");
		СтруктураНастройки.Вставить("ПослеДобавленияСтроки", "");
		
		Если СтруктураНастройки.Свойство("ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек") И СтруктураНастройки.ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек <> Неопределено Тогда
			СтруктураНастройки.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры", СтруктураНастройки.ДополнительныеРеквизитыПоКатегорииНоменклатурыИзНастроек);
		Иначе
			СтруктураНастройки.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры", ДополнительныеРеквизитыПоКатегорииНоменклатуры);
		КонецЕсли;
		
		Если НЕ СтруктураНастройки.Свойство("КоличествоНеОбрабатываемыхСтрок") Тогда
			СтруктураНастройки.Вставить("КоличествоНеОбрабатываемыхСтрок", 0);
		КонецЕсли;
		
		ПолучитьСтруктуруРеквизитовШапкиИТабличнойЧасти(Настройка, СтруктураНастройки, ТекстСообщения);
		
		СтруктураУмолчаний = СтруктураНастройки.СтруктураУмолчаний;
		
		Для Каждого Структура Из СтруктураУмолчаний Цикл
			СтрокаТаблицы = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Структура.Значение);
		КонецЦикла;
		
		СтруктураУмолчанийШапки = СтруктураНастройки.СтруктураУмолчанийШапки;
		
		Для Каждого Структура Из СтруктураУмолчанийШапки Цикл
			СтрокаТаблицы = ТаблицаЗагружаемыхРеквизитовШапки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Структура.Значение);
		КонецЦикла;
		
		НоваяНастройка = ПолучитьНастройки(СтруктураНастройки);
		
		НастройкаОбъект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(НоваяНастройка);
		
		Попытка
			НастройкаОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаОбъект.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

// Процедура выполняет проверку полученных реквизитов из настройки: есть ли они в метаданных объекта.
//
Процедура ВыполнитьПроверкуПолученныхРеквизитовИзНастройки(Метаданное, СтруктураРеквизитов, СтруктураРеквизитовШапки, ТекстСообщения) Экспорт
	
	Если Метаданные.РегистрыСведений.Найти(Метаданное.Имя) <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Метаданное, "Измерения") Тогда
		
		ИзмеренияРегистра = Метаданное.Измерения;
		РесурсыРегистра = Метаданное.Ресурсы;
		РеквизитыРегистра = Метаданное.Реквизиты;
		СтандартныеРеквизитыРегистра = Метаданное.СтандартныеРеквизиты;
		
		Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
			НайденноеЗначение = ИзмеренияРегистра.Найти(КлючИЗначение.Ключ);
			Если НайденноеЗначение = Неопределено Тогда
				НайденноеЗначение = РесурсыРегистра.Найти(КлючИЗначение.Ключ);
				Если НайденноеЗначение = Неопределено Тогда
					НайденноеЗначение = РеквизитыРегистра.Найти(КлючИЗначение.Ключ);
					Если НайденноеЗначение = Неопределено Тогда
						Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыРегистра Цикл
							Если СтандартныйРеквизит.Имя = КлючИЗначение.Ключ Тогда
								НайденныйРеквизит = СтандартныйРеквизит;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если НайденноеЗначение = Неопределено Тогда
							Текст = "Были удалены настройки отсутствующего реквизита " + КлючИЗначение.Ключ + "";
							ТекстСообщения = ?(ТекстСообщения = "", Текст, ТекстСообщения + Символы.ПС + Текст);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СтандартныеРеквизитыМетаданного = Метаданное.СтандартныеРеквизиты;
		РеквизитыМетаданного = Метаданное.Реквизиты;
		
		Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
			НайденныйРеквизит = РеквизитыМетаданного.Найти(КлючИЗначение.Ключ);
			Если НайденныйРеквизит = Неопределено Тогда
				Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыМетаданного Цикл
					Если СтандартныйРеквизит.Имя = КлючИЗначение.Ключ Тогда
						НайденныйРеквизит = СтандартныйРеквизит;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НайденныйРеквизит = Неопределено Тогда
					Текст = "Были удалены настройки отсутствующего реквизита " + КлючИЗначение.Ключ + "";
					ТекстСообщения = ?(ТекстСообщения = "", Текст, ТекстСообщения + Символы.ПС + Текст);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если СтруктураРеквизитовШапки.Количество() <> 0 Тогда
			МетаданноеРодитель = Метаданное.Родитель();
			СтандартныеРеквизитыМетаданногоРодителя = МетаданноеРодитель.СтандартныеРеквизиты;
			РеквизитыМетаданногоРодителя = МетаданноеРодитель.Реквизиты;
			Для Каждого КлючИЗначение Из СтруктураРеквизитовШапки Цикл
				НайденныйРеквизит = РеквизитыМетаданногоРодителя.Найти(КлючИЗначение.Ключ);
				Если НайденныйРеквизит = Неопределено Тогда
					Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыМетаданногоРодителя Цикл
						Если СтандартныйРеквизит.Имя = КлючИЗначение.Ключ Тогда
							НайденныйРеквизит = СтандартныйРеквизит;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НайденныйРеквизит = Неопределено Тогда
						Текст = "Были удалены настройки отсутствующего реквизита " + КлючИЗначение.Ключ + "";
						ТекстСообщения = ?(ТекстСообщения = "", Текст, ТекстСообщения + Символы.ПС + Текст);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКодировкуXBase(XBase, ТипКодировки) Экспорт
	
	Если ТипКодировки = "OEM" Тогда
		XBase.Кодировка = КодировкаXBase.OEM;
	ИначеЕсли ТипКодировки = "ANSI" Тогда
		XBase.Кодировка = КодировкаXBase.ANSI;
	КонецЕсли;
	
КонецПроцедуры

// Функция приводит строковое представление даты к его значению
//
// Параметры:
//  Представление - Строка			- Представление числа
//  ОписаниеТипов - ОписаниеТипов	- Допустимое описание типов значения типа дата
//  Примечание    - Строка			- Примечание (необязательный).
//
// Возвращаемое значение:
//  Дата 		- Значение типа дата
//
Функция ПривестиКДате(Представление, ТипРеквизита, Примечание = "") Экспорт
	
	Результат = ТипРеквизита.ПривестиЗначение(Представление);
	Если Результат = '00010101' Тогда
		
		МассивЧастей = ПолучитьЧастиПредставленияДаты(Представление);
		Если ТипРеквизита.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
			
			Попытка
				
				Если МассивЧастей.Количество() = 3 Тогда
					Результат = Дата(1,1,1, МассивЧастей[0],МассивЧастей[1],МассивЧастей[2]);
				ИначеЕсли МассивЧастей.Количество() = 6 Тогда
					Результат = Дата(1,1,1, МассивЧастей[3],МассивЧастей[4],МассивЧастей[5]);
				КонецЕсли;
				
			Исключение
				Примечание = НСтр("ru = 'Неправильный формат даты'");
			КонецПопытки;
			
		ИначеЕсли МассивЧастей.Количество() = 3 ИЛИ МассивЧастей.Количество() = 6 Тогда
			
			Если МассивЧастей[0] >= 1000 Тогда
				Временно = МассивЧастей[0];
				МассивЧастей[0] = МассивЧастей[2];
				МассивЧастей[2] = Временно;
			КонецЕсли;
			
			Если МассивЧастей[2] < 100 Тогда
				МассивЧастей[2] = МассивЧастей[2] + ?(МассивЧастей[2] < 30, 2000,1900);
			КонецЕсли;
			
			Попытка
				Если МассивЧастей.Количество() = 3 ИЛИ ТипРеквизита.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					Результат = Дата(МассивЧастей[2],МассивЧастей[1],МассивЧастей[0]);
				Иначе
					Результат = Дата(МассивЧастей[2],МассивЧастей[1],МассивЧастей[0],МассивЧастей[3],МассивЧастей[4],МассивЧастей[5]);
				КонецЕсли;
			Исключение
				Примечание = НСтр("ru = 'Неправильный формат даты'");
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //мПривестиКДате()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Для преобразования имени файла при обращении к OpenOffice/LibreOffice
Функция ConvertToURL(FileName)
	ИмяФайла =  СтрЗаменить(FileName," ","%20" );
	ИмяФайла =  СтрЗаменить(ИмяФайла,"\","/");
	Возврат "file:/" + "/localhost/" + ИмяФайла;
КонецФункции

// Получает информацию по заданному штрихкоду
//
// Параметры:
//  Штрихкод         - Строка			- значение штрих-кода
//
// Возвращаемое значение:
//  Таблица		- Таблица найденных товаров
//
Функция ПолучитьШтрихкоды(Штрихкод)
	
	// Создадим запрос по регистру сведений.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШК",Штрихкод);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Штрихкоды.Номенклатура КАК Объект,
	|	Штрихкоды.Характеристика КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &ШК
	|	И Штрихкоды.Номенклатура.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
КонецФункции // ПолучитьШтрихкодыШтрихкоды()

// Функция возвращает части представления даты
//
// Параметры:
//  Представление - Строка	- Представление даты
//
// Возвращаемое значение:
//  Массив	- Массив частей даты
//
Функция ПолучитьЧастиПредставленияДаты(ЗНАЧ Представление)
	
	МассивЧастей = Новый Массив;
	НачалоЦифры = 0;
	Для к = 1 По СтрДлина(Представление) Цикл
		
		Символ = Сред(Представление, к ,1);
		ЭтоЦифра = Символ >= "0" И Символ <= "9";
		
		Если ЭтоЦифра Тогда
			
			Если НачалоЦифры = 0 Тогда
				НачалоЦифры = к;
			КонецЕсли;
			
		Иначе
			
			Если НЕ НачалоЦифры = 0 Тогда
				МассивЧастей.Добавить(Число(Сред(Представление,НачалоЦифры, к - НачалоЦифры)));
			КонецЕсли;
			
			НачалоЦифры = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ НачалоЦифры = 0 Тогда
		МассивЧастей.Добавить(Число(Сред(Представление,НачалоЦифры)));
	КонецЕсли;
	
	Возврат МассивЧастей;
	
КонецФункции //ПолучитьЧастиПредставленияДаты()

// Заполняет настройки колонок по умолчанию для справочника
//
Процедура ЗаполнитьНастройкиКолонокСправочника(СтруктураПараметров)
	
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(Тип("Булево"));
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	
	Если МетаданныеИсточника.ДлинаКода > 0 Тогда
		
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Код";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Код";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		Если МетаданныеИсточника.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаКода));
		Иначе
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(МетаданныеИсточника.ДлинаКода));
		КонецЕсли;
		
	КонецЕсли;
	
	Если МетаданныеИсточника.ДлинаНаименования > 0 Тогда
		
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Наименование";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаНаименования));
		
	КонецЕсли;
	
	ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита           = "ПометкаУдаления";
	ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Пометка удаления";
	ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
	ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(МассивБулево);
	
	Если МетаданныеИсточника.Владельцы.Количество() > 0 Тогда
		
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Владелец";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Владелец";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		СтрокаОписанияТипов = "";
			
		Для Каждого ТекВладелец Из МетаданныеИсточника.Владельцы Цикл
			СтрокаОписанияТипов = ?(ПустаяСтрока(СтрокаОписанияТипов),"",СтрокаОписанияТипов + ", ") + ТекВладелец.ПолноеИмя();
		КонецЦикла;
			
		СтрокаОписанияТипов = СтрЗаменить(СтрокаОписанияТипов,".","Ссылка.");
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(СтрокаОписанияТипов);
		
	КонецЕсли;
	
	Если МетаданныеИсточника.Иерархический Тогда
		
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Родитель";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Родитель";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(СтрЗаменить(МетаданныеИсточника.ПолноеИмя(),".","Ссылка."));
		
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "ЭтоГруппа";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Это группа";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(МассивБулево);
	КонецЕсли;
	
	ЕстьОтраслевойПроизводитель = Ложь;
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		Если Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
			Продолжить;
		КонецЕсли;
		Если НРег(Реквизит.Имя) = НРег("ор_Производитель") Тогда
			ЕстьОтраслевойПроизводитель = Истина;
		КонецЕсли;
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = НЕ Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	// ++ Аптека
	Если ЕстьОтраслевойПроизводитель Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИмяРеквизита", "Производитель");
		МассивСтрок = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
			СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Удалить(ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	// -- Аптека
	
	ДополнитьДополнительныеРеквизитыВТаблицуРеквизитов(МетаданныеИсточника, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов, СтруктураПараметров.ДополнительныеРеквизитыПоКатегорииНоменклатуры, СтруктураПараметров.ЗагружатьДополнительныеРеквизитыИСведения, СтруктураПараметров.ДополнительныеРеквизитыИСведенияТолькоОбщие);

	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
		ЗагружаемыйРеквизит.ОписаниеТипов = ЗагружаемыйРеквизит.ДоступноеОписаниеТипов;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
				
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
				
			Иначе
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
	КонецЦикла;
	
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокСправочника()

// Заполняет настройки колонок по умолчанию для регистра сведений
//
Процедура ЗаполнитьНастройкиКолонокРегистраСведений(СтруктураПараметров)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ МетаданныеИсточника.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		
		ЗагружаемыйРеквизит = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Период";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Период";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска = Истина;
		ЗагружаемыйРеквизит.ПолеПоиска           = Истина;
		
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Дата", , , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Измерения Цикл
		ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска = Истина;
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Измерения[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Ресурсы Цикл
		ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Ресурсы[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
		ЗагружаемыйРеквизит.ОписаниеТипов = ЗагружаемыйРеквизит.ДоступноеОписаниеТипов;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
				
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
				
			Иначе
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
		ЗагружаемыйРеквизит.РежимПоиска = "По равному значению";
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокРегистраСведений()

// Заполняет настройки колонок по умолчанию для табличной части
//
Процедура ЗаполнитьНастройкиКолонокТабличнойЧасти(СтруктураПараметров)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		Для Каждого Реквизит Из МетаданныеИсточника.Измерения Цикл
			ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
		КонецЦикла;
		Для Каждого Реквизит Из МетаданныеИсточника.Ресурсы Цикл
			ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
		ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
			Иначе
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
			КонецЕсли;
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
		ЗагружаемыйРеквизит.РежимПоиска = "По равному значению";
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокТабличнойЧасти()

// Функция проверки наличия реквизита в переданной табличной части.
//
Функция ЕстьРеквизитТЧОбъекта(ИмяРеквизита, МетаданныеОбъекта, ИмяТЧ)

	ТЧ = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТЧ);
	Если ТЧ = Неопределено Тогда 
		Возврат Ложь;
	Иначе
		Если ТЧ.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

КонецФункции 

// Заполняет настройки шапки по умолчанию
//
Процедура ЗаполнитьНастройкиШапки(СтруктураПараметров)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(СтруктураПараметров);
	
	Если НЕ Метаданные.Документы.Содержит(МетаданныеИсточника.Родитель()) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеРодителя = МетаданныеИсточника.Родитель();
	Для Каждого Реквизит Из МетаданныеРодителя.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
		ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки Цикл
		
		СписокВыбора = ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
			ИначеЕсли Найти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
			Иначе
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
			КонецЕсли;
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
		ЗагружаемыйРеквизит.РежимПоиска = "По равному значению";
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиШапки()

// Процедура получает структуру реквизитов шапки и табличной части из переданной настройки(табличного документа).
//
Процедура ПолучитьСтруктуруРеквизитовШапкиИТабличнойЧасти(Настройки, СтруктураПараметров, ТекстСообщения)
	
	СтруктураПараметров.ПередЗаписьюОбъекта   = "";
	СтруктураПараметров.ПриЗаписиОбъекта      = "";
	СтруктураПараметров.ПослеДобавленияСтроки = "";
	
	Если ТипЗнч(Настройки) = Тип("ТабличныйДокумент") Тогда
		
		ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст);
		
		ТекущаяСтрока = СтруктураПараметров.ТекущаяСтрока;
		ТекущаяСтрокаШапка = СтруктураПараметров.ТекущаяСтрокаШапка;
		
		Попытка
			
			ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область("R2C5").Текст);
			Если ТекстВосстановленногоРежимаЗагрузки = "в справочник" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "" Тогда
				ВосстановленныйРежимЗагрузки = 0;
			ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" ИЛИ ТекстВосстановленногоРежимаЗагрузки = "Х" Тогда
				Если ТекстВосстановленногоРежимаЗагрузки = "в табличную часть" Тогда
					ТекстОбъекта = СокрЛП(Настройки.Область("R3C5").Текст);
					Если Лев(ТекстОбъекта, 16) = "РегистрСведений." Тогда
						ВосстановленныйРежимЗагрузки = 2;
					Иначе
						ВосстановленныйРежимЗагрузки = 1;
					КонецЕсли;
				Иначе
					ВосстановленныйРежимЗагрузки = 1;
				КонецЕсли;
			ИначеЕсли ТекстВосстановленногоРежимаЗагрузки = "в регистр сведений" Тогда
				ВосстановленныйРежимЗагрузки = 2;
			КонецЕсли;
			
			Если СтруктураПараметров.РежимЗагрузки = 3 Тогда
				Если ВосстановленныйРежимЗагрузки = 1 ИЛИ ВосстановленныйРежимЗагрузки = 2 Тогда
					ВосстановленныйРежимЗагрузки = 3;
				ИначеЕсли ВосстановленныйРежимЗагрузки = 0 Тогда
				Иначе
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			ВерсияОбъектовМетаданных = СокрЛП(Настройки.Область("R31C5").Текст);
			
			МетаданныеОбъектаИмя = Настройки.Область("R3C5").Текст;
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(МетаданныеОбъектаИмя);
			
			Если МетаданныеОбъекта = Неопределено Тогда
				Если СтруктураПараметров.Свойство("МетаданныеИсточникаИзСправочника") И СтруктураПараметров.МетаданныеИсточникаИзСправочника <> Неопределено Тогда
					МетаданныеОбъекта = СтруктураПараметров.МетаданныеИсточникаИзСправочника;
				Иначе
					МетаданныеОбъекта = ПреобразоватьЗагружаемоеМетаданное(МетаданныеОбъектаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
					Если МетаданныеОбъекта = Неопределено Тогда
						ВызватьИсключение "Неправильный формат файла";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СтруктураУмолчаний = Новый Структура;
			ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
			Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
				СтруктураУмолчанияРеквизита = Новый Структура;
				СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
				СтруктураУмолчанияРеквизита.Вставить("Пометка",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
				СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
				
				Типы = Новый Массив;
				ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст;
				
				Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
					
					кс = Неопределено;кч = Неопределено;кд = Неопределено;
					МассивЧастейТипа = РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
					Если МассивЧастейТипа.Количество() = 0 Тогда
						Продолжить;
					ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
						Тип = ?(Метаданные.НайтиПоПолномуИмени(МассивЧастейТипа[0]) <> Неопределено, Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка.")), Неопределено);
						Если Тип = Неопределено Тогда
							Продолжить;
						КонецЕсли;
					ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
						Тип = Тип("Строка");
						Если МассивЧастейТипа.Количество() = 2 Тогда
							кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
						ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
							кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
						Иначе
							кс = Новый КвалификаторыСтроки;
						КонецЕсли;
					ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
						Тип = Тип("Число");
						кч = Новый КвалификаторыЧисла(ПривестиКЧислу(МассивЧастейТипа[1]),ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
					ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
						Тип = Тип("Булево");
					ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.Дата);
					ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
					ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
						Тип = Тип("Дата");
						кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
					Иначе
						Продолжить;
					КонецЕсли;
					Типы.Добавить(Тип);
				КонецЦикла;
				
				ОписаниеТипов = Новый ОписаниеТипов(Типы, кч, кс, кд);
				СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
				
				РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст;
				
				СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
				СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст);
				ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст;
				СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
				НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбласти + "C13").Текст;
				СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
				ЭтоДополнительныйРеквизит = ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C14").Текст);
				ЭтоСведение = ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C16").Текст);
				СсылкаРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C15").Текст;
				СтруктураУмолчанияРеквизита.Вставить("СсылкаРеквизита",?(ПустаяСтрока(СсылкаРеквизита), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(СсылкаРеквизита)));
				СтруктураУмолчанияРеквизита.Вставить("ЭтоДополнительныйРеквизит",ЭтоДополнительныйРеквизит);
				СтруктураУмолчанияРеквизита.Вставить("ЭтоСведение",ЭтоСведение);
				
				Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
					СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
				Иначе
					СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
					
					СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбласти + "C9").Текст;
					СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
					
					СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбласти + "C10").Текст;
					СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
					
					СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбласти + "C11").Текст));
				КонецЕсли;
				
				СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст), "По равному значению", Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст));
				
				// проверим загруженный реквизит
				ПроверитьЗагружаемыйРеквизит(СтруктураУмолчанияРеквизита, МетаданныеОбъектаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
				// Имя реквизита могло измениться
				ИмяРеквизита = СтруктураУмолчанияРеквизита.ИмяРеквизита;
				СтруктураУмолчаний.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
				
				ТекущаяСтрока = ТекущаяСтрока + 1;
				ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
				ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
				
			КонецЦикла;
			
			СтруктураУмолчанийШапки = Новый Структура;
			Если ТекущаяСтрокаШапка <> 0 Тогда
				ТекущаяСтрокаШапка = ТекущаяСтрока+5;
				ТекущаяСтрокаОбластиШапкиДокумента = "R" + Формат(ТекущаяСтрокаШапка, "ЧГ=");
				ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C2").Текст;
				Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
					СтруктураУмолчанияРеквизита = Новый Структура;
					СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
					СтруктураУмолчанияРеквизита.Вставить("Пометка",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C1").Текст));
					СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C3").Текст));
					
					Типы = Новый Массив;
					ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C4").Текст;
					
					Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
						
						кс = Неопределено;кч = Неопределено;кд = Неопределено;
						МассивЧастейТипа = РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
						Если МассивЧастейТипа.Количество() = 0 Тогда
							Продолжить;
						ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
							Тип = ?(Метаданные.НайтиПоПолномуИмени(МассивЧастейТипа[0]) <> Неопределено, Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка.")), Неопределено);
							Если Тип = Неопределено Тогда
								Продолжить;
							КонецЕсли;
						ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
							Тип = Тип("Строка");
							Если МассивЧастейТипа.Количество() = 2 Тогда
								кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
							ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
								кс = Новый КвалификаторыСтроки(ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
							Иначе
								кс = Новый КвалификаторыСтроки;
							КонецЕсли;
						ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
							Тип = Тип("Число");
							кч = Новый КвалификаторыЧисла(ПривестиКЧислу(МассивЧастейТипа[1]),ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
						ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
							Тип = Тип("Булево");
						ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
							Тип = Тип("Дата");
							кд = Новый КвалификаторыДаты(ЧастиДаты.Дата);
						ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
							Тип = Тип("Дата");
							кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
						ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
							Тип = Тип("Дата");
							кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
						Иначе
							Продолжить;
						КонецЕсли;
						Типы.Добавить(Тип);
					КонецЦикла;
					
					ОписаниеТипов = Новый ОписаниеТипов(Типы, кч, кс, кд);
					СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
					
					РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C5").Текст;
					
					СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
					СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C6").Текст);
					ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C7").Текст;
					СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
					НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C13").Текст;
					СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
					
					Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
						СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C8").Текст);
					Иначе
						СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C8").Текст);
						
						СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C9").Текст;
						СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
						
						СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C10").Текст;
						СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
						
						СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C11").Текст));
					КонецЕсли;
					
					СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C12").Текст), "По равному значению", Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C12").Текст));
					
					// Проверим загруженный реквизит.
					ПроверитьЗагружаемыйРеквизит(СтруктураУмолчанияРеквизита, МетаданныеОбъектаИмя, ВерсияОбъектовМетаданных, ТекстСообщения);
					
					// Имя реквизита могло измениться.
					ИмяРеквизита = СтруктураУмолчанияРеквизита.ИмяРеквизита;
					СтруктураУмолчанийШапки.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
					
					ТекущаяСтрокаШапка = ТекущаяСтрокаШапка + 1;
					ТекущаяСтрокаОбластиШапкиДокумента = "R" + Формат(ТекущаяСтрокаШапка, "ЧГ=");
					ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбластиШапкиДокумента + "C2").Текст;
					
				КонецЦикла;
			КонецЕсли;
			
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецПопытки;
		
		// Проверим структуры с загруженными реквизитами из настройки - есть ли эти реквизиты в метаданных объекта.
		ВыполнитьПроверкуПолученныхРеквизитовИзНастройки(МетаданныеОбъекта, СтруктураУмолчаний, СтруктураУмолчанийШапки, ТекстСообщения);
		
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиДополнительныхПараметров(СтруктураПараметров, Настройки, ВерсияОбработки);
		
		СтруктураПараметров.ПередЗаписьюОбъекта = Настройки.Область("R" + Формат(ТекущаяСтрока + 2, "ЧГ=") + "C3").Текст;
		СтруктураПараметров.ПриЗаписиОбъекта    = Настройки.Область("R" + Формат(ТекущаяСтрока + 3, "ЧГ=") + "C3").Текст;
		
		Если СтруктураПараметров.РежимЗагрузки Тогда
			СтруктураПараметров.ПослеДобавленияСтроки = Настройки.Область("R" + Формат(ТекущаяСтрока + 4, "ЧГ=") + "C3").Текст;
		КонецЕсли;
		
		СтруктураПараметров.Вставить("СтруктураУмолчаний", СтруктураУмолчаний);
		СтруктураПараметров.Вставить("СтруктураУмолчанийШапки", СтруктураУмолчанийШапки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
