#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Операция") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Операция = Параметры.Операция;
		
		ДанныеВыбора = Новый СписокЗначений;
		Для Каждого Элемент Из Перечисления.ТипыОперацийОтгрузкиМДЛП Цикл
			
			Если Элемент = Продажа Тогда
				Если Операция = Перечисления.ОперацииОтгрузкиМДЛП.ВозвратПриостановленныхЛП Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли Элемент = ВозвратПроизводителю Тогда
				Если Операция <> Перечисления.ОперацииОтгрузкиМДЛП.ВозвратПриостановленныхЛП Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(Элемент);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
