
#Область ПрограммныйИнтерфейс

#Область CDNПлощадки

// Начинает обновление CDN-площадок.
// Необходимо выполнять один раз перед всеми проверками кодов маркировок за определенный период.
// Это нужно для того, чтоб обновление списка CDN-площадок не выполнялось непосредственно в момент проверки КМ, для ускорения проверки.
// Вызов процедуры можно разместить в момент открытия формы документа или открытия кассовой смены.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта, к которому подключен механизма обновления CDN- площадок.
//  ОповещениеОЗавершении - ОписаниеОповещения - обработчик, в который будет возвращен результат обновления CDN- площадок.
//
Процедура ОбновитьСписокCDNПлощадокНаФорме(Форма, ОповещениеОЗавершении = Неопределено) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	СобытияФормРазрешительныйРежимМДЛПКлиентПереопределяемый.ОбновитьСписокCDNПлощадокНаФорме(Форма, ОповещениеОЗавершении, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		ПараметрыЗапроса                         = РазрешительныйРежимМДЛПКлиент.ПараметрыЗапросаДанных();
		ПараметрыЗапроса.ОповещениеОЗавершении   = Новый ОписаниеОповещения("ЗакончитьОбновлениеСпискаCDNПлощадокНаФорме", ЭтотОбъект, ОповещениеОЗавершении);
		ПараметрыЗапроса.УникальныйИдентификатор = Форма.УникальныйИдентификатор;
		ПараметрыЗапроса.Организация             = Форма.Объект.Организация;
		ПараметрыЗапроса.Параметры               = Новый Структура("НеВыводитьОкноОжидания", Ложь);
		
		РазрешительныйРежимМДЛПКлиент.АктуализацияСпискаCDNПлощадок(ПараметрыЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // CDNПлощадки

#Область ПроверкаКодаМаркировки

// Запускает выполнение проверки КМ на форме документов библиотеки МДЛП или документов имеющих структуру подобную документам библиотеки МДЛП.
// Для выполнения проверки КМ на форме объектов не имеющих структуру подобную документам библиотеки МДЛП
// необходимо использовать процедуру РазрешительныйРежимМДЛПКлиент.НачатьПроверкуКМ.
//
Процедура НачатьПроверкуКМНаФорме(Форма, ДанныеШтрихкодовПоТипам, ОповещениеОЗавершении) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	СобытияФормРазрешительныйРежимМДЛПКлиентПереопределяемый.НачатьПроверкуКМНаФорме(Форма, ДанныеШтрихкодовПоТипам, ОповещениеОЗавершении, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		ОповещениеОЗавершенииПроверкиКМ = Новый ОписаниеОповещения("ЗакончитьПроверкуКМНаФорме", ЭтотОбъект, ОповещениеОЗавершении);
		
		ПараметрыПроверкиКМ = РазрешительныйРежимМДЛПКлиент.ПараметрыПроверкиКМ(Форма);
		ПараметрыПроверкиКМ.ОповещениеОЗавершении = ОповещениеОЗавершенииПроверкиКМ;
		ПараметрыПроверкиКМ.Организация           = Форма.Объект.Организация;
		
		ДанныеДляПроверки = Новый Массив;
		Для Каждого ДанныеШтрихкода Из ДанныеШтрихкодовПоТипам.НомераКиЗ Цикл
			
			ДанныеШтрихкода.ШтрихкодBase64 = СтрЗаменить(СтрЗаменить(ДанныеШтрихкода.ШтрихкодBase64, Символы.ПС, ""), Символы.ВК, "");
			
			ЭлементДанных = РазрешительныйРежимМДЛПКлиент.НовыйЭлементДанныхДляПроверки();
			ЭлементДанных.ПолныйКодМаркировки   = ДанныеШтрихкода.ШтрихкодBase64;
			ЭлементДанных.ИдентификаторЭлемента = ДанныеШтрихкода.ШтрихкодBase64;
			
			ДанныеДляПроверки.Добавить(ЭлементДанных);
			
		КонецЦикла;
		ПараметрыПроверкиКМ.ДанныеДляПроверки = ДанныеДляПроверки;
		
		РазрешительныйРежимМДЛПКлиент.НачатьПроверкуКМ(ПараметрыПроверкиКМ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПроверкаКодаМаркировки

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область АварийныйРежим

Процедура ОбновитьПредставлениеАварийногоРежима(Форма) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработкаОжиданияЗавершенияАварийногоРежима");
	
	ПараметрыАварийногоРежима = ДанныеНастройкиАварийногоРежима();
	
	ДанныеОсновнойЧасти = Новый Массив;
	
	Если ПараметрыАварийногоРежима.Включено Тогда
		
		Если ЗначениеЗаполнено(ПараметрыАварийногоРежима.ДатаОкончания) Тогда
			ДатаЗавершенияАварийногоРежима = МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания);
		КонецЕсли;
		
		ДатаТекущая = МестноеВремя(ОбщегоНазначенияКлиент.ДатаУниверсальная());
		
		Если ДатаТекущая < ДатаЗавершенияАварийногоРежима Тогда
		
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим установлен до'"));
			ДанныеОсновнойЧасти.Добавить(" ");
			
			Если НачалоДня(ДатаТекущая) <> НачалоДня(ДатаЗавершенияАварийногоРежима) Тогда
				ПредставлениеДаты = СтрШаблон(
					" (%1)",
					Формат(ДатаЗавершенияАварийногоРежима, "ДФ=dd.MM.yyyy"));
			Иначе
				ПредставлениеДаты = "";
			КонецЕсли;
			
			ПредставлениеВремени = СтрШаблон(
				"%1%2",
				Формат(ДатаЗавершенияАварийногоРежима, "ДФ=HH:mm;"),
				ПредставлениеДаты);
			
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					ПредставлениеВремени,,,,
					"ИзменитьВремяОкончанияАварийногоРежима"));
			
			ПодключитьОбработчикОжидания(
				"ОбработкаОжиданияЗавершенияАварийногоРежима",
				(ДатаЗавершенияАварийногоРежима - ДатаТекущая) + 10,
				Истина);
			
			ДанныеОсновнойЧасти.Добавить(" ");
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Отключить'"),,,,
					"ОтключитьАварийныйРежим"));
			
		Иначе
			
			ПараметрыАварийногоРежима.Включено = Ложь;
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим не включен.'"));
			
			ДанныеОсновнойЧасти.Добавить(" ");
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Включить'"),,,,
					"ВключитьАварийныйРежим"));
			
		КонецЕсли;
		
	Иначе
		
		ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим не включен.'"));
		
		ДанныеОсновнойЧасти.Добавить(" ");
		ДанныеОсновнойЧасти.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Включить'"),,,,
				"ВключитьАварийныйРежим"));
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Обработка.ПанельМаркировкиМДЛП.Форма.ПанельМаркировки" Тогда
		
		Форма.Элементы.НадписьАварийныйРежим.Заголовок = Новый ФорматированнаяСтрока(ДанныеОсновнойЧасти);
		Форма.Элементы.ГруппаАварийногоРежима.Видимость = ПараметрыАварийногоРежима.Включено;
		
	ИначеЕсли Форма.ИмяФормы = "Обработка.ПанельМаркировкиМДЛП.Форма.РасширенныеНастройкиИСервис" Тогда
		
		Форма.Элементы.НадписьАварийныйРежим.Заголовок = Новый ФорматированнаяСтрока(ДанныеОсновнойЧасти);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыАварийногоРежима = ДанныеНастройкиАварийногоРежима();
	
	ПослеЗакрытияФормы = Новый ОписаниеОповещения("ПослеОбработкиФормыУточненияАварийногоРежима", ЭтотОбъект);
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВключитьАварийныйРежим" Тогда
		
		ОткрытьФорму("ОбщаяФорма.АварийныйРежимМДЛП",
			Новый Структура("АварийныйРежимВключен", Ложь),,,,,
			ПослеЗакрытияФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьВремяОкончанияАварийногоРежима" Тогда
		
		ОткрытьФорму("ОбщаяФорма.АварийныйРежимМДЛП", 
			Новый Структура("АварийныйРежимВключен, АварийныйРежимДо", ПараметрыАварийногоРежима.Включено, МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания)),,,,,
			ПослеЗакрытияФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтключитьАварийныйРежим" Тогда
		
		РазрешительныйРежимМДЛПВызовСервера.ОтключитьАварийныйРежимРазрешительнойСистемы();
		
		ОповеститьОбИзмененииАварийногоРежима();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеОбработкиФормыУточненияАварийногоРежима(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("АктивностьРежима") Тогда
		
		Если Результат.АктивностьРежима Тогда
			
			// включение аварийного режима
			РазрешительныйРежимМДЛПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы(Результат.СрокДействияВЧасах);
			
		Иначе
			
			// отключение аварийного режима
			РазрешительныйРежимМДЛПВызовСервера.ОтключитьАварийныйРежимРазрешительнойСистемы();
			
		КонецЕсли;
		
		ОповеститьОбИзмененииАварийногоРежима();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбИзмененииАварийногоРежима() Экспорт
	
	Оповестить("ИзменениеАварийногоРежимаРазрешительногоРежимаМДЛП");
	
КонецПроцедуры

Процедура ОбработатьОповещениеОбИзмененииАварийногоРежима(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ИзменениеАварийногоРежимаРазрешительногоРежимаМДЛП" Тогда
		ОбновитьПредставлениеАварийногоРежима(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // АварийныйРежим

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АварийныйРежим

// Возвращает параметры включения аварийного режима.
//
// Возвращаемое значение:
//  Структура - Параметры аварийного режима:
//   * ДатаОкончания - Дата - универсальная дата окончания аварийного режима.
//   * Включено - Булево - признак активности аварийного режима.
//
Функция ДанныеНастройкиАварийногоРежима() Экспорт
	
	ДатаДействияАварийногоРежима = РазрешительныйРежимМДЛПКлиентСерверПовтИсп.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата();
	
	ДанныеАварийногоРежима = Новый Структура("ДатаОкончания, Включено", Дата(1, 1, 1), Ложь);
	ДанныеАварийногоРежима.ДатаОкончания = ДатаДействияАварийногоРежима;
	
	Если ТранспортМДЛПАПИКлиентСервер.ПолучитьТекущуюУниверсальнуюДату() < ДатаДействияАварийногоРежима Тогда
		ДанныеАварийногоРежима.Включено = Истина;
	Иначе
		ДанныеАварийногоРежима.ДатаОкончания = Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат ДанныеАварийногоРежима;
	
КонецФункции

#КонецОбласти // АварийныйРежим

#Область CDNПлощадки

// Продолжение асинхронной процедуры ОбновитьСписокCDNПлощадокНаФорме.
//
Процедура ЗакончитьОбновлениеСпискаCDNПлощадокНаФорме(РезультатОбновления, ОповещениеОЗавершении) Экспорт
	
	Если РезультатОбновления <> Неопределено Тогда
		
		Если РезультатОбновления.ЕстьОшибки И ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОбновления.ТекстОшибки);
			
			ОткрытьФорму("РегистрСведений.СостоянияCDNПлощадокМДЛП.Форма.ФормаОшибкиАвторизации",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // CDNПлощадки

#Область ПроверкаКодаМаркировки

// Продолжение асинхронной процедуры НачатьПроверкуКМНаФорме.
//
Процедура ЗакончитьПроверкуКМНаФорме(РезультатПроверки, ОповещениеОЗавершении) Экспорт
	
	Если ЗначениеЗаполнено(РезультатПроверки) Тогда
		
		НовыеНомераУпаковок = Новый Массив;
		
		Если РезультатПроверки.ЕстьОшибки Тогда
			// Общая ошибка, не позволяющая выполнить обработку конкретных элементов проверки:
			// 1. Общая ошибка выполнения запроса, например, недоступность сервера и т.п.
			// 2. Набор ошибок, которые не удалось сопоставить с конкретным элементом проверки.
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.ТекстОшибки);
		Иначе
			
			НомераУпаковок = ОповещениеОЗавершении.ДополнительныеПараметры.ДанныеШтрихкодовПоТипам.НомераКиЗ;
			Для Каждого ДанныеШтрихкодаПриемник Из НомераУпаковок Цикл
				
				ДанныеШтрихкодаИсточникИсходный = РезультатПроверки.ДанныеПроверки[ДанныеШтрихкодаПриемник.ШтрихкодBase64];
				
				Если Не ЗначениеЗаполнено(ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ) Тогда
					ТекстОшибки = НСтр("ru = 'Не удалось выполнить проверку для кода маркировки %1. Подробности смотрите в Журнале регистрации.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеШтрихкодаПриемник.Штрихкод);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ.ЕстьОшибки Тогда
					ТекстОшибки = НСтр("ru = 'Невозможно добавить код маркировки %1:'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеШтрихкодаПриемник.Штрихкод);
					ТекстОшибки = ТекстОшибки + Символы.ПС + ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ.ТекстОшибки;
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если Не ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ.ДанныеПроверкиКМПолучены
					И ЗначениеЗаполнено(ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ.ПредставлениеРезультата) Тогда
					// Сообщение пользователю о причинах того, почему данные проверки не получены.
					// Если это не ошибка, значит - аварийный режим.
					ТекстПредупреждения = НСтр("ru = 'Данные проверки кода маркировки %1 не получены по причине:'");
					ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, ДанныеШтрихкодаПриемник.Штрихкод);
					ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ.ПредставлениеРезультата;
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения);
				КонецЕсли;
				
				ДанныеШтрихкодаИсточник = Новый Структура;
				ДанныеШтрихкодаИсточник.Вставить("ПолныйКодМаркировки"                   , ДанныеШтрихкодаИсточникИсходный.ПолныйКодМаркировки);
				ДанныеШтрихкодаИсточник.Вставить("РезультатПроверкиКМРазрешительныйРежим", ДанныеШтрихкодаИсточникИсходный.РезультатПроверкиКМ);
				
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеШтрихкодаПриемник, ДанныеШтрихкодаИсточник, Ложь);
				
				НовыеНомераУпаковок.Добавить(ДанныеШтрихкодаПриемник);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОповещениеОЗавершении.ДополнительныеПараметры.ДанныеШтрихкодовПоТипам.НомераКиЗ = НовыеНомераУпаковок;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	
КонецПроцедуры

#КонецОбласти // ПроверкаКодаМаркировки

#КонецОбласти // СлужебныеПроцедурыИФункции
