
&НаКлиенте
Перем ДанныеПеренесены;

&НаКлиенте
Перем ВыполняетсяЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрокаКоллекции Из Параметры.КоллекцияСтрок Цикл 
		Если СтрокаКоллекции.Загружать И НЕ ЗначениеЗаполнено(СтрокаКоллекции.Номенклатура) Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	НоменклатурыЗаказа = Параметры.Документ.Товары.ВыгрузитьКолонку("Номенклатура");
	Для Каждого Номенклатура Из НоменклатурыЗаказа Цикл
		НаденныеСтроки = Параметры.КоллекцияСтрок.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Если НаденныеСтроки.Количество() = 0 Тогда
			НовСтрока = ТаблицаНоменклатур.Добавить();
			НовСтрока.Номенклатура = Номенклатура;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыполняетсяЗакрытие Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ДанныеПеренесены И ЕстьСопоставленнаяНоменклатура() Тогда
			Отказ = Истина;
			ТекстВопроса = "Обнаружена сопоставленная номенклатура. При закрытии формы данные будут утеряны. Закрыть форму?";
			Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоставитьСоответствие(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоставитьСоответствие(Команда)
	
	ТекСтрокаНоменклатур = Элементы.ТаблицаНоменклатур.ТекущиеДанные;
	ТекСтрокаДанных      = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ТекСтрокаНоменклатур = Неопределено Или ТекСтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрокаНоменклатур.Сопоставлено Тогда
		СтрокаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, ТекСтрокаНоменклатур);
		
		ТекСтрокаНоменклатур.Наименование = "";
		ТекСтрокаНоменклатур.НомерСтроки = 0;
		ТекСтрокаНоменклатур.Сопоставлено = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекСтрокаНоменклатур, ТекСтрокаДанных);
	ТекСтрокаНоменклатур.Сопоставлено = Истина;
	ТаблицаДанных.Удалить(ТекСтрокаДанных);
	ТаблицаДанных.Сортировать("НомерСтроки");
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьСоответствие(Команда)
	
	ТекСтрокаНоменклатур = Элементы.ТаблицаНоменклатур.ТекущиеДанные;
	Если ТекСтрокаНоменклатур = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекСтрокаНоменклатур.Сопоставлено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДанных, ТекСтрокаНоменклатур);
	
	ТекСтрокаНоменклатур.Наименование = "";
	ТекСтрокаНоменклатур.НомерСтроки = 0;
	ТекСтрокаНоменклатур.Сопоставлено = Ложь;
	
	ТаблицаДанных.Сортировать("НомерСтроки");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзСписка(Команда)
	
	ПараметрыФормы = Новый Структура("ТаблицаДанных, ОткрытаИзФормыПодбораПоДокументу", ТаблицаДанных, Истина);
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораНоменклатуры", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораНоменклатуры", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Если НЕ ЕстьСопоставленнаяНоменклатура() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружено ни одной сопоставленной номенклатуры!");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНоменклатур Из ТаблицаНоменклатур Цикл
		Если НЕ СтрокаНоменклатур.Сопоставлено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СопоставленныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатур);
		
		ДанныеПеренесены = Истина;
	КонецЦикла;
	
	Закрыть(СопоставленныеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицыДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("Наименование", Результат))[0].ПолучитьИдентификатор();
	Если СтрокаТаблицыДанных<>Неопределено Тогда
		Элементы.ТаблицаДанных.ТекущаяСтрока = СтрокаТаблицыДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьСопоставленнаяНоменклатура()
	
	Результат = Ложь;
	Для Каждого ТекСтрока Из ТаблицаНоменклатур Цикл
		Если ТекСтрока.Сопоставлено Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

ДанныеПеренесены = Ложь;
ВыполняетсяЗакрытие = Ложь;
