
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменяет доступность элементов
//
&НаСервере
Процедура УстановитьДоступностьЭлементовСервер()
	
	// Настройки доступности элементов
	РазрешитьРедактироватьФальсификатыВручную = Пользователи.РолиДоступны("ор_ПравоРазрешитьРедактироватьФальсификатыВручную");
	Если НЕ РазрешитьРедактироватьФальсификатыВручную Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
