
#Если ВебКлиент Тогда

#Область ПрограммныйИнтерфейс

#Область МетодыИнтерфейсаРазрешительногоРежима

#Область ПроверкаКодаМаркировки

// См. РазрешительныйРежимМДЛПКлиентСервер.ПроверитьКМНаЛокальномМодуле.
//
Асинх Функция ПроверитьКМНаЛокальномМодуле(ПараметрыПроверкиКМ) Экспорт
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ);
	
	РезультатПроверки = ПараметрыВыполненияПроверки.РезультатПроверки;
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаЛокальномМодуле Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатОфлайнЗапроса = Ждать ДанныеЛокальногоМодуля(
		ПараметрыВыполненияПроверки.ДанныеДляПроверки,
		ПараметрыВыполненияПроверки.Организация,
		ПараметрыВыполненияПроверки.НомерФискальногоНакопителя,
		ПараметрыВыполненияПроверки.РабочееМесто);
	
	РазрешительныйРежимМДЛПКлиентСервер.ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(РезультатПроверки, РезультатОфлайнЗапроса);
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти // ПроверкаКодаМаркировки

#Область ЛокальныйМодульЧЗ

// См. РазрешительныйРежимМДЛПКлиентСервер.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ.
//
Асинх Функция ИнициализацияКонфигурацииЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, ИдентификаторФискальногоНакопителя = "") Экспорт
	
	КлючСессии = РазрешительныйРежимМДЛПВызовСервера.ПроверитьОбновитьКлючСессии(РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",                      Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПараметрыЗапросов = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьДанныеЗапросаИнициализацииКонфигурацииЛокальногоМодуляЧЗ(КлючСессии, ПараметрыУстановки, ИдентификаторФискальногоНакопителя);
	
	РезультатОтправкиЗапроса = Ждать ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапросАсинх(ПараметрыПодключения, ДанныеЗапроса);
	
	РазрешительныйРежимМДЛПКлиентСервер.ОбработатьОтветИнициализацияКонфигурацииЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// См. РазрешительныйРежимМДЛПКлиентСервер.ЗапроситьСтатусЛокальногоМодуляЧЗ.
//
Асинх Функция ЗапроситьСтатусЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ВерсияСборки",               "");
	ВозвращаемоеЗначение.Вставить("Статус",                     "");
	ВозвращаемоеЗначение.Вставить("ДатаПоследнейСинхронизации", Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("ТребуетсяЗагрузка",          Ложь);
	
	ПараметрыЗапросов = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьДанныеЗапросаСтатусаЛокальногоМодуляЧЗ(ПараметрыУстановки);
	
	РезультатОтправкиЗапроса = Ждать ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапросАсинх(ПараметрыПодключения, ДанныеЗапроса);
	
	РазрешительныйРежимМДЛПКлиентСервер.ОбработатьОтветЗапроситьСтатусЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// См. РазрешительныйРежимМДЛПКлиентСервер.ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ.
//
Асинх Функция ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, НовыйПароль) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ОшибкаПроверкиНовогоПароля", Ложь);
	
	ПараметрыЗапросов = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьДанныеЗапросаИзмененияПароляАдминистратораЛокальногоМодуляЧЗ(ПараметрыУстановки, НовыйПароль);
	
	РезультатОтправкиЗапроса = Ждать ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапросАсинх(ПараметрыПодключения, ДанныеЗапроса);
	
	РазрешительныйРежимМДЛПКлиентСервер.ОбработатьОтветИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ЛокальныйМодульЧЗ

#КонецОбласти // МетодыИнтерфейсаРазрешительногоРежима

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаКодаМаркировки

// См. РазрешительныйРежимМДЛПКлиентСервер.ДанныеЛокальногоМодуля.
//
Асинх Функция ДанныеЛокальногоМодуля(ДанныеПроверкиКМ, Организация, НомерФискальногоНакопителя, РабочееМесто = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим"                         , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМ"             , Ложь);
	ВозвращаемоеЗначение.Вставить("НезавершеннаяНастройкаЛМ"               , Ложь);
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизации"          , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствиеСинхронизацииЛМ"              , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаКлиенте"             , Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                            , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима"          , Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"            , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"                , Новый Соответствие);
	
	ВозвращаемоеЗначение.АварийныйРежим = РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж();
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		// На срок действия аварийного режима разрешена продажа без разрешительного режима.
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеУстановленныхЛокальныхМодулей = РазрешительныйРежимМДЛПВызовСервера.СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто);
	
	СписокКлиентскихМодулей = ДанныеУстановленныхЛокальныхМодулей.КлиентскиеМодули;
	
	НетКлиентскихМодулей = Не ЗначениеЗаполнено(СписокКлиентскихМодулей);
	
	Если НетКлиентскихМодулей Тогда
		// Если локальных модулей не установлено, то не отправлять запрос.
		ВозвращаемоеЗначение.ОтсутствуютУстановленныеЛМ = Истина;
		РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, НСтр("ru = 'Локальный модуль Честный знак не установлен.'"));
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	СтруктураДополнительныхПараметров = Новый Структура;
	СтруктураДополнительныхПараметров.Вставить("НомерФН", НомерФискальногоНакопителя);
	
	РезультатОбработкиКМ = Ждать ОбработатьКодыМаркировкиНаЛокальномМодулеЧестногоЗнака(
		ДанныеПроверкиКМ,
		СписокКлиентскихМодулей,
		СтруктураДополнительныхПараметров);
	
	ВозвращаемоеЗначение.НезавершеннаяНастройкаЛМ      = РезультатОбработкиКМ.НезавершеннаяНастройкаЛМ;
	ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = РезультатОбработкиКМ.НекорректныеДанныеАвторизации;
	ВозвращаемоеЗначение.ОтсутствиеСинхронизацииЛМ     = РезультатОбработкиКМ.ОтсутствиеСинхронизацииЛМ;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.ТекстОшибки) Тогда
		РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, РезультатОбработкиКМ.ТекстОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.КонтролиРазрешительногоРежима) Тогда
		ВозвращаемоеЗначение.КонтролиРазрешительногоРежима = РезультатОбработкиКМ.КонтролиРазрешительногоРежима;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.СтатусыКодовМаркировкиГИСМТ) Тогда
		ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ = РезультатОбработкиКМ.СтатусыКодовМаркировкиГИСМТ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбработкиКМ.КодыМаркировкиБезДанных) Тогда
		ВозвращаемоеЗначение.КодыМаркировкиБезДанных = РезультатОбработкиКМ.КодыМаркировкиБезДанных;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// См. РазрешительныйРежимМДЛПКлиентСервер.ОбработатьКодыМаркировкиНаЛокальномМодулеЧестногоЗнака.
//
Асинх Функция ОбработатьКодыМаркировкиНаЛокальномМодулеЧестногоЗнака(ДанныеПроверкиКМ, ДанныеУстановленныхЛокальныхМодулей, СтруктураДополнительныхПараметров)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизации", Ложь);
	ВозвращаемоеЗначение.Вставить("НезавершеннаяНастройкаЛМ"     , Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствиеСинхронизацииЛМ"    , Ложь);
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                  , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима", Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"  , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"      , Новый Соответствие);
	
	МассивКодовИдентификацииДляОтправки = Новый Массив;
	СоответствиеКИЗСтрокам              = Новый Соответствие;
	КодыМаркировкиБезДанных             = Новый Соответствие;
	
	Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
		МассивКодовИдентификацииДляОтправки.Добавить(ЭлементПроверки.СокращенныйКодМаркировки);
		СоответствиеКИЗСтрокам.Вставить(ЭлементПроверки.СокращенныйКодМаркировки, ЭлементПроверки);
		// Изначально, считаем все элементы проверки без данных.
		КодыМаркировкиБезДанных.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ЭлементПроверки);
	КонецЦикла;
	
	ЗапросыДляЛогирования = Новый Массив;
	
	Для Каждого ДанныеЛокальногоМодуля Из ДанныеУстановленныхЛокальныхМодулей Цикл
		
		ДанныеЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьДанныеЗапросаОбработкиКодовМаркировкиНаЛокальномМодулеЧЗ(ДанныеЛокальногоМодуля, МассивКодовИдентификацииДляОтправки, СтруктураДополнительныхПараметров);
		
		ПараметрыЗапросов = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросовКЛокальномуМодулюЧЗ(ДанныеЛокальногоМодуля);
		ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
		ПараметрыПодключения.Таймаут = ДанныеЛокальногоМодуля.Таймаут;
		
		РезультатОтправкиЗапроса = Ждать ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапросАсинх(ПараметрыПодключения, ДанныеЗапроса);
		
		АдресСервера = ДанныеЛокальногоМодуля.АдресПодключения;
		
		Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
			
			Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния) Тогда
				КодОшибки = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
			Иначе
				КодОшибки = НСтр("ru = 'Таймаут'");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля) Тогда
				ТекстОтвета = РезультатОтправкиЗапроса.ОтветТранспортногоМодуля;
			Иначе
				ТекстОтвета = РезультатОтправкиЗапроса.ОписаниеОшибки;
			КонецЕсли;
			
			Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
				ПараметрыЗаписиВЛог = РазрешительныйРежимМДЛПВызовСервера.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ЭлементПроверки.ПолныйКодМаркировки, ТекстОтвета, ДанныеЗапроса.АдресЗапроса);
				// ор ++
				ПараметрыЗаписиВЛог.Наименование = ЭлементПроверки.ПредставлениеНоменклатуры;
				// ор --
				ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
			КонецЦикла;
			
			Если РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда // РезультатОтправкиЗапроса.КодСостояния = 401
				
				ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = Истина;
				
				// Некорректный логин/пароль администратора.
				ТекстОшибки = НСтр("ru = 'Указаны некорректные логин/пароль подключения к Локальному модулю ""Честный знак"" %1.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, АдресСервера);
				
				РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
				
				Продолжить;
				
			ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
				
				// Код ошибки 4045 - не инициализировано, или в статусе инициализации.
				// Код ошибки 4050 - ошибка синхронизации.
				
				// В обоих случаях переходим к следующему ЛМ.
				
				ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
				
				Если ДанныеОтвета = Неопределено Тогда
					ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				КодРасшифровкиОшибки = ДанныеОтвета.Получить("errorCode");
				Если КодРасшифровкиОшибки = Неопределено Тогда
					ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если КодРасшифровкиОшибки = 4045 Тогда
					ВозвращаемоеЗначение.НезавершеннаяНастройкаЛМ = Истина;
					ТекстОшибки = НСтр("ru = 'Не завершена настройка подключения к Локальному модулю ""Честный знак"" %1.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,  АдресСервера);
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если КодРасшифровкиОшибки = 4050 Тогда
					ВозвращаемоеЗначение.ОтсутствиеСинхронизацииЛМ = Истина;
					ТекстОшибки = НСтр("ru = 'Статус Локального модуля ""Честный знак"" %1 - ошибка синхронизации.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,  АдресСервера);
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				ТекстОшибкиИзСервиса = ДанныеОтвета.Получить("reason");
				Если ЗначениеЗаполнено(ТекстОшибкиИзСервиса) Тогда
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибкиИзСервиса);
					Продолжить;
				КонецЕсли;
				
				ДополнениеТекстаОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
				РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
				Продолжить;
				
			Иначе
				ДополнениеТекстаОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
				РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ДополнениеТекстаОшибки);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
		
		Если ДанныеОтвета = Неопределено Тогда
			ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
			РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		КодОтветаОшибки = ДанныеОтвета.Получить("code");
		Если ЗначениеЗаполнено(КодОтветаОшибки) Тогда
			ТекстОшибки = НСтр("ru = 'Локальный модуль ""Честный знак"" вернул ошибку.
			|Код ошибки %1, описание ошибки:
			|%2.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, КодОтветаОшибки, ДанныеОтвета.Получить("description"));
			РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		ДанныеОтветаЛокальногоМодуля = ДанныеОтвета.Получить("results");
		
		Если ТипЗнч(ДанныеОтветаЛокальногоМодуля) <> Тип("Массив") Или Не ЗначениеЗаполнено(ДанныеОтветаЛокальногоМодуля) Тогда
			ТекстОшибки = НСтр("ru = 'Некорректный формат ответа от Локального модуля Честный знак.'");
			РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОбщиеДанныеОтветаЛокальногоМодуля Из ДанныеОтветаЛокальногоМодуля Цикл
			
			ДанныеПоКодамМаркировки = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("codes");
			// ор ++
			ЕстьВСеромСписке = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("isGreyGtin");
			// ор --
			
			Если ТипЗнч(ДанныеПоКодамМаркировки) <> Тип("Массив") Или Не ЗначениеЗаполнено(ДанныеПоКодамМаркировки) Тогда
				ТекстОшибки = НСтр("ru = 'Некорректный формат ответа от Локального модуля Честный знак.'");
				РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
				
				КИЗСтроки = ЭлементДанных.Получить("cis");
				Если Не ЗначениеЗаполнено(КИЗСтроки) Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементПроверки = СоответствиеКИЗСтрокам.Получить(КИЗСтроки);
				Если Не ЗначениеЗаполнено(ЭлементПроверки) Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыКодаМаркировки = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(ЭлементДанных);
				
				Если ПараметрыКодаМаркировки.Заблокирован Тогда
					ТекстОшибки = НСтр("ru = 'Оборот товара был заблокирован.'");
					// ор ++
					Если ЕстьВСеромСписке = Истина Или ПараметрыКодаМаркировки.ЕстьВСеромСписке Тогда
						ТекстОшибки = НСтр("ru = 'Проверка товара возможна только в режиме онлайн.'");
					КонецЕсли;
					// ор --
					ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекстОшибки));
				КонецЕсли;
				
				ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(ОбщиеДанныеОтветаЛокальногоМодуля.Получить("reqTimestamp"), "ЧГ=;");
				ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("reqId");
				ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = АдресСервера;
				ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = ДанныеЗапроса.АдресЗапроса;
				ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = РезультатОтправкиЗапроса.ОтветТранспортногоМодуля;
				ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
				
				ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЭкземпляраПО = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("inst");
				ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазыЧерногоСписка   = ОбщиеДанныеОтветаЛокальногоМодуля.Получить("version");
				// ор ++
				ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазы = ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазыЧерногоСписка;
				// ор --
				
				ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ПараметрыКодаМаркировки);
				
				// Если по элементу проверки удалось получить данные, тогда нужно удалить его из коллекции.
				КодыМаркировкиБезДанных.Удалить(ЭлементПроверки.ИдентификаторЭлемента);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КодыМаркировкиБезДанных) Тогда
			ВозвращаемоеЗначение.КодыМаркировкиБезДанных = КодыМаркировкиБезДанных;
		КонецЕсли;
		
		// Если получили ответ хотя бы от одного ЛМ, тогда ошибки отключаем.
		ВозвращаемоеЗначение.НекорректныеДанныеАвторизации = Ложь;
		ВозвращаемоеЗначение.НезавершеннаяНастройкаЛМ = Ложь;
		ВозвращаемоеЗначение.ОтсутствиеСинхронизацииЛМ = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = "";
		
		// Достаточно одного ответа от одного ЛМ.
		Прервать;
		
	КонецЦикла;
	
	РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ПроверкаКодаМаркировки

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
