
#Область ОписаниеПеременных

&НаСервере
Перем ПрошлыйМетаданныеСсылкиИсточника; // Метаданные ссылки источника.

&НаКлиенте
Перем КаталогЗагружаемогоФайла; // Каталог загружаемого файла.

&НаКлиенте
Перем ПолныйПутьКЗагружаемомуФайлу; // Полный путь к файлу.

&НаКлиенте
Перем ИндексТипаЗагружаемогоФайла; // Индекс типа загружаемого файла.

&НаКлиенте
Перем НастройкиЗагруженыИзФайла; // Флаг загрузки настройки из файла.

&НаКлиенте
Перем флКонтрольЗаполнения; // Вспомогательный флаг Контроль/Заполнение для выражений.

&НаКлиенте
Перем ОтветПередЗакрытием;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Объект.ТаблицаЗагружаемыхРеквизитов.Загрузить(ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПеренестиСтруктуруКолонокДопПараметровВОбъект(Объект, ЭтотОбъект);
	
	ЗаполнитьСписокПрикладныхОбъектов();

	Элементы.СтраницаСоответствия.Видимость = Ложь;
	
	Объект.ДействиеСЗагружаемымФайлом = 2;
	Объект.ФорматДатыСрокаГодности    = "дд.мм.гггг";
	
	Элементы.КаталогАрхиваЗагруженныхФайлов.Доступность = Объект.ДействиеСЗагружаемымФайлом = 0;
	мОбновитьДанныеТабличногоДокумента(Объект.ТабличныйДокумент);
	НастройкиЗагруженыИзФайла = ЛОЖЬ;
	
	// + ОР РежимВыбораИзСписка
	Элементы.ДействиеСЗагружаемымФайлом.КнопкаВыбора = Истина;
	// - ОР РежимВыбораИзСписка
	
КонецПроцедуры

// Обработчик события формы "ПриОткрытии".
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если НЕ ВебКлиент Тогда
		
		ИнициализацияПриОткрытии();
		
	#Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Загрузка данных из внешних файлов не поддерживается в веб-клиенте.'"));
		Отказ = ИСТИНА;
		Возврат;
		
	#КонецЕсли

	ОбновлениеОтображенияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветПередЗакрытием <> Истина Тогда
		Если (Объект.РежимЗагрузки = 3) ИЛИ (ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЧтоЭтоДокумент(Объект.СсылкаИсточника) И (Объект.РежимЗагрузки = 1)) Тогда
			Если Объект.СоответствиеНоменклатуры<>Неопределено И Объект.СоответствиеНоменклатуры.Количество()>0 Тогда
				ОтмеченныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")));
				Если ОтмеченныеСтроки.Количество()<>Объект.СоответствиеНоменклатуры.Количество() Тогда
					ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемВопросЗавершение", ЭтотОбъект), НСтр("ru = 'Сохранить соответствия номенклатуры в прайс-лист поставщика?'"), РежимДиалогаВопрос.ДаНет);
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события "РежимЗагрузкиПриИзменении".
//
&НаКлиенте
Процедура РежимЗагрузкиПриИзменении(Элемент)
	
	ИмяПрикладногоОбъекта = "";
	
	Объект.СсылкаИсточника         = Неопределено;
	Объект.ИмяВидаРегистра         = Неопределено;
	Объект.ТабличнаяЧастьИсточника = Неопределено;
	
	УстановитьСписокТабличныхЧастейНаКлиенте();
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСправочникаПриИзменении(Элемент)
	
	Объект.СсылкаИсточника = ПредопределенноеЗначение("Справочник." + ИмяПрикладногоОбъекта + ".ПустаяСсылка");
	Объект.ИмяСправочника = ИмяПрикладногоОбъекта;
	
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПрикладногоОбъектаПриИзменении(Элемент)
	
	Объект.СсылкаИсточника = ПредопределенноеЗначение(ИмяПрикладногоОбъекта + ".ПустаяСсылка");
	Если ПроверитьСовпадениеСПрошлымиМетаданнымиНаСервере() Тогда
		УстановитьСписокТабличныхЧастейНаКлиенте();
	КонецЕсли;
	
	ОбновлениеОтображенияНаКлиенте();
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму(
		ИмяПрикладногоОбъекта + ".ФормаВыбора",
		ПараметрыФормы,
		Элементы.СсылкаИсточника,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик события "СсылкаИсточникаПриИзменении".
//
&НаКлиенте
Процедура СсылкаИсточникаПриИзменении(Элемент)
	
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Обработчик события "ТабличнаяЧастьИсточникаПриИзменении".
//
&НаКлиенте
Процедура ТабличнаяЧастьИсточникаПриИзменении(Элемент)
	
	УстановитьИсточник();
	ТабличнаяЧастьИсточникаПроверитьСохраненныеНастройки();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Обработчик события "ИмяВидаРегистраПриИзменении".
//
&НаКлиенте
Процедура ИмяВидаРегистраПриИзменении(Элемент)
	
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Обработчик события "ИмяВидаРегистраОткрытие".
//
&НаКлиенте
Процедура ИмяВидаРегистраОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ПустаяСтрока(Объект.ИмяВидаРегистра) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" флага "ИспользоватьВнешнийМодульПреобразованияФайла"
//
&НаКлиенте
Процедура ИспользоватьВнешнийМодульПреобразованияФайлаПриИзменении(Элемент)
	
	НастроитьДоступностьПоляОбработки();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля формы "ДействиеСЗагружаемымФайлом"
//
&НаКлиенте
Процедура ДействиеСЗагружаемымФайломПриИзменении(Элемент)
	
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля формы "КаталогАрхиваЗагруженныхФайлов"
//
&НаКлиенте
Процедура КаталогАрхиваЗагруженныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//	Обработка выбора каталога хранения архива сохраняемых файлов
	СтандартнаяОбработка   = Ложь;
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.ПолноеИмяФайла = "";
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	
	// Определим, какой каталог выбираем
	ДиалогОткрытияКаталога.Заголовок = НСтр("ru = 'Выберите каталог архива загружаемых файлов'");
	ДиалогОткрытияКаталога.Каталог   = Объект.КаталогАрхиваЗагруженныхФайлов;
	
	// Предоставим выбор пользователю
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		Объект.КаталогАрхиваЗагруженныхФайлов = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьДополнительныеРеквизитыИСведенияПриИзменении(Элемент)
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыИСведенияТолькоОбщиеПриИзменении(Элемент)
	
	Если Объект.ДополнительныеРеквизитыИСведенияТолькоОбщие Тогда
		ДополнительныеРеквизитыИСведенияКатегорияНоменклатурыНаФорме.Очистить();
	КонецЕсли;
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПоКатегорииНоменклатурыПриИзменении(Элемент)
	УстановитьИсточник();
	ОбновлениеОтображенияНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаЗагружаемыхРеквизитов

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Иначе
		Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитов.Индекс(Элемент.ТекущиеДанные);
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элемент.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		//СписокВыбора = ЗаполнитьСпискиВыбора(Элемент.ТекущаяСтрока, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		СписокВыбора = ЗаполнитьСпискиВыбора(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
		Элемент.ТекущийЭлемент.ТолькоПросмотр = СписокВыбора.Количество() = 0 ИЛИ НЕ РежимЗагрузкиИскать;
	КонецЕсли;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры

// Обработчик события "ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбора".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовВыражениеОткрытьФормуЗавершение", ЭтотОбъект);
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещенияОВыборе, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовРежимПоиска"
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СтандартнаяОбработка = ВозможностьУстановкиРежима;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПометкаПриИзменении(Элемент)
	ОбновлениеОтображенияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовИскатьПоПриИзменении(Элемент)
	ОбновлениеОтображенияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЗначениеПоУмолчанию = Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТекДанные.ДоступноеОписаниеТипов.Типы());
		ВыбранныйТип = Ждать СписокТипов.ВыбратьЭлементАсинх(НСтр("ru = 'Выбор типа данных'"));
		
		Если ВыбранныйТип <> Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ВыбранныйТип.Значение);
			ОписаниеВыбранныйТип = Новый ОписаниеТипов(МассивТипов);
			ТекДанные.ЗначениеПоУмолчанию = ОписаниеВыбранныйТип.ПривестиЗначение(ТекДанные.ЗначениеПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекДанные.ИмяРеквизита = "Родитель" Тогда
		
		ФормаВыбора = ПолучитьФормуВыбораОбъектаМетаданных(ТипЗнч(ТекДанные.ЗначениеПоУмолчанию));
		Если ФормаВыбора <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ОткрытьФорму(ФормаВыбора, ПараметрыФормы, Элемент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные.ЗначениеПоУмолчанию = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ИмяРеквизита = "Родитель" Тогда
		
		ДанныеВыбораРодителя = ПолучитьДанныеВыбораРодителя(ТипЗнч(ТекДанные.ЗначениеПоУмолчанию), ПараметрыПолученияДанных, СтандартнаяОбработка);
		Если Не СтандартнаяОбработка Тогда
			ДанныеВыбора = ДанныеВыбораРодителя;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРодителя(Тип, ПараметрыПолученияДанных, СтандартнаяОбработка = Истина)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Не ОбъектМетаданных.Иерархический
		Или ОбъектМетаданных.ВидИерархии <> Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(ПараметрыПолученияДанных.СтрокаПоиска) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Таблица
		|ГДЕ
		|	Таблица.ЭтоГруппа");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура", ОбъектМетаданных.Имя);
		Выборка = Запрос.Выполнить().Выбрать();
		ДанныеВыбора = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ЭтоГруппа", Истина);
		
		ПараметрыПолученияДанных.Отбор = ПараметрыОтбора;
		ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		
		ДанныеВыбора = Справочники[ОбъектМетаданных.Имя].ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаЗагружаемыхРеквизитовШапки

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиПометкаПриИзменении(Элемент)
	
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовШапкиВыражениеОткрытьФормуЗавершение", ЭтотОбъект);
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещенияВыбора, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиИскатьПоПриИзменении(Элемент)
	
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СтандартнаяОбработка = ВозможностьУстановкиРежима;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиПередНачаломИзменения(Элемент, Отказ)
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитовШапки.Индекс(Элемент.ТекущиеДанные);
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элемент.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоТипу" Тогда
		СписокВыбора = ЗаполнитьСпискиВыбораШапка(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
		Элемент.ТекущийЭлемент.ТолькоПросмотр = СписокВыбора.Количество() = 0 ИЛИ НЕ РежимЗагрузкиИскать;
	КонецЕсли;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЗначениеПоУмолчанию = Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТекДанные.ДоступноеОписаниеТипов.Типы());
		ВыбранныйТип = Ждать СписокТипов.ВыбратьЭлементАсинх(НСтр("ru = 'Выбор типа данных'"));
		
		Если ВыбранныйТип <> Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ВыбранныйТип.Значение);
			ОписаниеВыбранныйТип = Новый ОписаниеТипов(МассивТипов);
			ТекДанные.ЗначениеПоУмолчанию = ОписаниеВыбранныйТип.ПривестиЗначение(ТекДанные.ЗначениеПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗагружаемыхРеквизитовШапки.ТекущиеДанные;
	Если ТекДанные <> Неопределено
		И ТекДанные.ДоступноеОписаниеТипов.Типы().Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные.ЗначениеПоУмолчанию = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоответствиеНоменклатуры

// Процедура - обработчик события "ПриИзменении" реквизита "Загружать" таблицы формы "СоответствиеНоменклатуры"
//
&НаКлиенте
Процедура СоответствиеНоменклатурыЗагружатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И ТекущиеДанные.Загружать Тогда
		ТекущиеДанные.Загружать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" реквизита "Номенклатура" таблицы формы "СоответствиеНоменклатуры"
//
&НаКлиенте
Процедура СоответствиеНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И (ТекущиеДанные.Загружать) Тогда
		ТекущиеДанные.Загружать = Ложь
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И (НЕ ТекущиеДанные.Загружать) Тогда
		ТекущиеДанные.Загружать = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ДополнительныеПараметрыЗагрузки"
//
&НаКлиенте
Процедура ДополнительныеПараметрыЗагрузки(Команда)
	Рез = Неопределено;
	ДопПараметры = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.УстановитьДополнительныеПараметрыЗагрузки(ЭтотОбъект, Объект, Рез);
	ОткрытьФорму(ДопПараметры.ФормаИмя, ДопПараметры.ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("УстановитьДополнительныеПараметрыЗагрузкиОткрытьФормуЗавершение", этотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

// Процедура - обработчик команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Восстановить значения из файла'");
	ДиалогВыбораФайла.Фильтр    = "Настройка загрузки в табличный документ (*.mxlz)|*.mxlz|Все файлы (*.*)|*.*|";
	
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияПомещениеФайлов = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершение", ЭтотОбъект);
	НачатьПомещениеФайлов(ОписаниеОповещенияПомещениеФайлов,, ДиалогВыбораФайла.ПолноеИмяФайла, Ложь, Новый УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - обработчик команды "СохранитьНастройкиВФайл"
//
&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	Настройки = ПолучитьСтруктуруПараметровИНастройкиНаСервере();
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Сохранить значения настройки в файл'");
	ДиалогВыбораФайла.Фильтр    = "Настройка загрузки в табличный документ (*.mxlz)|*.mxlz|Все файлы (*.*)|*.*|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		Настройки.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажки"
//
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитов);
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажки"
//
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитов);
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажкиСоответствия"
//
&НаКлиенте
Процедура УстановитьФлажкиСоответствия(Команда)
	
	УстановитьФлагТаблицыСоответствий(Истина);
	
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажкиСоответствия"
//
&НаКлиенте
Процедура СнятьФлажкиСоответствия(Команда)
	
	УстановитьФлагТаблицыСоответствий(Ложь);
	
КонецПроцедуры

// Процедура - обработчик команды "Перечитать"
//
&НаКлиенте
Процедура Перечитать(Команда)
	
	ЗаполнитьНастройкиКолонок(Истина);
	
КонецПроцедуры

// Процедура - обработчик команды "РучнаяНумерацияКолонокТабличногоДокумента"
//
&НаКлиенте
Процедура РучнаяНумерацияКолонокТабличногоДокумента(Команда)
	
	УстановитьРучнаяНумерацияКолонок();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

// Процедура - обработчик команды "ОткрытьФайл"
//
&НаКлиенте
Процедура ПеренумероватьКолонки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик команды "ПеренумероватьКолонки"
//
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Если Объект.ИспользоватьВнешнийМодульПреобразованияФайла Тогда
		// Проверим внешнюю обработку, которой обработаем XML
		Если НЕ ЗначениеЗаполнено(Объект.ОбработкаПреобразования) Тогда
			ПоказатьПредупреждение(,НСтр("ru= 'Не указана обработка преобразования файла в табличный документ!'"));
			Возврат;
		КонецЕсли;
		
		// Теперь выберем файл, который будем обрабатывать
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Каталог = КаталогЗагружаемогоФайла;
		Если ИндексТипаЗагружаемогоФайла <> Неопределено Тогда
			ДиалогВыбораФайла.ИндексФильтра = ИндексТипаЗагружаемогоФайла;
		КонецЕсли;
		ДиалогВыбораФайла.Заголовок = НСтр("ru= 'Прочитать табличный документ из файла'");
		Если ДиалогВыбораФайла.Выбрать() Тогда
			
			КаталогЗагружаемогоФайла     = ДиалогВыбораФайла.Каталог;
			ПолныйПутьКЗагружаемомуФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
			ИндексТипаЗагружаемогоФайла  = ДиалогВыбораФайла.ИндексФильтра;
			
			НачатьПомещениеФайлов(Новый ОписаниеОповещения("ЗаполнитьТабличныйДокументИзXMLЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)),,ДиалогВыбораФайла.ПолноеИмяФайла,Ложь, Новый УникальныйИдентификатор);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Не выбран файл!'"));
		КонецЕсли;
		
	Иначе
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
		ДиалогВыбораФайла.Каталог   = КаталогЗагружаемогоФайла;
		Если ИндексТипаЗагружаемогоФайла <> Неопределено Тогда
			ДиалогВыбораФайла.ИндексФильтра = ИндексТипаЗагружаемогоФайла;
		КонецЕсли;
		ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
		ДиалогВыбораФайла.Фильтр    = "dBase III (*.dbf)|*.dbf|Лист Excel (*.xls)|*.xls|Лист Excel 2007 (*.xlsx)|*.xlsx|Бинарная рабочая книга Excel (*.xlsb)|*.xlsb|Лист Excel с поддержкой макросов (*.xlsm)|*.xlsm|Текстовый документ (*.txt)|*.txt|Табличный документ (*.mxl)|*.mxl|Формат sst (*.sst)|*.sst|Формат mmo (*.mmo)|*.mmo |Формат OpenOffice (*.ods)|*.ods|";
		Если ДиалогВыбораФайла.Выбрать() Тогда
			КаталогЗагружаемогоФайла = ДиалогВыбораФайла.Каталог; 
			ПолныйПутьКЗагружаемомуФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
			ИндексТипаЗагружаемогоФайла  = ДиалогВыбораФайла.ИндексФильтра;
			ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
			
			НачатьПомещениеФайлов(Новый ОписаниеОповещения("ЗаполнитьТабличныйДокументИзТабличногоФайлаЗавершение", ЭтотОбъект, Новый Структура("ФайлНаДиске", ФайлНаДиске)),,ДиалогВыбораФайла.ПолноеИмяФайла,Ложь, Новый УникальныйИдентификатор);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "СохранитьВФайл"
//
&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.СохранитьВФайл(КаталогЗагружаемогоФайла, Объект.ТабличныйДокумент);
	
КонецПроцедуры

// Процедура - обработчик команды "ОбновитьТабличныйДокумент"
//
&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	
	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана первая строка данных табличного документа'"),,,"ПерваяСтрокаДанныхТабличногоДокумента");
		Возврат;
	КонецЕсли;
	
	мОбновитьДанныеТабличногоДокумента(Объект.ТабличныйДокумент, Истина);
	
КонецПроцедуры

// Процедура - обработчик команды "КонтрольЗаполнения"
//
&НаКлиенте
Процедура КонтрольЗаполнения(Команда)
	
	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана первая строка данных табличного документа'"),,,"Объект.ПерваяСтрокаДанныхТабличногоДокумента");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПерваяСтрокаДанныхШапки = 0 И ЕстьОтмеченныеСтрокиВНастройкахШапки() Тогда
		ТекстСообщения = "Не указана строка для загрузки данных шапки документа!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,"Объект.ПерваяСтрокаДанныхШапки");
		Возврат;
	КонецЕсли;
	
	флКонтрольЗаполнения = Истина;
	мКонтрольЗаполнения(Объект.ТабличныйДокумент);
	
КонецПроцедуры

// Процедура - обработчик команды "Загрузить"
//
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана первая строка данных табличного документа'"),,,"Объект.ПерваяСтрокаДанныхТабличногоДокумента");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПерваяСтрокаДанныхШапки = 0 И ЕстьОтмеченныеСтрокиВНастройкахШапки() Тогда
		ТекстСообщения = "Не указана строка для загрузки данных шапки документа!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,"ПерваяСтрокаДанныхШапки");
		Возврат;
	КонецЕсли;
	
	флКонтрольЗаполнения = Ложь;
	мЗагрузитьДанные(Объект.ТабличныйДокумент);
	
	Если Объект.РежимЗагрузки = 3 Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды "ЗаполнитьСоответствиеНоменклатуры"
//
&НаКлиенте
Процедура ЗаполнитьСоответствиеНоменклатуры(Команда)
	
	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана первая строка данных табличного документа",,,"Объект.ПерваяСтрокаДанныхТабличногоДокумента");
		Возврат;
	КонецЕсли;
	
	мЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент);
	
КонецПроцедуры

// Процедура - обработчик команды "ВосстановитьНастройки"
//
&НаКлиенте
Процедура ВосстановитьНастройки(Команда)
	
	// Если загрузка в табличную часть документа, переопределим выбор настройки
	Если ИспользоватьСправочникНастроек() Тогда
		
		СтруктураПараметров = СформироватьСтруктуруОтбораДляВыбораНастройки();
		
		ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ФормаВыбора", 
			СтруктураПараметров, ЭтотОбъект,
			,,,
			Новый ОписаниеОповещения("ВосстановитьНастройкиОткрытьФормуЗавершение", ЭтотОбъект), 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "СохранитьНастройки"
//
&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если ИспользоватьСправочникНастроек() Тогда
		
		СтруктураПараметров = СформироватьСтруктуруПараметровДляСохраненияНастроек();
		
		ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "События"
//
&НаКлиенте
Процедура События(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПередЗаписьюОбъекта",   Объект.ПередЗаписьюОбъекта);
	ПараметрыФормы.Вставить("ПриЗаписиОбъекта",      Объект.ПриЗаписиОбъекта);
	ПараметрыФормы.Вставить("ПослеДобавленияСтроки", Объект.ПослеДобавленияСтроки);
	ПараметрыФормы.Вставить("РежимЗагрузки",         Объект.РежимЗагрузки);
	
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаРедактированияСобытий",
		Новый Структура("ПараметрыФормы", ПараметрыФормы),
		ЭтотОбъект,
		,,,
		Новый ОписаниеОповещения("СобытияОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура - обработчик команды "СформироватьНоменклатуру"
//
&НаКлиенте
Процедура СформироватьНоменклатуру(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Таблица соответствий пуста'"));
		Возврат;
	КонецЕсли;
	
	ОтмеченныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Загружать", Истина));
	Если ОтмеченныеСтроки.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не выбраны позиции, которые необходимо добавить'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьНоменклатуруОбработкаВопроса",ЭтотОбъект),НСтр("ru= 'Добавить выбранные позиции в справочник номенклатуры?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Процедура - обработчик команды "СформироватьНоменклатуруПоНастройке"
//
&НаКлиенте
Процедура СформироватьНоменклатуруПоНастройке(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Таблица соответствий пуста'"));
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("ПредставлениеРеквизита", "Номенклатура"));
	Если НайденнаяСтрока.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не найдено в настройках поле ""Номенклатура""'"));
		Возврат;
	Иначе
		НайденнаяСтрока = НайденнаяСтрока[0];
	КонецЕсли;
	
	Если НЕ НайденнаяСтрока.Пометка ИЛИ НайденнаяСтрока.НомерКолонки=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'В настройках поле ""Номенклатура"" не используется'"));
		Возврат;
	КонецЕсли;
	
	ОтмеченныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Загружать", Истина));
	Если ОтмеченныеСтроки.Количество()=0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не выбраны позиции, которые необходимо добавить'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СформироватьНоменклатуруПоНастройкеОбработкаВопроса", ЭтотОбъект, Новый Структура("НайденнаяСтрока", НайденнаяСтрока));
	ПоказатьВопрос(ОписаниеОповещенияВопрос, НСтр("ru= 'Добавить выбранные позиции в справочник номенклатуры?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиНастройкиШапки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитовШапки);
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиНастройкиШапки(Команда)
	
	ор_ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитовШапки);
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяНумерацияКолонокНастройкиШапки(Команда)
	
	УстановитьРучнаяНумерацияКолонокНастройкиШапки();
	ОбновлениеОтображенияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренумероватьКолонкиНастройкиШапки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитовШапки Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеПоПохожимНаименованиям(Команда)
	
	ПараметрыФормы = Новый Структура("КоллекцияСтрок", Объект.СоответствиеНоменклатуры);
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораНоменклатурыПоСхожести", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораНоменклатурыПоСхожести", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеПоШтрихкоду(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Произвести точное сопоставление отмеченной номенклатуры по штрихкоду?";
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСопоставлениеПоШтрихкоду", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеПоНаименованию(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Произвести точное сопоставление отмеченной номенклатуры по наименованию?";
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСопоставлениеПоНаименованию", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставлениеИзСписка(Команда)
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.Загружать И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для текущей строки соответствие уже установлено!");
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораНоменклатуры", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораНоменклатуры", Новый Структура,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставитьПоЗаказуПоставщику(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Предварительный контроль наличия данных для обработки
	ЕстьДанныеДляОбработки = Ложь;
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ЕстьДанныеДляОбработки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДанныеДляОбработки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Незаполненных данных для сопоставления не найдено.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Обработчик = Новый ОписаниеОповещения("ОбработатьНоменклатурыДокумента", ЭтотОбъект);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрыФормы, , , , , Обработчик, РежимОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СопоставитьПоЗаказуНаПеремещение(Команда)
	
	Если Объект.СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Предварительный контроль наличия данных для обработки
	ЕстьДанныеДляОбработки = Ложь;
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ЕстьДанныеДляОбработки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДанныеДляОбработки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Незаполненных данных для сопоставления не найдено.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Обработчик = Новый ОписаниеОповещения("ОбработатьНоменклатурыДокумента", ЭтотОбъект);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Документ.ЗаказНаПеремещение.ФормаВыбора", ПараметрыФормы, , , , , Обработчик, РежимОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - обработчик управляет доступностью поля обработки
//
&НаКлиенте
Процедура НастроитьДоступностьПоляОбработки()
	
	Если Объект.ИспользоватьВнешнийМодульПреобразованияФайла Тогда
		Элементы.ОбработкаПреобразования.Доступность = Истина;
		Элементы.ОбработкаПреобразования.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ОбработкаПреобразования.Доступность = Ложь;
		Элементы.ОбработкаПреобразования.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Функция определяет использовать ли справочник настроек вместо СохранитьЗначение()
//
// Параметры
//  Нет. 
//
// Возвращаемое значение:
//   Булево   - Использовать или нет
//
&НаСервере
Функция ИспользоватьСправочникНастроек()
	Возврат (Объект.РежимЗагрузки=1 ИЛИ Объект.РежимЗагрузки=3 ИЛИ Объект.РежимЗагрузки=0 ИЛИ Объект.РежимЗагрузки = 2) И (Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.СсылкаИсточника)) ИЛИ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.СсылкаИсточника)) ИЛИ Не ПустаяСтрока(Объект.ИмяВидаРегистра));
КонецФункции // ИспользоватьСправочникНастроек()

// Функция формирования структуры параметров для установки отбора в форме выбора настроек
//
&НаСервере
Функция СформироватьСтруктуруОтбораДляВыбораНастройки(ДляФормированияНоменклатуры=Ложь)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("РежимЗагрузки", Объект.РежимЗагрузки);
	СтруктураРеквизитов.Вставить("СсылкаИсточника", Объект.СсылкаИсточника);
	СтруктураРеквизитов.Вставить("ТабличнаяЧастьИсточника", Объект.ТабличнаяЧастьИсточника);
	СтруктураРеквизитов.Вставить("ИмяВидаРегистра", Объект.ИмяВидаРегистра);
	СтруктураРеквизитов.Вставить("ИмяСправочника", Объект.ИмяСправочника);
	
	ПараметрОтборПоМетаданнымТабличнойЧасти = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьМетаданныеИсточника(СтруктураРеквизитов);
	
	Поставщик = ПолучитьПоставщика();
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("ПараметрОтборПоВариантуИспользования", Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных);
	
	Если ДляФормированияНоменклатуры Тогда
		
		СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
		СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"            , Метаданные.Справочники.Номенклатура.ПолноеИмя());
		
	Иначе
		
		СтруктураПараметров.Вставить("ПараметрОтборПоКонтрагенту", Поставщик);
		
		Если Метаданные.Справочники.Содержит(ПараметрОтборПоМетаданнымТабличнойЧасти) Тогда
			// Это справочник
			СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"            , ПараметрОтборПоМетаданнымТабличнойЧасти.ПолноеИмя());
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(ПараметрОтборПоМетаданнымТабличнойЧасти) Тогда
			// это регистр
			СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений);
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"              , ПараметрОтборПоМетаданнымТабличнойЧасти.ПолноеИмя());
		Иначе
			// Это ТЧ, надо только выяснить чья
			Если Метаданные.Документы.Содержит(ПараметрОтборПоМетаданнымТабличнойЧасти.Родитель()) Тогда
				СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Документ);
			Иначе
				СтруктураПараметров.Вставить("ПараметрОтборПоТипуПрикладногоОбъекта", Перечисления.ор_ТипыПрикладныхОбъектов.Справочник);
			КонецЕсли;
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданным"              , ?(ПараметрОтборПоМетаданнымТабличнойЧасти = Неопределено, "", ПараметрОтборПоМетаданнымТабличнойЧасти.Родитель().ПолноеИмя()));
			СтруктураПараметров.Вставить("ПараметрОтборПоМетаданнымТабличнойЧасти", ПараметрОтборПоМетаданнымТабличнойЧасти.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Функция формирования структуры параметров для сохранения настроек в справочник
//
&НаСервере
Функция СформироватьСтруктуруПараметровДляСохраненияНастроек()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ВариантИспользованияНастройки", Перечисления.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных);
	СтруктураПараметровНастроек = ПолучитьСтруктуруПараметровДляСохраненияНастроек();
	Настройки = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройки(СтруктураПараметровНастроек);
	СтруктураПараметров.Вставить("НастройкиЗагрузкиВыгрузки"    , Новый ХранилищеЗначения(Настройки));
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеОтображенияНаКлиенте()
	Если Объект.РежимЗагрузки = 0 Тогда
		Элементы.СтраницыРежимы.ТекущаяСтраница = Элементы.ЗагрузкаВСправочник;
		Элементы.ГруппаСтраницаНастройкиШапки.Видимость = Ложь;
		Элементы.ГруппаСтраницыНастройкиЗагрузки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ИначеЕсли Объект.РежимЗагрузки = 1 Тогда
		Элементы.СтраницыРежимы.ТекущаяСтраница = Элементы.ЗагрузкаВТабличнуюЧасть;
		Элементы.ГруппаСтраницаНастройкиШапки.Видимость = Истина;
		Элементы.ГруппаСтраницыНастройкиЗагрузки.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	ИначеЕсли Объект.РежимЗагрузки = 2 Тогда
		Элементы.СтраницыРежимы.ТекущаяСтраница = Элементы.ЗагрузкаВРегистрСведений;
		Элементы.ГруппаСтраницаНастройкиШапки.Видимость = Ложь;
		Элементы.ГруппаСтраницыНастройкиЗагрузки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	ДоступностьЗагрузкиДопРеквизитов = Объект.РежимЗагрузки = 0 И 
									(ТипЗнч(Объект.СсылкаИсточника) = Тип("СправочникСсылка.Номенклатура")
									ИЛИ ТипЗнч(Объект.СсылкаИсточника) = Тип("СправочникСсылка.Контрагенты")
									ИЛИ ТипЗнч(Объект.СсылкаИсточника) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Элементы.ГруппаЗагрузкаДопРеквизитов.Видимость = ДоступностьЗагрузкиДопРеквизитов;
	
	ЭтоЗагрузкаКонтрагентов 	= Объект.РежимЗагрузки = 0 И ТипЗнч(Объект.СсылкаИсточника) = Тип("СправочникСсылка.Контрагенты");
	Элементы.ГруппаОтборРеквизитов.Видимость		  = Объект.ЗагружатьДополнительныеРеквизитыИСведения И НЕ ЭтоЗагрузкаКонтрагентов;
	Элементы.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Доступность = НЕ Объект.ДополнительныеРеквизитыИСведенияТолькоОбщие;

	Элементы.ТаблицаЗагружаемыхРеквизитовПолеПоиска.Видимость         = Объект.РежимЗагрузки = 0;
	Элементы.ТаблицаЗагружаемыхРеквизитовРежимПоиска.Видимость        = НЕ (Объект.РежимЗагрузки = 0);
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПолеПоиска.Видимость    = Объект.РежимЗагрузки = 0;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРежимПоиска.Видимость   = НЕ (Объект.РежимЗагрузки = 0);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.ОтработатьВидимостьКнопкиДопПараметров(Элементы,Объект.РежимЗагрузки, Объект.СсылкаИсточника);
	
	Элементы.ЗапретСозданияНовыхЭлементов.Видимость = Объект.РежимЗагрузки = 0;
	Элементы.ЗапретОбновленияСуществующихЭлементов.Видимость = Объект.РежимЗагрузки = 0;
	Элементы.флПоискПоПрайсуПоставщика.Видимость  = (Объект.РежимЗагрузки = 3)
	         ИЛИ (ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЧтоЭтоДокумент(Объект.СсылкаИсточника) И (Объект.РежимЗагрузки = 1));
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("РежимЗагрузки", Объект.РежимЗагрузки);
	СтруктураРеквизитов.Вставить("СсылкаИсточника", Объект.СсылкаИсточника);
	СтруктураРеквизитов.Вставить("ТабличнаяЧастьИсточника", Объект.ТабличнаяЧастьИсточника);
	СтруктураРеквизитов.Вставить("ИмяВидаРегистра", Объект.ИмяВидаРегистра);
	СтруктураРеквизитов.Вставить("ИмяСправочника", Объект.ИмяСправочника);
	
	МетаданныеЗаполнены = МетаданныеИсточникаЗаполнены(СтруктураРеквизитов);
	
	ДоступностьКнопкиСохранитьЗначения = МетаданныеЗаполнены;
	Если ИспользоватьСправочникНастроек() Тогда
		ДоступностьКнопкиВосстановитьЗначения = МетаданныеЗаполнены;
	Иначе
		ДоступностьКнопкиВосстановитьЗначения = Ложь;
	КонецЕсли;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовВосстановитьНастройки.Доступность = ДоступностьКнопкиВосстановитьЗначения;
	Элементы.ТаблицаЗагружаемыхРеквизитовСохранитьНастройки.   Доступность = ДоступностьКнопкиСохранитьЗначения;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиВосстановитьНастройки.Доступность = ДоступностьКнопкиВосстановитьЗначения;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиСохранитьНастройки.   Доступность = ДоступностьКнопкиСохранитьЗначения;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовСохранитьНастройкиВФайл.Доступность = ДоступностьКнопкиСохранитьЗначения;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиСохранитьНастройкиВФайл.Доступность = ДоступностьКнопкиСохранитьЗначения;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиНомерКолонки.Видимость = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиПеренумероватьКолонкиНастройкиШапки.Доступность = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	Элементы.ТаблицаЗагружаемыхРеквизитовШапкиРучнаяНумерацияКолонокНастройкиШапки.Пометка = Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	
	Элементы.КаталогАрхиваЗагруженныхФайлов.Доступность = Объект.ДействиеСЗагружаемымФайлом = 0;
	
	// Доступность реквизитов соответствия номенклатуры
	СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено;
	ОтборСтрок = Новый Структура("ПредставлениеРеквизита","Номенклатура");
	Строки = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
	Если Строки.Количество() > 0 Тогда
		СтрокаНастройкиЗагрузкиНоменклатуры = Строки[0];
	КонецЕсли;
	
	Если (СтрокаНастройкиЗагрузкиНоменклатуры = Неопределено) ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.Пометка = Ложь)
	 ИЛИ (СтрокаНастройкиЗагрузкиНоменклатуры.НомерКолонки=0) Тогда
		Элементы.СтраницаСоответствия.Видимость = Ложь;
	Иначе
		Элементы.СтраницаСоответствия.Видимость = Истина;
		
		// Если номенклатуру ищем по наименованию, тогда скроем соответствующую колонку  
		Если СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо = "Наименование" Тогда
			Элементы.СоответствиеНоменклатурыНаименование.Видимость = Ложь;
		Иначе
			Элементы.СоответствиеНоменклатурыНаименование.Видимость = Истина;
		КонецЕсли;
		
		НомерКолонкиЦена = ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаКлиент.ПолучитьНомерКолонкиЦена(ЭтотОбъект);
		
		Элементы.СоответствиеНоменклатурыЦена.Видимость = НомерКолонкиЦена>0;
		
		// Т.к. попали сюда, то СтрокаНастройкиЗагрузкиНоменклатуры<>Неопределено
		Элементы.СоответствиеНоменклатурыНаименование.Видимость = НЕ СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо="Наименование";
		Элементы.НомерКолонкиСНаименованием.Видимость = НЕ СтрокаНастройкиЗагрузкиНоменклатуры.ИскатьПо="Наименование";
		Элементы.СоответствиеНоменклатурыЦена.Видимость = НомерКолонкиЦена>0;
		
	КонецЕсли;
	
	Элементы.КаталогАрхиваЗагруженныхФайлов.Доступность = (Объект.ДействиеСЗагружаемымФайлом = 0);
	
	НастроитьДоступностьПоляОбработки();
КонецПроцедуры

// Функция определить возможность установки режима поиска для текущих данных
//
&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

// Функция определить возможность установки режима загрузки для текущих данных
//
&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию)
	
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

&НаСервере
Функция МетаданныеИсточникаЗаполнены(СтруктураРеквизитов)
	МетаданныеИсточника = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьМетаданныеИсточника(СтруктураРеквизитов);
	Возврат МетаданныеИсточника <> Неопределено;
КонецФункции

// Процедура выполняет установку реквизитов, связанных с источником данных
//
&НаКлиенте
Процедура УстановитьИсточник()
	
	Источник        = Неопределено;
	ОбъектИсточника = Неопределено;
	СписокСохраненныхНастроек = Неопределено;
	СтеретьПрошлыеМетаданныеИсточникаНаСервере();
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("РежимЗагрузки", Объект.РежимЗагрузки);
	СтруктураРеквизитов.Вставить("СсылкаИсточника", Объект.СсылкаИсточника);
	СтруктураРеквизитов.Вставить("ТабличнаяЧастьИсточника", Объект.ТабличнаяЧастьИсточника);
	СтруктураРеквизитов.Вставить("ИмяВидаРегистра", Объект.ИмяВидаРегистра);
	СтруктураРеквизитов.Вставить("ИмяСправочника", Объект.ИмяСправочника);
	
	Если НЕ МетаданныеИсточникаЗаполнены(СтруктураРеквизитов) Тогда
		СписокСохраненныхНастроек = Неопределено;
		ТаблицаЗагружаемыхРеквизитов.Очистить();
		ТаблицаЗагружаемыхРеквизитовШапки.Очистить();
	Иначе
		ЗаполнитьНастройкиКолонок(Неопределено);
	КонецЕсли;
	
	Если Объект.РежимЗагрузки = 1 И ЗначениеЗаполнено(Объект.СсылкаИсточника) Тогда
		ЗафиксироватьПрошлыеМетаданныеНаСервере();
	КонецЕсли;
	
	мОбновитьДанныеТабличногоДокумента(Объект.ТабличныйДокумент, Истина);
	
КонецПроцедуры // УстановитьИсточник()

&НаСервере
Функция ПроверитьСовпадениеСПрошлымиМетаданнымиНаСервере()
	Возврат ПрошлыйМетаданныеСсылкиИсточника = Неопределено ИЛИ Объект.СсылкаИсточника = Неопределено
		ИЛИ НЕ ПрошлыйМетаданныеСсылкиИсточника = Объект.СсылкаИсточника.Метаданные();
КонецФункции

&НаСервере
Процедура ЗафиксироватьПрошлыеМетаданныеНаСервере() 
	ПрошлыйМетаданныеСсылкиИсточника = Объект.СсылкаИсточника.Метаданные();
КонецПроцедуры

&НаСервере
Процедура СтеретьПрошлыеМетаданныеИсточникаНаСервере()
	ПрошлыйМетаданныеСсылкиИсточника = Неопределено;
КонецПроцедуры

// Процедура выполняет инициализацию служебных переменных и констант модуля
//
&НаСервере
Процедура ИнициализацияПриОткрытии()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураПараметровИнициализации = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.Инициализация();
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураПараметровИнициализации);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Если Объект.ПерваяСтрокаДанныхТабличногоДокумента < 2 Тогда
		Объект.ПерваяСтрокаДанныхТабличногоДокумента = 2;
	КонецЕсли;

КонецПроцедуры // ИнициализацияПриОткрытии()

// Процедура заполняет список выбора элемента управления "ТабличнаяЧастьИсточника"
//
&НаКлиенте
Процедура УстановитьСписокТабличныхЧастейНаКлиенте()
	
	СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокТабличныхЧастей(Объект.СсылкаИсточника);
	
	Элементы.ТабличнаяЧастьИсточника.СписокВыбора.Очистить();
	Для Каждого ЗначениеСписка Из СписокВыбора Цикл
		Элементы.ТабличнаяЧастьИсточника.СписокВыбора.Добавить(ЗначениеСписка.Значение, ЗначениеСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры // УстановитьСписокТабличныхЧастей()

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбора(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитов[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбораШапка(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитовШапки[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиИскатьПо" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоВладельцу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитовШапки);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовШапкиСвязьПоТипу" Тогда
		
		СписокВыбора = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитовШапки);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Функция мЗагрузитьДанные(ТабличныйДокумент)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("флКонтрольЗаполнения", 						Ложь);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	
	СтруктураПараметров.Вставить("ТЧДокумента", 								ТЧДокумента);
	СтруктураПараметров.Вставить("ОписаниеОшибок", 								"");
	СтруктураПараметров.Вставить("ДопПараметры", 								Неопределено);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	Объект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("РежимЗагрузки", 								Объект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника", 							Объект.СсылкаИсточника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",	 					Объект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 							Объект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника", 								Объект.ИмяСправочника);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		Объект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок", 			Объект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("ВладелецСерии", 								Неопределено);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 					Объект.ЗапретСозданияНовыхЭлементов);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы", 			Объект.ЗапретОбновленияСуществующихЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 					Объект.ЗамещатьСуществующиеЗаписи);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 						Объект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 							Объект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 						Объект.ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					Объект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии", 				Объект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("Поставщик", 									Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения", 				Объект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 					Объект.СоответствиеНоменклатуры.Выгрузить());
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						Объект.ФорматДатыСрокаГодности);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           Объект.ПерваяСтрокаДанныхШапки);
	
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии", Объект.ЗагружатьGTINДляСерии);
	
	Если (Объект.РежимЗагрузки = 1) Тогда
		Попытка
			СтруктураПараметров.Поставщик = Объект.СсылкаИсточника.Контрагент;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,Объект);
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗагрузитьДанные(ТабличныйДокумент,СтруктураПараметров);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецФункции // мЗагрузитьДанные()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Функция мЗагрузитьСоответствиеНоменклатуры(ТабличныйДокумент, СохранятьПроставленные = Ложь)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 			ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 				ОбработкаОбъект.СоответствиеНоменклатуры.Выгрузить());
	СтруктураПараметров.Вставить("РежимЗагрузки",							ОбработкаОбъект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника",							ОбработкаОбъект.СсылкаИсточника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника",					ОбработкаОбъект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра",							ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",							ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("Поставщик", 								Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",	ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок",			ОбработкаОбъект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",					ОбработкаОбъект.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",				ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ТЧДокумента",								ОбработкаОбъект.ТЧДокумента);
	СтруктураПараметров.Вставить("флКонтрольЗаполнения",					Истина);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",				ОбработкаОбъект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("СохранятьПроставленные", 					СохранятьПроставленные);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",			ОбработкаОбъект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",					ОбработкаОбъект.ЗагружатьGTINДляСерии);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,ОбработкаОбъект);
	
	Если (Объект.РежимЗагрузки = 1) Тогда
		Попытка
			СтруктураПараметров.Поставщик = Объект.СсылкаИсточника.Контрагент;
		Исключение
		КонецПопытки;
	КонецЕсли;
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗагрузитьСоответствиеНоменклатуры(ТабличныйДокумент, СтруктураПараметров);
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураПараметров);
	ОбработкаОбъект.СоответствиеНоменклатуры.Загрузить(СтруктураПараметров.СоответствиеНоменклатуры.Скопировать());
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецФункции // мЗагрузитьСоответствиеНоменклатуры()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Процедура мКонтрольЗаполнения(ТабличныйДокумент)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	// получим метаданные источника
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов = ТаблицаЗагружаемыхРеквизитов.Выгрузить();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить();
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов.Скопировать());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("СоответствиеНоменклатуры", 					ОбработкаОбъект.СоответствиеНоменклатуры.Выгрузить());
	СтруктураПараметров.Вставить("РежимЗагрузки", 								ОбработкаОбъект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника", 							ОбработкаОбъект.СсылкаИсточника);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ТЧДокумента",		 							?(ОбработкаОбъект.ТЧДокумента=Неопределено, Неопределено, ОбработкаОбъект.ТЧДокумента.Выгрузить()));
	СтруктураПараметров.Вставить("флКонтрольЗаполнения", 						Истина);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",					ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("ВладелецСерии",								Неопределено);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						ОбработкаОбъект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",							ОбработкаОбъект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",							ОбработкаОбъект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",		ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок", 				  ОбработкаОбъект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",						ОбработкаОбъект.ПослеДобавленияСтроки);
	
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать());
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,ОбработкаОбъект);
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруОтраслевыеФлаги(СтруктураПараметров,ОбработкаОбъект);
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.КонтрольЗаполнения(ТабличныйДокумент, СтруктураПараметров);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры // мКонтрольЗаполнения()

// Функция возвращает текущие настройки загружаемых реквизитов в формате Табличного документа
//
// Возвращаемое значение:
//  ТабличныйДокумент	- Табличный документ
//
&НаСервере
Процедура мОбновитьДанныеТабличногоДокумента(ТабличныйДокумент, БезВопросов = Ложь, ЗаполнитьИзТЧДокумента=Истина)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	// получим метаданные источника
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов = ТаблицаЗагружаемыхРеквизитов.Выгрузить();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить();
	СтруктураРеквизитовОбработки = Новый Структура();
	СтруктураРеквизитовОбработки.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураРеквизитовОбработки.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов.Скопировать());
	СтруктураРеквизитовОбработки.Вставить("РежимЗагрузки", 								ОбработкаОбъект.РежимЗагрузки);
	СтруктураРеквизитовОбработки.Вставить("СсылкаИсточника", 							ОбработкаОбъект.СсылкаИсточника);
	СтруктураРеквизитовОбработки.Вставить("ТабличнаяЧастьИсточника",					ОбработкаОбъект.ТабличнаяЧастьИсточника);
	СтруктураРеквизитовОбработки.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураРеквизитовОбработки.Вставить("ИмяВидаРегистра", 							ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураРеквизитовОбработки.Вставить("ИмяСправочника", 							ОбработкаОбъект.ИмяСправочника);
	СтруктураРеквизитовОбработки.Вставить("ТЧДокумента", 								?(ОбработкаОбъект.ТЧДокумента = Неопределено, Неопределено, ОбработкаОбъект.ТЧДокумента.Выгрузить()));
	
	СтруктураРеквизитовОбработки.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать());
	СтруктураРеквизитовОбработки.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураРеквизитовОбработки.Вставить("ПерваяСтрокаДанныхШапки",                           ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОбновитьДанныеТабличногоДокумента(СтруктураРеквизитовОбработки, ТабличныйДокумент, БезВопросов, ЗаполнитьИзТЧДокумента);
	ОбработкаОбъект.ТабличныйДокумент = ТабличныйДокумент;
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураРеквизитовОбработки);
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов = СтруктураРеквизитовОбработки.ТаблицаЗагружаемыхРЕквизитов.Скопировать();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = СтруктураРеквизитовОбработки.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	
КонецПроцедуры // мОбновитьДанныеТабличногоДокумента()

// Проверяем сохраненные настройки табличной части документа
//
&НаСервере
Процедура ПроверитьСохраненныеНастройкиТЧДокумента()
	
	Объект.ДействиеСЗагружаемымФайлом = 2;
	//Объект.РучнаяНумерацияКолонокТабличногоДокумента = Истина;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураИнициализированныхПараметров = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.Инициализация();
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураИнициализированныхПараметров);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	ЗаполнитьНастройкиКолонок(Истина);
	Элементы.СтраницаСоответствия.Видимость = Истина;
	
КонецПроцедуры

// Процедура установки нумерации
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонок()
	
	Объект.РучнаяНумерацияКолонокТабличногоДокумента = НЕ Объект.РучнаяНумерацияКолонокТабличногоДокумента;
	
КонецПроцедуры

// Процедура загрузки настроек
//
&НаСервере
Процедура ВыполнитьЗагрузкуНастроек(АдресВременногоХранилища)
	
	Настройки = Новый ТабличныйДокумент;
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ВременныйФайл = КаталогВременныхФайлов() + "testUASettings.mxlz";
	ДанныеФайла.Записать(ВременныйФайл);
		
	Попытка
		Настройки.Прочитать(ВременныйФайл);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ИнформацияОбОшибке.Причина.Описание);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	ВсеОк = Истина;
	ЗаполнитьНастройкиКолонок(Настройки, ВсеОк);
	Если Не ВсеОк Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Загружаемые настройки не являются настройками выбранного объекта!'"));
		Возврат;
	КонецЕсли;
	мОбновитьДанныеТабличногоДокумента(Объект.ТабличныйДокумент, Истина);
	
	ТЧДокумента = Объект.ТабличнаяЧастьДокументаОбъекта;
	
КонецПроцедуры

// Процедура сохранения настроек
//
&НаКлиенте
Процедура ТабличнаяЧастьИсточникаПроверитьСохраненныеНастройки()
	
	Если ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЧтоЭтоДокумент(Объект.СсылкаИсточника) И Объект.РежимЗагрузки = 1 Тогда
		ПроверитьСохраненныеНастройкиТЧДокумента();
	КонецЕсли;
	
КонецПроцедуры

// Процедура сохраняет данные таблицы соответствия номенклатуры в прайс-лист поставщика
//
&НаКлиенте
Процедура СохранитьТаблицуСоответствия()
	
	Поставщик = ПолучитьПоставщика();
	
	Если Поставщик = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Неопределен контрагент, невозможно сохранить соответсвия в прайс-лист поставщика!'"));
		Возврат;
	КонецЕсли;
	
	РезультатЗагрузки = Истина;
	НайденныеСтроки = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("ПредставлениеРеквизита", "Номенклатура"));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не найден реквизит номенклатура!'"));
		Возврат;
	КонецЕсли;

	ИскатьПо        = НайденныеСтроки[0].ИскатьПо;
	Если НайденныеСтроки.Количество()=0 ИЛИ НЕ НайденныеСтроки[0].Пометка Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Не отмечен реквизит номенклатура!'"));
		Возврат;
	ИначеЕсли (ИскатьПо = "ЕГК") Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Нельзя сохранить соответствия номенклатуры при поиске по'") + " " + ИскатьПо);
		Возврат;
	КонецЕсли;
	
	// Откроем форму подбора, установив предварительно отбор на контрагента
	СтруктураПараметровОтбора = Новый Структура("Владелец", Поставщик);
	
	ФормаВыбораПрайса = ПолучитьФорму("Справочник.ПрайсЛистыКонтрагентов.ФормаВыбора");
	УправлениеНебольшойФирмойКлиент.УстановитьЭлементОтбораСписка(
		ФормаВыбораПрайса.Список,
		"Владелец",
		Поставщик,
		ВидСравненияКомпоновкиДанных.Равно);
		
	УправлениеНебольшойФирмойКлиент.УстановитьЭлементОтбораСписка(
		ФормаВыбораПрайса.Список,
		"ПрайсЛистДляМониторингаЦен",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно);
		
	ФормаВыбораПрайса.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("СохранитьТаблицуСоответствияЗавершение", ЭтотОбъект, Новый Структура("ИскатьПо", ИскатьПо));
	
	// Выбираем прайс-лист контрагента
	ФормаВыбораПрайса.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТаблицуСоответствияЗавершение(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьТаблицуСоответствияСервер(ЗначениеВыбора, ДополнительныеПараметры.ИскатьПо);
	
	ПоказатьПредупреждение(,НСтр("ru = 'Обработка таблицы соответствия завершена!'"));
	
	ОтветПередЗакрытием = Истина;
	
КонецПроцедуры

// Функция получения поставщика (контрагента)
//
&НаСервере
Функция ПолучитьПоставщика()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Поставщик = ОбработкаОбъект.Поставщик;
	
	Если НЕ ЗначениеЗаполнено(Поставщик) И ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПроверитьЧтоЭтоДокумент(Объект.СсылкаИсточника) И Объект.РежимЗагрузки = 1 Тогда
		Попытка
			Поставщик = Объект.СсылкаИсточника.Контрагент;
		Исключение
			Поставщик = Справочники.Контрагенты.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Возврат Поставщик;
	
КонецФункции

// Процедура сохраняет данные таблицы соответствия номенклатуры в прайс-лист поставщика
//
&НаСервере
Процедура СохранитьТаблицуСоответствияСервер(ПрайсЛистКонтрагента, ИскатьПо)
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.СохранитьТаблицуСоответствия(ПрайсЛистКонтрагента, ИскатьПо, ТаблицаЗагружаемыхРеквизитов.Выгрузить(), Объект.СоответствиеНоменклатуры.Выгрузить(), ЭтотОбъект);
	
КонецПроцедуры

#Область НастройкиЗагрузки

// Процедура загрузки настроек в форму по переданной настройке
//
// Параметры:
//  Настройка - СправочникСсылка.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента - хранит элемент настроек.
//
&НаСервере
Процедура ЗагрузитьНастройки(Настройка)
	
	ЗаполнитьНастройкиКолонок(Настройка.НастройкиЗагрузкиВыгрузки.Получить());
	мОбновитьДанныеТабличногоДокумента(Объект.ТабличныйДокумент, Истина);
	ТЧДокумента = Объект.ТабличнаяЧастьДокументаОбъекта;
	
КонецПроцедуры

// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  СтруктураУмолчаний - Структура - Структура настройки колонок по умолчанию
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонок(Настройки, ВсеОк = Истина)
	
	Попытка
		КоличествоИсходныхПомеченныхСтрок      = ТаблицаЗагружаемыхРеквизитов.Выгрузить().НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
		КоличествоИсходныхПомеченныхСтрокШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить().НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Исключение
		КоличествоИсходныхПомеченныхСтрок = 0;
		КоличествоИсходныхПомеченныхСтрокШапки = 0;
	КонецПопытки;
	
	ПромежуточнаяТаблица      = ТаблицаЗагружаемыхРеквизитов.Выгрузить();
	ПромежуточнаяТаблицаШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить();
	ТаблицаЗагружаемыхРеквизитов.Очистить();
	ТаблицаЗагружаемыхРеквизитовШапки.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов      = ТаблицаЗагружаемыхРеквизитов.Выгрузить().СкопироватьКолонки();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить().СкопироватьКолонки();
	ПромежуточныйСписокКатегорийНоменклатуры = ДополнительныеРеквизитыИСведенияКатегорияНоменклатурыНаФорме.Скопировать();
	ОбработкаОбъект.ДополнительныеРеквизитыПоКатегорииНоменклатуры = ДополнительныеРеквизитыИСведенияКатегорияНоменклатурыНаФорме.Скопировать();
	ОбработкаОбъект.ТЧДокумента = ТЧДокумента;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СсылкаИсточника", 							ОбработкаОбъект.СсылкаИсточника);
	СтруктураПараметров.Вставить("РежимЗагрузки", 								ОбработкаОбъект.РежимЗагрузки);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника", 					ОбработкаОбъект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 							ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника", 								ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьДокументаОбъекта",				ОбработкаОбъект.ТабличнаяЧастьДокументаОбъекта);
	СтруктураПараметров.Вставить("ТЧДокумента",									ОбработкаОбъект.ТЧДокумента);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов",					ОбработкаОбъект.ЗапретСозданияНовыхЭлементов);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",				ОбработкаОбъект.ЗапретОбновленияСуществующихЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи",					ОбработкаОбъект.ЗамещатьСуществующиеЗаписи);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента",	ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента",		ОбработкаОбъект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности",						ОбработкаОбъект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии",					ОбработкаОбъект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("СоздаватьОбщиеХарактеристики",				ОбработкаОбъект.СоздаватьОбщиеХарактеристики);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом",					ОбработкаОбъект.ДействиеСЗагружаемымФайлом);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика",					ОбработкаОбъект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов",				ОбработкаОбъект.КаталогАрхиваЗагруженныхФайлов);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя",						ОбработкаОбъект.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",ОбработкаОбъект.ИспользоватьВнешнийМодульПреобразованияФайла);
	СтруктураПараметров.Вставить("ОбработкаПреобразования",						ОбработкаОбъект.ОбработкаПреобразования);
	СтруктураПараметров.Вставить("Кодировка",									ОбработкаОбъект.Кодировка);
	СтруктураПараметров.Вставить("Табуляция",									ОбработкаОбъект.Табуляция);
	СтруктураПараметров.Вставить("ИмяТаблицы",									ОбработкаОбъект.ИмяТаблицы);
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта",							ОбработкаОбъект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта",							ОбработкаОбъект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки",						ОбработкаОбъект.ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов",				ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов.Скопировать());
	СтруктураПараметров.Вставить("ИмяВидаРегистра",								ОбработкаОбъект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника",								ОбработкаОбъект.ИмяСправочника);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры",	ОбработкаОбъект.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Скопировать());
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	ОбработкаОбъект.ЗагружатьДополнительныеРеквизитыИСведения);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	ОбработкаОбъект.ДополнительныеРеквизитыИСведенияТолькоОбщие);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения",				ОбработкаОбъект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("ЗагружатьШК",									ОбработкаОбъект.ЗагружатьШК);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии",						ОбработкаОбъект.ЗагружатьGTINДляСерии);
	
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", ОбработкаОбъект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           ОбработкаОбъект.ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать());
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект, ОбработкаОбъект, Истина);
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьНастройкиКолонок(Настройки, СтруктураПараметров);
	
	КоличествоПомеченныхСтрокВСтруктуре = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	КоличествоПомеченныхСтрокШапкиВСтруктуре = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	
	Если СтруктураПараметров.РежимЗагрузки = 0 И СтруктураПараметров.ИмяСправочника = "" И СтруктураПараметров.СсылкаИсточника = Неопределено
		ИЛИ СтруктураПараметров.РежимЗагрузки = 1 И Не ЗначениеЗаполнено(СтруктураПараметров.СсылкаИсточника) 
		ИЛИ СтруктураПараметров.РежимЗагрузки = 2 И СтруктураПараметров.ИмяВидаРегистра = ""
		ИЛИ КоличествоИсходныхПомеченныхСтрок<>0 И КоличествоПомеченныхСтрокВСтруктуре = 0 Тогда
		// что-то пошло не так
		
		ТаблицаЗагружаемыхРеквизитов.Загрузить(ПромежуточнаяТаблица);
		
		Если  КоличествоИсходныхПомеченныхСтрокШапки<>0 И КоличествоПомеченныхСтрокШапкиВСтруктуре = 0 Тогда
			// что-то пошло не так
			ТаблицаЗагружаемыхРеквизитовШапки.Загрузить(ПромежуточнаяТаблицаШапки);
		КонецЕсли;
		
		ВсеОк = Ложь;
		Возврат;
	КонецЕсли;
	
	// Перегружаем таблицу шапки, если в настройках нет помеченых реквизитов.
	Если КоличествоИсходныхПомеченныхСтрокШапки<>0 И КоличествоПомеченныхСтрокШапкиВСтруктуре = 0 Тогда
		// что-то пошло не так
		ТаблицаЗагружаемыхРеквизитовШапки.Загрузить(ПромежуточнаяТаблицаШапки);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбработкаОбъект, СтруктураПараметров);
	ОбработкаОбъект.ЗапретСозданияНовыхЭлементов = СтруктураПараметров.НеСоздаватьНовыхЭлементов;
	ОбработкаОбъект.ЗапретОбновленияСуществующихЭлементов = СтруктураПараметров.НеОбновлятьСуществующиеЭлементы;
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитов.Скопировать();
	ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки = СтруктураПараметров.ТаблицаЗагружаемыхРеквизитовШапки.Скопировать();
	ОбработкаОбъект.ДополнительныеРеквизитыПоКатегорииНоменклатуры = СтруктураПараметров.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Скопировать();
	ТаблицаЗагружаемыхРеквизитов.Загрузить(ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитов);
	ТаблицаЗагружаемыхРеквизитовШапки.Загрузить(ОбработкаОбъект.ТаблицаЗагружаемыхРеквизитовШапки);
	ДополнительныеРеквизитыИСведенияКатегорияНоменклатурыНаФорме = ОбработкаОбъект.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Скопировать();
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПеренестиДопПараметрыВОбъектИНаФорму(СтруктураПараметров, ЭтотОбъект, ОбработкаОбъект);

	ТЧДокумента = ОбработкаОбъект.ТЧДокумента;
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры // ЗаполнитьНастройкиКолонок()

&НаКлиенте
Процедура ПередЗакрытиемВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СохранитьТаблицуСоответствия();
		Возврат;
	КонецЕсли;
	
	ОтветПередЗакрытием = Истина;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ЭтотОбъект[Элемент.Имя] = СокрЛП(Результат);
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДополнительныеПараметрыЗагрузкиОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ВсегдаФормироватьНовыеСерии  = Результат.ВсегдаФормироватьНовыеСерии;
	Объект.СоздаватьПроизводителя       = Результат.СоздаватьПроизводителя;
	Объект.ФорматДатыСрокаГодности      = Результат.ФорматДатыСрокаГодности;
	Объект.НеФормироватьДопНомерСерии   = Результат.НеФормироватьДопНомерСерии;
	Объект.ЗагружатьШК                  = Результат.ЗагружатьШК;
	Объект.СоздаватьСтрануПроисхождения = Результат.СоздаватьСтрануПроисхождения;
	Объект.ЗагружатьGTINДляСерии        = Результат.ЗагружатьGTINДляСерии;
	Объект.ШКЯвляетсяПолемПоискаНоменклатуры = Результат.ШКЯвляетсяПолемПоискаНоменклатуры;
	Объект.СоздаватьОбщиеХарактеристики      = Результат.СоздаватьОбщиеХарактеристики;
	
	ЗагрузитьДопТаблицу(Результат) 

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДопТаблицу(Рез)
	Если Рез<>Неопределено Тогда
		ТаблицаДополнительныхПараметров.Загрузить(Рез.ТаблицаДополнительныхПараметров.Выгрузить());
		Объект.ТаблицаДополнительныхПараметров.Загрузить(Рез.ТаблицаДополнительныхПараметров.Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		АдресВоВременномХранилище = Результат[0].Хранение;
		
		ВыполнитьЗагрузкуНастроек(АдресВоВременномХранилище);
		ОбновлениеОтображенияНаКлиенте();
		НастройкиЗагруженыИзФайла = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровДляСохраненияНастроек()
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимЗагрузки",			 					Объект.РежимЗагрузки);
	СтруктураПараметров.Вставить("СсылкаИсточника", 							Объект.СсылкаИсточника);
	СтруктураПараметров.Вставить("ТабличнаяЧастьИсточника", 					Объект.ТабличнаяЧастьИсточника);
	СтруктураПараметров.Вставить("ИмяВидаРегистра", 							Объект.ИмяВидаРегистра);
	СтруктураПараметров.Вставить("ИмяСправочника", 								Объект.ИмяСправочника);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 					Объект.ЗапретСозданияНовыхЭлементов);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы",				Объект.ЗапретОбновленияСуществующихЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 					Объект.ЗамещатьСуществующиеЗаписи);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	Объект.РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		Объект.ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("КоличествоНеОбрабатываемыхСтрок", 			Объект.КоличествоНеОбрабатываемыхСтрок);
	СтруктураПараметров.Вставить("ФорматДатыСрокаГодности", 					Объект.ФорматДатыСрокаГодности);
	СтруктураПараметров.Вставить("ВсегдаФормироватьНовыеСерии", 				Объект.ВсегдаФормироватьНовыеСерии);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом", 					Объект.ДействиеСЗагружаемымФайлом);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					Объект.флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов", 				Объект.КаталогАрхиваЗагруженныхФайлов);
	СтруктураПараметров.Вставить("СоздаватьПроизводителя", 						Объект.СоздаватьПроизводителя);
	СтруктураПараметров.Вставить("Кодировка", 									Объект.Кодировка);
	СтруктураПараметров.Вставить("Табуляция", 									Объект.Табуляция);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла",Объект.ИспользоватьВнешнийМодульПреобразованияФайла);
	СтруктураПараметров.Вставить("ОбработкаПреобразования", 					Объект.ОбработкаПреобразования);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 						Объект.ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 							Объект.ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 						Объект.ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоКатегорииНоменклатуры", 	Объект.ДополнительныеРеквизитыПоКатегорииНоменклатуры.Скопировать());
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения", 	Объект.ЗагружатьДополнительныеРеквизитыИСведения);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие", Объект.ДополнительныеРеквизитыИСведенияТолькоОбщие);
	СтруктураПараметров.Вставить("СоздаватьСтрануПроисхождения", 				Объект.СоздаватьСтрануПроисхождения);
	СтруктураПараметров.Вставить("ЗагружатьGTINДляСерии", 						Объект.ЗагружатьGTINДляСерии);
	
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокументаДляШапки", Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхШапки",                           Объект.ПерваяСтрокаДанныхШапки);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитовШапки",                 ТаблицаЗагружаемыхРеквизитовШапки.Выгрузить());
	
	ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ДополнитьВСтруктуруДопПараметры(СтруктураПараметров, ЭтотОбъект,Объект);

	Возврат СтруктураПараметров;	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПараметровИНастройкиНаСервере()
	СтруктураПараметров = ПолучитьСтруктуруПараметровДляСохраненияНастроек();
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройки(СтруктураПараметров);
КонецФункции

&НаСервере
Процедура УстановитьФлагТаблицыСоответствий(ЗначениеФлага)
	
	ТаблицаСоответствия = Объект.СоответствиеНоменклатуры.Выгрузить();
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.УстановитьФлагТаблицыСоответствий(ЗначениеФлага, ТаблицаСоответствия);
	Объект.СоответствиеНоменклатуры.Загрузить(ТаблицаСоответствия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныйДокументИзXMLЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВХранилище = Результат[0].Хранение;
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьТабличныйДокументИзXMLСервер(ДополнительныеПараметры.ДиалогВыбораФайла.ПолноеИмяФайла, 
	Объект.ОбработкаПреобразования, Объект.ТабличныйДокумент, АдресВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныйДокументИзТабличногоФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресВоВременномХранилище = Результат[0].Хранение;
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПрочитатьТабличныйДокумент(Объект.ТабличныйДокумент, ДополнительныеПараметры.ФайлНаДиске.Расширение, 
	ДополнительныеПараметры.ФайлНаДиске.ИмяБезРасширения, АдресВоВременномХранилище, Объект.Табуляция, Объект.Кодировка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиОткрытьФормуЗавершение(Настройка, ДополнительныеПараметры) Экспорт
	
	Если Настройка <> Неопределено Тогда
		
		ВыбраннаяНастройка = Настройка;
		ЗагрузитьНастройки(Настройка);
		
		ОбновлениеОтображенияНаКлиенте();
		НастройкиЗагруженыИзФайла = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого РезультирующееЗначение Из Результат Цикл
		Объект[РезультирующееЗначение.Ключ] = РезультирующееЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруОбработкаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("СоответствиеНоменклатуры", Объект.СоответствиеНоменклатуры);
	
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаДобавленияНоменклатуры",
		СтруктураПараметров,
		ЭтотОбъект,
		,,,
		Новый ОписаниеОповещения("СформироватьНоменклатуруОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		мЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПоНастройкеНаСервере(ТабличныйДокумент, Настройка, НомерКолонки)
	Возврат ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.СоздатьНоменклатуруПоНастройке(ТабличныйДокумент,
																				Настройка, 
																				НомерКолонки, 
																				Объект.СоответствиеНоменклатуры.Выгрузить(), 
																				ЭтотОбъект,
																				Объект.ПерваяСтрокаДанныхТабличногоДокумента);
КонецФункции

&НаКлиенте
Процедура СформироватьНоменклатуруПоНастройкеОбработкаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// Выберем настройку, по которой будем загружать
	СтруктураПараметров = СформироватьСтруктуруОтбораДляВыбораНастройки(Истина);
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("СформироватьНоменклатуруПоНастройкеОткрытьФормуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ФормаВыбора", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещенияОВыборе, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНоменклатуруПоНастройкеОткрытьФормуЗавершение(Настройка, ДополнительныеПараметры) Экспорт
	
	ЕстьЧтоЗагружать = Ложь;
	НайденнаяСтрока  = ДополнительныеПараметры.НайденнаяСтрока;
	
	Если Настройка <> Неопределено Тогда
		
		ЕстьЧтоЗагружать = СоздатьНоменклатуруПоНастройкеНаСервере(Объект.ТабличныйДокумент,
																				Настройка, 
																				НайденнаяСтрока.НомерКолонки);
		
	КонецЕсли;
	
	Если ЕстьЧтоЗагружать Тогда
		мЗагрузитьСоответствиеНоменклатуры(Объект.ТабличныйДокумент, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовШапкиВыражениеОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура изменения настройки ручной нумерации колонок настроек загрузки шапки документа
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонокНастройкиШапки()
	
	Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки = НЕ Объект.РучнаяНумерацияКолонокТабличногоДокументаДляШапки;
	
КонецПроцедуры

&НаСервере
Функция ЕстьОтмеченныеСтрокиВНастройкахШапки()
	
	Результат = ТаблицаЗагружаемыхРеквизитовШапки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() <> 0;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьФормуВыбораОбъектаМетаданных(Тип)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбъектМетаданных.Иерархический
		И ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			Возврат ОбъектМетаданных.ПолноеИмя() + ".ФормаВыбораГруппы";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораНоменклатурыПоСхожести(ТаблицаДанных, ДополнительныеПараметры) Экспорт
	
	Если ТаблицаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		Если СтрокаТаблицыДанных.Загружать Тогда
			
			СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаТаблицыДанных.НомерСтроки))[0];
			СтрокаСоответствия.Номенклатура = СтрокаТаблицыДанных.Номенклатура;
			
			Если ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (СтрокаСоответствия.Загружать) Тогда
				СтрокаСоответствия.Загружать = Ложь
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (НЕ СтрокаСоответствия.Загружать) Тогда
				СтрокаСоответствия.Загружать = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСопоставлениеПоШтрихкоду(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьСопоставлениеПоШтрихкодуСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСопоставлениеПоШтрихкодуСервер()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
	
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСТрока.Штрихкод) Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.НомерСтроки,
	|	ТаблицаДанных.ШтрихКод
	|ПОМЕСТИТЬ ВрТаблица
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаблица.НомерСтроки,
	|	ВрТаблица.ШтрихКод,
	|	ВЫРАЗИТЬ(ШтрихКоды.Владелец КАК Справочник.Номенклатура) КАК СопоставляемаяНоменклатура
	|ИЗ
	|	ВрТаблица КАК ВрТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	|		ПО ВрТаблица.ШтрихКод = ШтрихКоды.Штрихкод
	|ГДЕ
	|	ШтрихКоды.Владелец ССЫЛКА Справочник.Номенклатура";
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки))[0];
		СтрокаСоответствия.Номенклатура = Выборка.СопоставляемаяНоменклатура;
		
		Если ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Ложь
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (НЕ СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСопоставлениеПоНаименованию(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьСопоставлениеПоНаименованиюСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСопоставлениеПоНаименованиюСервер()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	
	Для Каждого ТекСтрока Из Объект.СоответствиеНоменклатуры Цикл
		Если ТекСтрока.Загружать И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСТрока.Наименование) Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.НомерСтроки,
	|	ТаблицаДанных.Наименование
	|ПОМЕСТИТЬ ВрТаблица
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаблица.НомерСтроки,
	|	ВрТаблица.Наименование,
	|	СпрНоменклатура.Ссылка КАК СопоставляемаяНоменклатура
	|ИЗ
	|	ВрТаблица КАК ВрТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВрТаблица.Наименование = СпрНоменклатура.Наименование
	|ГДЕ
	|	НЕ СпрНоменклатура.Ссылка ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки))[0];
		СтрокаСоответствия.Номенклатура = Выборка.СопоставляемаяНоменклатура;
		
		Если ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Ложь
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаСоответствия.Номенклатура) И (НЕ СтрокаСоответствия.Загружать) Тогда
			СтрокаСоответствия.Загружать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СоответствиеНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.Номенклатура = Результат;
	ТекущиеДанные.Загружать = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНоменклатурыДокумента(Документ, ДополнительныеПараметры) Экспорт
	
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьНесопоставленнаяНоменклатураДокумента(Документ) Тогда
		
		ПараметрыФормы = Новый Структура("КоллекцияСтрок, Документ", Объект.СоответствиеНоменклатуры, Документ);
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораПоДокументу", ЭтотОбъект);
		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораПоДокументу", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе  <"+Документ+"> не обнаружено несопоставленных номенклатур.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораПоДокументу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Для Каждого ТекСтрока Из Результат Цикл
			
			СтрокаСоответствия = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("НомерСтроки", ТекСтрока.НомерСтроки))[0];
			СтрокаСоответствия.Номенклатура = ТекСтрока.Номенклатура;
			СтрокаСоответствия.Загружать = Ложь
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьНесопоставленнаяНоменклатураДокумента(Документ)
	
	НоменклатурыЗаказа = Документ.Товары.ВыгрузитьКолонку("Номенклатура");
	
	Результат = Ложь;
	Для Каждого Номенклатура Из НоменклатурыЗаказа Цикл
		НаденныеСтроки = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Если НаденныеСтроки.Количество() = 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПрикладныхОбъектов()
	
	Элементы.ИмяСправочника.СписокВыбора.Очистить();
	Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Очистить();
	Элементы.ИмяВидаРегистра.СписокВыбора.Очистить();
	
	Картинка = БиблиотекаКартинок.СправочникОбъект; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхСправочник Из Метаданные.Справочники Цикл
		Если СтрНачинаетсяС(ОбъектМетаданныхСправочник.Имя, "Удалить") Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.ИмяСправочника.СписокВыбора.Добавить(
			ОбъектМетаданныхСправочник.Имя,
			ОбъектМетаданныхСправочник.Представление(),,
			Картинка);
		Если ОбъектМетаданныхСправочник.ТабличныеЧасти.Количество() > 0 Тогда
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(
				"Справочник." + ОбъектМетаданныхСправочник.Имя,
				ОбъектМетаданныхСправочник.Представление(),,
				Картинка);
		КонецЕсли;
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.ДокументОбъект;
	Для Каждого ОбъектМетаданныхДокумент Из Метаданные.Документы Цикл
		Если ОбъектМетаданныхДокумент.ТабличныеЧасти.Количество() > 0 Тогда
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(
				"Документ." + ОбъектМетаданныхДокумент.Имя,
				ОбъектМетаданныхДокумент.Представление(),,
				Картинка);
		КонецЕсли;
	КонецЦикла;
	
	МетаданныеПодчиненРегистратору = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору;
	Для Каждого ОбъектМетаданных Из Метаданные.РегистрыСведений Цикл
		Если НЕ ОбъектМетаданных.РежимЗаписи = МетаданныеПодчиненРегистратору
			И ОбъектМетаданных <> Метаданные.РегистрыСведений.СопутствующиеТовары Тогда
			Элементы.ИмяВидаРегистра.СписокВыбора.Добавить(ОбъектМетаданных.Имя, ОбъектМетаданных.Представление());
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ИмяСправочника.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	Элементы.ИмяПрикладногоОбъекта.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	Элементы.ИмяВидаРегистра.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
КонецПроцедуры

#КонецОбласти
