

								   
Функция ЕстьЧекНаВозврат()

	ПродажаБыла = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЧекККМ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	И ЧекККМ.Заказ = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПродажаБыла = Истина;
	КонецЦикла;
	
    Возврат ПродажаБыла;
	
КонецФункции // ()
Функция ИнтернетЗаказОплачен()

	ОплатаБыла = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ФактОплатыЗаказов.Сумма = ФактОплатыЗаказов.СуммаОплаты
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОплаченНаСайте
		|ИЗ
		|	РегистрСведений.ФактОплатыЗаказов КАК ФактОплатыЗаказов
		|ГДЕ
		|	ФактОплатыЗаказов.СчетНаОплату = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОплатаБыла = ВыборкаДетальныеЗаписи.ОплаченНаСайте;
	КонецЦикла;
	
    Возврат ОплатаБыла;
	
КонецФункции // ()
								   
								   
&После ("ОбработкаПроверкиЗаполнения")
Процедура _ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
	    Возврат;
	КонецЕсли;

	Если ос_СделатьВозвратАванса Тогда
		
		Если НЕ ИнтернетЗаказОплачен() Тогда
		
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данный заказ не оплачивался на сайте. Возврат не возможен.'"), ЭтотОбъект, "Статус",,Отказ);
		
		КонецЕсли; 
		
    	Если ЕстьЧекНаВозврат() Тогда
		
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Имеется пробитый закрывающий чек. Оформите чек возврата.'"), ЭтотОбъект, "Статус",,Отказ);
		
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ос_ДатаВозвратаАванса) Тогда
		
			ос_ДатаВозвратаАванса = ТекущаяДатаСеанса();
		
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры