
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.АнализСканированияШтрихкодов.Видимость = ПравоДоступа("Использование", Метаданные.Обработки.АнализСканированияШтрихкодовМДЛП);
	
	НастроитьФормуПриИзменииЭлементовУправления();
	
	// ИнтеграцияМДЛП.РазрешительныйРежим.
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим.ТСПИоТ") Тогда
			Элементы.НастройкиПодключенияТСПИоТ.Видимость = Истина;
			Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
				Элементы.НастройкиПодключенияТСПИоТ.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники["ТСПИоТ"]);
			КонецЕсли;
		Иначе
			Элементы.НастройкиПодключенияТСПИоТ.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаРазрешительныйРежимНастройки.Видимость = Ложь;
		Элементы.ГруппаРазрешительныйРежимСервис.Видимость = Ложь;
		Элементы.НастройкиПодключенияТСПИоТ.Видимость = Ложь;
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.РазрешительныйРежим.
	
	СобытияФормМДЛППереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ИнтеграцияМДЛП.РазрешительныйРежим.
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормРазрешительныйРежимМДЛПКлиент");
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент.ОбновитьПредставлениеАварийногоРежима(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.РазрешительныйРежим.
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ИнтеграцияМДЛП.РазрешительныйРежим.
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормРазрешительныйРежимМДЛПКлиент");
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент.ОбработатьОповещениеОбИзмененииАварийногоРежима(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.РазрешительныйРежим.
	
	СобытияФормМДЛПКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьРеестрВыбытияУпаковокМДЛППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьДанныеТолькоПриВыполненииОбменаМДЛППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗапускаМетодовАПИМДЛППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗапросаМетодовАПИПоУмолчаниюМДЛППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьКодыМаркировкиСредствамиАПИМДЛППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляСредствамиАПИМДЛПНастройкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиИсключенийКонтроляКМ(Элементы.КонтролироватьКодыМаркировкиСредствамиАПИМДЛП.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьКодыМаркировкиСредствамиРВПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляСредствамиРВНастройкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиИсключенийКонтроляКМ(Элементы.КонтролироватьКодыМаркировкиСредствамиРВ.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьКодыМаркировкиСредствамиККТПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляСредствамиККТНастройкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиИсключенийКонтроляКМ(Элементы.КонтролироватьКодыМаркировкиСредствамиККТ.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаОбновленияCDNПлощадокПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяБлокировкиCDNПлощадокПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтветаCDNПлощадокПриПробитииЧекаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияИдентификатораРазрешительногоРежимаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьАварийныйРежимОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	// ИнтеграцияМДЛП.РазрешительныйРежим.
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормРазрешительныйРежимМДЛПКлиент");
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент.ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.РазрешительныйРежим.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройкиГраницЗагрузкиДокументов(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ГраницаЗагрузкиДокументовМДЛП",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиГраницЗагрузкиОстатковПотребительскихУпаковок(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ГраницаЗагрузкиОстатковПотребительскихУпаковокМДЛП",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаОстатковМДЛП(Команда)
	
	ОткрытьФорму("Обработка.СверкаОстатковМДЛП.Форма.СверкаОстатков",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСоставТранспортныхУпаковок(Команда)
	
	ОткрытьФорму("Обработка.ПолучитьСоставТранспортныхУпаковокМДЛП.Форма.ПолучитьСоставТранспортныхУпаковок",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализСканированияШтрихкодовМДЛП(Команда)
	
	ОткрытьФорму("Обработка.АнализСканированияШтрихкодовМДЛП.Форма.АнализСканированияШтрихкодов",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрВыбытияМДЛП(Команда)
	
	ОткрытьФорму("Обработка.РеестрВыбытияМДЛП.Форма.РеестрВыбытия",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрРешенийОВводеЛПВОборот(Команда)
	
	ОткрытьФорму("Обработка.РеестрРешенийОВводеЛПВГражданскийОборот.Форма.РеестрРешенийОВводеЛПВОборот",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколОбменаМДЛП(Команда)
	
	ОткрытьФорму("Отчет.ПротоколОбменаМДЛП.Форма",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборочныйКонтрольКММДЛП(Команда)
	
	ОткрытьФорму("Обработка.ВыборочныйКонтрольКММДЛП.Форма.ВыборочныйКонтроль",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТокеныАвторизации(Команда)
	
	ОткрытьФорму("РегистрСведений.ДанныеКлючаСессииМДЛП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокCDNПлощадок(Команда)
	
	ОткрытьФорму("РегистрСведений.СостоянияCDNПлощадокМДЛП.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияКЛокальномуМодулюРазрешительногоРежима(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияТСПИоТ(Команда)
	
	Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
		ОткрытьФорму("Справочник.ТСПИоТ.Форма.ФормаСписка", , ЭтотОбъект);
	Иначе
		ОткрытьФорму("РегистрСведений.НастройкиПодключенияТСПИоТМДЛП.Форма.ФормаСписка", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормМДЛПКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	Элемент = Элементы[ИмяЭлемента];
	
	РеквизитПутьКДанным = Элемент.ПутьКДанным;
	
	Если ЭлементВходитВГруппу(Элемент, Элементы.ГруппаКонтрольКМ) Тогда
		КонстантаИмя = СохранитьНастройкиКонтроляКМ(РеквизитПутьКДанным);
	ИначеЕсли ЭлементВходитВГруппу(Элемент, Элементы.ГруппаРазрешительныйРежимНастройки) Тогда
		КонстантаИмя = СохранитьНастройкиРазрешительногоРежима(РеквизитПутьКДанным);
	Иначе
		КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	КонецЕсли;
	
	НастроитьФормуПриИзменииЭлементовУправления(ИмяЭлемента);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если СтрНачинаетсяС(НРег(РеквизитПутьКДанным), НРег("НаборКонстант.")) Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура НастроитьФормуПриИзменииЭлементовУправления(ИмяЭлемента = "")
	
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		
		Элемент = Элементы[ИмяЭлемента];
		РеквизитПутьКДанным = Элемент.ПутьКДанным;
		ЭлементВходитВГруппуКонтрольКМ          = ЭлементВходитВГруппу(Элемент, Элементы.ГруппаКонтрольКМ);
		ЭлементВходитВГруппуРазрешительныйРежим = ЭлементВходитВГруппу(Элемент, Элементы.ГруппаРазрешительныйРежимНастройки);
		
	Иначе
		
		РеквизитПутьКДанным = "";
		ЭлементВходитВГруппуКонтрольКМ = Истина;
		ЭлементВходитВГруппуРазрешительныйРежим = Истина;
		
	КонецЕсли;
	
	Если ЭлементВходитВГруппуКонтрольКМ Тогда
		ПрочитатьНастройкиКонтроляКМ(РеквизитПутьКДанным);
	КонецЕсли;
	
	Если ЭлементВходитВГруппуРазрешительныйРежим Тогда
		ПрочитатьНастройкиРазрешительногоРежима(РеквизитПутьКДанным);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭлементВходитВГруппу(Элемент, Группа)
	
	ПроверяемыеРодители = Новый Массив;
	ПроверяемыеРодители.Добавить(Элемент.Родитель);
	
	Пока ПроверяемыеРодители.Количество() > 0 Цикл
		
		Родитель = ПроверяемыеРодители[0];
		ПроверяемыеРодители.Удалить(0);
		
		Если Родитель = Группа Тогда
			Возврат Истина;
		ИначеЕсли Родитель = Неопределено Или Родитель = ЭтотОбъект Тогда
			Возврат Ложь;
		Иначе
			ПроверяемыеРодители.Добавить(Родитель.Родитель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#Область НастройкиСканированияКодовМаркировки

&НаСервере
Функция СохранитьНастройкиКонтроляКМ(РеквизитПутьКДанным)
	
	КонстантаИмя = Метаданные.Константы.НастройкиКонтроляКодовМаркировкиМДЛП.Имя;
	
	КлючГруппыНастроекКонтроляКМ = КлючГруппыНастроекКонтроляКМ(РеквизитПутьКДанным);
	Если КлючГруппыНастроекКонтроляКМ <> Неопределено Тогда
		
		Успех = КонтрольКодовМаркировкиМДЛП.УстановитьИспользованиеНастройкиКонтроляКМ(КлючГруппыНастроекКонтроляКМ, ЭтотОбъект[РеквизитПутьКДанным]);
		Если Не Успех Тогда
			ЭтотОбъект[РеквизитПутьКДанным] = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиКонтроляКМ(РеквизитПутьКДанным = "")
	
	Если ЗначениеЗаполнено(РеквизитПутьКДанным) Тогда
		Реквизиты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитПутьКДанным);
	Иначе
		Реквизиты = Новый Массив;
		Для Каждого КлючИЗначение Из СоответствияКлючейГруппНастроекКонтроляКМРеквизитамФормы() Цикл
			Реквизиты.Добавить(КлючИЗначение.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИмяРеквизит Из Реквизиты Цикл
		
		КлючГруппыНастроекКонтроляКМ = КлючГруппыНастроекКонтроляКМ(ИмяРеквизит);
		Если КлючГруппыНастроекКонтроляКМ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ГруппаНастроек = КонтрольКодовМаркировкиМДЛПКлиентСервер.ЗначениеГруппыНастроекКонтроляКМ(, КлючГруппыНастроекКонтроляКМ);
		ЭтотОбъект[ИмяРеквизит] = ГруппаНастроек.Включено;
		
		ЭлементФормыНастройка = Элементы[КлючГруппыНастроекКонтроляКМ];
		ЭлементФормыНастройка.Доступность = ГруппаНастроек.Включено;
		
		ПредставлениеИсключений = КонтрольКодовМаркировкиМДЛП.ПредставлениеИсключенийГруппыНастроекКонтроляКМ(ГруппаНастроек);
		Если ЗначениеЗаполнено(ПредставлениеИсключений) Тогда
			Если СтрДлина(ПредставлениеИсключений) > 40 Тогда
				ЭлементФормыНастройка.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Настроить исключения'"),,,, "Перейти");
			Иначе
				ЭлементФормыНастройка.Заголовок = Новый ФорматированнаяСтрока(ПредставлениеИсключений,,,, "Перейти");
			КонецЕсли;
		Иначе
			ЭлементФормыНастройка.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = '<Все операции>'"),,,, "Перейти");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КлючГруппыНастроекКонтроляКМ(РеквизитПутьКДанным)
	
	Возврат СоответствияКлючейГруппНастроекКонтроляКМРеквизитамФормы().Получить(РеквизитПутьКДанным);
	
КонецФункции

&НаСервере
Функция СоответствияКлючейГруппНастроекКонтроляКМРеквизитамФормы()
	
	ГруппыНастроекКонтроляКМ = КонтрольКодовМаркировкиМДЛПКлиентСервер.ГруппыНастроекКонтроляКМ();
	
	Результат = Новый Соответствие;
	Результат.Вставить(Элементы.КонтролироватьКодыМаркировкиСредствамиАПИМДЛП.ПутьКДанным, ГруппыНастроекКонтроляКМ.ПараметрыКонтроляСредствамиАПИМДЛП);
	Результат.Вставить(Элементы.КонтролироватьКодыМаркировкиСредствамиРВ.ПутьКДанным, ГруппыНастроекКонтроляКМ.ПараметрыКонтроляСредствамиРВ);
	Результат.Вставить(Элементы.КонтролироватьКодыМаркировкиСредствамиККТ.ПутьКДанным, ГруппыНастроекКонтроляКМ.ПараметрыКонтроляСредствамиККТ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастройкиИсключенийКонтроляКМ(РеквизитПутьКДанным)
	
	КлючГруппыНастроекКонтроляКМ = КлючГруппыНастроекКонтроляКМ(РеквизитПутьКДанным);
	Если КлючГруппыНастроекКонтроляКМ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючГруппыНастроекКонтроляКМ", КлючГруппыНастроекКонтроляКМ);
	
	Оповещение = Новый ОписаниеОповещения("НастройкаИсключенийЗавершение", ЭтотОбъект, РеквизитПутьКДанным);
	
	ОткрытьФорму(
		"Обработка.ПанельМаркировкиМДЛП.Форма.НастройкиИсключенийКонтроляКодовМаркировки",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИсключенийЗавершение(Результат, РеквизитПутьКДанным) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьНастройкиКонтроляКМ(РеквизитПутьКДанным);
	
КонецПроцедуры

#КонецОбласти // НастройкиСканированияКодовМаркировки

#Область НастройкиРазрешительногоРежима

&НаСервере
Функция СохранитьНастройкиРазрешительногоРежима(РеквизитПутьКДанным)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		Возврат "";
	КонецЕсли;
	
	// Имя получено напрямую, т.к. может не быть внедрена подсистема ИнтеграцияМДЛП.РазрешительныйРежим.
	КонстантаИмя = "НастройкиРазрешительногоРежимаМДЛП";
	
	МодульРазрешительныйРежимМДЛПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("РазрешительныйРежимМДЛПКлиентСервер");
	МодульРазрешительныйРежимМДЛП = ОбщегоНазначения.ОбщийМодуль("РазрешительныйРежимМДЛП");
	
	Настройки = МодульРазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежима();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Настройки, РеквизитПутьКДанным)
		И Настройки[РеквизитПутьКДанным] <> ЭтотОбъект[РеквизитПутьКДанным] Тогда
		
		Настройки[РеквизитПутьКДанным] = ЭтотОбъект[РеквизитПутьКДанным];
		
		МодульРазрешительныйРежимМДЛП.УстановитьНастройкиРазрешительногоРежима(Настройки);
		
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиРазрешительногоРежима(РеквизитПутьКДанным = "")
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		Возврат;
	КонецЕсли;
	
	МодульРазрешительныйРежимМДЛПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("РазрешительныйРежимМДЛПКлиентСервер");
	
	Настройки = МодульРазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежима();
	
	Если ЗначениеЗаполнено(РеквизитПутьКДанным) Тогда
		Реквизиты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитПутьКДанным);
	Иначе
		Реквизиты = Новый Массив;
		Для Каждого КлючИЗначение Из Настройки Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, КлючИЗначение.Ключ) Тогда
				Реквизиты.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИмяРеквизит Из Реквизиты Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Настройки, ИмяРеквизит)
			И Настройки[ИмяРеквизит] <> ЭтотОбъект[ИмяРеквизит] Тогда
			
			ЭтотОбъект[ИмяРеквизит] = Настройки[ИмяРеквизит];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // НастройкиРазрешительногоРежима

#КонецОбласти
