
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если НЕ Параметры.Свойство("Выражение") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
	УстановитьНадписьТекстВыражения();
	ПолеТекстовогоДокумента.УстановитьТекст(Параметры.Выражение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(ПолеТекстовогоДокумента.ПолучитьТекст());
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает текст надписи текста выражения
//
&НаСервере
Процедура УстановитьНадписьТекстВыражения()
	
	НадписьТекстВыражения =
	"В тексте выражения можно использовать следующие предопределенные параметры:
	|   Результат      - результат вычисления (на входе - значение по умолчанию)
	|   ТекстЯчейки    - текст текущей ячейки
	|   ТекстыЯчеек    - массив текстов ячеек строки
	|   ТекущиеДанные  - структура загруженных значений
	|   флКонтрольЗаполнения - флаг запрета создания новых элементов
	|   ДокументОбъект - документ для загрузки данных
	|Встроенные функции, функции общих модулей.";
	
КонецПроцедуры // УстановитьНадписьТекстВыражения()

#КонецОбласти
