#Область ПрограммныйИнтерфейс

// Возвращает прочитанный макет указанного в параметрах классификатора.
//
// Параметры:
//  Классификатор	 - Строка	 - наименование справочника, для которого требуется получить классификатор;
//  Макет			 - Строка	 - наименование макета в справочнике, в котором хранятся данные классификатора;
// 
// Возвращаемое значение:
//  Произвольный - данные классификатора.
//
Функция ПолучитьДанныеКлассификатора(Классификатор, Макет = "Классификатор") Экспорт
	
	Если Классификатор = "ор_ЛекарственныеФормы" И Макет = "Классификатор" Тогда
		
		Возврат ор_РаботаСКлассификаторами.СформироватьДеревоЛекарственныхФорм();
		
	ИначеЕсли Классификатор = "ор_КлассификаторАТХ" И Макет = "Классификатор" Тогда
		
		Возврат ор_РаботаСКлассификаторами.СформироватьДеревоКлассификаторовATX();
		
	ИначеЕсли Классификатор = "ор_ДВЛП" И Макет = "Классификатор" Тогда
		
		Возврат ор_РаботаСКлассификаторами.СформироватьДеревоДВЛП();
		
	ИначеЕсли Классификатор = "ор_ФТГ" И Макет = "Классификатор" Тогда
		
		Возврат ор_РаботаСКлассификаторами.СформироватьДеревоФТГ();
		
	КонецЕсли;
	
	Макет = Справочники[Классификатор].ПолучитьМакет(Макет);
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
	
	Возврат СериализаторXDTO.ПрочитатьXML(Чтение);
	
КонецФункции

#КонецОбласти
