
#Область СлужебныеПроцедурыИФункции

// Формирует значение тега 1265 (ЗначениеРеквизита) параметров фискализации для целей МДЛП.
//
// Параметры:
//  ЗначениеОтраслевогоРеквизита			 - Строка	 - значение, для заполнения параметра ЗначениеРеквизита (тег 1265)
//       тега 1260 (ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОтраслевойРеквизит).
//  ЭлементПроверки - Структура - данные проверки КМ:
//      * РазрешительныйРежимИдентификаторЗапроса		 - Строка	 - идентификатор запроса разрешительного режима.
//      * РазрешительныйРежимВременнаяМетка				 - Строка	 - дата запроса разрешительного режима.
//      * РазрешительныйРежимИдентификаторЭкземпляраПО	 - Строка	 - идентификатор локального модуля.
//      * РазрешительныйРежимВерсияБазы					 - Строка	 - идентификатор базы данных локального модуля.
// 
// Возвращаемое значение:
//  ЗначениеОтраслевогоРеквизита - Строка - значение, для заполнения параметра ЗначениеРеквизита (тег 1265)
//        тега 1260 (ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОтраслевойРеквизит).
//
Функция ОбновитьЗначениеОтраслевогоРеквизитаМДЛП(ЗначениеОтраслевогоРеквизита, ЭлементПроверки) Экспорт
	
	ИмяРеквизита_ИдентификаторРазрешительногоРежима = "UUID";
	ИмяРеквизита_ДатаРазрешительногоРежима          = "Time";
	ИмяРеквизита_ИдентификаторЭкземпляраПО          = "Inst";
	ИмяРеквизита_ВерсияБазыЧерногоСписка            = "Ver";
	Разделитель                                     = "&";
	
	Если ПустаяСтрока(ЭлементПроверки.РазрешительныйРежимИдентификаторЗапросаГИСМТ)
		И СтрНайти(ЗначениеОтраслевогоРеквизита, ИмяРеквизита_ИдентификаторРазрешительногоРежима) = 0 Тогда
		Возврат ЗначениеОтраслевогоРеквизита;
	КонецЕсли;
	
	СоставЗначенияОтраслевогоРеквизита = СтрРазделить(ЗначениеОтраслевогоРеквизита, Разделитель, Ложь);
	
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого ТекущаяСтрока Из СоставЗначенияОтраслевогоРеквизита Цикл
		Если СтрНачинаетсяС(ТекущаяСтрока, СтрШаблон("%1=", ИмяРеквизита_ИдентификаторРазрешительногоРежима))
			Или СтрНачинаетсяС(ТекущаяСтрока, СтрШаблон("%1=", ИмяРеквизита_ДатаРазрешительногоРежима))
			Или СтрНачинаетсяС(ТекущаяСтрока, СтрШаблон("%1=", ИмяРеквизита_ИдентификаторЭкземпляраПО))
			Или СтрНачинаетсяС(ТекущаяСтрока, СтрШаблон("%1=", ИмяРеквизита_ВерсияБазыЧерногоСписка)) Тогда
			МассивСтрокКУдалению.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из МассивСтрокКУдалению Цикл
		ИндексЭлемента = СоставЗначенияОтраслевогоРеквизита.Найти(ТекущаяСтрока);
		Если ИндексЭлемента <> Неопределено Тогда
			СоставЗначенияОтраслевогоРеквизита.Удалить(ИндексЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ЭлементПроверки.РазрешительныйРежимИдентификаторЗапросаГИСМТ) Тогда
		СоставЗначенияОтраслевогоРеквизита.Добавить(СтрШаблон("%1=%2",
			ИмяРеквизита_ИдентификаторРазрешительногоРежима, ЭлементПроверки.РазрешительныйРежимИдентификаторЗапросаГИСМТ));
		СоставЗначенияОтраслевогоРеквизита.Добавить(СтрШаблон("%1=%2",
			ИмяРеквизита_ДатаРазрешительногоРежима, ЭлементПроверки.РазрешительныйРежимДатаЗапросаГИСМТ));
		
		Если ЗначениеЗаполнено(ЭлементПроверки.РазрешительныйРежимИдентификаторЭкземпляраПО)
			И ЗначениеЗаполнено(ЭлементПроверки.РазрешительныйРежимВерсияБазы) Тогда
			СоставЗначенияОтраслевогоРеквизита.Добавить(СтрШаблон("%1=%2",
				ИмяРеквизита_ИдентификаторЭкземпляраПО,
				ЭлементПроверки.РазрешительныйРежимИдентификаторЭкземпляраПО));
			СоставЗначенияОтраслевогоРеквизита.Добавить(СтрШаблон("%1=%2",
				ИмяРеквизита_ВерсияБазыЧерногоСписка,
				ЭлементПроверки.РазрешительныйРежимВерсияБазы));
		КонецЕсли;
	КонецЕсли;
	
	НовоеЗначениеОтраслевогоРеквизита = СтрСоединить(СоставЗначенияОтраслевогоРеквизита, Разделитель);
	// Завершающий символ
	НовоеЗначениеОтраслевогоРеквизита = НовоеЗначениеОтраслевогоРеквизита + Разделитель;
	
	Возврат НовоеЗначениеОтраслевогоРеквизита;
	
КонецФункции

#Область ОбновлениеСтатусаНомеровУпаковок

Процедура ОбновитьСтатусыЗаполненияНомеровУпаковок(Объект, 
	ИмяТЧТовары = "Запасы", 
	ИмяТЧСерии = "ор_НомераУпаковок", 
	ИмяТЧСоставТУ = "ор_СоставТранспортныхУпаковок") Экспорт
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧТовары] Цикл
		ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, СтрокаТЧ, ИмяТЧСерии, ИмяТЧСоставТУ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСтатусЗаполненияУпаковокВСтроке(Объект, 
	ТекущиеДанные, 
	ИмяТЧСерии = "ор_НомераУпаковок", 
	ИмяТЧСоставТУ = "ор_СоставТранспортныхУпаковок") Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ИспользоватьНомераУпаковок Тогда
		ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 0;
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки);
	КоличествоНомеров = Объект[ИмяТЧСерии].НайтиСтроки(ПараметрыОтбора).Количество();
	
	// транспортные упаковки
	КоличествоСоставаТранспортных = 0;
	ЕстьСоставТранспортных = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяТЧСоставТУ);
	Если ЕстьСоставТранспортных Тогда
		
		ПараметрыОтбораСостава = Новый Структура("ИдентификаторСтрокиТовара", ТекущиеДанные.ор_ИдентификаторСтроки);
		НайденныеСтрокиСостава = Объект[ИмяТЧСоставТУ].НайтиСтроки(ПараметрыОтбораСостава);
		
		Для Каждого СтрокаСостава Из НайденныеСтрокиСостава Цикл
			КоличествоСоставаТранспортных = КоличествоСоставаТранспортных + СтрокаСостава.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоНомеров = КоличествоНомеров + КоличествоСоставаТранспортных;
	
	ЕстьКоличествоУпаковок = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "КоличествоУпаковок");
	ЕстьЕдиницаИзмерения = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ЕдиницаИзмерения");
	
	Если ЕстьЕдиницаИзмерения
		И ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения)
		И ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		КоличествоВСтоке = ТекущиеДанные.Количество * ор_ИнтеграцияМДЛП.ПолучитьКоэффициентЕдиницыИзмерения(ТекущиеДанные.ЕдиницаИзмерения);
	Иначе
		КоличествоВСтоке = ТекущиеДанные.Количество;
	КонецЕсли;
	
	Если КоличествоНомеров = 0 Тогда
		ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 2;
	ИначеЕсли ЕстьКоличествоУпаковок
		И ТекущиеДанные.КоличествоУпаковок >= 1
		И ТекущиеДанные.КоличествоУпаковок - Цел(ТекущиеДанные.КоличествоУпаковок) = 0
		И ТекущиеДанные.КоличествоУпаковок > ТекущиеДанные.Количество
		И ТекущиеДанные.Количество > 0 И ТекущиеДанные.Количество < 1.05 И КоличествоНомеров = 1 Тогда
		ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 1;
	ИначеЕсли ЕстьЕдиницаИзмерения
		И ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения)
		И ТипЗнч(ТекущиеДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения")
		И ТекущиеДанные.Количество >= 1
		И ТекущиеДанные.Количество - Цел(ТекущиеДанные.Количество) = 0
		И ТекущиеДанные.Количество > КоличествоВСтоке
		И КоличествоВСтоке > 0 И КоличествоВСтоке < 1.05 И КоличествоНомеров = 1 Тогда
		ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 1;
	ИначеЕсли КоличествоНомеров = КоличествоВСтоке Тогда
		ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 1;
	Иначе
		ТекущиеДанные.ор_СтатусЗаполненияУпаковок = 2;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуНомераУпаковки(Объект, ТекущаяСтрока, ПараметрыФормыУказания, СтруктураПараметров) Экспорт
	
	ИмяТЧТовары = ПараметрыФормыУказания.ИмяТЧТовары;
	ИмяТЧСерии  = ПараметрыФормыУказания.ИмяТЧСерии;
	
	ДанныеМаркировкиМДЛП = Неопределено;
	
	Если СтруктураПараметров.Свойство("ДанныеМаркировкиМДЛП") Тогда
		ДанныеМаркировкиМДЛП = СтруктураПараметров.ДанныеМаркировкиМДЛП;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("sgtin") Тогда
		ДанныеМаркировкиМДЛП = СтруктураПараметров;
	КонецЕсли;
	
	Если ДанныеМаркировкиМДЛП = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущаяСтрока.ИспользоватьНомераУпаковок Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("НомерКиЗ,ИдентификаторСтроки", ДанныеМаркировкиМДЛП.sgtin, ТекущаяСтрока.ор_ИдентификаторСтроки)).Количество() > 0 Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Номер упаковки %1 уже присутствует в документе'"), ДанныеМаркировкиМДЛП.sgtin);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	// Ищем киз в строках других товаров
	НайденныеСтрокиSGTIN = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("НомерКиЗ", ДанныеМаркировкиМДЛП.sgtin));
	Если НайденныеСтрокиSGTIN.Количество() > 0 Тогда
		Для Каждого СтрокаSGTIN Из НайденныеСтрокиSGTIN Цикл
			Если Объект[ИмяТЧТовары].НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", СтрокаSGTIN.ИдентификаторСтроки)).Количество() > 0 Тогда
				ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Номер упаковки %1 уже присутствует в документе'"), ДанныеМаркировкиМДЛП.sgtin);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Проверяем GTIN по уже добавленным строкам
	НайденныеСтроки = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ор_ИдентификаторСтроки));
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаКиза = НайденныеСтроки[0];
		СтрокаКизаGTIN = Лев(СтрокаКиза.НомерКиЗ,14);
		Если ЗначениеЗаполнено(СтрокаКиза.НомерКиЗ) И СтрокаКизаGTIN <> ДанныеМаркировкиМДЛП.GTIN Тогда
			ТекстПредупреждения = НСтр("ru = 'GTIN %GTIN% отсканированного кода не соответствует GTIN %GTIN1% добавленных номеров упаковок для строки найденного товара.'");
			ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%GTIN%", ДанныеМаркировкиМДЛП.GTIN);
			ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%GTIN1%", СтрокаКизаGTIN);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НоваяСтрока = Объект[ИмяТЧСерии].Добавить();
	НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрока.ор_ИдентификаторСтроки;
	НоваяСтрока.НомерКиЗ            = ДанныеМаркировкиМДЛП.sgtin;
	ор_ИнтеграцияМДЛПКлиентСервер.ДобавитьПолныйКодМаркировки(НоваяСтрока, ДанныеМаркировкиМДЛП);
	
	Если ДанныеМаркировкиМДЛП.Свойство("РазрешительныйРежимИдентификаторЗапросаГИСМТ") Тогда
		НоваяСтрока.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ДанныеМаркировкиМДЛП.РазрешительныйРежимИдентификаторЗапросаГИСМТ;
		НоваяСтрока.РазрешительныйРежимДатаЗапросаГИСМТ          = ДанныеМаркировкиМДЛП.РазрешительныйРежимДатаЗапросаГИСМТ;
	КонецЕсли;
	Если ДанныеМаркировкиМДЛП.Свойство("РазрешительныйРежимИдентификаторЭкземпляраПО") Тогда
		НоваяСтрока.РазрешительныйРежимИдентификаторЭкземпляраПО = ДанныеМаркировкиМДЛП.РазрешительныйРежимИдентификаторЭкземпляраПО;
		НоваяСтрока.РазрешительныйРежимВерсияБазы                = ДанныеМаркировкиМДЛП.РазрешительныйРежимВерсияБазы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакИспользоватьНомераУпаковок(Объект, ИмяТЧТовары = "Запасы", ЗапретитьВводНомеров = Ложь) Экспорт
	
	ИспользоватьНомераУпаковок = Истина;
	
	Если ЗапретитьВводНомеров Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если Не ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧТовары] Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ор_ИдентификаторСтроки) Тогда
			СтрокаТЧ.ор_ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ИспользоватьНомераУпаковок И ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
			СтрокаТЧ.ИспользоватьНомераУпаковок = ор_ИнтеграцияМДЛП.ПолучитьФлагМаркируемогоТовараХарактеристики(СтрокаТЧ.Характеристика);
		Иначе
			СтрокаТЧ.ИспользоватьНомераУпаковок = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакИспользоватьНомераУпаковокВСтроке(СтрокаТЧ, ЗапретитьВводНомеров = Ложь) Экспорт
	
	ИспользоватьНомераУпаковок = Истина;
	
	Если ЗапретитьВводНомеров Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если Не ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.ор_ИдентификаторСтроки) Тогда
		СтрокаТЧ.ор_ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	Если ИспользоватьНомераУпаковок И ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
		СтрокаТЧ.ИспользоватьНомераУпаковок = ор_ИнтеграцияМДЛП.ПолучитьФлагМаркируемогоТовараХарактеристики(СтрокаТЧ.Характеристика);
	Иначе
		СтрокаТЧ.ИспользоватьНомераУпаковок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеРеквизитымдлпВСтрокеТЧ(СтрокаТЧ, СтруктураДанные) Экспорт
	
	СписокСвойств = "
		|ИспользоватьНомераУпаковок";
	
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураДанные, СписокСвойств);
	
	ЕстьИдентификаторСтроки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "ор_ИдентификаторСтроки");
	
	Если ЕстьИдентификаторСтроки И Не ЗначениеЗаполнено(СтрокаТЧ.ор_ИдентификаторСтроки) Тогда
		СтрокаТЧ.ор_ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПолучитьСтруктуруЗаполненияПризнакаИспользоватьНомераУпаковокВСтрокеТЧ(Объект, ЗапретитьВводНомеров = Ложь, ОбновлятьGTIN = Истина) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЗапретитьВводНомеров", ЗапретитьВводНомеров);
	СтруктураВозврата.Вставить("ОбновлятьGTIN", ОбновлятьGTIN);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция РазобратьШтрихкодПоТипу(Штрихкод, ВыводитьСообщение = Истина) Экспорт
	
	Если НЕ ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	ДанныеШтрихкодов = Новый Массив;
	ДанныеШтрихкодов.Добавить(Новый Структура("Штрихкод", Штрихкод));
	
	ДанныеШтрихкодовПоТипам = ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодыПоТипам(ДанныеШтрихкодов, ВыводитьСообщение);
	
	СтруктураВозврата = Новый Структура;
	
	Если ДанныеШтрихкодовПоТипам.НомераКиЗ.Количество() > 0 Тогда
		
		СтруктураВозврата.Вставить("МаркированныйТовар");
		СтруктураВозврата.Вставить("Данные", ДанныеШтрихкодовПоТипам.НомераКиЗ[0]);
		СтруктураВозврата.Данные.ШтрихкодBase64 = СтрЗаменить(СтруктураВозврата.Данные.ШтрихкодBase64, Символы.ВК, "");
		СтруктураВозврата.Данные.ШтрихкодBase64 = СтрЗаменить(СтруктураВозврата.Данные.ШтрихкодBase64, Символы.ПС, "");
		
	ИначеЕсли ДанныеШтрихкодовПоТипам.НомераТранспортныхУпаковок.Количество() > 0 Тогда
		
		СтруктураВозврата.Вставить("ГрупповаяУпаковка");
		СтруктураВозврата.Вставить("Данные", ДанныеШтрихкодовПоТипам.НомераТранспортныхУпаковок[0]);
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ДобавитьПолныйКодМаркировки(ТекущиеДанные, ДанныеМаркировкиМДЛП) Экспорт
	
	ЕстьПолныйКодМаркировки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ПолныйКодМаркировки");
	
	Если НЕ ЕстьПолныйКодМаркировки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьКриптоХвостВДанныхМаркировки(ДанныеМаркировкиМДЛП) Тогда
		ТекущиеДанные.ПолныйКодМаркировки = ДанныеМаркировкиМДЛП.ШтрихкодBase64;
	Иначе
		ТекущиеДанные.ПолныйКодМаркировки = "";
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьКриптоХвостВДанныхМаркировки(ДанныеМаркировкиМДЛП) Экспорт
	
	ЕстьКриптоЗащита91 = Ложь;
	ЕстьКриптоЗащита92 = Ложь;
	Если ДанныеМаркировкиМДЛП.Свойство("ДанныеШтрихкода") Тогда
		Для Каждого СтрокаМассива Из ДанныеМаркировкиМДЛП.ДанныеШтрихкода Цикл
			Если СтрокаМассива.ИдентификаторПрименения = "91" И ЗначениеЗаполнено(СтрокаМассива.Значение) Тогда
				ЕстьКриптоЗащита91 = Истина;
			ИначеЕсли СтрокаМассива.ИдентификаторПрименения = "92" И ЗначениеЗаполнено(СтрокаМассива.Значение) Тогда
				ЕстьКриптоЗащита92 = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьКриптоЗащита91 И ЕстьКриптоЗащита92;
	
КонецФункции

Процедура ОбработатьИзменениеСтрокиПоПараметрамЗаполнения(ТекущаяСтрока, ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.ПересчитатьКоличествоУпаковок Тогда
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество/ор_ИнтеграцияМДЛП.ПолучитьКоэффициентЕдиницыИзмерения(ТекущаяСтрока.Упаковка);
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ПересчитатьКоличествоЕдиниц Тогда
		ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок * ор_ИнтеграцияМДЛП.ПолучитьКоэффициентЕдиницыИзмерения(ТекущаяСтрока.Упаковка);
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ПересчитатьСумму Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.КоличествоУпаковок;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ПересчитатьКоличествоЕдиниц Тогда
		Попытка
			ТекСумма = ТекущаяСтрока.Сумма;
			ТекЦена  = ТекущаяСтрока.Цена;
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.КоличествоУпаковок;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ПересчитатьЦену Тогда
		Если ТекущаяСтрока.КоличествоУпаковок = 0 Тогда
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма;
		Иначе
			ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.Сумма / ТекущаяСтрока.КоличествоУпаковок, 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеРеквизитыНоменклатуры(ТекущаяСтрока) Экспорт
	
	// Заполняем служебные реквизиты
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов = УправлениеНебольшойФирмойВызовСервера.ЗначенияРеквизитовОбъекта(
		ТекущаяСтрока.Номенклатура,
		"ЕдиницаИзмерения, ИспользоватьХарактеристики",
		Истина);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Упаковка") Тогда
		ТекущаяСтрока.Упаковка = СтруктураРеквизитов.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ХарактеристикиИспользуются") Тогда
		ТекущаяСтрока.ХарактеристикиИспользуются = СтруктураРеквизитов.ИспользоватьХарактеристики;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыФормыУказанияМДЛП() Экспорт
	
	ПараметрыФормыУказания = Новый Структура();
	
	ПараметрыФормыУказания.Вставить("ИмяТЧТовары"  , "Запасы");
	ПараметрыФормыУказания.Вставить("ИмяТЧСерии"   , "ор_НомераУпаковок");
	ПараметрыФормыУказания.Вставить("ИмяТЧТУ"      , "ор_ТранспортныеУпаковки");
	ПараметрыФормыУказания.Вставить("ИмяТЧСоставТУ", "ор_СоставТранспортныхУпаковок");
	ПараметрыФормыУказания.Вставить("ТекущиеДанныеИдентификатор");
	
	Возврат ПараметрыФормыУказания;
	
КонецФункции


Функция КодСоответствуетАлфавитуSGTIN(НомерКИЗ, НедопустимыеСимволы) Экспорт
	
	// !-"%-/0-9A-Z_a-z
	Алфавит = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!”""%&’'()*+,-./_:;=<>?";
	
	ДлинаКода = СтрДлина(НомерКИЗ);
	
	Индекс = 1;
	Пока Индекс <= ДлинаКода Цикл
		
		ПроверяемыйСимвол = Сред(НомерКИЗ, Индекс, 1);
		
		Если СтрНайти(Алфавит, ПроверяемыйСимвол) = 0 Тогда
			НедопустимыеСимволы = ПроверяемыйСимвол;
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоGTIN(Штрихкод) Экспорт
	
	Если СтрДлина(Штрихкод) <> 14 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипШтрихкодаСтрокой = МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(Штрихкод);
	
	Если ТипШтрихкодаСтрокой = "ITF14" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти
