
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//   см. справочную информацию по событиям управляемой формы.
//  Отказ - Булево - признак отказа;
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартных действий;
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаСписка" Тогда
		ИспользуетсяМДЛП = ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки();
		Форма.Элементы.ОткрытьПанельМаркировкиМДЛП.Видимость = ИспользуетсяМДЛП;
		Форма.Элементы.ПолучитьСоставТранспортныхУпаковок.Видимость = ИспользуетсяМДЛП;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Документ.ОприходованиеЗапасов.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Документ.СписаниеЗапасов.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "ЖурналДокументов.ЧекиККМ.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Документ.ор_ИзготовлениеЛекарственныхФорм.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Документ.КомплектацияЗапасов.Форма.ФормаСписка" Тогда
		
		Форма.Элементы.СтатусМДЛП.Видимость = ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки();
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ОприходованиеЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПриходныйОрдер.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходныйОрдер.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.СписаниеЗапасов.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ор_ИзготовлениеЛекарственныхФорм.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.КомплектацияЗапасов.Форма.ФормаДокумента" Тогда
		
		ЕстьТранспортныеУпаковки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ор_ТранспортныеУпаковки");
		ЕстьСоставТранспортныхУпаковок = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ор_СоставТранспортныхУпаковок");
		
		ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов = ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки();
		ИспользоватьХарактеристикиНоменклатур                      = ИнтеграцияМДЛППереопределяемый.ИспользоватьХарактеристикиНоменклатуры();
		
		ЭтоПеремещениеПоОрдеру = Ложь;
		Если Форма.ИмяФормы = "Документ.ПриходныйОрдер.Форма.ФормаДокумента"
			ИЛИ Форма.ИмяФормы = "Документ.РасходныйОрдер.Форма.ФормаДокумента" Тогда
			ЭтоПеремещениеПоОрдеру = ЗначениеЗаполнено(Форма.Объект.ДокументОснование) И ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеЗапасов");
		КонецЕсли;
		
		Форма.Элементы.ЗапасыМаркировкаМДЛП.Видимость           = ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов И НЕ ЭтоПеремещениеПоОрдеру;
		Форма.Элементы.ЗапасыСтатусЗаполненияУпаковок.Видимость = ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов;
		
		Если ЕстьТранспортныеУпаковки Тогда
			
			Форма.Элементы.СтраницаТранспортныеУпаковки.Видимость = ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов;
			
			Если ЕстьСоставТранспортныхУпаковок Тогда
				
				СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
					Форма, Форма.Элементы.ор_СоставТранспортныхУпаковокХарактеристика.Имя, "Объект.ор_СоставТранспортныхУпаковок.ХарактеристикиИспользуются");
				
				Форма.Элементы.ор_СоставТранспортныхУпаковокХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатур;
				Форма.Элементы.ор_СоставТранспортныхУпаковок.Видимость   = НЕ ЭтоПеремещениеПоОрдеру;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Документ.СписаниеЗапасов.Форма.ФормаДокумента"
			ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента"
			ИЛИ Форма.ИмяФормы = "Документ.ОприходованиеЗапасов.Форма.ФормаДокумента" Тогда
			
			Форма.Элементы.ор_НеИспользоватьМаркировкуЛС.Видимость = ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов;
			
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента" Тогда
		
		Форма.Элементы.ЗапасыСтатусЗаполненияУпаковок.Видимость = ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки();
		
	КонецЕсли;
	
	ор_ИнтеграцияМДЛП.СоздатьКомандуРегистрацииGTINНаФорме(Форма);
	
КонецПроцедуры

#КонецОбласти

// Обработка получения данных списка.
//
// Параметры:
//  ИмяЭлемента - Строка - Имя элемента формы
//  Настройки - настройки списка
//  Строки - полученные строки динамического списка
//
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	Если НЕ ор_ИнтеграцияМДЛП.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Строка.Значение.Данные, "СтатусМДЛП") Тогда
			Прервать;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыОформленияДокументовМДЛП.Основание КАК Основание,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтатусыОформленияДокументовМДЛП.СтатусОформления = ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеОформлено)
	|				ТОГДА 1
	|			КОГДА СтатусыОформленияДокументовМДЛП.СтатусОформления = ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.ОформленоЧастично)
	|				ТОГДА 4
	|			КОГДА СтатусыОформленияДокументовМДЛП.СтатусОформления = ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.Оформлено)
	|				ТОГДА 3
	|			КОГДА СтатусыОформленияДокументовМДЛП.СтатусОформления = ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеТребуется)
	|				ТОГДА 0
	|			КОГДА СтатусыОформленияДокументовМДЛП.СтатусОформления = ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.ЕстьОшибкиОформления)
	|				ТОГДА 5
	|		КОНЕЦ) КАК СтатусОформления
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	РегистрСведений.СтатусыОформленияДокументовМДЛП КАК СтатусыОформленияДокументовМДЛП
	|ГДЕ
	|	СтатусыОформленияДокументовМДЛП.Основание В(&Документы)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыОформленияДокументовМДЛП.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА втТаблица.СтатусОформления = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеОформлено)
	|		КОГДА втТаблица.СтатусОформления = 4
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.ОформленоЧастично)
	|		КОГДА втТаблица.СтатусОформления = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.Оформлено)
	|		КОГДА втТаблица.СтатусОформления = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеТребуется)
	|		КОГДА втТаблица.СтатусОформления = 5
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.ЕстьОшибкиОформления)
	|	КОНЕЦ КАК СтатусОформления
	|ИЗ
	|	втТаблица КАК втТаблица";
	
	Запрос.УстановитьПараметр("Документы", Строки.ПолучитьКлючи());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСписка = Строки[Выборка.Основание];
		СтрокаСписка.Данные["СтатусМДЛП"] = Строка(Выборка.СтатусОформления);
		
		Если Выборка.СтатусОформления = Перечисления.СтатусыОформленияДокументовМДЛП.ЕстьОшибкиОформления Тогда
			
			ОформлениеМДЛП = СтрокаСписка.Оформление.Получить("СтатусМДЛП");
			Если ОформлениеМДЛП <> Неопределено Тогда
				ОформлениеМДЛП.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияМДЛП);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


