
#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП) Экспорт
	
	Возврат ИнтеграцияТСПИоТМДЛП.НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	
КонецФункции

Функция ДополнительныеДанныеЗапросаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП) Экспорт
	
	Возврат ИнтеграцияТСПИоТМДЛП.ДополнительныеДанныеЗапросаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс