#Если ВебКлиент Тогда

#Область ПрограммныйИнтерфейс

#Область ПроверкаКодовМаркировки

// Возвращает результат проверки кодов маркировки на ТС ПИоТ.
//
// Параметры:
//  ПараметрыПроверкиКМ - Структура - См. ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПроверкиКМНаТСПИоТ.
//
// Возвращаемое значение:
//  РезультатПроверки - Структура - См. ИнтеграцияТСПИоТМДЛПКлиентСервер.НовыйРезультатПроверкиКМНаТСПИоТ.
//
Асинх Функция ПроверитьКМНаТСПИоТ(ПараметрыПроверкиКМ) Экспорт
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ);
	
	РезультатПроверки = ПараметрыВыполненияПроверки.РезультатПроверки;
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатЗапросаНаТСПИоТ = ДанныеКодовМаркировкиНаТСПИоТ(
		ПараметрыВыполненияПроверки.ДанныеДляПроверки,
		ПараметрыВыполненияПроверки.НомерФискальногоНакопителя,
		ПараметрыВыполненияПроверки.ККТФФД12МДЛП);
	
	РазрешительныйРежимМДЛПКлиентСервер.ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(РезультатПроверки, РезультатЗапросаНаТСПИоТ);
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти // ПроверкаКодовМаркировки

#Область МетодыИнтерфейсаТСПИоТ

// Запрос данных о подключенной ККТ к экземпляру ТС ПИоТ по адресу подключения.
//
// Параметры:
//  ПараметрыУстановки - см. ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ
//
// Возвращаемое значение:
//  Структура - Настройки экземпляра ТС ПИоТ:
//    * РезультатОтправкиЗапроса - см. ИнтеграцияТСПИоТМДЛПКлиентСервер.ОбработатьОтветПолученияНастроекЭкземпляраТСПИоТ.
//    * ТекстОшибки - Строка - текст ошибки, полученной от ТС ПИоТ.
//    * НастройкиЭкземпляраТСПИоТ - см. ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ
//
Асинх Функция ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыУстановки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса" , Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"              , "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", Неопределено);
	
	ПараметрыЗапросов = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросовКТСПИоТ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПодготовитьДанныеЗапросаПолученияНастроекЭкземпляраТСПИоТ();
	
	РезультатОтправкиЗапроса = Ждать ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапросАсинх(ПараметрыПодключения, ДанныеЗапроса);
	
	ИнтеграцияТСПИоТМДЛПКлиентСервер.ОбработатьОтветПолученияНастроекЭкземпляраТСПИоТ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // МетодыИнтерфейсаТСПИоТ

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаКодаМаркировки

// См. ИнтеграцияТСПИоТМДЛПКлиентСервер.ДанныеКодовМаркировкиНаТСПИоТ.
//
Асинх Функция ДанныеКодовМаркировкиНаТСПИоТ(ДанныеПроверкиКМ, НомерФискальногоНакопителя, ККТФФД12МДЛП)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим"               , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаКлиенте"   , Ложь);
	// ор ++
	ВозвращаемоеЗначение.Вставить("ПроверкаНаТСПИоТЗавершена"    , Ложь);
	// ор --
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                  , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима", Новый Соответствие);
	
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"  , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"      , Новый Соответствие);
	
	ВозвращаемоеЗначение.АварийныйРежим = РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж();
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		// На срок действия аварийного режима разрешена продажа без разрешительного режима
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	МассивКодовИдентификацииДляОтправки = Новый Массив;
	Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
		МассивКодовИдентификацииДляОтправки.Добавить(ЭлементПроверки.ПолныйКодМаркировки);
		// Изначально, считаем все элементы проверки без данных.
		ВозвращаемоеЗначение.КодыМаркировкиБезДанных.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ЭлементПроверки);
	КонецЦикла;
	
	НастройкиПодключенияЭкземпляраТСПИоТ = ИнтеграцияТСПИоТМДЛПКлиентСервер.НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	Если Не НастройкиПодключенияЭкземпляраТСПИоТ.Настроено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Не выполнены настройки ТС ПИоТ.'");
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПодключения = НастройкиПодключенияЭкземпляраТСПИоТ.НастройкиПодключения;
	
	ПараметрыЗапросов = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросовКТСПИоТ(НастройкиПодключения);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	// ор ++
	ПараметрыПодключения.Таймаут = РазрешительныйРежимМДЛПКлиентСерверПовтИсп.ВремяОтветаCDNПлощадокПриПробитииЧека();
	// ор --
	
	ДанныеЗапроса = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПодготовитьДанныеЗапросаПолученияДанныхКодовМаркировкиНаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП, МассивКодовИдентификацииДляОтправки);
	
	РезультатОтправкиЗапроса = Ждать ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ИнтеграцияТСПИоТМДЛПКлиентСервер.ОбработатьРезультатОтправкиЗапросаНаТСПИоТ(РезультатОтправкиЗапроса, ДанныеПроверкиКМ, НастройкиПодключения, ДанныеЗапроса, ВозвращаемоеЗначение);
	// ор ++
	ВозвращаемоеЗначение.ПроверкаНаТСПИоТЗавершена = Истина;
	// ор --
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // ПроверкаКодовМаркировки

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли