
#Область ОписаниеПеременных

&НаКлиенте
Перем РедактируемыеРеквизиты; // Массив реквизитов редактируемый в данной форме

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если Параметры.Свойство("ПередЗаписьюОбъекта") Тогда
		ПередЗаписьюОбъекта = Параметры.ПередЗаписьюОбъекта;
	КонецЕсли;
	
	Если Параметры.Свойство("ПриЗаписиОбъекта") Тогда
		ПриЗаписиОбъекта = Параметры.ПриЗаписиОбъекта;
	КонецЕсли;
	
	Если Параметры.Свойство("ПослеДобавленияСтроки") Тогда
		ПослеДобавленияСтроки = Параметры.ПослеДобавленияСтроки;
	КонецЕсли;
	
	Если Параметры.Свойство("ПередВыгрузкойОбъекта") Тогда
		ПередВыгрузкойОбъекта = Параметры.ПередВыгрузкойОбъекта;
	КонецЕсли;
	
	Если Параметры.Свойство("ВариантИспользованияНастройки") Тогда
		ВариантИспользованияНастройки = Параметры.ВариантИспользованияНастройки;
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Определим редактируемые реквизиты
	РедактируемыеРеквизиты = Новый Массив;
	Если ВариантИспользованияНастройки = ПредопределенноеЗначение("Перечисление.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных") Тогда
		РедактируемыеРеквизиты.Добавить("ПередЗаписьюОбъекта");
		РедактируемыеРеквизиты.Добавить("ПриЗаписиОбъекта");
		РедактируемыеРеквизиты.Добавить("ПослеДобавленияСтроки");
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПередЗаписьюОбъекта;
	ИначеЕсли ВариантИспользованияНастройки = ПредопределенноеЗначение("Перечисление.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных") Тогда
		РедактируемыеРеквизиты.Добавить("ПередВыгрузкойОбъекта");
		РедактируемыеРеквизиты.Добавить("ПослеДобавленияСтроки");
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПередВыгрузкойОбъекта;
	Иначе
		ВызватьИсключение "Не указан вариант использования настройки";
	КонецЕсли;
	
	// Скроем ненужные страницы
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		
		ИмяСобытия = СтрЗаменить(Страница.Имя, "Страница", "");
		ПорядковыйНомер = РедактируемыеРеквизиты.Найти(ИмяСобытия);
		Если ПорядковыйНомер = Неопределено Тогда
			Страница.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьНадписьТекстВыражения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПриСменеСтраницы"
//
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьНадписьТекстВыражения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ОК"
//
&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из РедактируемыеРеквизиты Цикл
		Результат.Вставить(Элемент, ЭтотОбъект[Элемент]);
	КонецЦикла;
	
	ЭтотОбъект.Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает текст надписи текста выражения
//
&НаКлиенте
Процедура УстановитьНадписьТекстВыражения()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПослеДобавленияСтроки Тогда
		
		Если ВариантИспользованияНастройки = ПредопределенноеЗначение("Перечисление.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных") Тогда
			Элементы.НадписьПояснения.Заголовок =
			"В тексте выражения можно использовать следующие предопределенные параметры:
			|   Объект                           - записываемый объект;
			|   ТекущиеДанные                    - содержит данные загружаемой строки табличной части;
			|   ТекстыЯчеек                      - массив текстов ячеек строки;
			|   ТаблицаЗагружаемыхРеквизитов     - таблица настроек загружаемых реквизитов строк;
			|   ТаблицаДополнительныхПараметров  - таблица дополнительных параметров загрузки характеристик.
			|Встроенные функции, функции общих модулей.";
				
		ИначеЕсли ВариантИспользованияНастройки = ПредопределенноеЗначение("Перечисление.ор_ВариантыИспользованияНастройки.ВыгрузкаДанных") Тогда
			Элементы.НадписьПояснения.Заголовок =
			"В тексте выражения можно использовать следующие предопределенные параметры:
			|   Результат       - строка с рассчитанными значениями полей выгружаемого файла обращение
			|                     производится по индексу 0..N-1, где N количество колонок файла;
			|   ТекущиеДанные   - структура доступных значений объекта;
			|   Ссылка          - ссылка на документ (только при выгрузке документа);
			|   ПользовательскиеДанные - структура для хранения пользовательских данных.
			|Встроенные функции, функции общих модулей.";
		Иначе
			ВызватьИсключение "Не указан вариант использования настройки";
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПередВыгрузкойОбъекта Тогда
		
		Элементы.НадписьПояснения.Заголовок =
		"В тексте выражения можно использовать следующие предопределенные параметры:
		|   Ссылка                 - ссылка на документ (только при выгрузке документа);
		|   ПользовательскиеДанные - структура для хранения пользовательских данных.
		|Встроенные функции, функции общих модулей.";
		
	Иначе
		
		Элементы.НадписьПояснения.Заголовок =
		"В тексте выражения можно использовать следующие предопределенные параметры:
		|   Объект         - записываемый объект;
		|   Отказ          - признак отказа от записи объекта.
		|Встроенные функции, функции общих модулей.";
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьНадписьТекстВыражения()

#КонецОбласти
