

&Перед ("ОбработатьНеНайденныйВДеревеШтрихКод")
&НаКлиенте
Процедура м_ОбработатьНеНайденныйВДеревеШтрихКод(ДанныеШтрихкода, ТекущаяСтрокаДерева)  
	Если Не ЗначениеЗаполнено(ДанныеШтрихкода.Характеристика) Тогда
		//## Найдем характеристику на 2 закладке по товару и вставим в эту строку GTIN отсканированного товара, вместо внутреннего ШК  
		Товар = ДанныеШтрихкода.Номенклатура;
		GTIN  = ДанныеШтрихкода.GTIN;
		ТекущиеДанные = Элементы.ПодобраннаяМаркируемаяПродукция.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.Номенклатура = Товар Тогда
			Для каждого Стр Из ПодобраннаяМаркируемаяПродукция Цикл 
				Если Стр.Номенклатура = Товар Тогда
					Стр.GTIN = GTIN;
					ДанныеШтрихкода.Характеристика = Стр.Характеристика; 
					ТекущаяСтрокаДерева.Характеристика = Стр.Характеристика;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИНачеЕсли ТекущиеДанные.Номенклатура = Товар Тогда	
			ТекущиеДанные.GTIN = GTIN;
			ДанныеШтрихкода.Характеристика     = ТекущиеДанные.Характеристика; 
			ТекущаяСтрокаДерева.Характеристика = ТекущиеДанные.Характеристика;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры	

&НаКлиенте
Процедура м_ПодобраннаяМаркируемаяПродукцияПриАктивизацииСтрокиПосле(Элемент)
	
	// Посчитаем итоги
	ТекущиеДанные = Элементы.ПодобраннаяМаркируемаяПродукция.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
	    Возврат;
	КонецЕсли;

	Товар          = ТекущиеДанные.Номенклатура;
	Характеристика = ТекущиеДанные.Характеристика;
	
	ВДокументе = 0;
	Подобрано  = 0;
	
	Для каждого Стр Из ПодобраннаяМаркируемаяПродукция Цикл 
		Если Стр.Номенклатура = Товар И Стр.Характеристика = Характеристика Тогда
			ВДокументе = ВДокументе + ?(ЗначениеЗаполнено(Стр.Количество),Стр.Количество,0);
			Подобрано  = Подобрано  + ?(ЗначениеЗаполнено(Стр.КоличествоИС),Стр.КоличествоИС,0);
		КонецЕсли;
	КонецЦикла;
	
	Если ВДокументе > 0 Тогда
		Элементы.ПодобраннаяМаркируемаяПродукцияКоличество.Заголовок = "В документе, " + Формат(ВДокументе, "ЧЦ=10; ЧДЦ=0");
	Иначе
		Элементы.ПодобраннаяМаркируемаяПродукцияКоличество.Заголовок = "В документе";
	КонецЕсли; 
	Если Подобрано > 0 Тогда
		Элементы.ПодобраннаяМаркируемаяПродукцияКоличествоИС.Заголовок = "В упаковках, " + Формат(Подобрано, "ЧЦ=10; ЧДЦ=0");
	Иначе
		Элементы.ПодобраннаяМаркируемаяПродукцияКоличествоИС.Заголовок = "В упаковках";
	КонецЕсли; 
	
	
КонецПроцедуры
