
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЧекККМ") И ЗначениеЗаполнено(Параметры.ЧекККМ) Тогда
		ЧекККМ = Параметры.ЧекККМ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(ЧекККМ) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите чек ККМ.'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Номера упаковок заполнены'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ЗаполнитьИЗаписать(ЧекККМ);
	
КонецПроцедуры
