
#Область ПрограммныйИнтерфейс

// Проверка, подлежит ли продукция обязательной онлайн-проверке перед розничной продажей.
// 
// Возвращаемое значение:
//  Булево - Продукция подлежит обязательной онлайн проверке перед розничной продажей.
Функция ИспользуетсяОбязательнаяОнлайнПроверкаПередРозничнойПродажей() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПВызовСервера.ИспользуетсяОбязательнаяОнлайнПроверкаПередРозничнойПродажей();
	
КонецФункции

// Получить дату начала разрешительного режима МДЛП.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаРазрешительногоРежима() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПВызовСервера.ПолучитьДатуНачалаРазрешительногоРежима();
	
КонецФункции

// Получить дату начала работы с локальным модулем разрешительного режима МДЛП.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаОфлайнРазрешительногоРежима() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПВызовСервера.ПолучитьДатуНачалаОфлайнРазрешительногоРежима();
	
КонецФункции

// Получить дату начала работы разрешительного режима МДЛП с помощью ТС ПИоТ.
// 
// Возвращаемое значение:
//   - Дата.
//
Функция ПолучитьДатуНачалаДействияТСПИоТ() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПВызовСервера.ПолучитьДатуНачалаДействияТСПИоТ();
	
КонецФункции

// Получить признак ведения учета МДЛП.
// 
// Возвращаемое значение:
//   - Булево.
//
Функция ПолучитьПризнакВеденияУчетаМаркировки() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПВызовСервера.ПолучитьПризнакВеденияУчетаМаркировки();
	
КонецФункции

// Получение Организации МДЛП по учетной организации.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации	 - организация учета.
// 
// Возвращаемое значение:
//   - СправочникСсылка.ОрганизацииМДЛП - соответсвующая организация МДЛП.
//
Функция ОрганизацияМДЛППоОрганизации(Организация) Экспорт
	
	Возврат ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(Организация);
	
КонецФункции

// Функция определяет, включён ли режим проверки кодов маркировки (КМ) при сканировании на контрольно‑кассовой технике (ККТ).
// 
// Возвращаемое значение:
//   - Булево - результат функции.
//
Функция РежимПроверкиКМПриСканировании() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПВызовСервера.РежимПроверкиКМПриСканировании();
	
КонецФункции

#КонецОбласти