 
&ПОСЛЕ ("ОбработатьИзменениеСостоянияЗаказа")
&НаКлиенте
Процедура эв_ОбработатьИзменениеСостоянияЗаказа()
	
	Если Объект.СостояниеЗаказа = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
	    Возврат;
	КонецЕсли;
	
	эв_ОбработатьИзменениеСостоянияЗаказаНаСервере(Строка(Объект.СостояниеЗаказа));
	
КонецПроцедуры

&НаСервере
Процедура эв_ОбработатьИзменениеСостоянияЗаказаНаСервере(Состояние)
	
	Для каждого Стр Из Объект.Запасы Цикл
	
		Стр.Резерв = ?(Состояние = "Согласован", Стр.Количество, 0);
	
	КонецЦикла;

КонецПроцедуры

&Вместо ("ЗапасыХарактеристикаПриИзменении")
&НаКлиенте
Процедура эв_ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Компания);
	СтруктураДанные.Вставить("Номенклатура", 	СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", 	СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу") Тогда
		СтруктураДанные.Вставить("ВключаяШаблоны", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда  
		
		СтруктураДанные.Вставить("ДатаОбработки", 		Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента", 	Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС",	Объект.СуммаВключаетНДС);
		
		СтруктураДанные.Вставить("СтавкаНДС", 	СтрокаТабличнойЧасти.СтавкаНДС);
		СтруктураДанные.Вставить("Цена", 		СтрокаТабличнойЧасти.Цена);
		
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		
	КонецЕсли;

	РезервированиеЗапасов = ?(КэшЗначений.Свойство("РезервированиеЗапасов"), КэшЗначений.РезервированиеЗапасов, Ложь);	
	ЦенообразованиеКлиентСервер.ДополнитьСтруктуруДанныхНоменклатурыПолямиЦенообразования(Объект, СтрокаТабличнойЧасти, СтруктураДанные, , НЕ РезервированиеЗапасов);	
	
	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	Если СтруктураДанные.ЭтоНабор Тогда
		
		// Наборы
		ЗаменитьСтрокуЗапасовДаннымиНабора(ЭтотОбъект, СтрокаТабличнойЧасти, СтруктураДанные);
		
		ЗаполнитьПризнакиИспользованияХарактеристик();
		
		// АвтоматическиеСкидки.
		СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
		// Конец АвтоматическиеСкидки
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияРезервовИОстатокНоменклатурыВТабличнойЧастиНаСервере();
		КонецЕсли;
		
	Иначе
		Если НЕ Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказовПокупателей.Основной") Тогда 
			//##По интернет заказам цены не пересчитываем
			СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		КонецЕсли;

		Если СтруктураДанные.Свойство("МинимальнаяЦена") 
			И СтрокаТабличнойЧасти.Свойство("МинимальнаяЦена") Тогда
			СтрокаТабличнойЧасти.МинимальнаяЦена = СтруктураДанные.МинимальнаяЦена;			
		КонецЕсли;
		СтрокаТабличнойЧасти.Содержание = "";
		СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
		СтрокаТабличнойЧасти.ЭтоШаблонСпецификации = СтруктураДанные.ЭтоШаблонСпецификации;
		СтрокаТабличнойЧасти.ЕстьДопРеквизитыСпецификации = СтруктураДанные.ЕстьДопРеквизитыСпецификации;
		Если СтрокаТабличнойЧасти.ЕстьДопРеквизитыСпецификации Тогда
			Если СтрокаТабличнойЧасти.КлючСвязи<>0 Тогда
				ТабличныеЧастиУНФКлиентСервер.УдалитьСтрокиПоКлючуСвязи(Объект.РеквизитыПараметрическихСпецификаций, СтрокаТабличнойЧасти);
			КонецЕсли; 
			ЗаполнитьДопРеквизитыПоУмолчанию(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
			ОбновитьОписанияДопРеквизитов(ЭтотОбъект, СтрокаТабличнойЧасти.КлючСвязи);
		КонецЕсли; 
		
		РассчитатьСуммуВСтрокеТабличнойЧасти();
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияРезервовИОстатокНоменклатурыВТабличнойЧастиНаСервере(,СтрокаТабличнойЧасти.Номенклатура);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИтогиКлиент();
	ОчиститьКалькуляцию();
	ВключитьИндикаторНеобходимостиПересчетаСтоимостиДоставки();
	
	ОбновитьВидимостьКолонкиПараметровСпецификации(ЭтотОбъект);
	
	// СборкаЗаказов
	Если ФОСборкаЗаказов Тогда
		СтрокаТабличнойЧасти.КоличествоСобрано = 0;
		СборкаЗаказовКлиент.РассчитатьРасхождения(ЭтаФорма, СтрокаТабличнойЧасти);
	КонецЕсли;
	// Конец СборкаЗаказов
	
КонецПроцедуры

&Вместо ("РассчитатьСкидкиНаценки")
&НаКлиенте
Процедура эв_РассчитатьСкидкиНаценки(Команда)
	
	Если Объект.Запасы.Количество() = 0      //## Отключим скидки для интернет заказов
		ИЛИ Объект.ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказовПокупателей.Основной") Тогда
		Если Объект.СкидкиНаценки.Количество() > 0 Тогда
			Объект.СкидкиНаценки.Очистить();
		КонецЕсли; 
		Возврат;
	КонецЕсли;
	
	РассчитатьСкидкиНаценкиКлиент();
	
КонецПроцедуры



