
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Ячейка") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Ячейка) Тогда
		Запись.Ячейка = Параметры.ЗначенияЗаполнения.Ячейка;
		Элементы.Ячейка.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Номенклатура) Тогда
		Запись.Номенклатура = Параметры.ЗначенияЗаполнения.Номенклатура;
		Элементы.Номенклатура.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Характеристика") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Характеристика) Тогда
		Запись.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ХарактеристикиИспользуются = Запись.Номенклатура.ИспользоватьХарактеристики;
		Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ХарактеристикиИспользуются = Запись.Номенклатура.ИспользоватьХарактеристики;
	Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Запись.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Данные о расположении можно фиксировать только для номенклатуры с типом ""Запас""'"),
		,
		"Запись.Номенклатура",
		,
		Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НоменклатураПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НоменклатураПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		ХарактеристикиИспользуются = Запись.Номенклатура.ИспользоватьХарактеристики;
		Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;
	Иначе
		Запись.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Элементы.Характеристика.Доступность = Ложь
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
