
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если Параметры.СоответствиеНоменклатуры=Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.СоответствиеНоменклатуры.Загрузить(Параметры.СоответствиеНоменклатуры.Выгрузить());
	
	Справочники.СтавкиНДС.ЗаполнитьСписокВыбораСтавокНДС(ЭтотОбъект, Элементы.ВидСтавкиНДС.Имя);
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КатегорияНоменклатурыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		КатегорияНоменклатурыПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "Добавить".
//
&НаКлиенте
Процедура Добавить(Команда)
	
	ЗаполненыОбязательныеРеквизиты = Истина;
	
	Если НЕ ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		ЗаполненыОбязательныеРеквизиты = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru= 'Реквизит <Вид номенклатуры> не заполнен.'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидСтавкиНДС) Тогда
		// Если ставки ндс заполнены в таблица соотв ном-ры, для тех позиций которые собираемся загружать, то реквизит 
		// формы СтавкаНДС может оставаться не заполненным
		СтавкаНДСОбязательна = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Загружать, ВидСтавкиНДС", Истина, ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ПустаяСсылка"))).Количество()>0;
		Если СтавкаНДСОбязательна Тогда
			ЗаполненыОбязательныеРеквизиты = Ложь;
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru= 'Реквизит <Ставка НДС> не заполнен.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЗаполненыОбязательныеРеквизиты=Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru= 'Реквизит <Единица измерения> не заполнен.'"));
	КонецЕсли;
	
	Если НЕ ЗаполненыОбязательныеРеквизиты Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНоменклатуру();
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Результат", Истина);
	СтруктураРезультата.Вставить("СоответствиеНоменклатуры", Объект.СоответствиеНоменклатуры);
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура создания номенклатуры
//
&НаСервере
Процедура СоздатьНоменклатуру()
	
	ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.СоздатьНоменклатуру(
		Объект.СоответствиеНоменклатуры,
		ГруппаНоменклатуры,
		КатегорияНоменклатуры,
		ЕдиницаИзмерения,
		ЦеноваяГруппа,
		ВидСтавкиНДС,
		СтранаПроисхождения);
	
КонецПроцедуры

&НаСервере
Процедура КатегорияНоменклатурыПриИзмененииНаСервере()
	
	ДанныеКатегории = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		КатегорияНоменклатуры,
		"ВидСтавкиНДС,ЕдиницаИзмерения,СтранаПроисхождения,ЦеноваяГруппа");
	ВидСтавкиНДС        = ДанныеКатегории.ВидСтавкиНДС;
	ЕдиницаИзмерения    = ДанныеКатегории.ЕдиницаИзмерения;
	СтранаПроисхождения = ДанныеКатегории.СтранаПроисхождения;
	ЦеноваяГруппа       = ДанныеКатегории.ЦеноваяГруппа;
	
КонецПроцедуры

#КонецОбласти
