
&После ("УстановитьНастройкиФормыУПД")
&НаКлиентеНаСервереБезКонтекста
Процедура ш_УстановитьНастройкиФормыУПД(Форма, СчетФактураСсылка, ИзменениеУПД = Ложь)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.ЭтоУниверсальныйДокумент Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураНомер", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураДата", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураНомер", "ОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураДата", "ОтметкаНезаполненного", Ложь);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураНомер", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураДата", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураНомер", "ОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетФактураДата", "ОтметкаНезаполненного", Истина);
		
	КонецЕсли;
	
	// По просьбе Аптек
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Расхождения", "Видимость", Ложь);

КонецПроцедуры
