

&Вместо("ПробитьЧек")
&НаКлиенте
Процедура эв_ПробитьЧек(Команда)
	
	Если эв_КассаБезПодключенияОборудования(Объект.КассаККМ) Тогда
		эв_ПробитьЧекБезОборудования();
		Возврат;
	КонецЕсли;
	
	ПродолжитьВызов(Команда);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция эв_КассаБезПодключенияОборудования(КассаККМ)
	
	Если Не ЗначениеЗаполнено(КассаККМ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		КассаККМ, "ИспользоватьБезПодключенияОборудования") = Истина;
	
КонецФункции

&НаКлиенте
Процедура эв_ПробитьЧекБезОборудования()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если Объект.ПометкаУдаления Тогда
		ТекстОшибки = НСтр("ru = 'Документ помечен на удаление'");
	ИначеЕсли Модифицированность Тогда
		ТекстОшибки = НСтр("ru = 'Измененный документ не сохранен'");
	ИначеЕсли Объект.ПробитЧек Тогда
		ТекстОшибки = НСтр("ru = 'Чек коррекции уже пробит'");
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = эв_ПоставитьЧекКоррекцииВОчередьНаСервере();
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция эв_ПоставитьЧекКоррекцииВОчередьНаСервере()
	
	Возврат эв_РаспределеннаяФискализация.эв_ПоставитьЧекКоррекцииБезОборудованияВОчередь(Объект.Ссылка);
	
КонецФункции
