#Область ОбработчикиСобытийФормы

&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылкиГосИС;
	
	// Настройки видимости при запуске.
	// ИнтеграцияМДЛП.РазрешительныйРежим.
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим.ТСПИоТ") Тогда
			Элементы.ор_МДЛПДатаНачалаДействияТСПИоТ.Видимость = Истина;
			Элементы.НастройкиПодключенияТСПИоТ.Видимость = Истина;
			Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
				Элементы.НастройкиПодключенияТСПИоТ.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники["ТСПИоТ"]);
			КонецЕсли;
		Иначе
			Элементы.ор_МДЛПДатаНачалаДействияТСПИоТ.Видимость = Ложь;
			Элементы.НастройкиПодключенияТСПИоТ.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ор_МДЛПДатаНачалаДействияТСПИоТ.Видимость = Ложь;
		Элементы.НастройкиПодключенияТСПИоТ.Видимость = Ложь;
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.РазрешительныйРежим.
	
	НастроитьФормуПриИзменииЭлементовУправления();
	
	// Обновление состояния элементов.
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	ОбновитьПредставлениеАварийногоРежима();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработчикОповещений(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ор_МДЛПДатаНачалаМаркировкиТоваровПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратовПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМестаДеятельностиОрганизацийПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьЗаполнениеТоваровВУведомленияхПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтпарвлятьДанныеМаркировкиЧерезОФДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольСтатусовКИЗПриПробитииЧерезРМКПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ор_МДЛПРегистрироватьGTINПриПодбореНомеровУпаковокПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ор_МДЛПКонтролироватьКодыМаркировкиСредствамиККТПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ор_МДЛПРежимКонтроляКМСредствамиККТПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ор_МДЛПДатаНачалаРазрешительногоРежимаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАварийногоРежимаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыСТестовымКонтуромИСМППриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаОбновленияCDNПлощадокПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяБлокировкиCDNПлощадокПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтветаCDNПлощадокПриПробитииЧекаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияИдентификатораРазрешительногоРежимаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежимаПриИзменении(Элемент)
	
	Если НаборКонстант.ор_МДЛПДатаНачалаРазрешительногоРежима > НаборКонстант.ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежима Тогда
		
		НаборКонстант.ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежима = НаборКонстант.ор_МДЛПДатаНачалаРазрешительногоРежима;
		ТекстОшибки = НСтр("ru = 'Дата включения локальной проверки разрешительного режима не должна быть ранее даты разрешительного режима'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ор_МДЛПДатаНачалаЛокальногоРазрешительногоРежима",
			"НаборКонстант");
		
		Возврат;
	КонецЕсли;
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ор_МДЛПДатаНачалаДействияТСПИоТПриИзменении(Элемент)
	
	Если НаборКонстант.ор_МДЛПДатаНачалаРазрешительногоРежима > НаборКонстант.ор_МДЛПДатаНачалаДействияТСПИоТ Тогда
		
		НаборКонстант.ор_МДЛПДатаНачалаДействияТСПИоТ = НаборКонстант.ор_МДЛПДатаНачалаРазрешительногоРежима;
		ТекстОшибки = НСтр("ru = 'Дата начала использования ТС ПИоТ для проверки разрешительного режима не должна быть ранее даты разрешительного режима'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ор_МДЛПДатаНачалаДействияТСПИоТ",
			"НаборКонстант");
		
		Возврат;
	КонецЕсли;
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПанельМаркировкиМДЛП(Команда)
	ОткрытьФорму("Обработка.ПанельМаркировкиМДЛП.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНомераУпаковок(Команда)
	ОткрытьФорму("ОбщаяФорма.ор_МДЛПЗагрузитьНомераУпаковок30");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТокеныАвторизацииИСМП(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоРазрешительныйРежим", Истина);
	ОткрытьФорму("РегистрСведений.ДанныеКлючаСессииМДЛП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокCDNПлощадок(Команда)
	
	ОткрытьФорму("РегистрСведений.СостоянияCDNПлощадокМДЛП.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияКЛокальномуМодулюРазрешительногоРежима(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияТСПИоТ(Команда)
	
	Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
		ОткрытьФорму("Справочник.ТСПИоТ.Форма.ФормаСписка", , ЭтотОбъект);
	Иначе
		ОткрытьФорму("РегистрСведений.НастройкиПодключенияТСПИоТМДЛП.Форма.ФормаСписка", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Клиент

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Результат = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		#Если НЕ ВебКлиент Тогда
			ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
			ОбновитьИнтерфейс = Истина;
		#КонецЕсли
	КонецЕсли;
	
	Если Результат <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещений от других открытых форм.
//
// Пример:
//   Если ИмяСобытия = "НаборКонстант.ПрефиксУзлаРаспределеннойИнформационнойБазы" Тогда
//     НаборКонстант.ПрефиксУзлаРаспределеннойИнформационнойБазы = Параметр;
//   КонецЕсли;
//
&НаКлиенте
Процедура ОбработчикОповещений(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		УстановитьДоступность();
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеАварийногоРежимаРазрешительногоРежимаМДЛП" Тогда
		ОбновитьПредставлениеАварийногоРежима();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	#Если НЕ ВебКлиент Тогда
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбновитьИнтерфейс();
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ВызовСервера

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	Элемент = Элементы[ИмяЭлемента];
	Если ЭлементВходитВГруппу(Элемент, Элементы.ГруппаРазрешительныйРежимНастройки) Тогда
		Результат = СохранитьНастройкиРазрешительногоРежима(РеквизитПутьКДанным);
	Иначе
		Результат = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	КонецЕсли;
	
	НастроитьФормуПриИзменииЭлементовУправления(ИмяЭлемента);
	
	УстановитьДоступность(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Сервер

&НаСервере
Процедура НастроитьФормуПриИзменииЭлементовУправления(ИмяЭлемента = "")
	
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		
		Элемент = Элементы[ИмяЭлемента];
		РеквизитПутьКДанным = Элемент.ПутьКДанным;
		ЭлементВходитВГруппуРазрешительныйРежим = ЭлементВходитВГруппу(Элемент, Элементы.ГруппаРазрешительныйРежимНастройки);
		
	Иначе
		
		РеквизитПутьКДанным = "";
		ЭлементВходитВГруппуРазрешительныйРежим = Истина;
		
	КонецЕсли;
	
	Если ЭлементВходитВГруппуРазрешительныйРежим Тогда
		ПрочитатьНастройкиРазрешительногоРежима(РеквизитПутьКДанным);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭлементВходитВГруппу(Элемент, Группа)
	
	ПроверяемыеРодители = Новый Массив;
	ПроверяемыеРодители.Добавить(Элемент.Родитель);
	
	Пока ПроверяемыеРодители.Количество() > 0 Цикл
		
		Родитель = ПроверяемыеРодители[0];
		ПроверяемыеРодители.Удалить(0);
		
		Если Родитель = Группа Тогда
			Возврат Истина;
		ИначеЕсли Родитель = Неопределено Или Родитель = ЭтотОбъект Тогда
			Возврат Ложь;
		Иначе
			ПроверяемыеРодители.Добавить(Родитель.Родитель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Определение имени константы.
	КонстантаИмя = "";
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат КонстантаИмя;
	КонецЕсли;
	
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	Иначе
		// Определение имени и запись значения реквизита в соответствующей константе из "НаборКонстант".
		// Используется для тех реквизитов формы, которые связаны с константами напрямую (в отношении один-к-одному).
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	
	ИспользоватьМаркировку = Константы.ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов.Получить();
	
	Если РеквизитПутьКДанным = "НаборКонстант.ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов" ИЛИ РеквизитПутьКДанным = "" Тогда
		Элементы.ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов.Доступность = НЕ ЗапретПоРабочемуМесту И НЕ ЗапретПоМагазину;
		Элементы.ДатаНачалаМаркировкиТоваров.Доступность                                = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту И НЕ ЗапретПоМагазину;
		Элементы.ОткрытьПанельМаркировкиМДЛП.Доступность                                = ИспользоватьМаркировку;
		Элементы.ЗагрузитьНомераУпаковок.Доступность                                    = ИспользоватьМаркировку;
		Элементы.ИспользоватьМестаДеятельностиОрганизаций.Доступность                   = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту;
		Элементы.КонтролироватьЗаполнениеТоваровВУведомлениях.Доступность               = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту;
		Элементы.ОтпарвлятьДанныеМаркировкиЧерезОФД.Доступность                         = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту;
		Элементы.КонтрольСтатусовКИЗПриПробитииЧерезРМК.Доступность                     = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту;
		Элементы.РегистрироватьGTINПриПодбореНомеровУпаковок.Доступность                = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту;
		Элементы.КонтролироватьКодыМаркировкиСредствамиККТ.Доступность                  = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту;
	КонецЕсли;
	
	КонтролироватьКМСредствамиККТ = ор_ИнтеграцияМДЛП.ПолучитьПризнакКонтролироватьКодыМаркировкиСредствамиККТ();
	Элементы.Группа1.Доступность = ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту И КонтролироватьКМСредствамиККТ;
	
	Элементы.ГруппаРазрешительныйРежимЛево.Доступность =  ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту И КонтролироватьКМСредствамиККТ;
	Элементы.ГруппаРазрешительныйРежимПраво.Доступность =  ИспользоватьМаркировку И НЕ ЗапретПоРабочемуМесту И КонтролироватьКМСредствамиККТ;
	
КонецПроцедуры

#КонецОбласти

#Область АварийныйРежим

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	// ИнтеграцияМДЛП.РазрешительныйРежим.
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормРазрешительныйРежимМДЛПКлиент");
		МодульСобытияФормРазрешительныйРежимМДЛПКлиент.ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ИнтеграцияМДЛП.РазрешительныйРежим.
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима()
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	ОбновитьПредставлениеАварийногоРежима();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыАварийногоРежима()
	
	ПараметрыАварийногоРежима = СобытияФормРазрешительныйРежимМДЛПКлиент.ДанныеНастройкиАварийногоРежима();
	
	Возврат ПараметрыАварийногоРежима;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставлениеАварийногоРежима()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима");
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	
	ДанныеОсновнойЧасти = Новый Массив();
	
	Если ПараметрыАварийногоРежима.Включено Тогда
		
		Если ЗначениеЗаполнено(ПараметрыАварийногоРежима.ДатаОкончания) Тогда
			ДатаЗавершенияАварийногоРежима = МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания);
		КонецЕсли;
		
		ДатаТекущая = МестноеВремя(ОбщегоНазначенияКлиент.ДатаУниверсальная());
		
		Если ДатаТекущая < ДатаЗавершенияАварийногоРежима Тогда
		
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим установлен до'"));
			ДанныеОсновнойЧасти.Добавить(" ");
			
			Если НачалоДня(ДатаТекущая) <> НачалоДня(ДатаЗавершенияАварийногоРежима) Тогда
				ПредставлениеДаты = СтрШаблон(
					" (%1)",
					Формат(ДатаЗавершенияАварийногоРежима, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			ПредставлениеВремени = СтрШаблон(
				"%1%2",
				Формат(ДатаЗавершенияАварийногоРежима, "ДФ=HH:mm;"),
				ПредставлениеДаты);
			
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					ПредставлениеВремени,,
					ЦветГиперссылки,,
					"ИзменитьВремяОкончанияАварийногоРежима"));
			
			ПодключитьОбработчикОжидания(
				"Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима",
				(ДатаЗавершенияАварийногоРежима - ДатаТекущая) + 10,
				Истина);
			
			ДанныеОсновнойЧасти.Добавить(" ");
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Отключить'"),,
					ЦветГиперссылки,,
					"ОтключитьАварийныйРежим"));
			
			ШаблонСтроки = НСтр("ru = 'Установлен аварийный режим до %1'");
			
		Иначе
			
			ПараметрыАварийногоРежима.Включено = Ложь;
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим не включен.'"));
		
			ДанныеОсновнойЧасти.Добавить(" ");
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Включить'"),,
					ЦветГиперссылки,,
					"ВключитьАварийныйРежим"));
			
		КонецЕсли;
		
	Иначе
		
		ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим не включен.'"));
		
		ДанныеОсновнойЧасти.Добавить(" ");
		ДанныеОсновнойЧасти.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Включить'"),,
				ЦветГиперссылки,,
				"ВключитьАварийныйРежим"));
		
	КонецЕсли;
	
	ПредставлениеАварийногоРежима = Новый ФорматированнаяСтрока(ДанныеОсновнойЧасти);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиРазрешительногоРежима

&НаСервере
Функция СохранитьНастройкиРазрешительногоРежима(РеквизитПутьКДанным)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		Возврат "";
	КонецЕсли;
	
	// Имя получено напрямую, т.к. может не быть внедрена подсистема ИнтеграцияМДЛП.РазрешительныйРежим.
	КонстантаИмя = "НастройкиРазрешительногоРежимаМДЛП";
	
	МодульРазрешительныйРежимМДЛПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("РазрешительныйРежимМДЛПКлиентСервер");
	МодульРазрешительныйРежимМДЛП = ОбщегоНазначения.ОбщийМодуль("РазрешительныйРежимМДЛП");
	
	Настройки = МодульРазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежима();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Настройки, РеквизитПутьКДанным)
		И Настройки[РеквизитПутьКДанным] <> ЭтотОбъект[РеквизитПутьКДанным] Тогда
		
		Настройки[РеквизитПутьКДанным] = ЭтотОбъект[РеквизитПутьКДанным];
		
		МодульРазрешительныйРежимМДЛП.УстановитьНастройкиРазрешительногоРежима(Настройки);
		
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиРазрешительногоРежима(РеквизитПутьКДанным = "")
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РазрешительныйРежим") Тогда
		Возврат;
	КонецЕсли;
	
	МодульРазрешительныйРежимМДЛПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("РазрешительныйРежимМДЛПКлиентСервер");
	
	Настройки = МодульРазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежима();
	
	Если ЗначениеЗаполнено(РеквизитПутьКДанным) Тогда
		Реквизиты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитПутьКДанным);
	Иначе
		Реквизиты = Новый Массив;
		Для Каждого КлючИЗначение Из Настройки Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, КлючИЗначение.Ключ) Тогда
				Реквизиты.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИмяРеквизит Из Реквизиты Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Настройки, ИмяРеквизит)
			И Настройки[ИмяРеквизит] <> ЭтотОбъект[ИмяРеквизит] Тогда
			
			ЭтотОбъект[ИмяРеквизит] = Настройки[ИмяРеквизит];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
