

&Вместо ("ТекстСлипЧекаПоУмолчанию")
Функция эв_ТекстСлипЧекаПоУмолчанию(ПараметрыСлипЧека, КороткийСлипЧек = Истина) Экспорт
	//Данные параметры необходимо извлекать из файла р. В проекте.
	Если ПараметрыСлипЧека.Результат Тогда
		//Текст = НСтр("ru = 'ПЛАТЕЖНАЯ ОПЕРАЦИЯ'") + Символы.ПС;
		//Текст = Текст + СтрШаблон(НСтр("ru = 'Код авторизации: %1'"), ПараметрыСлипЧека.КодАвторизации) + Символы.ПС;
		//Текст = Текст + СтрШаблон(НСтр("ru = 'Номер карты: %1'"),     ПараметрыСлипЧека.НомерКарты)     + Символы.ПС;
		//Текст = Текст + СтрШаблон(НСтр("ru = 'Номер чека ЭТ: %1'"),   ПараметрыСлипЧека.НомерЧекаЭТ)    + Символы.ПС;
		//Текст = Текст + СтрШаблон(НСтр("ru = 'Ссылочный номер: %1'"), ПараметрыСлипЧека.СсылочныйНомер) + Символы.ПС;
		//Если ПараметрыСлипЧека.Свойство("СуммаОперации") Тогда
		//	Текст = Текст + СтрШаблон(НСтр("ru = 'Сумма: %1'"), ПараметрыСлипЧека.СуммаОперации) + Символы.ПС;
		//КонецЕсли;
		//Если Не КороткийСлипЧек И ПараметрыСлипЧека.Свойство("ТекстСлипЧека") Тогда
		//	Текст = Текст + ПараметрыСлипЧека.ТекстСлипЧека;
		//КонецЕсли;                                        
		Текст = ПараметрыСлипЧека.ТекстСлипЧека;
	Иначе
		Текст = НСтр("ru = 'ОПЕРАЦИЯ ОТКЛОНЕНА'") + Символы.ПС;  
		Текст = Текст + ПараметрыСлипЧека.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Текст;    
	
КонецФункции


