
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		Склад = Параметры.ТекущаяСтрока.Владелец;
		НачальныйЭлемент = Параметры.ТекущаяСтрока;
	Иначе
		ЗначениеНастройки = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад");
		Склад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(НачальныйЭлемент) Тогда
		Элементы.Список.ТекущаяСтрока = НачальныйЭлемент;
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Владелец",
		Склад,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Владелец",
		Склад,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
КонецПроцедуры

#КонецОбласти