
#Область ПрограммныйИнтерфейс

Процедура ЗапросМетодаИнтерфейсаСОбработкой(ПараметрыОбработки) Экспорт

	Если Не ЭлектроннаяПодпись.ИспользоватьЭлектронныеПодписи()
		И Не ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи
		И Не ПараметрыОбработки.НеТребуетсяАвторизацияПоКлючуСессии Тогда
		ПараметрыОбработки.ЕстьОшибки  = Истина;
		ПараметрыОбработки.ТекстОшибки = НСтр("ru = 'Подсистема электронной подписи отключена.'");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОрганизациюПараметровОбработкиПоКлючуСессии(ПараметрыОбработки);
	
	Если Не ЗначениеЗаполнено(ПараметрыОбработки.Организация)
		И ПараметрыОбработки.ОрганизацияПоСертификатам = Неопределено Тогда
		ПараметрыОбработки.ОрганизацияПоСертификатам = Истина;
		Возврат;
	КонецЕсли;
	
	ТребуетсяОбновлениеКлючаСессииРозница = Ложь;
	ТекстОшибки                           = Неопределено;
	
	ДоступныеМетодыИнтерфейса = РазрешительныйРежимМДЛПКлиентСервер.ДоступныеМетодыИнтерфейса();
	
	Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок Тогда
		
		ОбновлятьБезПроверкиДатыОбновления = Ложь;
		ИспользуетсяТСПИоТДляРР            = Ложь;
		
		Если ТипЗнч(ПараметрыОбработки.Параметры) = Тип("Структура") Тогда
			
			Если ПараметрыОбработки.Параметры.Свойство("ОбновлятьБезПроверкиДатыОбновления") Тогда
				ОбновлятьБезПроверкиДатыОбновления = ПараметрыОбработки.Параметры.ОбновлятьБезПроверкиДатыОбновления;
			КонецЕсли;
			
			Если ПараметрыОбработки.Параметры.Свойство("НомерФискальногоНакопителя") Или ПараметрыОбработки.Параметры.Свойство("ККТ") Тогда
				ИспользуетсяТСПИоТДляРР = ИнтеграцияТСПИоТМДЛП.НастройкиПодключенияЭкземпляраТСПИоТ(
					ПараметрыОбработки.Параметры.НомерФискальногоНакопителя,
					ПараметрыОбработки.Параметры.ККТ).Настроено;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИспользуетсяТСПИоТДляРР Тогда
			ПараметрыОбработки.ВыполнениеВФоне = Ложь;
			Возврат;
		КонецЕсли;
		
		РезультатОбновления = НачатьАктуализациюCDNПлощадокНаСервере(ПараметрыОбработки.Организация, ПараметрыОбработки.УникальныйИдентификатор, ОбновлятьБезПроверкиДатыОбновления);
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = НачатьИнициализациюКонфигурацииЛокальногоМодуляЧЗНаСервере(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = НачатьЗапросСтатусаЛокальногоМодуляЧЗНаСервере(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = НачатьИзменениеПароляАдминистратораЛокальногоМодуляЧЗНаСервере(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.Параметры.НовыйПароль,
			ПараметрыОбработки.УникальныйИдентификатор);
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
		
		РезультатНастроекТСПИоТ = НачатьПолучениеДанныхНастроекТСПИоТ(
			ПараметрыОбработки.Параметры.ПараметрыПодключения,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Внутренняя ошибка. Не описан метод интерфейса с запросом ключа авторизации %1'"),
			ПараметрыОбработки.ИмяОбработчика);
	КонецЕсли;
	
	Если ТребуетсяОбновлениеКлючаСессииРозница Тогда
		
		ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПараметрыОбработки.ЕстьОшибки  = Истина;
		ПараметрыОбработки.ТекстОшибки = ТекстОшибки;
		
	Иначе
		
		Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок Тогда
			ПараметрыОбработки.ДлительнаяОперация = РезультатОбновления;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ
			Тогда
			ПараметрыОбработки.ДлительнаяОперация = РезультатНастройкиЛМЧЗ;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
			ПараметрыОбработки.ДлительнаяОперация = РезультатНастроекТСПИоТ;
		Иначе
			ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Не описан метод интерфейса с запросом ключа авторизации (после авторизации).'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОрганизациюПараметровОбработкиПоКлючуСессии(ПараметрыОбработки)
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.Организация)
		Или Не ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница();
	
	ДанныеКлючаСессии = РегистрыСведений.ДанныеКлючаСессииМДЛП.ПолучитьСохраненныеДанныеКлючаСессии(ПараметрыЗапроса.ИмяПараметраКлючаСессии);
	ОрганизацииСИстекшимКлючем = Новый ТаблицаЗначений();
	ОрганизацииСИстекшимКлючем.Колонки.Добавить("Организация");
	ОрганизацииСИстекшимКлючем.Колонки.Добавить("ДействуетДо");
	
	Если ДанныеКлючаСессии <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ДанныеКлючаСессии Цикл
			Организация          = КлючИЗначение.Ключ;
			ПараметрыКлючаСессии = КлючИЗначение.Значение;
			ЭтоРозничныйТокен    = ПараметрыЗапроса.ИмяПараметраКлючаСессии = РазрешительныйРежимМДЛПКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница);
			Если ЭтоРозничныйТокен И РазрешительныйРежимМДЛПКлиентСервер.ДатаДействияТокенаГИСМТРозница() > ТекущаяДатаСеанса() Тогда
				ПараметрыОбработки.Организация = Организация;
				Возврат;
			ИначеЕсли ПараметрыКлючаСессии.ДействуетДо > ТекущаяДатаСеанса() Тогда
				ПараметрыОбработки.Организация = Организация;
				Возврат;
			Иначе
				НоваяСтрока = ОрганизацииСИстекшимКлючем.Добавить();
				НоваяСтрока.Организация = Организация;
				НоваяСтрока.ДействуетДо = ПараметрыКлючаСессии.ДействуетДо;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СертификатыДляПодписания = РазрешительныйРежимМДЛП.СертификатыДляПодписанияНаСервере();
	
	Если ЗначениеЗаполнено(СертификатыДляПодписания) Тогда
		Организация = СертификатыДляПодписания.Сертификаты[0].Организация;
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.ОрганизацииМДЛП") Тогда
			ПараметрыОбработки.Организация = Организация;
		ИначеЕсли Метаданные.ОпределяемыеТипы.ОрганизацияКонтрагентМДЛП.Тип.СодержитТип(ТипЗнч(Организация)) Тогда
			ПараметрыОбработки.Организация = ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(Организация);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ОрганизацииСИстекшимКлючем.Количество() Тогда
		ОрганизацииСИстекшимКлючем.Сортировать("ДействуетДо убыв");
		ПараметрыОбработки.Организация = ОрганизацииСИстекшимКлючем[0].Организация;
	КонецЕсли;
	
КонецПроцедуры

#Область CDNПлощадки

Функция НачатьАктуализациюCDNПлощадокНаСервере(Организация, УникальныйИдентификатор = Неопределено, ОбновлятьБезПроверкиДатыОбновления = Ложь)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление CDN-площадок'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация", Организация);
	ПараметрыФоновогоЗадания.Вставить("ОбновлятьБезПроверкиДатыОбновления", ОбновлятьБезПроверкиДатыОбновления);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"РазрешительныйРежимМаршрутизаторМДЛПСлужебныйВызовСервера.АктуализацияСпискаCDNПлощадокНаСервереДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура АктуализацияСпискаCDNПлощадокНаСервереДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ПараметрыФоновогоЗадания.Свойство("ОбновлятьБезПроверкиДатыОбновления") И ПараметрыФоновогоЗадания.ОбновлятьБезПроверкиДатыОбновления Тогда
		ТребуетсяОбновлениеCDNПлощадок = Истина;
	Иначе
		ТребуетсяОбновлениеCDNПлощадок = РегистрыСведений.СостоянияCDNПлощадокМДЛП.ТребуетсяОбновлениеСпискаCDNПлощадок();
	КонецЕсли;
	
	Если Не ТребуетсяОбновлениеCDNПлощадок Тогда
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	РезультатОбновления = РазрешительныйРежимМДЛП.АктуализацияСпискаCDNПлощадок(ПараметрыФоновогоЗадания.Организация);
	
	Если ЗначениеЗаполнено(РезультатОбновления.СписокПлощадок) Тогда
		
		РезультатЗаписи = РегистрыСведений.СостоянияCDNПлощадокМДЛП.ЗаписатьДанныеСостоянияCDNПлощадок(РезультатОбновления.СписокПлощадок);
		
		Если РезультатЗаписи.Отказ Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатЗаписи.ТекстОшибки;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатОбновления.ТекстОшибки;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
		
		// если требуется обновление токена, не выводить текст ошибки, выводить общее окно с подсказкой настройки
		Если Не ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
			ВозвращаемоеЗначение.ТекстОшибки = РезультатОбновления.ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти // CDNПлощадки

#Область ЛокальныйМодульЧЗ

Функция НачатьИнициализациюКонфигурацииЛокальногоМодуляЧЗНаСервере(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Инициализация конфигурации локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация"       , Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки", ПараметрыУстановки);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"РазрешительныйРежимМаршрутизаторМДЛПСлужебныйВызовСервера.ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",                      Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	РезультатОбновления = РазрешительныйРежимМДЛПКлиентСервер.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ(ПараметрыФоновогоЗадания.Организация, ПараметрыФоновогоЗадания.ПараметрыУстановки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                            = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
	ВозвращаемоеЗначение.ТекстОшибки                           = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации                      = РезультатОбновления.ОтказАвторизации;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры


Функция НачатьЗапросСтатусаЛокальногоМодуляЧЗНаСервере(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запрос статуса локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"РазрешительныйРежимМаршрутизаторМДЛПСлужебныйВызовСервера.ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                 Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации",           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("ВерсияСборки",               "");
	ВозвращаемоеЗначение.Вставить("Статус",                     "");
	ВозвращаемоеЗначение.Вставить("ДатаПоследнейСинхронизации", Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("ТребуетсяЗагрузка",          Ложь);
	
	РезультатОбновления = РазрешительныйРежимМДЛПКлиентСервер.ЗапроситьСтатусЛокальногоМодуляЧЗ(ПараметрыФоновогоЗадания.Организация, ПараметрыФоновогоЗадания.ПараметрыУстановки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации           = РезультатОбновления.ОтказАвторизации;
	ВозвращаемоеЗначение.ВерсияСборки               = РезультатОбновления.ВерсияСборки;
	ВозвращаемоеЗначение.Статус                     = РезультатОбновления.Статус;
	ВозвращаемоеЗначение.ТребуетсяЗагрузка          = РезультатОбновления.ТребуетсяЗагрузка;
	ВозвращаемоеЗначение.ДатаПоследнейСинхронизации = РезультатОбновления.ДатаПоследнейСинхронизации;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры


Функция НачатьИзменениеПароляАдминистратораЛокальногоМодуляЧЗНаСервере(Организация, ПараметрыУстановки, НовыйПароль, УникальныйИдентификатор = Неопределено)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Смена пароля администратора локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	ПараметрыФоновогоЗадания.Вставить("НовыйПароль",                      НовыйПароль);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"РазрешительныйРежимМаршрутизаторМДЛПСлужебныйВызовСервера.ВыполнитьИзменениеПароляАдминистратораЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ВыполнитьИзменениеПароляАдминистратораЛокальногоМодуляЧЗДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",       Ложь);
	ВозвращаемоеЗначение.Вставить("ОтказАвторизации", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",      "");
	
	РезультатОбновления = РазрешительныйРежимМДЛПКлиентСервер.ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(ПараметрыФоновогоЗадания.Организация, ПараметрыФоновогоЗадания.ПараметрыУстановки, ПараметрыФоновогоЗадания.НовыйПароль);
	
	ВозвращаемоеЗначение.ЕстьОшибки       = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки      = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.ОтказАвторизации = РезультатОбновления.ОтказАвторизации;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти // ЛокальныйМодульЧЗ

#Область ТСПИоТ

Функция НачатьПолучениеДанныхНастроекТСПИоТ(ПараметрыНастройки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка настройки ТС ПИоТ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ПараметрыНастройки", ПараметрыНастройки);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"РазрешительныйРежимМаршрутизаторМДЛПСлужебныйВызовСервера.ВыполнитьПроверкуНастройкиТСПИоТДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ВыполнитьПроверкуНастройкиТСПИоТДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",               "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", Неопределено);
	
	РезультатОбновления = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыФоновогоЗадания.ПараметрыНастройки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ  = РезультатОбновления.НастройкиЭкземпляраТСПИоТ;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти // ТСПИоТ


#КонецОбласти // СлужебныеПроцедурыИФункции
