
#Область ПрограммныйИнтерфейс

// Выполняет программное изменение структуры формы
// (создание и изменение реквизитов, команд, элементов, условного оформления), 
// связанное с изменениями в общих отраслевых блоках. 
//
// Параметры:
//   ИмяПроцедуры - Строка - Имя процедуры, которая будет выполнять изменение структуры для конкретной формы.
// 				    Должно подчиняться шаблону именования [Сокращенное наименование типа объекта][Имя объекта][Имя Формы] 
//   Форма 	  	  - Форма клиентского приложения, структура которой изменяется 
//   СписокОшибок - Строка - Список ошибок при изменении формы
//
Процедура ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок) Экспорт
	
	СписокПроцедурПрограммногоСоздания 	= ор_ПрограммноеСозданиеЭлементовФормПовтИсп.СписокПроцедурОРМДЛП();
	ПроцедураЕсть 						= СписокПроцедурПрограммногоСоздания.Получить(ИмяПроцедуры);
	
	Если ПроцедураЕсть <> Неопределено  Тогда
		Выполнить("" + ИмяПроцедуры + "(Форма, СписокОшибок);");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает соответствие используемых процедур.
//
// Возвращаемое значение:
//  СоответствияИспользуемыхПроцедурОР - Соответствие - Наименования используемых процедур.
//
Функция СформироватьСоответствияИспользуемыхПроцедур() Экспорт
	
	СоответствияИспользуемыхПроцедур = Новый Соответствие();
	
	#Область ОбщиеФормы
	СоответствияИспользуемыхПроцедур.Вставить(
		"ОФНастройкиРабочегоМестаКассира",
		"ОбщаяФорма.НастройкиРабочегоМестаКассира");
	#КонецОбласти
	
	#Область Справочники
	СоответствияИспользуемыхПроцедур.Вставить(
		"СпрКассыККМФормаЭлемента",
		"Справочник.КассыККМ.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"СпрЕдиницыИзмеренияФормаЭлемента",
		"Справочник.ЕдиницыИзмерения.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"СпрКатегорииНоменклатурыФормаЭлемента",
		"Справочник.КатегорииНоменклатуры.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"СпрХарактеристикиНоменклатурыФормаЭлемента",
		"Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"СпрХарактеристикиНоменклатурыФормаВыбора",
		"Справочник.ХарактеристикиНоменклатуры.Форма.ФормаВыбора");
	СоответствияИспользуемыхПроцедур.Вставить(
		"СпрТСПИоТФормаЭлемента",
		"Справочник.ТСПИоТ.Форма.ФормаЭлемента");
	#КонецОбласти
	
	#Область Документы
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокОприходованиеЗапасовФормаСписка",
		"Документ.ОприходованиеЗапасов.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокОприходованиеЗапасовФормаДокумента",
		"Документ.ОприходованиеЗапасов.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокПеремещениеЗапасовФормаСписка",
		"Документ.ПеремещениеЗапасов.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокПеремещениеЗапасовФормаДокумента",
		"Документ.ПеремещениеЗапасов.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокПриходнаяНакладнаяФормаСписка",
		"Документ.ПриходнаяНакладная.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокПриходнаяНакладнаяФормаДокумента",
		"Документ.ПриходнаяНакладная.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокРасходнаяНакладнаяФормаСписка",
		"Документ.РасходнаяНакладная.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокРасходнаяНакладнаяФормаДокумента",
		"Документ.РасходнаяНакладная.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокКомплектацияЗапасовФормаСписка",
		"Документ.КомплектацияЗапасов.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокКомплектацияЗапасовФормаДокумента",
		"Документ.КомплектацияЗапасов.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокСписаниеЗапасовФормаСписка",
		"Документ.СписаниеЗапасов.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокСписаниеЗапасовФормаДокумента",
		"Документ.СписаниеЗапасов.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокПриходныйОрдерФормаДокумента",
		"Документ.ПриходныйОрдер.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокРасходныйОрдерФормаДокумента",
		"Документ.РасходныйОрдер.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"ДокЧекККМФормаДокумента",
		"Документ.ЧекККМ.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить(
		"Докор_ИзготовлениеЛекарственныхФормФормаСписка",
		"Документ.ор_ИзготовлениеЛекарственныхФорм.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедур.Вставить(
		"Докор_ИзготовлениеЛекарственныхФормФормаДокумента",
		"Документ.ор_ИзготовлениеЛекарственныхФорм.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеВладельцаОбОприходованииМДЛПФормаДокумента",	"Документ.УведомлениеВладельцаОбОприходованииМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОбАгрегированииИТрансформацииУпаковокМДЛПФормаДокумента",	"Документ.УведомлениеОбАгрегированииИТрансформацииУпаковокМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОбОприходованииМДЛПФормаДокумента",			"Документ.УведомлениеОбОприходованииМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОбОтгрузкеМДЛПФормаДокумента",					"Документ.УведомлениеОбОтгрузкеМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛПФормаДокумента", "Документ.УведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОВыбытииМДЛПФормаДокумента",					"Документ.УведомлениеОВыбытииМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОВыдачеВОтделенияМДЛПФормаДокумента",			"Документ.УведомлениеОВыдачеВОтделенияМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОПередачеНаУничтожениеМДЛПФормаДокумента",		"Документ.УведомлениеОПередачеНаУничтожениеМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОПеремещенииМДЛПФормаДокумента",				"Документ.УведомлениеОПеремещенииМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОПовторномВводеВОборотМДЛПФормаДокумента",		"Документ.УведомлениеОПовторномВводеВОборотМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОПриемкеМДЛПФормаДокумента",					"Документ.УведомлениеОПриемкеМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОРозничнойПродажеМДЛПФормаДокумента",			"Документ.УведомлениеОРозничнойПродажеМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокУведомлениеОФактеУничтоженияМДЛПФормаДокумента",			"Документ.УведомлениеОФактеУничтоженияМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокИнвентаризацияПотребительскихУпаковокМДЛПФормаДокумента",	"Документ.ИнвентаризацияПотребительскихУпаковокМДЛП.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедур.Вставить("ДокИнвентаризацияЗапасовФормаДокумента",						"Документ.ИнвентаризацияЗапасов.Форма.ФормаДокумента");
	#КонецОбласти
	
	#Область ЖурналыДокументов
	СоответствияИспользуемыхПроцедур.Вставить("ЖурДокЧекиККМФормаСписка", "ЖурналДокументов.ЧекиККМ.Форма.ФормаСписка");
	#КонецОбласти
	
	#Область Обработки
	СоответствияИспользуемыхПроцедур.Вставить(
		"ОбрРабочееМестоКассираФормаРМК",
		"Обработка.РабочееМестоКассира.Форма.ФормаРМК");
	#КонецОбласти
	
	#Область РегистрыСведений
	СоответствияИспользуемыхПроцедур.Вставить(
		"РСДанныеКлючаСессииИСМПФормаПросмотраИАктуализацииТокеновАвторизации",
		"РегистрСведений.ДанныеКлючаСессииИСМП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации");
	СоответствияИспользуемыхПроцедур.Вставить(
		"РСДанныеКлючаСессииМДЛПФормаПросмотраИАктуализацииТокеновАвторизации",
		"РегистрСведений.ДанныеКлючаСессииМДЛП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации");
	#КонецОбласти
	
	Возврат СоответствияИспользуемыхПроцедур;
	
КонецФункции

#Область СозданиеЭлементов

#Область ОбщиеФормы

Процедура ОФНастройкиРабочегоМестаКассира(Форма, СписокОшибок)

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ОткрыватьФормуВводаДанныхРецептаПриПодбореНоменклатуры", 
		Тип("ПолеФормы"),
		Элементы.ГруппаОтраслевыеФлагиЛево,
		Элементы.ГруппаВыбораЦветаДляТовараОтпускаемогоПоРецепту);
	НовыйЭлемент.Вид 	 	 		= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным 		= "НастройкиРМК.ор_ОткрыватьФормуВводаДанныхРецептаПриПодбореНоменклатуры";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
#КонецОбласти

#Область ИзмененныеСвойства
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область ПланыОбмена
#КонецОбласти

#Область Справочники

Процедура СпрКассыККМФормаЭлемента(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"РеквизитыМДЛП",
		Тип("ГруппаФормы"),
		Элементы.ГруппаОсновныеПараметрыКассы,
		Элементы.ГруппаНастройкиСБП);
	НовыйЭлемент.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Маркировка ИС МДЛП'");
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Маркировка ИС МДЛП'");
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_МДЛПОтправлятьДанныеМаркируемыхТоваровЧерезОФД",
		Тип("ПолеФормы"),
		Элементы.РеквизитыМДЛП);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным        = "Объект.ор_МДЛПОтправлятьДанныеМаркируемыхТоваровЧерезОФД";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
#КонецОбласти

КонецПроцедуры

Процедура СпрЕдиницыИзмеренияФормаЭлемента(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить("ор_КоличествоПервичныхУпаковок", Тип("ПолеФормы"),, Элементы.ГруппаВесИОбъем);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_КоличествоПервичныхУпаковок";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_КоличествоПервичныхУпаковок");
#КонецОбласти

КонецПроцедуры

Процедура СпрКатегорииНоменклатурыФормаЭлемента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ГруппаМаркировкаМДЛП",
		Тип("ГруппаФормы"),
		Элементы.СтраницаМаркировкаИФГИСЛеваяКолонка,
		Элементы.ГруппаАлкогольнаяПродукция);
	НовыйЭлемент.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Маркировка ИС МДЛП'");
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Маркировка ИС МДЛП'");
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ор_УчетМаркируемыхТоваров",
		Тип("ПолеФормы"),
		Элементы.ГруппаМаркировкаМДЛП);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок          = НСтр("ru = 'Маркируемая лекарственная продукция'");
	НовыйЭлемент.ПутьКДанным        = "Объект.ор_УчетМаркируемыхТоваров";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ВидФлажка          = ВидФлажка.Выключатель;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_УчетМаркируемыхТоваров");
	
	НовыйЭлемент.Подсказка = НСтр("ru = 'Осуществляется обмен с ИС МДЛП информацией по обороту лекарственной продукции.'");
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	
#КонецОбласти

КонецПроцедуры

Процедура СпрХарактеристикиНоменклатурыФормаЭлемента(Форма, СписокОшибок)
	
#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_МаркируемыйТовар",
		Тип("ПолеФормы"),
		Элементы.ГруппаФлажков);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным        = "Объект.ор_МаркируемыйТовар";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_ОтраслевкаПриИзменении");
	
#КонецОбласти

#Область ИзмененныеСвойства
	
#КонецОбласти

КонецПроцедуры

Процедура СпрХарактеристикиНоменклатурыФормаВыбора(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ДанныеМаркировкиМДЛП",
										Новый ОписаниеТипов(),,
										"Данные маркировки");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	#КонецОбласти
	
	#Область ДинамическогоСписка
	#КонецОбласти
	
КонецПроцедуры

Процедура СпрТСПИоТФормаЭлемента(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОрганизацияМДЛП",
		Новый ОписаниеТипов("СправочникСсылка.ОрганизацииМДЛП"),,
		НСтр("ru = 'Организация МДЛП'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НастройкаЛокальногоМодуляМДЛП",
		Новый ОписаниеТипов());
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"АдресПодключенияЛМЧЗМДЛП",
		Новый ОписаниеТипов("Строка"),,
		НСтр("ru = 'Адрес подключения Локального модуля Честный знак для МДЛП'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"АдресПодключенияЛМЧЗМДЛПВнутреннийПИоТ",
		Тип("ПолеФормы"),
		Элементы.ВнутреннийТСПИоТ,
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ);
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок                = НСтр("ru = 'МДЛП ЛМ ""Честный знак""'");
	НовыйЭлемент.ПутьКДанным              = "АдресПодключенияЛМЧЗМДЛП";
	НовыйЭлемент.Гиперссылка              = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_АдресПодключенияЛМЧЗМДЛПВнутреннийПИоТНажатие");
	
	НовыйЭлемент = Элементы.Вставить(
		"АдресПодключенияЛМЧЗМДЛПВнешнийПИоТ",
		Тип("ПолеФормы"),
		Элементы.ВнешнийТСПИоТ,
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ);
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок                = НСтр("ru = 'МДЛП ЛМ ""Честный знак""'");
	НовыйЭлемент.ПутьКДанным              = "АдресПодключенияЛМЧЗМДЛП";
	НовыйЭлемент.Гиперссылка              = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_АдресПодключенияЛМЧЗМДЛПВнешнийПИоТНажатие");
	
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область Документы

Процедура ДокОприходованиеЗапасовФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.ОприходованиеЗапасов");
	
КонецПроцедуры

Процедура ДокОприходованиеЗапасовФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.Запасы.КоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ор_НеИспользоватьМаркировкуЛС", 
									Тип("ПолеФормы"),
									Элементы.ЛеваяКолонка);
	НовыйЭлемент.Вид 	 	 		= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным 		= "Объект.ор_НеИспользоватьМаркировкуЛС";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_НеИспользоватьМаркировкуЛСПриИзменении");
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокПеремещениеЗапасовФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.ПеремещениеЗапасов");
	
КонецПроцедуры

Процедура ДокПеремещениеЗапасовФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.ЗапасыКоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	// ++ СтраницаТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("СтраницаТранспортныеУпаковки",
											Тип("ГруппаФормы"),
											Элементы.ГруппаСтраницы,
											Элементы.СтраницаСпецоснастка);
	НовыйЭлемент.Вид 				  	= ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.Подсказка 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.ПутьКДаннымЗаголовка 	= "Объект.ор_ТранспортныеУпаковки.КоличествоСтрок";
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// ++ ор_ТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковки",
										    Тип("ТаблицаФормы"),
										    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_ТранспортныеУпаковки";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования");
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерУпаковки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерУпаковки";
	
	// -- ор_ТранспортныеУпаковки
	// -- СтраницаТранспортныеУпаковки
	
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_НеИспользоватьМаркировкуЛС",
		Тип("ПолеФормы"),
		Элементы.ЛеваяКолонка);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным        = "Объект.ор_НеИспользоватьМаркировкуЛС";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_НеИспользоватьМаркировкуЛСПриИзменении");
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"Запасы",
		"ПередНачаломИзменения",
		"ЗапасыПередНачаломИзменения",
		,
		СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокПриходнаяНакладнаяФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.ПриходнаяНакладная");
	
	#Область ИзмененныеСвойства
	Форма.Список.УстановитьОбязательноеИспользование("Организация"       , Истина);
	Форма.Список.УстановитьОбязательноеИспользование("СтруктурнаяЕдиница", Истина);
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ОткрытьПанельМаркировкиМДЛП");
	НоваяКоманда.Действие                   = "Подключаемый_ОткрытьПанельМаркировкиМДЛП";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Панель МДЛП'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Настройка и выполение обмена МДЛП.'");
	
	НоваяКоманда = Форма.Команды.Добавить("ПолучитьСоставТранспортныхУпаковок");
	НоваяКоманда.Действие                   = "Подключаемый_ПолучитьСоставТранспортныхУпаковок";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Состав ТУ'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Получает информацию о составе транспортных упаковок из ИС ""Маркировка.МДЛП"".'");
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ОткрытьПанельМаркировкиМДЛП",
		Тип("КнопкаФормы"),
		Элементы.СписокКоманднаяПанель,
		Элементы.ГруппаГлобальныеКоманды);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ОткрытьПанельМаркировкиМДЛП";
	
	НовыйЭлемент = Элементы.Вставить(
		"ПолучитьСоставТранспортныхУпаковок",
		Тип("КнопкаФормы"),
		Элементы.СписокКоманднаяПанель,
		Элементы.ГруппаГлобальныеКоманды);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ПолучитьСоставТранспортныхУпаковок";
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокПриходнаяНакладнаяФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	ДобавитьРеквизитыХарактеристикСоставаТУ(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьНомераУпаковок");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьНомераУпаковок";
	НоваяКоманда.Заголовок 					= "Заполнить номера упаковок";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить номера упаковок";
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьПоУведомлению");
	НоваяКоманда.Действие 					= "ЗаполнитьПоУведомлению";
	НоваяКоманда.Заголовок 					= "Заполнить по уведомлению";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить по уведомлению";
	
	НоваяКоманда = Форма.Команды.Добавить("СопоставитьПоУведомлению");
	НоваяКоманда.Действие 					= "СопоставитьПоУведомлению";
	НоваяКоманда.Заголовок 					= "Сопоставить по уведомлению";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Сопоставить по уведомлению";
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьСоставТранспортнойУпаковки");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьСоставТранспортнойУпаковки";
	НоваяКоманда.Заголовок 					= "Заполнить";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить состав транспортной упаковки";
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ЗаполнитьНомераУпаковок", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "ЗаполнитьНомераУпаковок";
	
	НовыйЭлемент = Элементы.Вставить("ТоварыЗаполнитьПоУведомлению", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "ЗаполнитьПоУведомлению";
	
	НовыйЭлемент = Элементы.Вставить("ТоварыСопоставитьПоУведомлению", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "СопоставитьПоУведомлению";
	
	// ++ СтраницаТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("СтраницаТранспортныеУпаковки",
											Тип("ГруппаФормы"),
											Элементы.Страницы,
											Элементы.ГруппаДоставка);
	НовыйЭлемент.Вид 				  	= ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.Подсказка 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.ПутьКДаннымЗаголовка 	= "Объект.ор_ТранспортныеУпаковки.КоличествоСтрок";
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// ++ ор_ТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковки",
										    Тип("ТаблицаФормы"),
										    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_ТранспортныеУпаковки";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", 	"Подключаемый_ор_ТранспортныеУпаковкиПриАктивизацииСтроки");
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПередУдалением", 			"Подключаемый_ор_ТранспортныеУпаковкиПередУдалением");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования");
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерУпаковки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерУпаковки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиЦена",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.Цена";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиСуммаНДС",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.СуммаНДС";
	// -- ор_ТранспортныеУпаковки
	
	// ++  ор_СоставТранспортныхУпаковок
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковок",
									    Тип("ТаблицаФормы"),
									    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_СоставТранспортныхУпаковок";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_СоставТранспортныхУпаковокПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_СоставТранспортныхУпаковокПриНачалеРедактирования");
	НовыйЭлемент.УстановитьДействие("ПослеУдаления", 			"Подключаемый_ор_СоставТранспортныхУпаковокПослеУдаления");
	НовыйЭлемент.УстановитьДействие("ПриОкончанииРедактирования", "Подключаемый_ор_СоставТранспортныхУпаковокПриОкончанииРедактирования");
	
	НовыйЭлемент = Форма.Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНоменклатура",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Номенклатура";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокНоменклатураПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокХарактеристика",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Характеристика";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаПриИзменении");
	//НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаНачалоВыбора");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокGTIN",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.GTIN";
		
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСерии",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСерии";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокКоличество",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Количество";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокКоличествоПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокЦена",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Цена";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокСуммаНДС",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.СуммаНДС";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокЗаполнитьТранспортныеУпаковки",
										Тип("КнопкаФормы"),
										Элементы.ор_СоставТранспортныхУпаковок.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьСоставТранспортнойУпаковки";
	// -- ор_СоставТранспортныхУпаковок
	// -- СтраницаТранспортныеУпаковки
	
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокРасходнаяНакладнаяФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.РасходнаяНакладная");
	
КонецПроцедуры

Процедура ДокРасходнаяНакладнаяФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	ДобавитьРеквизитыХарактеристикСоставаТУ(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("СопоставитьПоУведомлению");
	НоваяКоманда.Действие 					= "СопоставитьПоУведомлению";
	НоваяКоманда.Заголовок 					= "Сопоставить по уведомлению";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Сопоставить по уведомлению";
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьСоставТранспортнойУпаковки");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьСоставТранспортнойУпаковки";
	НоваяКоманда.Заголовок 					= "Заполнить";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить состав транспортной упаковки";
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ТоварыСопоставитьПоУведомлению", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "СопоставитьПоУведомлению";
	
	// ++ СтраницаТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("СтраницаТранспортныеУпаковки",
											Тип("ГруппаФормы"),
											Элементы.Страницы,
											Элементы.ГруппаДоставка);
	НовыйЭлемент.Вид 				  	= ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.Подсказка 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.ПутьКДаннымЗаголовка 	= "Объект.ор_ТранспортныеУпаковки.КоличествоСтрок";
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// ++ ор_ТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковки",
										    Тип("ТаблицаФормы"),
										    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_ТранспортныеУпаковки";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", 	"Подключаемый_ор_ТранспортныеУпаковкиПриАктивизацииСтроки");
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПередУдалением", 			"Подключаемый_ор_ТранспортныеУпаковкиПередУдалением");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования");
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерУпаковки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерУпаковки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиЦена",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.Цена";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиСуммаНДС",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.СуммаНДС";
	// -- ор_ТранспортныеУпаковки
	
	// ++  ор_СоставТранспортныхУпаковок
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковок",
									    Тип("ТаблицаФормы"),
									    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_СоставТранспортныхУпаковок";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_СоставТранспортныхУпаковокПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_СоставТранспортныхУпаковокПриНачалеРедактирования");
	НовыйЭлемент.УстановитьДействие("ПослеУдаления", 			"Подключаемый_ор_СоставТранспортныхУпаковокПослеУдаления");
	НовыйЭлемент.УстановитьДействие("ПриОкончанииРедактирования", "Подключаемый_ор_СоставТранспортныхУпаковокПриОкончанииРедактирования");
	
	НовыйЭлемент = Форма.Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНоменклатура",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Номенклатура";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокНоменклатураПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокХарактеристика",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Характеристика";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаПриИзменении");
	//НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаНачалоВыбора");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокGTIN",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.GTIN";
		
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСерии",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСерии";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокКоличество",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Количество";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокКоличествоПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокЦена",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Цена";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокСуммаНДС",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.СуммаНДС";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокЗаполнитьТранспортныеУпаковки",
										Тип("КнопкаФормы"),
										Элементы.ор_СоставТранспортныхУпаковок.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьСоставТранспортнойУпаковки";
	// -- ор_СоставТранспортныхУпаковок
	// -- СтраницаТранспортныеУпаковки
	
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокКомплектацияЗапасовФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.КомплектацияЗапасов");
	
КонецПроцедуры

Процедура ДокКомплектацияЗапасовФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок, Форма.Элементы.Страницы);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.ЗапасыКоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"Запасы",
		"ПередНачаломИзменения",
		"ЗапасыПередНачаломИзменения",
		,
		СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокСписаниеЗапасовФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.СписаниеЗапасов");
	
КонецПроцедуры

Процедура ДокСписаниеЗапасовФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.Запасы.КоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ор_НеИспользоватьМаркировкуЛС", 
									Тип("ПолеФормы"),
									Элементы.ЛеваяКолонка);
	НовыйЭлемент.Вид 	 			= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным 		= "Объект.ор_НеИспользоватьМаркировкуЛС";
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_НеИспользоватьМаркировкуЛСПриИзменении");
	
	// ++ СтраницаТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("СтраницаТранспортныеУпаковки",
											Тип("ГруппаФормы"),
											Элементы.Страницы,
											Элементы.ГруппаДополнительно);
	НовыйЭлемент.Вид 				  	= ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.Подсказка 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.ПутьКДаннымЗаголовка 	= "Объект.ор_ТранспортныеУпаковки.КоличествоСтрок";
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// ++ ор_ТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковки",
										    Тип("ТаблицаФормы"),
										    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_ТранспортныеУпаковки";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования");
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерУпаковки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерУпаковки";
	// -- ор_ТранспортныеУпаковки
	// -- СтраницаТранспортныеУпаковки
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокПриходныйОрдерФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	ДобавитьРеквизитыХарактеристикСоставаТУ(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.Запасы.КоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьНомераУпаковок");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьНомераУпаковок";
	НоваяКоманда.Заголовок 					= "Заполнить номера упаковок";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить номера упаковок";
	
	НоваяКоманда = Форма.Команды.Добавить("СопоставитьПоУведомлению");
	НоваяКоманда.Действие 					= "СопоставитьПоУведомлению";
	НоваяКоманда.Заголовок 					= "Сопоставить по уведомлению";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Сопоставить по уведомлению";
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьСоставТранспортнойУпаковки");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьСоставТранспортнойУпаковки";
	НоваяКоманда.Заголовок 					= "Заполнить";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить состав транспортной упаковки";
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ЗаполнитьНомераУпаковок", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "ЗаполнитьНомераУпаковок";
	
	НовыйЭлемент = Элементы.Вставить("ТоварыСопоставитьПоУведомлению", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "СопоставитьПоУведомлению";
	
	// ++ СтраницаТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("СтраницаТранспортныеУпаковки",
											Тип("ГруппаФормы"),
											Элементы.Страницы,
											Элементы.ГруппаДополнительно);
	НовыйЭлемент.Вид 				  	= ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.Подсказка 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.ПутьКДаннымЗаголовка 	= "Объект.ор_ТранспортныеУпаковки.КоличествоСтрок";
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// ++ ор_ТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковки",
										    Тип("ТаблицаФормы"),
										    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_ТранспортныеУпаковки";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", 	"Подключаемый_ор_ТранспортныеУпаковкиПриАктивизацииСтроки");
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПередУдалением", 			"Подключаемый_ор_ТранспортныеУпаковкиПередУдалением");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования");
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерУпаковки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерУпаковки";
	// -- ор_ТранспортныеУпаковки
	
	// ++  ор_СоставТранспортныхУпаковок
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковок",
									    Тип("ТаблицаФормы"),
									    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_СоставТранспортныхУпаковок";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_СоставТранспортныхУпаковокПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_СоставТранспортныхУпаковокПриНачалеРедактирования");
	НовыйЭлемент.УстановитьДействие("ПослеУдаления", 			"Подключаемый_ор_СоставТранспортныхУпаковокПослеУдаления");
	НовыйЭлемент.УстановитьДействие("ПриОкончанииРедактирования", "Подключаемый_ор_СоставТранспортныхУпаковокПриОкончанииРедактирования");
	
	НовыйЭлемент = Форма.Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНоменклатура",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Номенклатура";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокНоменклатураПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокХарактеристика",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Характеристика";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаПриИзменении");
	//НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаНачалоВыбора");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокGTIN",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.GTIN";
		
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСерии",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСерии";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокКоличество",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Количество";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокКоличествоПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокЗаполнитьТранспортныеУпаковки",
										Тип("КнопкаФормы"),
										Элементы.ор_СоставТранспортныхУпаковок.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьСоставТранспортнойУпаковки";
	// -- ор_СоставТранспортныхУпаковок
	// -- СтраницаТранспортныеУпаковки
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"ЗапасыХарактеристика",
																"ПриИзменении",
																"ЗапасыХарактеристикаПриИзменении",
																,
																СписокОшибок);
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокРасходныйОрдерФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	ДобавитьРеквизитыХарактеристикСоставаТУ(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.Запасы.КоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("СопоставитьПоУведомлению");
	НоваяКоманда.Действие 					= "СопоставитьПоУведомлению";
	НоваяКоманда.Заголовок 					= "Сопоставить по уведомлению";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Сопоставить по уведомлению";
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьСоставТранспортнойУпаковки");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьСоставТранспортнойУпаковки";
	НоваяКоманда.Заголовок 					= "Заполнить";
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= "Заполнить состав транспортной упаковки";
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ТоварыСопоставитьПоУведомлению", 
											Тип("КнопкаФормы"),
											Элементы.ЗапасыМаркировкаМДЛП);
	НовыйЭлемент.Вид 	 	= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "СопоставитьПоУведомлению";
	
	// ++ СтраницаТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("СтраницаТранспортныеУпаковки",
											Тип("ГруппаФормы"),
											Элементы.Страницы,
											Элементы.ГруппаДополнительно);
	НовыйЭлемент.Вид 				  	= ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.Подсказка 	 		  	= "Транспортные упаковки";
	НовыйЭлемент.ПутьКДаннымЗаголовка 	= "Объект.ор_ТранспортныеУпаковки.КоличествоСтрок";
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// ++ ор_ТранспортныеУпаковки
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковки",
										    Тип("ТаблицаФормы"),
										    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_ТранспортныеУпаковки";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", 	"Подключаемый_ор_ТранспортныеУпаковкиПриАктивизацииСтроки");
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_ТранспортныеУпаковкиПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПередУдалением", 			"Подключаемый_ор_ТранспортныеУпаковкиПередУдалением");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_ТранспортныеУпаковкиПриНачалеРедактирования");
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_ТранспортныеУпаковкиНомерУпаковки",
											Тип("ПолеФормы"),
											Элементы.ор_ТранспортныеУпаковки);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ТранспортныеУпаковки.НомерУпаковки";
	// -- ор_ТранспортныеУпаковки
	
	// ++  ор_СоставТранспортныхУпаковок
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковок",
									    Тип("ТаблицаФормы"),
									    Элементы.СтраницаТранспортныеУпаковки);
	НовыйЭлемент.ПоложениеЗаголовка   		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  		= "Объект.ор_СоставТранспортныхУпаковок";
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", 	"Подключаемый_ор_СоставТранспортныхУпаковокПередНачаломДобавления");
	НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", 	"Подключаемый_ор_СоставТранспортныхУпаковокПриНачалеРедактирования");
	НовыйЭлемент.УстановитьДействие("ПослеУдаления", 			"Подключаемый_ор_СоставТранспортныхУпаковокПослеУдаления");
	НовыйЭлемент.УстановитьДействие("ПриОкончанииРедактирования", "Подключаемый_ор_СоставТранспортныхУпаковокПриОкончанииРедактирования");
	
	НовыйЭлемент = Форма.Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСтроки",
											Тип("ПолеФормы"),
											Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНоменклатура",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Номенклатура";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокНоменклатураПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокХарактеристика",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Характеристика";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаПриИзменении");
	//НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ор_СоставТранспортныхУпаковокХарактеристикаНачалоВыбора");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокGTIN",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.GTIN";
		
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокНомерСерии",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.НомерСерии";
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокКоличество",
										Тип("ПолеФормы"),
										Элементы.ор_СоставТранспортныхУпаковок);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_СоставТранспортныхУпаковок.Количество";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_СоставТранспортныхУпаковокКоличествоПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("ор_СоставТранспортныхУпаковокЗаполнитьТранспортныеУпаковки",
										Тип("КнопкаФормы"),
										Элементы.ор_СоставТранспортныхУпаковок.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьСоставТранспортнойУпаковки";
	// -- ор_СоставТранспортныхУпаковок
	// -- СтраницаТранспортныеУпаковки
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"ЗапасыХарактеристика",
																"ПриИзменении",
																"ЗапасыХарактеристикаПриИзменении",
																,
																СписокОшибок);
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокЧекККМФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.ЗапасыКоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыРассчитатьСкидкиНаценки";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("ПередаватьДанныеМаркировкиЧерезОФД", 
										Новый ОписаниеТипов("Булево"),, 
										"Передавать данные маркировки через ОФД");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ИспользоватьНомераУпаковок", 
										Новый ОписаниеТипов("Булево"),
										"Объект.Подарки", 
										"Использовать номера упаковок");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ПодаркиСтатусЗаполненияУпаковок",
											Тип("ПолеФормы"),
											Элементы.Подарки,
											Элементы.ПодаркиНомерСтроки);
	НовыйЭлемент.Вид 		 				= ВидПоляФормы.ПолеКартинки;
	НовыйЭлемент.ПутьКДанным 				= "Объект.Подарки.ор_СтатусЗаполненияУпаковок";
	НовыйЭлемент.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КартинкаЗначений			= БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	НовыйЭлемент.КартинкаШапки				= БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковокКолонкаСтатусов;
	НовыйЭлемент.ФиксацияВТаблице			= ФиксацияВТаблице.Лево;
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"ПодаркиХарактеристикаНоменклатуры",
																"ПриИзменении",
																"ПодаркиХарактеристикаПриИзменении",
																,
																СписокОшибок);
	
	#КонецОбласти
	
КонецПроцедуры

Процедура Докор_ИзготовлениеЛекарственныхФормФормаСписка(Форма, СписокОшибок)
	
	ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, "Документ.ор_ИзготовлениеЛекарственныхФорм");
	
КонецПроцедуры

Процедура Докор_ИзготовлениеЛекарственныхФормФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	
	СтруктураЭлементов = ПолучитьСтруктуруБазыЭлементов();
	СтруктураЭлементов.ЭлементКП = "Элементы.ГруппаЗапасыКоманднаяПанель";
	СтруктураЭлементов.ЭлементКППеред = "Элементы.ЗапасыГруппаКопированиеСтрок";
	ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов);
	
	#Область УсловноеОформлениеФормы
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Запасы",
																"ПередНачаломИзменения",
																"ЗапасыПередНачаломИзменения",
																,
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеВладельцаОбОприходованииМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОбАгрегированииИТрансформацииУпаковокМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОбОприходованииМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;		
	
	НовыйРеквизит = Новый РеквизитФормы("ОжидаетсяЗаписьДокументаОсновния",
										Новый ОписаниеТипов("Булево"),,
										НСтр("ru = 'Ожидается запись документа основния'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОбОтгрузкеМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("Сопоставить");
	НоваяКоманда.Действие 					= "Подключаемый_Сопоставить";
	НоваяКоманда.Заголовок 					= НСтр("ru = 'Сопоставить'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= НСтр("ru = 'Сопоставить с учетным документом'");
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ФормаСопоставить",
											Тип("КнопкаФормы"),
											Форма.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "Сопоставить";
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОбОтпускеЛППоДокументамОтличнымОтЧекаМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаЗаписиНового", "ОбработкаЗаписиНового");
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"Основание",
		"ПриИзменении",
		"Подключаемый_ОснованиеПриИзменении",,
		СписокОшибок);
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"Основание",
		"НачалоВыбора",
		"Подключаемый_ОснованиеНачалоВыбора",,
		СписокОшибок);
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"Основание",
		"Создание",
		"Подключаемый_ОснованиеСоздание",,
		СписокОшибок);
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы(
		"ТекстВыбытиеТоваров",
		Новый ОписаниеТипов("ФорматированнаяСтрока"),,
		("ru = 'Текст выбытие товаров'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОжидаетсяЗаписьДокументаОсновния",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Ожидается запись документа основния'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ЕстьПравоСозданияРахода",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Есть право создания расходной накладной'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаОснование",
		Тип("ГруппаФормы"),
		Элементы.ГруппаОсновное,
		Элементы.Основание);
	НовыйЭлемент.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.Основание, Элементы.ГруппаОснование);
	
	НовыйЭлемент = Элементы.Вставить(
		"ТекстВыбытиеТоваров",
		Тип("ПолеФормы"),
		Элементы.ГруппаОснование);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным        = "ТекстВыбытиеТоваров";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ТекстВыбытиеТоваровОбработкаНавигационнойСсылки");
	
	Элементы.ТоварыСтатусЗаполненияКиЗ.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОВыбытииМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаЗаписиНового", "ОбработкаЗаписиНового");
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;		
	НовыйРеквизит = Новый РеквизитФормы("ТекстВыбытиеТоваров",
										Новый ОписаниеТипов("ФорматированнаяСтрока"),,
										НСтр("ru = 'Текст выбытие товаров'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ОжидаетсяЗаписьДокументаОсновния",
										Новый ОписаниеТипов("Булево"),,
										НСтр("ru = 'Ожидается запись документа основния'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы("ЕстьПравоСозданияСписания",
										Новый ОписаниеТипов("Булево"),,
										НСтр("ru = 'Есть право создания списания'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды

	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ГруппаОснование",
										Тип("ГруппаФормы"),
										Элементы.ГруппаОсновное,
										Элементы.Основание);
	НовыйЭлемент.Вид 			= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение 	= ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ОтображатьЗаголовок 	= Ложь;
	
	Элементы.Переместить(Элементы.ОснованиеСвязать, Элементы.ГруппаОснование);
	
	НовыйЭлемент = Элементы.Вставить("ТекстВыбытиеТоваров",
										Тип("ПолеФормы"),
										Элементы.ГруппаОснование);
	НовыйЭлемент.Вид 		 			= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным 			= "ТекстВыбытиеТоваров";
	НовыйЭлемент.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ТекстВыбытиеТоваровОбработкаНавигационнойСсылки");
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма, 
																"ОснованиеСвязать", 
																"ПриИзменении", 
																"ОснованиеПриИзменении",, 
																СписокОшибок);
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма, 
																"ОснованиеСвязать", 
																"Создание", 
																"ОснованиеСоздание",, 
																СписокОшибок);
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма, 
																"ТоварыКоличествоПервичныхУпаковокВоВторичной", 
																"ПриИзменении", 
																"ТоварыКоличествоПервичныхУпаковокВоВторичнойПриИзменении",, 
																СписокОшибок);
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма, 
																"НомераУпаковокКоличествоПервичныхУпаковок", 
																"ПриИзменении", 
																"НомераУпаковокКоличествоПервичныхУпаковокПриИзменении",, 
																СписокОшибок);
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОВыдачеВОтделенияМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОПередачеНаУничтожениеМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОПеремещенииМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьДанные");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьДанные";
	НоваяКоманда.Заголовок 					= НСтр("ru = 'Заполнить'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= НСтр("ru = 'Заполнить данные'");
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ТоварыЗаполнитьДанные",
										Тип("КнопкаФормы"),
										Элементы.Товары.КоманднаяПанель,
										Элементы.ТоварыОтображатьВсеНомераУпаковок);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьДанные";
	
	НовыйЭлемент = Элементы.Вставить("СоставТранспортныхУпаковокЗаполнитьДанные",
										Тип("КнопкаФормы"),
										Элементы.СоставТранспортныхУпаковок.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьДанные";
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОПовторномВводеВОборотМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияКиЗ.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОПриемкеМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ОжидаетсяЗаписьДокументаОсновния",
										Новый ОписаниеТипов("Булево"),,
										НСтр("ru = 'Ожидается запись документа основния'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьДанные");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьДанные";
	НоваяКоманда.Заголовок 					= НСтр("ru = 'Заполнить'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Подсказка 					= НСтр("ru = 'Заполнить данные'");
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("ТоварыЗаполнитьДанные",
										Тип("КнопкаФормы"),
										Элементы.Товары.КоманднаяПанель,
										Элементы.ТоварыОтображатьВсеНомераУпаковок);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьДанные";
	
	НовыйЭлемент = Элементы.Вставить("СоставТранспортныхУпаковокЗаполнитьДанные",
										Тип("КнопкаФормы"),
										Элементы.СоставТранспортныхУпаковок.КоманднаяПанель);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьДанные";
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма, 
																"СоставТранспортныхУпаковокЦена", 
																"ПриИзменении", 
																"СоставТранспортныхУпаковокЦенаПриИзменении",, 
																СписокОшибок);
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОРозничнойПродажеМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияКиЗ.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокУведомлениеОФактеУничтоженияМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокИнвентаризацияПотребительскихУпаковокМДЛПФормаДокумента(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ОжидаетсяЗаписьДокументаОсновния",
										Новый ОписаниеТипов("Булево"),,
										НСтр("ru = 'Ожидается запись документа основния'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Элементы.ТоварыСтатусЗаполненияУпаковок.КартинкаЗначений = БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	#КонецОбласти
	
КонецПроцедуры

Процедура ДокИнвентаризацияЗапасовФормаДокумента(Форма, СписокОшибок)
	
	ДобавитьТекстУведомления(Форма, СписокОшибок);
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
	#Область Реквизиты
	#КонецОбласти
	
	#Область Команды
	#КонецОбласти
	
	#Область Элементы
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область ЖурналыДокументов

Процедура ЖурДокЧекиККМФормаСписка(Форма, СписокОшибок)
	
	#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ПроверкаНеобходимостиУстановкиПроизвольногоЗапроса(Форма.ЧекиККМ);
	
	СхемаЗапроса = ор_ПрограммноеСозданиеЭлементовФорм.ПолучитьСхемуЗапроса(Форма.ЧекиККМ.ТекстЗапроса);
	Колонки      = СхемаЗапроса.ПакетЗапросов[0].Колонки;
	Поля         = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	
	Поля.Добавить("Выразить("""" КАК Строка(50))");
	Колонки[Поля.Количество() - 1].Псевдоним = "СтатусМДЛП";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "ЖурналДокументов.ЧекиККМ";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.ЧекиККМ, СвойстваСписка);
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"ЧекиККМ",
																"ПриПолученииДанныхНаСервере",
																"СписокПриПолученииДанныхНаСервере",
																,
																СписокОшибок);
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить("СтатусМДЛП", Тип("ПолеФормы"), Элементы.ЧекиККМ);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ЧекиККМ.СтатусМДЛП";
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты
#КонецОбласти

#Область Обработки

Процедура ОбрРабочееМестоКассираФормаРМК(Форма, СписокОшибок)
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеЗапускатьПроверкуВРежимеПредупреждения", 
		Новый ОписаниеТипов("Булево"),, 
		"НеЗапускатьПроверкуВРежимеПредупреждения");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ОткрыватьФормуВводаДанныхРецептаПриПодбореНоменклатуры", 
		Новый ОписаниеТипов("Булево"),, 
		"ор_ОткрыватьФормуВводаДанныхРецептаПриПодбореНоменклатуры");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ЭтоТоварМДЛП",
		Новый ОписаниеТипов("Булево"),
		"Объект.Товары",
		НСтр("ru = 'Это товар МДЛП'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ИспользоватьРазрешительныйРежимМДЛП",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Признак использования разрешительного режима МДЛП'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ВыбратьУпаковку");
	НоваяКоманда.Действие                   = "Подключаемый_ВыбратьУпаковку";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Ед.'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Единица измерения'");
	НоваяКоманда.Отображение                = ОтображениеКнопки.Текст;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("ВвестиДанныеРецепта");
	НоваяКоманда.Действие                   = "Подключаемый_ВвестиДанныеРецепта";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Рецепт'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Ввести данные рецепта'");
	НоваяКоманда.Отображение                = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ТекущийТоварВыбратьУпаковку",
		Тип("КнопкаФормы"),
		Элементы.ГруппаКнопокУправленияТоваром,
		Элементы.УдалитьТовар);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "ВыбратьУпаковку";
	НовыйЭлемент.Шрифт      = Элементы.ТекущийТоварУстановитьДробноеКоличество.Шрифт;
	
	НовыйЭлемент = Элементы.Вставить(
		"ТекущийТоварВвестиДанныеРецепта",
		Тип("КнопкаФормы"),
		Элементы.ГруппаРучнаяСкидка,
		Элементы.ТоварыСтавкаНДСПереключатель);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "ВвестиДанныеРецепта";
	НовыйЭлемент.Картинка   = БиблиотекаКартинок.ор_ДанныеРецептаОтсутствуют;
	НовыйЭлемент.Шрифт      = Элементы.ТекущийТоварУстановитьДробноеКоличество.Шрифт;
	
	#КонецОбласти
	
	#Область ИзмененныеСвойства
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область РегистрыСведений

Процедура РСДанныеКлючаСессииИСМПФормаПросмотраИАктуализацииТокеновАвторизации(Форма, СписокОшибок)
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТолькоТокеныРазрешительногоРежима",
		Новый ОписаниеТипов("Булево"),, 
		"ТолькоТокеныРазрешительногоРежима");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
КонецПроцедуры

Процедура РСДанныеКлючаСессииМДЛПФормаПросмотраИАктуализацииТокеновАвторизации(Форма, СписокОшибок)
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТолькоТокеныРазрешительногоРежима",
		Новый ОписаниеТипов("Булево"),, 
		"ТолькоТокеныРазрешительногоРежима");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура ДобавитьТекстУведомления(Форма, СписокОшибок, ЭлементШапка = Неопределено)
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТекстУведомленияМДЛП",
		Новый ОписаниеТипов("ФорматированнаяСтрока"),,
		НСтр("ru = 'Статус МДЛП'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	Если ЭлементШапка = Неопределено Тогда
		ЭлементШапка = Элементы.Шапка;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаМаркировкаТоваровМДЛП",
		Тип("ГруппаФормы"),
		Форма,
		ЭлементШапка);
	НовыйЭлемент.Вид                    = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение            = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка            = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"ТекстУведомленияМДЛП",
		Тип("ПолеФормы"),
		Элементы.ГруппаМаркировкаТоваровМДЛП);
	НовыйЭлемент.Вид                    = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным            = "ТекстУведомленияМДЛП";
	НовыйЭлемент.ПоложениеЗаголовка     = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина     = 87;
	НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ТекстУведомленияМДЛПОбработкаНавигационнойСсылки");
	#КонецОбласти
	
КонецПроцедуры

Процедура ДобавитьРеквизитыХарактеристикСоставаТУ(Форма, СписокОшибок)
	
	#Область Реквизиты
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	//НовыйРеквизит = Новый РеквизитФормы("ХарактеристикиИспользуются", 
	//									Новый ОписаниеТипов("Булево"),
	//									"Объект.ор_СоставТранспортныхУпаковок", 
	//									"Характеристики используются");
	//МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ИспользоватьХарактеристики", 
										Новый ОписаниеТипов("Булево"),
										"Объект.ор_СоставТранспортныхУпаковок", 
										"Характеристики используются");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ПроверятьЗаполнениеХарактеристики", 
										Новый ОписаниеТипов("Булево"),
										"Объект.ор_СоставТранспортныхУпаковок", 
										"Проверять заполнение характеристики");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ЗаполнениеХарактеристикиПроверено", 
										Новый ОписаниеТипов("Булево"),
										"Объект.ор_СоставТранспортныхУпаковок", 
										"Заполнение характеристики проверено");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ДобавитьБазовыеЭлементыВФормуДокумента(Форма, СписокОшибок, СтруктураЭлементов)
	
	#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ИспользоватьНомераУпаковок",
										Новый ОписаниеТипов("Булево"),
										СтруктураЭлементов.ОбъектЗапасы,
										"Использовать номера упаковок");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	
	ЭлементКП          = Вычислить(СтруктураЭлементов.ЭлементКП);
	ЭлементКППеред     = Вычислить(СтруктураЭлементов.ЭлементКППеред);
	ЭлементТовары      = Вычислить(СтруктураЭлементов.ЭлементТовары);
	ЭлементТоварыПеред = Вычислить(СтруктураЭлементов.ЭлементТоварыПеред);
	
	НовыйЭлемент = Элементы.Вставить("ЗапасыМаркировкаМДЛП", Тип("ГруппаФормы"), ЭлементКП, ЭлементКППеред);
	НовыйЭлемент.Вид 	 	= ВидГруппыФормы.Подменю;
	НовыйЭлемент.Заголовок 	= "Маркировка";
	
	НовыйЭлемент = Элементы.Вставить("ЗапасыСтатусЗаполненияУпаковок", Тип("ПолеФормы"), ЭлементТовары, ЭлементТоварыПеред);
	НовыйЭлемент.Вид 		 				= ВидПоляФормы.ПолеКартинки;
	НовыйЭлемент.ПутьКДанным 				= "Объект.Запасы.ор_СтатусЗаполненияУпаковок";
	НовыйЭлемент.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КартинкаЗначений			= БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковок;
	НовыйЭлемент.КартинкаШапки				= БиблиотекаКартинок.ор_СтатусыСерийНомеровУпаковокКолонкаСтатусов;
	НовыйЭлемент.ФиксацияВТаблице			= ФиксацияВТаблице.Лево;
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	#КонецОбласти
	
КонецПроцедуры

Функция ПолучитьСтруктуруБазыЭлементов()
	
	СтруктураЭлементов = Новый Структура;
	СтруктураЭлементов.Вставить("ЭлементКП"         , "Элементы.ГруппаЗапасыКоманднаяПанель");
	СтруктураЭлементов.Вставить("ЭлементКППеред"    , "Элементы.ГруппаРаботаСНомерамиГТД");
	СтруктураЭлементов.Вставить("ЭлементТовары"     , "Элементы.Запасы");
	СтруктураЭлементов.Вставить("ЭлементТоварыПеред", "Элементы.ЗапасыНомерСтроки");
	
	СтруктураЭлементов.Вставить("ОбъектЗапасы"      , "Объект.Запасы");
	
	Возврат СтруктураЭлементов;
	
КонецФункции

Процедура ДобавитьСтатусМДЛПВФормуСписка(Форма, СписокОшибок, ИмяОсновнойТаблицы)
	
	#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ПроверкаНеобходимостиУстановкиПроизвольногоЗапроса(Форма.Список);
	
	СхемаЗапроса = ор_ПрограммноеСозданиеЭлементовФорм.ПолучитьСхемуЗапроса(Форма.Список.ТекстЗапроса);
	Колонки      = СхемаЗапроса.ПакетЗапросов[0].Колонки;
	Поля         = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
		
	Поля.Добавить("Выразить("""" КАК Строка(50))");
	Колонки[Поля.Количество() - 1].Псевдоним = "СтатусМДЛП";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = ИмяОсновнойТаблицы;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(Форма,
																"Список",
																"ПриПолученииДанныхНаСервере",
																"СписокПриПолученииДанныхНаСервере",
																,
																СписокОшибок);
	#КонецОбласти
	
	#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Форма.Элементы.Вставить("СтатусМДЛП", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.СтатусМДЛП";
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

