#Область ПрограммныйИнтерфейс

#Область НастройкиТСПИоТ

// Возвращает дату начала действия ТС ПИоТ.
//
// Возвращаемое значение:
//  Дата - дата начала действия ТС ПИоТ.
//
Функция ДатаНачалаДействияТСПИоТДляЛекарств() Экспорт
	
	Возврат ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ПолучитьДатуНачалаДействияТСПИоТ();
	
КонецФункции

// Проверка, подлежит ли продукция обязательной проверке на ТС ПИоТ перед розничной продажей.
//
// Возвращаемое значение:
//  Булево - продукция подлежит обязательной проверке На ТС ПИоТ перед розничной продажей.
//
Функция ПродукцияПодлежитОбязательнойПроверкеНаТСПИоТПередРозничнойПродажей() Экспорт
	
	Если Не ор_ИнтеграцияМДЛПКлиентСерверПовтИсп.ПолучитьПризнакВеденияУчетаМаркировки() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаТСПИоТ = ДатаНачалаДействияТСПИоТДляЛекарств();
	
	Возврат ДатаТСПИоТ <= ТранспортМДЛПАПИКлиентСервер.ПолучитьТекущуюДатуСеанса();
	
КонецФункции

// Функция возвращает признак, что проверка разрешительного режима настроена через ТС ПИоТ для ФН.
//
// Параметры:
//  НомерФискальногоНакопителя - Строка - номер фискального накопителя.
//  ККТФФД12МДЛП               - СправочникСсылка.ПодключаемоеОборудование - ссылка на справочник подключаемого оборудования,
//                               при использовании БПО.
//
// Возвращаемое значение:
//  Структура - результат проверки настройки:
//   * Настроено - Булево - Истина, если для указанного ФН используется проверка кодов маркировки через ТС ПИоТ
//   * НастройкиПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ.
//
Функция НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП) Экспорт
	
	Возврат ИнтеграцияТСПИоТМДЛПВызовСервера.НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	
КонецФункции

#КонецОбласти // НастройкиТСПИоТ

#Область ПроверкаКодовМаркировки

// Возвращает параметры необходимые для выполнения проверки КМ на ТС ПИоТ.
//
// Возвращаемое значение:
//   УникальныйИдентификатор    - УникальныйИдентификатор - идентификатор формы объекта, в котором выполняется проверка,
//                                или новый уникальный идентификатор, к которому можно подключить длительную операцию.
//   Организация                - СправочникСсылка.ОрганизацииМДЛП - организация по которой выполняется проверка КМ.
//   НомерФискальногоНакопителя - Строка - заводской номер фискального накопителя, позволяющий идентифицировать конкретную кассу
//                                с аутентификационным токеном и в случае подозрительной активности заблокировать конкретную кассу,
//                                а не весь токен полностью (блокировка на стороне ГИС МТ).
//   ККТФФД12МДЛП               - СправочникСсылка.ПодключаемоеОборудование - ссылка на справочник подключаемого оборудования,
//                                при использовании БПО.
//   ВыполнятьПроверкуНаТСПИоТ  - Булево - признак необходимости выполнения проверки на ТС ПИоТ.
//                                Выставляется по умолчанию по дате начала действия проверки на ТС ПИоТ.
//   ВыполнятьПроверкуНаВнутреннемТСПИоТ - Булево - признак необходимости выполнения проверки на внутреннем ТС ПИоТ, с использованием БПО.
//   ДанныеДляПроверки          - Массив - данные для проверки КМ.
//                                См. НовыйЭлементДанныхДляПроверкиНаТСПИоТ().
//   РезультатПроверки          - Структура - результаты проверки КМ.
//                                См. НовыйРезультатПроверкиКМНаТСПИоТ().
//
Функция ПараметрыПроверкиКМНаТСПИоТ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор"   , Неопределено);
	ВозвращаемоеЗначение.Вставить("Организация"               , ПредопределенноеЗначение("Справочник.ОрганизацииМДЛП.ПустаяСсылка"));
	ВозвращаемоеЗначение.Вставить("НомерФискальногоНакопителя", "");
	ВозвращаемоеЗначение.Вставить("ККТФФД12МДЛП"              , "");
	
	ВозвращаемоеЗначение.Вставить("ВыполнятьПроверкуНаТСПИоТ" , ПродукцияПодлежитОбязательнойПроверкеНаТСПИоТПередРозничнойПродажей());
	ВозвращаемоеЗначение.Вставить("ВыполнятьПроверкуНаВнутреннемТСПИоТ", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеДляПроверки"         , Новый Массив);
	
	ВозвращаемоеЗначение.Вставить("РезультатПроверки"         , НовыйРезультатПроверкиКМНаТСПИоТ());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает структуру элемента проверки КМ на ТС ПИоТ.
//
// Возвращаемое значение:
//  ПолныйКодМаркировки   - Строка - полный код маркировки в формате Base64.
//  ИдентификаторЭлемента - Строка - идентификатор по которому можно будет получить элемент проверки из общего результата проверки КМ.
//
Функция НовыйЭлементДанныхДляПроверкиНаТСПИоТ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки"  , "");
	ВозвращаемоеЗначение.Вставить("ИдентификаторЭлемента", СокрЛП(Новый УникальныйИдентификатор));
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата проверки КМ на ТС ПИоТ.
//
// Возвращаемое значение:
//  ЕстьОшибки                     - Булево - признак наличия критических ошибок выполнения проверки КМ.
//  ТекстОшибки                    - Строка - текст критических ошибок выполнения проверки КМ.
//  СтатусыТСПИоТ                  - Массив - статусы готовности к работе ТС ПИоТ (см. КонструкторДаныхСтатусаТСПИоТ).
//  ТребуетсяПроверкаНаКлиенте     - Булево - признак необходимости проверки КМ на клиенте.
//  ДанныеПроверки                 - Соответствие - коллекция результатов проверки кодов маркировки.
//   * Ключ - ИдентификаторЭлемента из коллекции ДанныеДляПроверки параметров проверки КМ
//            (см. функции ПараметрыПроверкиКМНаТСПИоТ и НовыйЭлементДанныхДляПроверкиНаТСПИоТ).
//   * Значение - Структура - результат проверки конкретного кода маркировки (см. функцию НовыйРезультатЭлементаПроверкиКМНаТСПИоТ).
//
Функция НовыйРезультатПроверкиКМНаТСПИоТ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки" , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");
	
	ВозвращаемоеЗначение.Вставить("СтатусыТСПИоТ", Неопределено);
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаКлиенте", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеПроверки", Новый Соответствие);
	// ор ++
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных", Неопределено);
	ВозвращаемоеЗначение.Вставить("ПроверкаНаТСПИоТЗавершена", Ложь);
	// ор --
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает описание результата проверки на ТС ПИоТ конкретного кода маркировки.
//
// Возвращаемое значение:
//  Структура:
//   * ЕстьОшибки                   - Булево - признак наличия ошибок проверки КМ.
//   * ТекстОшибки                  - Строка - текст ошибки проверки КМ.
//   * ПредставлениеРезультата      - Строка - представление результата проверки КМ (если ЕстьОшибки, то ТекстОшибки).
//   * ПолныйКодМаркировки          - Строка - полный код маркировки в формате Base64.
//   * ТребуетсяПолныйКодМаркировки - Булево - признак необходимости получения полного кода маркировки.
//   * ДанныеПроверкиКМПолучены     - Булево - признак получения данных проверки КМ (Ложь, если проверка не выполнена).
//   См. РазрешительныйРежимМДЛПКлиентСервер.РезультатЭлементаПроверкиКМПоУмолчанию()
//
Функция НовыйРезультатЭлементаПроверкиКМНаТСПИоТ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки"             , Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"            , "");
	ВозвращаемоеЗначение.Вставить("ПредставлениеРезультата", "");
	
	ВозвращаемоеЗначение.Вставить("ПолныйКодМаркировки"    , "");
	
	ВозвращаемоеЗначение.Вставить("ТребуетсяПолныйКодМаркировки", Ложь);
	
	ВозвращаемоеЗначение.Вставить("ДанныеПроверкиКМПолучены", Ложь);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемоеЗначение, РазрешительныйРежимМДЛПКлиентСервер.РезультатЭлементаПроверкиКМПоУмолчанию());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает результат проверки кодов маркировки на ТС ПИоТ.
//
// Параметры:
//  ПараметрыПроверкиКМ - Структура - См. ПараметрыПроверкиКМНаТСПИоТ.
//
// Возвращаемое значение:
//  РезультатПроверки - Структура - См. НовыйРезультатПроверкиКМНаТСПИоТ.
//
Функция ПроверитьКМНаТСПИоТ(ПараметрыПроверкиКМ) Экспорт
	
	ПараметрыВыполненияПроверки = Новый Структура;
	
	РазрешительныйРежимМДЛПКлиентСервер.ПодготовитьПараметрыВыполненияПроверкиКМ(ПараметрыВыполненияПроверки, ПараметрыПроверкиКМ);
	
	РезультатПроверки = ПараметрыВыполненияПроверки.РезультатПроверки;
	
	Если Не ПараметрыВыполненияПроверки.ВыполнятьПроверкуНаТСПИоТ Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатЗапросаНаТСПИоТ = ДанныеКодовМаркировкиНаТСПИоТ(
		ПараметрыВыполненияПроверки.ДанныеДляПроверки,
		ПараметрыВыполненияПроверки.НомерФискальногоНакопителя,
		ПараметрыВыполненияПроверки.ККТФФД12МДЛП);
	
	РазрешительныйРежимМДЛПКлиентСервер.ЗаполнитьРезультатПроверкиИзРезультатаЗапроса(РезультатПроверки, РезультатЗапросаНаТСПИоТ);
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти // ПроверкаКодовМаркировки

#Область МетодыИнтерфейсаТСПИоТ

#Область ПараметрыМетодовИнтерфейсаТСПИоТ

// Конструктор параметров подключения ТС ПИоТ - адрес подключения.
//
// Возвращаемое значение:
//  Структура - Параметры подключения ТС ПИоТ:
//   * Адрес - Строка - адрес сервера
//   * Порт - Число - порт службы отправки запросов. По умолчанию 443
//   * ЗащищенноеСоединение - Булево - Истина, если используется протокол https://, и Ложь, если http://
//   * ОбменНаСервере - Булево - Истина, если настроен обмен на сервере.
//   * АдресПодключения - Строка - адрес подключения
//
Функция ПараметрыПодключенияТСПИоТ() Экспорт
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("Адрес"               , "");
	ПараметрыПодключения.Вставить("Порт"                , 443);
	ПараметрыПодключения.Вставить("ЗащищенноеСоединение", Истина);
	ПараметрыПодключения.Вставить("ОбменНаСервере"      , Ложь);
	ПараметрыПодключения.Вставить("АдресПодключения"    , "");
	ПараметрыПодключения.Вставить("ИсключитьПроверкуКорневыхСертификатов", Ложь);
	ПараметрыПодключения.Вставить("ПодключаемоеОборудование",              Неопределено);
	ПараметрыПодключения.Вставить("ТСПИоТ",                                Неопределено);
	ПараметрыПодключения.Вставить("ВнутреннийТСПИоТ",                      Ложь);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

// Возвращает параметры для отправки HTTP запросов к ТС ПИоТ
// по переданным настройкам подключения.
//
// Параметры:
//  ПараметрыПодключения - см. ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ.
//
// Возвращаемое значение:
//  Структура - Описание:
//   * ПредставлениеСервиса - Строка - Представления сервиса.
//   * Адрес                - Строка - Адрес сервера.
//   * Порт                 - Число - Порт соединения.
//   * Таймаут              - Число - Таймаут соединения.
//   * ЗащищенноеСоединение - Булево - Признак использования SSL.
//
Функция ПараметрыОтправкиHTTPЗапросовКТСПИоТ(ПараметрыУстановки) Экспорт
	
	ПараметрыОтправкиHTTPЗапросов = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросов();
	ПараметрыОтправкиHTTPЗапросов.ПредставлениеСервиса = НСтр("ru = 'ТС ПИоТ'");
	ПараметрыОтправкиHTTPЗапросов.Адрес                = ПараметрыУстановки.Адрес;
	ПараметрыОтправкиHTTPЗапросов.Порт                 = ПараметрыУстановки.Порт;
	ПараметрыОтправкиHTTPЗапросов.ЗащищенноеСоединение = ПараметрыУстановки.ЗащищенноеСоединение;
	
	ИсключитьПроверкуКорневыхСертификатов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУстановки, "ИсключитьПроверкуКорневыхСертификатов", Ложь);
	Если ИсключитьПроверкуКорневыхСертификатов = Истина И ПараметрыОтправкиHTTPЗапросов.ЗащищенноеСоединение = Истина Тогда
		// В следствие изменения значения ЗащищенноеСоединение с Истина на Новый ЗащищенноеСоединениеOpenSSL(),
		// в механизме ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос не будет применено стандартное получение значения
		// ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение().
		ПараметрыОтправкиHTTPЗапросов.ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	КонецЕсли;
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

// Конструктор настройки экземпляра ТСПИоТ.
//
// Возвращаемое значение:
//  Структура:
//   * НомерФискальногоНакопителя    - Строка - номер фискального накопителя, к которому подключен экземпляр ТС ПИоТ.
//   * ИдентификаторТСПИоТ           - Строка - идентификатор экземпляра ТС ПИоТ.
//   * ЗаводскойНомерККТ             - Строка - заводской номер ККТ.
//   * ИНН                           - Строка - ИНН владельца кассы.
//   * ТаймаутПроверкиКодаМаркировки - Число - Таймаут проверки кода маркировки в ТС ПИоТ в миллисекундах.
//
Функция КонструкторНастройкиЭкземпляраТСПИоТ() Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("НомерФискальногоНакопителя"   , "");
	СтруктураВозврата.Вставить("ИдентификаторТСПИоТ"          , "");
	СтруктураВозврата.Вставить("ЗаводскойНомерККТ"            , "");
	СтруктураВозврата.Вставить("ИНН"                          , "");
	СтруктураВозврата.Вставить("ТаймаутПроверкиКодаМаркировки", 0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти // ПараметрыМетодовИнтерфейсаТСПИоТ

// Запрос данных о подключенной ККТ к экземпляру ТС ПИоТ по адресу подключения.
//
// Параметры:
//  ПараметрыУстановки - см. ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ.
//
// Возвращаемое значение:
//  Структура - Настройки экземпляра ТС ПИоТ:
//   * РезультатОтправкиЗапроса - см. ОбработатьОтветПолученияНастроекЭкземпляраТСПИоТ.
//   * ТекстОшибки - Строка - текст ошибки, полученной от ТС ПИоТ.
//   * НастройкиЭкземпляраТСПИоТ - см. КонструкторНастройкиЭкземпляраТСПИоТ
//
Функция ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыУстановки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",  Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", Неопределено);
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКТСПИоТ(ПараметрыУстановки);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	ДанныеЗапроса = ПодготовитьДанныеЗапросаПолученияНастроекЭкземпляраТСПИоТ();
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ОбработатьОтветПолученияНастроекЭкземпляраТСПИоТ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, ДанныеЗапроса.АдресЗапроса);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает подготовленные данные запроса получения настроек экземпляра ТС ПИоТ.
//
Функция ПодготовитьДанныеЗапросаПолученияНастроекЭкземпляраТСПИоТ() Экспорт
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	ДанныеЗапроса.АдресЗапроса = "api/v1/info";
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Accept",         "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Content-Type",   "application/json");
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

// Обрабатывает ответ запроса получения настроек экземпляра ТС ПИоТ.
//
Процедура ОбработатьОтветПолученияНастроекЭкземпляраТСПИоТ(РезультатОтправкиЗапроса, ВозвращаемоеЗначение, URLЗапроса) Экспорт
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
		Возврат;
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
	
	Если ДанныеОтвета = Неопределено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса);
		Возврат;
	КонецЕсли;
	
	НастройкиЭкземпляраТСПИоТ = КонструкторНастройкиЭкземпляраТСПИоТ();
	
	НастройкиЭкземпляраТСПИоТ.НомерФискальногоНакопителя    = ДанныеОтвета.Получить("fnSerial");
	НастройкиЭкземпляраТСПИоТ.ИдентификаторТСПИоТ           = ДанныеОтвета.Получить("tspiotId");
	НастройкиЭкземпляраТСПИоТ.ЗаводскойНомерККТ             = ДанныеОтвета.Получить("kktSerial");
	НастройкиЭкземпляраТСПИоТ.ИНН                           = ДанныеОтвета.Получить("kktInn");
	НастройкиЭкземпляраТСПИоТ.ТаймаутПроверкиКодаМаркировки = ДанныеОтвета.Получить("codesCheckTimeout");
	
	ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ = НастройкиЭкземпляраТСПИоТ;
	
КонецПроцедуры

#КонецОбласти // МетодыИнтерфейсаТСПИоТ

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Конструктор даных статуса готовности к работе внутреннего ТС ПИоТ.
//
// Возвращаемое значение:
//  Структура - Конструктор даных статуса ТС ПИоТ:
//  * АварийныйРежим - Булево - Истина, если объявлен аварийный режим
//  * АварийныйРежимДо - Дата - срок действия аварийного режима
//  * АвторизацияПройдена - Булево - Истина, если ТС ПИоТ прошел авторизацию
//  * ГотовКПроверкеКМ - Булево - Истина, если ТС ПИоТ готов к проверке марок
//  * ГотовКПроверкеКМOnline     - Булево - Истина, если ТС ПИоТ готов к проверке онлайн
//  * ГотовКПроверкеКМOffline - Булево - Истина, если ТС ПИоТ готов к проверке офлайн
//  * ЛМЧЗГотов - Булево - Истина, если ЛМ ЧЗ готов к проверке офлайн
//  * ЛМЧЗСтатус - Строка - статус ЛМ ЧЗ строкой
//  * ПостАварийныйРежим - Булево - Истина, если объявлен пост-аварийный режим
//  * РегистрацияПройдена - Булево - Истина, если регистрация пройдена
//
Функция КонструкторДаныхСтатусаТСПИоТ() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("АварийныйРежим",          Ложь);
	СтруктураВозврата.Вставить("АварийныйРежимДо",        Дата(1, 1, 1));
	СтруктураВозврата.Вставить("АвторизацияПройдена",     Ложь);
	СтруктураВозврата.Вставить("ГотовКПроверкеКМ",        Ложь);
	СтруктураВозврата.Вставить("ГотовКПроверкеКМOnline",  Ложь);
	СтруктураВозврата.Вставить("ГотовКПроверкеКМOffline", Ложь);
	СтруктураВозврата.Вставить("ЛМЧЗГотов",               Ложь);
	СтруктураВозврата.Вставить("ЛМЧЗСтатус",              "");
	СтруктураВозврата.Вставить("ПостАварийныйРежим",      Ложь);
	СтруктураВозврата.Вставить("РегистрацияПройдена",     Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция проверяет статус готовности внутреннего ТС ПИоТ к проверке марок.
//
// Параметры:
//  ДанныеСтатусаТСПИоТ - см. КонструкторДаныхСтатусаТСПИоТ.
//
// Возвращаемое значение:
//  Булево - Истина, если ТС ПИоТ готов к проверке марок.
//
Функция ПроверкаГотовностиТСПИоТаКПроверкеКМ(ДанныеСтатусаТСПИоТ) Экспорт
	
	Возврат ДанныеСтатусаТСПИоТ.ГотовКПроверкеКМ
		И (ДанныеСтатусаТСПИоТ.ГотовКПроверкеКМOnline Или ДанныеСтатусаТСПИоТ.ГотовКПроверкеКМOffline);
	
КонецФункции


#Область ПроверкаКодаМаркировки

Функция ДанныеКодовМаркировкиНаТСПИоТ(ДанныеПроверкиКМ, НомерФискальногоНакопителя, ККТФФД12МДЛП)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим"               , Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаКлиенте"   , Ложь);
	// ор ++
	ВозвращаемоеЗначение.Вставить("ПроверкаНаТСПИоТЗавершена"    , Ложь);
	// ор --
	
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                  , "");
	ВозвращаемоеЗначение.Вставить("КонтролиРазрешительногоРежима", Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ"  , Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанных"      , Новый Соответствие);
	
	ВозвращаемоеЗначение.АварийныйРежим = РазрешительныйРежимМДЛПКлиентСервер.ДействуетАварийныйРежимДляРозничныхПродаж();
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		// На срок действия аварийного режима разрешена продажа без разрешительного режима
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	МассивКодовИдентификацииДляОтправки = Новый Массив;
	Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
		МассивКодовИдентификацииДляОтправки.Добавить(ЭлементПроверки.ПолныйКодМаркировки);
		// Изначально, считаем все элементы проверки без данных.
		ВозвращаемоеЗначение.КодыМаркировкиБезДанных.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ЭлементПроверки);
	КонецЦикла;
	
	НастройкиПодключенияЭкземпляраТСПИоТ = НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	Если Не НастройкиПодключенияЭкземпляраТСПИоТ.Настроено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Не выполнены настройки ТС ПИоТ.'");
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПодключения = НастройкиПодключенияЭкземпляраТСПИоТ.НастройкиПодключения;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ОбменНаСервере = Истина;
	#Иначе
		ОбменНаСервере = Ложь;
	#КонецЕсли
	
	Если ОбменНаСервере И Не НастройкиПодключения.ОбменНаСервере Тогда
		
		// Обмен на сервере, нет настроенных серверных, но есть настроенные клиентские модули.
		// Вернуть флаг необходимости возврата на клиент для запроса на клиентских ЛМ.
		ВозвращаемоеЗначение.ТребуетсяПроверкаНаКлиенте = Истина;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросовКТСПИоТ(НастройкиПодключения);
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	// ор ++
	ПараметрыПодключения.Таймаут = РазрешительныйРежимМДЛПКлиентСерверПовтИсп.ВремяОтветаCDNПлощадокПриПробитииЧека();
	// ор --
	
	ДанныеЗапроса = ПодготовитьДанныеЗапросаПолученияДанныхКодовМаркировкиНаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП, МассивКодовИдентификацииДляОтправки);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	ОбработатьРезультатОтправкиЗапросаНаТСПИоТ(РезультатОтправкиЗапроса, ДанныеПроверкиКМ, НастройкиПодключения, ДанныеЗапроса, ВозвращаемоеЗначение);
	// ор ++
	ВозвращаемоеЗначение.ПроверкаНаТСПИоТЗавершена = Истина;
	// ор --
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает подготовленные данные запроса получения данных по коду маркировки на ТС ПИоТ.
//
Функция ПодготовитьДанныеЗапросаПолученияДанныхКодовМаркировкиНаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП, МассивКодовИдентификацииДляОтправки) Экспорт
	
	ДополнительныеПараметрыЗапроса = ИнтеграцияТСПИоТМДЛПВызовСервера.ДополнительныеДанныеЗапросаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	
	ДанныеОКлиенте = Новый Структура;
	ДанныеОКлиенте.Вставить("name",    ДополнительныеПараметрыЗапроса.ДанныеКлиента.НаименованиеКассовогоПО);
	ДанныеОКлиенте.Вставить("version", ДополнительныеПараметрыЗапроса.ДанныеКлиента.ВерсияКассовогоПО);
	ДанныеОКлиенте.Вставить("id",      ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторКассовогоПО);
	ДанныеОКлиенте.Вставить("token",   ДополнительныеПараметрыЗапроса.ДанныеКлиента.КонтрольнаяСумма);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	ДанныеЗапроса.АдресЗапроса = "api/v1/codes/check";
	
	ДанныеЗапроса.ТелоЗапроса = Новый Структура;
	ДанныеЗапроса.ТелоЗапроса.Вставить("codes"      , МассивКодовИдентификацииДляОтправки);
	ДанныеЗапроса.ТелоЗапроса.Вставить("client_info", ДанныеОКлиенте);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Accept",         "application/json");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("Content-Type",   "application/json");
	
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

Процедура ОбработатьРезультатОтправкиЗапросаНаТСПИоТ(РезультатОтправкиЗапроса, ДанныеПроверкиКМ, НастройкиПодключения, ДанныеЗапроса, ВозвращаемоеЗначение) Экспорт
	
	ЗапросыДляЛогирования = Новый Массив;
	
	АдресСервера = НастройкиПодключения.АдресПодключения;
	РазрешительныйРежимКодОтветаАварийныйРежим = РазрешительныйРежимМДЛПКлиентСервер.АварийныйРежимКодОтветаСервисаГИСМТ();
	РазрешительныйРежимКодОтветаАварийныйРежимСтрокой = Формат(РазрешительныйРежимКодОтветаАварийныйРежим, "ЧГ=0");
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Или РезультатОтправкиЗапроса.КодСостояния = РазрешительныйРежимКодОтветаАварийныйРежим Тогда
		
		Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния) Тогда
			КодОшибки = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
		Иначе
			КодОшибки = НСтр("ru = 'Таймаут'");
		КонецЕсли;
		
		ОтветТранспортногоМодуля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправкиЗапроса, "ОтветТранспортногоМодуля");
		Если ЗначениеЗаполнено(ОтветТранспортногоМодуля) Тогда
			ТекстОтвета = ОтветТранспортногоМодуля;
		Иначе
			ТекстОтвета = РезультатОтправкиЗапроса.ОписаниеОшибки;
		КонецЕсли;
		
		Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
			ПараметрыЗаписиВЛог = РазрешительныйРежимМДЛПВызовСервера.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ЭлементПроверки.ПолныйКодМаркировки, ТекстОтвета, ДанныеЗапроса.АдресЗапроса);
			ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		КонецЦикла;
		
		РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
		
		Если РезультатОтправкиЗапроса.КодСостояния = РазрешительныйРежимКодОтветаАварийныйРежим Тогда
			
			// Если аварийный режим, остальные коды можно не проверять.
			РазрешительныйРежимМДЛПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы();
			
			ВозвращаемоеЗначение.АварийныйРежим = Истина;
			
			Возврат;
			
		// ор ++
		ИначеЕсли Не ЗначениеЗаполнено(РезультатОтправкиЗапроса.КодСостояния)
				Или РезультатОтправкиЗапроса.КодСостояния >= 514 И РезультатОтправкиЗапроса.КодСостояния <= 520 Тогда
			// В данном случае просто уходим на ЛМ ЧЗ.
			Возврат;
		// ор --
		Иначе
			ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
	
	Если ДанныеОтвета = Неопределено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат;
	КонецЕсли;
	
	ДанныеОКодах = ДанныеОтвета.Получить("codesResponse");
	Если ДанныеОКодах = Неопределено Или ТипЗнч(ДанныеОКодах) <> Тип("Соответствие") Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат;
	КонецЕсли;
	
	ДанныеОКодах = ДанныеОКодах.Получить("codesResponse");
	Если ДанныеОКодах = Неопределено Или ТипЗнч(ДанныеОКодах) <> Тип("Массив") Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат;
	КонецЕсли;
	
	СоответствиеСокращенныхКИЗСтрокам = Новый Соответствие;
	СоответствиеПолныхКИЗСтрокам      = Новый Соответствие;
	
	Для Каждого ЭлементПроверки Из ДанныеПроверкиКМ Цикл
		СоответствиеСокращенныхКИЗСтрокам.Вставить(ЭлементПроверки.СокращенныйКодМаркировки, ЭлементПроверки);
		СоответствиеПолныхКИЗСтрокам.Вставить(ЭлементПроверки.ПолныйКодМаркировки, ЭлементПроверки);
	КонецЦикла;
	
	Для Каждого СтрокаДанныхОКодах Из ДанныеОКодах Цикл
		
		КодОшибки         = СтрокаДанныхОКодах.Получить("code");
		СообщениеОбОшибке = СтрокаДанныхОКодах.Получить("description");
		
		Если ЗначениеЗаполнено(КодОшибки) Тогда
			ТекстОшибки = ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиТСПИоТ(КодОшибки, СообщениеОбОшибке);
			РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		ДанныеПоКодамМаркировки = СтрокаДанныхОКодах.Получить("codes");
		Если ДанныеПоКодамМаркировки = Неопределено Тогда
			ДанныеПоКодамМаркировки = СтрокаДанныхОКодах.Получить("detials");
		КонецЕсли;
		
		Если ТипЗнч(ДанныеПоКодамМаркировки) <> Тип("Массив") Или Не ЗначениеЗаполнено(ДанныеПоКодамМаркировки) Тогда
			ТекстОшибки = НСтр("ru = 'Некорректный формат ответа от ТС ПИоТ.'");
			РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		// ор ++
		ПродажаПоДаннымОффлайнРежима = СтрокаДанныхОКодах.Получить("isCheckedOffline");
		// ор --
		Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
			
			КИЗСтроки = ЭлементДанных.Получить("cis");
			Если ЗначениеЗаполнено(КИЗСтроки) Тогда
				Если СтрНайти(КИЗСтроки, Символ(29)) = 0 Тогда
					ЭлементПроверки = СоответствиеСокращенныхКИЗСтрокам.Получить(КИЗСтроки);
				Иначе
					ПолныйКИЗСтроки = ИнтеграцияМДЛПКлиентСервер.ШтрихкодВBase64(КИЗСтроки);
					ЭлементПроверки = СоответствиеПолныхКИЗСтрокам.Получить(ПолныйКИЗСтроки);
				КонецЕсли;
			КонецЕсли;
			
			КодОшибки         = ЭлементДанных.Получить("code");
			СообщениеОбОшибке = ЭлементДанных.Получить("message");
			
			Если КодОшибки = РазрешительныйРежимКодОтветаАварийныйРежимСтрокой Тогда
				
				// Если аварийный режим, остальные коды можно не проверять.
				РазрешительныйРежимМДЛПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы();
				
				ВозвращаемоеЗначение.АварийныйРежим = Истина;
				
				Возврат;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КодОшибки) Тогда
				
				ТекстОшибки = ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиТСПИоТ(КодОшибки, СообщениеОбОшибке);
				Если ЗначениеЗаполнено(ЭлементПроверки) Тогда
					ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекстОшибки));
				Иначе
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			КодОшибки = ЭлементДанных.Получить("errorCode");
			Если ЗначениеЗаполнено(КодОшибки) Тогда
				
				ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиГИСМТ(КодОшибки, СообщениеОбОшибке);
				Если ЗначениеЗаполнено(ЭлементПроверки) Тогда
					ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекстОшибки));
				Иначе
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			ПараметрыКодаМаркировки = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(ЭлементДанных);
			
			ТекстыОшибок = РазрешительныйРежимМДЛПКлиентСервер.ТекстыОшибокРазрешительногоРежимаПоПараметрамКодаМаркировки(ПараметрыКодаМаркировки, ПродажаПоДаннымОффлайнРежима);
			Если ЗначениеЗаполнено(ТекстыОшибок) Тогда
				Если ЗначениеЗаполнено(ЭлементПроверки) Тогда
					ВозвращаемоеЗначение.КонтролиРазрешительногоРежима.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ТекстыОшибок);
				Иначе
					Для Каждого ТекстОшибки Из ТекстыОшибок Цикл
						РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЭлементПроверки) Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(СтрокаДанныхОКодах.Получить("reqTimestamp"), "ЧГ=;");
			ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = СтрокаДанныхОКодах.Получить("reqId");
			ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = АдресСервера;
			ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = ДанныеЗапроса.АдресЗапроса;
			ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = РезультатОтправкиЗапроса.ОтветТранспортногоМодуля;
			ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(РезультатОтправкиЗапроса.КодСостояния, "ЧГ=0;");
			
			ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЭкземпляраПО = СтрокаДанныхОКодах.Получить("inst");
			ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазыЧерногоСписка   = СтрокаДанныхОКодах.Получить("version");
			// ор ++
			ПараметрыКодаМаркировки.ПродажаПоДаннымОффлайнРежима                 = ПродажаПоДаннымОффлайнРежима;
			// ор --
			
			ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ЭлементПроверки.ИдентификаторЭлемента, ПараметрыКодаМаркировки);
			
			// Если по элементу проверки удалось получить данные, тогда нужно удалить его из коллекции.
			ВозвращаемоеЗначение.КодыМаркировкиБезДанных.Удалить(ЭлементПроверки.ИдентификаторЭлемента);
			
			Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ХранитьУспешныеОперацииПриПроверкеКМ() Тогда
				ПараметрыЗаписиВЛог = РазрешительныйРежимМДЛПВызовСервера.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					АдресСервера,
					РезультатОтправкиЗапроса.КодСостояния,
					ЭлементПроверки.ПолныйКодМаркировки,
					РезультатОтправкиЗапроса.ОтветТранспортногоМодуля,
					ДанныеЗапроса.АдресЗапроса);
				ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	РазрешительныйРежимМДЛПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
КонецПроцедуры

Функция ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиТСПиоТ(КодОшибки, ОписаниеОшибкиТСПИоТ = Неопределено)
	
	ТекстОшибки = "";
	
	Если КодОшибки = 13 Тогда
		ТекстОшибки = НСтр("ru = 'Отсутствует связь с ЛМ ЧЗ. Проверьте состояние ТС ПИоТ.'");
	Иначе
		
		ШаблонПодсказки   = НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ТС ПИоТ.
			|Описание из сервиса: %1.'");
			
		Если ОписаниеОшибкиТСПИоТ <> Неопределено Тогда
			ТекстИзГИСМТ = СтрЗаменить(ОписаниеОшибкиТСПИоТ, Символ(29), "");
		Иначе
			ТекстИзГИСМТ = "отсутствует";
		КонецЕсли;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПодсказки, ТекстИзГИСМТ);
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

#КонецОбласти // ПроверкаКодаМаркировки

#КонецОбласти // СлужебныеПроцедурыИФункции
