
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Обработка результата вопроса про разные номера.
//
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ВопросРазныеНомераЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПродолжитьПереходКСопоставлению();
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка результата вопроса проверки GTIN.
//
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ПроверкаGTINЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РегистрацияGTINПродолжить(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Обработка результата вопроса есть GTIN.
//
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ВопросЕстьGTINДляРегистрацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УстановитьТекущуюСтраницу("СтраницаОтчет");
		ЗаполнитьСтраницуОтчета();
		ОбновитьСостояниеКнопокСтраницы();
	КонецЕсли;
	
КонецПроцедуры

// Обработка результата вопроса о сбросе сопоставления.
//
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога - результат ответа.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
&НаКлиенте
Процедура ВопросСброситьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПродолжитьПереходКСопоставлению(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресВоВременномХранилище) Тогда
		ТекстСообщения = НСтр("ru='Предусмотрено открытие формы только из документов.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	АдресВоВременномХранилище = Параметры.АдресВоВременномХранилище;
	
	Параметры.Свойство("УведомлениеСсылка"        , УведомлениеСсылка);
	Параметры.Свойство("ОснованиеСсылка"          , ОснованиеСсылкаВходящая);
	Параметры.Свойство("ФормаОткрытаИзУведомления", ФормаОткрытаИзУведомления);
	
	Если ФормаОткрытаИзУведомления Тогда
		ЗаполнитьТаблицуОснований();
		УстановитьТекущуюСтраницу("СтраницаОснования");
	Иначе
		ЗаполнитьТаблицуУведомлений();
		УстановитьТекущуюСтраницу("СтраницаУведомления");
	КонецЕсли;
	
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьПараметрыВыбораНоменклатуры(ЭтотОбъект, Элементы.СоставТранспортныхУпаковокНоменклатура.Имя);
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект, Элементы.СоставТранспортныхУпаковокХарактеристика.Имя, "Элементы.СоставТранспортныхУпаковок.ТекущиеДанные.Номенклатура");
	
	ИспользоватьХарактеристики = ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры();
	Элементы.СоставТранспортныхУпаковокХарактеристика.Видимость = ИспользоватьХарактеристики;
	
	ГосударственныеИнформационныеСистемыПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, СоставТранспортныхУпаковок);
	
	ОтображатьУведомленияПоДругимОтгрузкам = Ложь;
	Элементы.ФормаУведомленияПоДругимОтгрузкам.Пометка = ОтображатьУведомленияПоДругимОтгрузкам;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСостояниеКнопокСтраницы();
	УстановитьОтборПоДругимОтгрузкам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиУведомления

&НаКлиенте
Процедура ОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Основания.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Выбран = Не ТекущаяСтрока.Выбран;
	
	Если НЕ ТекущаяСтрока.Выбран Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Основания Цикл
		Если ТекущаяСтрока.Ссылка <> Строка.Ссылка Тогда
			Строка.Выбран = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияВыбранПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Основания.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока.Выбран Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Основания Цикл
		Если ТекущаяСтрока.Ссылка <> Строка.Ссылка Тогда
			Строка.Выбран = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиУведомления

&НаКлиенте
Процедура УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Уведомления.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Выбран = Не ТекущаяСтрока.Выбран;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьОтборНомеровУпаковок(ТекущиеДанные.ор_ИдентификаторСтроки, ТекущиеДанные.GTIN);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если ТекСтрока.ЗапретРедактироватния Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыGTINНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = ПолучитьСписокВыбораGTIN();
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Строка Из Список Цикл
		ДанныеВыбора.Добавить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыGTINОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.GTIN = ВыбранноеЗначение;
	
	ТоварыGTINПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыGTINПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.GTIN)
		ИЛИ НЕ МенеджерОборудованияКлиентСервер.ПроверитьКорректностьGTIN(ТекущиеДанные.GTIN) Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.GTIN) Тогда
			ТекстСообщения = НСтр("ru = 'Введен неверный GTIN.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Найденныестроки = НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ор_ИдентификаторСтроки));
		
		Если Найденныестроки.Количество() > 0 Тогда
			ТекущиеДанные.GTIN = Лев(Найденныестроки[0].НомерКИЗ, 14);
		Иначе
			ТекущиеДанные.GTIN = "";
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборНомеровУпаковок(ТекущиеДанные.ор_ИдентификаторСтроки, ТекущиеДанные.GTIN);
	
КонецПроцедуры

&НаКлиенте
Процедура НомераУпаковокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПеренестиВверхВнизНомерУпаковки();
	
КонецПроцедуры

&НаКлиенте
Процедура НомераУпаковокУведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПеренестиВверхВнизНомерУпаковки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПеренестиВверхВнизТранспортнуюУпаковку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиУведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПеренестиВверхВнизТранспортнуюУпаковку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТранспортныеУпаковки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьОтборСоставаТранспортныхУпаковок(ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТранспортныхУпаковокНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если НЕ ор_ИнтеграцияМДЛП.ПроверитьНоменклатуруМаркировки(ТекущаяСтрока.Номенклатура) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбранной номенклатуры не ведется учет маркируемых товаров.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	ТекущаяСтрока.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(ТекущаяСтрока.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТранспортныхУпаковокХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставТранспортныхУпаковок.ТекущиеДанные;
	
	Если ТипЗнч(ОснованиеСсылкаВходящая) <> Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если НЕ ор_ИнтеграцияМДЛП.ПроверитьХарактеристикуМаркировки(ТекущаяСтрока.Характеристика) Тогда
			ТекстСообщения = НСтр("ru = 'Для выбранной характеристики не ведется учет маркируемых товаров.'");
			ПоказатьПредупреждение(,ТекстСообщения);
			ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПроверитьСериюПроизводителяХарактеристики(ТекущаяСтрока.Характеристика, ТекущаяСтрока.НомерСерии) Тогда
		ТекстСообщения = НСтр("ru = 'Серия производителя выбранной характеристики не совпадает с указанным номером серии.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	
	ТекущаяСтрока.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(ТекущаяСтрока.Характеристика);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	СменитьСтраницу(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	СменитьСтраницу(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВверх(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТранспортныеУпаковки Тогда
		ПеренестиВверхВнизТранспортнуюУпаковку(Истина);
	Иначе
		ПеренестиВверхВнизНомерУпаковки(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВниз(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТранспортныеУпаковки Тогда
		ПеренестиВверхВнизТранспортнуюУпаковку();
	Иначе
		ПеренестиВверхВнизНомерУпаковки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВвод(Команда)
	
	Если НЕ ПроверитьЗаполнениеТоваров() Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура Сбросить(Команда)
	
	ТекстВопроса = НСтр("ru='Данные будут сопоставлены заново. Продолжить?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСброситьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияПоДругимОтгрузкам(Команда)
	
	ОтображатьУведомленияПоДругимОтгрузкам = НЕ ОтображатьУведомленияПоДругимОтгрузкам;
	Элементы.ФормаУведомленияПоДругимОтгрузкам.Пометка = ОтображатьУведомленияПоДругимОтгрузкам;
	
	УстановитьОтборПоДругимОтгрузкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьGTIN(Команда)
	
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	Если ТоварыРегистрацииGTIN.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет данных для регистрации GTIN.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьGTINПоРегиструШК();
	
	Если РезультатПроверки.Свойство("ТекстПредупреждения") Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаGTINЗавершение", ЭтотОбъект, РезультатПроверки);
		ПоказатьВопрос(ОписаниеОповещения, РезультатПроверки.ТекстПредупреждения, РежимДиалогаВопрос.ДаНет,,,НСтр("ru = 'Регистрация GTIN.'"));
		Возврат;
	КонецЕсли;
	
	РегистрацияGTINПродолжить(РезультатПроверки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьПереходКСопоставлению(СброситьСопоставление = Ложь)
	
	Если СброситьСопоставление Тогда
		ЗаполнитьОснованиеИСписокУведомлений();
		ЗаполнитьТаблицыПоОснованию();
		ЗаполнитьТаблицыПоУведомлению();
		СопоставитьТаблицы();
		СопоставитьТаблицыТранспортныхУпаковок();
		ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок");
	Иначе
		ЗаполнитьОснованиеИСписокУведомлений();
		ЗаполнитьТаблицыПоОснованию();
		ЗаполнитьТаблицыПоУведомлению();
		РезультатПроверки = ПроверитьТаблицыПередСопоставлением();
		Если РезультатПроверки.ЕстьОшибки Тогда
			УстановитьТекущуюСтраницу("СтраницаОтчет");
			ЗаполнитьСтраницуОтчетаОтмена(РезультатПроверки.ТекстЗаголовка, РезультатПроверки.ТекстСообщения);
		Иначе
			СопоставитьТаблицы();
			СопоставитьТаблицыТранспортныхУпаковок();
			УстановитьТекущуюСтраницу("СтраницаСопоставление");
			ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок");
		КонецЕсли;
		ОбновитьСостояниеКнопокСтраницы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОснований()
	
	Основания.Очистить();
	
	ТаблицаОснований = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораОснований(УведомлениеСсылка);
	
	Если ТаблицаОснований = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаОснований Цикл
		НоваяСтрока = Основания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУведомлений()
	
	Уведомления.Очистить();
	
	СтруктураВыбора = ор_ИнтеграцияМДЛП.ПолучитьСписокВыбораУведомленний(ОснованиеСсылкаВходящая);
	
	Если СтруктураВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОснованиеСсылка = СтруктураВыбора.ОснованиеСсылка;
	
	Для Каждого Строка Из СтруктураВыбора.ТаблицаУведомлений Цикл
		Если ор_ИнтеграцияМДЛП.СтатусДоступенДляЗаполнения(Строка.Статус) Тогда
			НоваяСтрока = Уведомления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			Если НоваяСтрока.УжеСопоставлен Тогда
				НоваяСтрока.Выбран = Истина;
			КонецЕсли;
			Если НоваяСтрока.УжеСопоставлен ИЛИ НоваяСтрока.НомерИДатаСоответствует Тогда
				НоваяСтрока.Отображать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОткорректироватьСписокУведомлний();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованиеИСписокУведомлений()
	
	Если ФормаОткрытаИзУведомления Тогда
		
		Для Каждого Строка Из Основания Цикл
			Если Строка.Выбран Тогда
				ОснованиеСсылка = Строка.Ссылка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		// ОснованиеСсылка уже заполнено в ЗаполнитьТаблицуУведомлений()
	КонецЕсли;
	
	СписокУведомлений.Очистить();
	
	Если ФормаОткрытаИзУведомления Тогда
		СписокУведомлений.Добавить(УведомлениеСсылка);
	Иначе
		Для Каждого Строка Из Уведомления Цикл
			Если Строка.Выбран Тогда
				СписокУведомлений.Добавить(Строка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПоОснованию()
	
	// Когда связь будет из поступления, когда поступление ордерное, 
	// тогда нужно будет если ссылка на поступление то данные заполнять по ордерам.
	// Пока сопоставить из ордерного поступления нельзя, сопоставление из ордеров.
	
	Товары.Очистить();
	НомераУпаковок.Очистить();
	ТранспортныеУпаковки.Очистить();
	СоставТранспортныхУпаковок.Очистить();
	
	ТекстЗапроса =
	//0
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|			ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Количество,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|			ТОГДА 0
	|		КОГДА НЕ &СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((Товары.Сумма + &СуммаНДС) / ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|							ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|						ИНАЧЕ Товары.Количество
	|					КОНЕЦ КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.Сумма / ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Товары.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|						ТОГДА Товары.Количество * ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|					ИНАЧЕ Товары.Количество
	|				КОНЕЦ КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ &СуммаВключаетНДС
	|			ТОГДА Товары.Сумма + &СуммаНДС
	|		ИНАЧЕ Товары.Сумма
	|	КОНЕЦ КАК Сумма,
	|	&СуммаНДС КАК СуммаНДС,
	|	Товары.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки
	|ПОМЕСТИТЬ втТоварыВременная
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераУпаковок.НомерСтроки КАК НомерСтроки,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	НомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ втНомера
	|ИЗ
	|	&НомераУпаковок КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Цена КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДС,
	|	ИСТИНА КАК ИзОснования
	|ПОМЕСТИТЬ втТранспортныеУпаковки
	|ИЗ
	|	&ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СоставТранспортныхУпаковок.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(СоставТранспортныхУпаковок.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	СоставТранспортныхУпаковок.GTIN КАК GTIN,
	|	СоставТранспортныхУпаковок.Цена КАК Цена,
	|	СоставТранспортныхУпаковок.Количество КАК Количество,
	|	СоставТранспортныхУпаковок.НомерСерии КАК НомерСерии,
	|	СоставТранспортныхУпаковок.СуммаНДС КАК СуммаНДС,
	|	СоставТранспортныхУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СоставТранспортныхУпаковок.ИдентификаторСтрокиТовара КАК ИдентификаторСтрокиТовара
	|ПОМЕСТИТЬ втСоставТранспортныхУпаковок
	|ИЗ
	|	&СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|ГДЕ
	|	СоставТранспортныхУпаковок.Ссылка = &Основание
	|;
	|
	//4
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварыВременная.Номенклатура КАК Номенклатура,
	|	втТоварыВременная.Характеристика КАК Характеристика,
	|	втТоварыВременная.Количество КАК Количество,
	|	втТоварыВременная.ор_СтатусЗаполненияУпаковок КАК ор_СтатусЗаполненияУпаковок,
	|	втТоварыВременная.Цена КАК Цена,
	|	втТоварыВременная.Сумма КАК Сумма,
	|	втТоварыВременная.СуммаНДС КАК СуммаНДС,
	|	втТоварыВременная.ор_ИдентификаторСтроки КАК ор_ИдентификаторСтроки,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	втТоварыВременная.Характеристика.ор_МаркируемыйТовар КАК ИспользоватьНомераУпаковок,
	|	втТоварыВременная.Характеристика.ор_МаркируемыйТовар КАК МаркируемыйТовар
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	втТоварыВременная КАК втТоварыВременная
	|ГДЕ
	|	втТоварыВременная.Номенклатура.КатегорияНоменклатуры.ор_УчетМаркируемыхТоваров
	|	И втТоварыВременная.Характеристика <> &ПустаяХарактеристика
	|	И ВЫБОР
	|			КОГДА &ЭтоПриемка
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ втТоварыВременная.Характеристика.ор_МаркируемыйТовар
	|		КОНЕЦ
	|;
	|
	//5
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика,
	|	втТовары.Количество,
	|	втТовары.ор_СтатусЗаполненияУпаковок,
	|	втТовары.Цена,
	|	втТовары.Сумма,
	|	втТовары.СуммаНДС,
	|	втТовары.ор_ИдентификаторСтроки,
	|	втТовары.ХарактеристикиИспользуются,
	|	втТовары.ИспользоватьНомераУпаковок,
	|	втТовары.МаркируемыйТовар
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	//6
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНомера.НомерКИЗ КАК НомерКИЗ,
	|	втТовары.Цена КАК Цена,
	|	втНомера.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомера КАК втНомера
	|		ПО втТовары.ор_ИдентификаторСтроки = втНомера.ИдентификаторСтроки
	|ГДЕ
	|	НЕ втНомера.ИдентификаторСтроки ЕСТЬ NULL
	|;
	|
	//7
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	втТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втТранспортныеУпаковки.Цена КАК Цена,
	|	втТранспортныеУпаковки.СуммаНДС КАК СуммаНДС,
	|	втТранспортныеУпаковки.ИзОснования КАК ИзОснования
	|ИЗ
	|	втТранспортныеУпаковки КАК втТранспортныеУпаковки
	|;
	|
	//8
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСоставТранспортныхУпаковок.Номенклатура КАК Номенклатура,
	|	втСоставТранспортныхУпаковок.Характеристика КАК Характеристика,
	|	втСоставТранспортныхУпаковок.GTIN КАК GTIN,
	|	втСоставТранспортныхУпаковок.Цена КАК Цена,
	|	втСоставТранспортныхУпаковок.Количество КАК Количество,
	|	втСоставТранспортныхУпаковок.НомерСерии КАК НомерСерии,
	|	втСоставТранспортныхУпаковок.СуммаНДС КАК СуммаНДС,
	|	втСоставТранспортныхУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втСоставТранспортныхУпаковок.ИдентификаторСтрокиТовара КАК ИдентификаторСтрокиТовара,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	втСоставТранспортныхУпаковок.Характеристика.ор_МаркируемыйТовар КАК ИспользоватьНомераУпаковок,
	|	втСоставТранспортныхУпаковок.Характеристика.ор_МаркируемыйТовар КАК МаркируемыйТовар
	|ИЗ
	|	втСоставТранспортныхУпаковок КАК втСоставТранспортныхУпаковок
	|";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	СуммаВключаетНДС = Истина;
	Если ЗначениеЗаполнено(ОснованиеСсылкаВходящая) Тогда
		Запрос.УстановитьПараметр("Основание", ОснованиеСсылкаВходящая);
		ИмяОбъектаОснования = ОснованиеСсылкаВходящая.Метаданные().Имя;
		Если ИмяОбъектаОснования = "ПриходнаяНакладная"
			ИЛИ ИмяОбъектаОснования = "РасходнаяНакладная" Тогда
			СуммаВключаетНДС = ОснованиеСсылкаВходящая.СуммаВключаетНДС;
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("Основание", ОснованиеСсылка);
		ИмяОбъектаОснования = ОснованиеСсылка.Метаданные().Имя;
		Если ИмяОбъектаОснования = "ПриходнаяНакладная"
			ИЛИ ИмяОбъектаОснования = "РасходнаяНакладная" Тогда
			СуммаВключаетНДС = ОснованиеСсылка.СуммаВключаетНДС;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	Запрос.УстановитьПараметр("ЭтоПриемка", ИмяОбъектаОснования = "ПриходнаяНакладная");
	
	Если ИмяОбъектаОснования = "ПриходныйОрдер" ИЛИ ИмяОбъектаОснования = "РасходныйОрдер" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНДС", "0");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНДС", "Товары.СуммаНДС");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Товары"                    , "Документ." + ИмяОбъектаОснования + ".Запасы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомераУпаковок"            , "Документ." + ИмяОбъектаОснования + ".ор_НомераУпаковок");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТранспортныеУпаковки"      , "Документ." + ИмяОбъектаОснования + ".ор_ТранспортныеУпаковки");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СоставТранспортныхУпаковок", "Документ." + ИмяОбъектаОснования + ".ор_СоставТранспортныхУпаковок");
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаТоваров                    = Результат[5].Выгрузить();
	ТаблицаНомеров                    = Результат[6].Выгрузить();
	ТаблицаТранспортныеУпаковки       = Результат[7].Выгрузить();
	ТаблицаСоставТранспортныхУпаковок = Результат[8].Выгрузить();
	
	Товары.Загрузить(ТаблицаТоваров);
	Товары.Сортировать("Номенклатура Возр, МаркируемыйТовар Убыв, Характеристика Возр");
	НомераУпаковок.Загрузить(ТаблицаНомеров);
	ТранспортныеУпаковки.Загрузить(ТаблицаТранспортныеУпаковки);
	СоставТранспортныхУпаковок.Загрузить(ТаблицаСоставТранспортныхУпаковок);
	
	ЗаполнитьGTIN();
	
	НомерСтроки = 1;
	Для Каждого Строка Из СоставТранспортныхУпаковок Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПоУведомлению()
	
	НомераУпаковокУведомления.Очистить();
	ТранспортныеУпаковкиУведомления.Очистить();
	СоставТранспортныхУпаковокУведомления.Очистить();
	
	ИмяОбъектаУведомления = СписокУведомлений[0].Значение.Метаданные().Имя;
	
	СтруктураНедоступныхНомеров = ПолучитьСтруктуруНедоступныхНомеров(СписокУведомлений);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомераУпаковок.Ссылка КАК Уведомление,
	|	НомераУпаковок.НомерКИЗ КАК НомерКИЗ,
	|	НомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.GTIN КАК GTIN,
	|	ВЫБОР
	|		КОГДА Товары.КоличествоУпаковок = Товары.Количество
	|			ТОГДА Товары.Цена
	|		КОГДА Товары.КоличествоУпаковок = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ Товары.Цена / Товары.КоличествоУпаковок
	|	КОНЕЦ КАК Цена,
	|	НомераУпаковок.СостояниеПодтверждения КАК СостояниеПодтверждения
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.Товары КАК Товары
	|		ПО НомераУпаковок.ИдентификаторСтроки = Товары.ИдентификаторСтроки
	|		И НомераУпаковок.Ссылка = Товары.Ссылка
	|ГДЕ
	|	НомераУпаковок.Ссылка В(&СписокУведомлений)
	|	И НЕ Товары.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В(&СписокНомеровИсключений)
	|	И НомераУпаковок.СостояниеПодтверждения В(&СписокСостояний)
	|;
	|
	//1
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.Ссылка КАК Уведомление,
	|	ТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки,
	|	ТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТранспортныеУпаковки.Цена КАК Цена,
	|	ТранспортныеУпаковки.СуммаНДС КАК СуммаНДС,
	|	ТранспортныеУпаковки.СостояниеПодтверждения КАК СостояниеПодтверждения
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка В(&СписокУведомлений)
	|	И ТранспортныеУпаковки.СостояниеПодтверждения В(&СписокСостояний)
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В(&СписокТранспортныхНомеровИсключений)
	|;
	|
	//2
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставТранспортныхУпаковок.Ссылка КАК Уведомление,
	|	СоставТранспортныхУпаковок.Номенклатура КАК Номенклатура,
	|	СоставТранспортныхУпаковок.Характеристика КАК Характеристика,
	|	СоставТранспортныхУпаковок.GTIN КАК GTIN,
	|	СоставТранспортныхУпаковок.НомерСерии КАК НомерСерии,
	|	СоставТранспортныхУпаковок.Количество КАК Количество,
	|	СоставТранспортныхУпаковок.Цена КАК Цена,
	|	СоставТранспортныхУпаковок.СуммаНДС КАК СуммаНДС,
	|	СоставТранспортныхУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК СоставТранспортныхУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|		ПО СоставТранспортныхУпаковок.ИдентификаторСтроки = ТранспортныеУпаковки.ИдентификаторСтроки
	|		И СоставТранспортныхУпаковок.Ссылка = ТранспортныеУпаковки.Ссылка
	|ГДЕ
	|	СоставТранспортныхУпаковок.Ссылка В(&СписокУведомлений)
	|	И НЕ ТранспортныеУпаковки.ИдентификаторСтроки ЕСТЬ NULL
	|	И ТранспортныеУпаковки.СостояниеПодтверждения В(&СписокСостояний)
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В(&СписокТранспортныхНомеровИсключений)";
	
	Запрос.УстановитьПараметр("СписокУведомлений", СписокУведомлений);
	
	Запрос.УстановитьПараметр("СписокСостояний", ор_ИнтеграцияМДЛП.ПолучитьСписокСостоянийПодтверждения(Истина));
	
	Запрос.УстановитьПараметр("СписокНомеровИсключений"            , СтруктураНедоступныхНомеров.Номераупаковок);
	Запрос.УстановитьПараметр("СписокТранспортныхНомеровИсключений", СтруктураНедоступныхНомеров.ТранспортныеУпаковки);
	
	Если ИмяОбъектаУведомления = "УведомлениеОбОтгрузкеМДЛП" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УведомлениеОПриемкеМДЛП", "УведомлениеОбОтгрузкеМДЛП");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоставТранспортныхУпаковок.Количество", "0");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	УведомлениеТаблицаНомеров                    = Результат[0].Выгрузить();
	УведомлениеТаблицаТранспортныеУпаковки       = Результат[1].Выгрузить();
	УведомлениеТаблицаСоставТранспортныхУпаковок = Результат[2].Выгрузить();
	
	Для Каждого Строка Из УведомлениеТаблицаНомеров Цикл
		НоваяСтрока = НомераУпаковокУведомления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ТранспортныеУпаковкиУведомления.Загрузить(УведомлениеТаблицаТранспортныеУпаковки);
	СоставТранспортныхУпаковокУведомления.Загрузить(УведомлениеТаблицаСоставТранспортныхУпаковок);
	
	Для Каждого Строка Из СоставТранспортныхУпаковокУведомления Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Строка.Номенклатура = ор_ИнтеграцияМДЛП.НайтиНоменклатруПоGTIN(Строка.GTIN);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьGTIN()
	
	Для Каждого СтрокаТовара Из Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовара.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтрокиКизов = НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТовара.ор_ИдентификаторСтроки));
		
		Если НайденныеСтрокиКизов.Количество() > 0 Тогда
			СтрокаТовара.GTIN = Лев(НайденныеСтрокиКизов[0].НомерКИЗ, 14);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТовара.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПоиска = ор_ИнтеграцияМДЛП.НайтиGTINПоНоменклатре(СтрокаТовара.Номенклатура, СтрокаТовара.Характеристика);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			СтрокаТовара.GTIN = РезультатПоиска;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьТаблицы()
	
	Если ФормаОткрытаИзУведомления Тогда
		Игнорироватьцену = УведомлениеСсылка.Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора
	Иначе
		Игнорироватьцену = СписокУведомлений[0].Значение.Операция = Перечисления.ОперацииПриемкиМДЛП.ПоступлениеВРамкахАгентскогоДоговора;
	КонецЕсли;
	
	МассивСтрокУдаления = Новый Массив;
	
	НомераУпаковокУведомленияВременная = НомераУпаковокУведомления.Выгрузить();
	НомераУпаковокУведомленияВременная.Свернуть("ИдентификаторСтроки,GTIN,Цена");
	
	Для Каждого СтрокаНомераУпаковокУведомленияВременная Из НомераУпаковокУведомленияВременная Цикл
		
		НайденныеСтрокиНомеровУведомления = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("ИдентификаторСтроки,GTIN,Цена", СтрокаНомераУпаковокУведомленияВременная.ИдентификаторСтроки, СтрокаНомераУпаковокУведомленияВременная.GTIN, СтрокаНомераУпаковокУведомленияВременная.Цена));
		КоличествоНомеров = НайденныеСтрокиНомеровУведомления.Количество();
		
		Если Игнорироватьцену Тогда
			НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("GTIN,Количество", СтрокаНомераУпаковокУведомленияВременная.GTIN, КоличествоНомеров));
		Иначе
			НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("GTIN,Количество,Цена", СтрокаНомераУпаковокУведомленияВременная.GTIN, КоличествоНомеров, СтрокаНомераУпаковокУведомленияВременная.Цена));
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СопоставитьТаблицыПоКоличествоЦена(СтрокаНомераУпаковокУведомленияВременная, НайденныеСтрокиНомеровУведомления, НайденныеСтроки, МассивСтрокУдаления);
		
	КонецЦикла;
	
	МассивСтрокУдаления = Новый Массив;
	
	Для Каждого СтрокаНомераУведомления Из НомераУпаковокУведомления Цикл
		
		Если Игнорироватьцену Тогда
			НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("GTIN", СтрокаНомераУведомления.GTIN));
		Иначе
			НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("GTIN,Цена", СтрокаНомераУведомления.GTIN, СтрокаНомераУведомления.Цена));
		КонецЕсли;
		
		// ищем по GTIN
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Обрабатываем киз уведомления
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			НайденныеСтрокиНомеров = НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", НайденнаяСтрока.ор_ИдентификаторСтроки));
			
			ЗапретДобавленияКИЗ = Ложь;
			Если НайденныеСтрокиНомеров.Количество() = НайденнаяСтрока.Количество Тогда
				ЗапретДобавленияКИЗ = Истина;
			КонецЕсли;
			
			КизОбработан = Ложь;
			
			Для Каждого НайденныйНомер Из НомераУпаковок Цикл
				Если НайденныйНомер.НомерКИЗ = СтрокаНомераУведомления.НомерКИЗ Тогда
					КизОбработан = Истина;
					НайденныйНомер.Уведомление = СтрокаНомераУведомления.Уведомление;
					НайденныйНомер.СостояниеПодтверждения = СтрокаНомераУведомления.СостояниеПодтверждения;
					МассивСтрокУдаления.Добавить(СтрокаНомераУведомления);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если КизОбработан Тогда
				Прервать;
			КонецЕсли;
			
			Если НЕ ЗапретДобавленияКИЗ Тогда
				
				НоваяСтрока = НомераУпаковок.Добавить();
				НоваяСтрока.НомерКИЗ = СтрокаНомераУведомления.НомерКИЗ;
				НоваяСтрока.Цена = СтрокаНомераУведомления.Цена;
				НоваяСтрока.Уведомление = СтрокаНомераУведомления.Уведомление;
				НоваяСтрока.СостояниеПодтверждения = СтрокаНомераУведомления.СостояниеПодтверждения;
				НоваяСтрока.ИдентификаторСтроки = НайденнаяСтрока.ор_ИдентификаторСтроки;
				МассивСтрокУдаления.Добавить(СтрокаНомераУведомления);
				
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.GTIN) Тогда
					НайденнаяСтрока.GTIN = СтрокаНомераУведомления.GTIN;
				КонецЕсли;
				
				Если НЕ НайденнаяСтрока.ИспользоватьНомераУпаковок Тогда
					НайденнаяСтрока.ИспользоватьНомераУпаковок = Истина;
				КонецЕсли;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из МассивСтрокУдаления Цикл
		
		НомераУпаковокУведомления.Удалить(СтрокаМассива);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьТаблицыПоКоличествоЦена(СтрокаНомераУпаковокУведомленияВременная, НайденныеСтрокиНомеровУведомления, НайденныеСтроки, МассивСтрокУдаления)
	
	// Обрабатываем киз уведомления
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		СтрокаТовараНайдена = Ложь;
		
		НайденныеСтрокиНомеров = НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", НайденнаяСтрока.ор_ИдентификаторСтроки));
		
		КоличествоСтрокТоваров = НайденныеСтрокиНомеров.Количество();
		КоличествоСвободныхСтрокТоваров = НайденнаяСтрока.Количество - КоличествоСтрокТоваров;
		ЗапретДобавленияКИЗ = Ложь;
		Если КоличествоСвободныхСтрокТоваров = 0 Тогда
			ЗапретДобавленияКИЗ = Истина;
		КонецЕсли;
		
		Для Каждого НайденныйНомер Из НомераУпаковок Цикл
			Для Каждого НайденныйНомерУведомления Из НайденныеСтрокиНомеровУведомления Цикл
				
				Если НайденныйНомер.НомерКИЗ = НайденныйНомерУведомления.НомерКИЗ Тогда
					НайденныйНомер.Уведомление = НайденныйНомерУведомления.Уведомление;
					НайденныйНомер.СостояниеПодтверждения = НайденныйНомерУведомления.СостояниеПодтверждения;
					МассивСтрокУдаления.Добавить(НайденныйНомерУведомления);
					СтрокаТовараНайдена = Истина;
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаМассива Из МассивСтрокУдаления Цикл
			НомераУпаковокУведомления.Удалить(СтрокаМассива);
		КонецЦикла;
		МассивСтрокУдаления = Новый Массив;
		
		НайденныеСтрокиНомеровУведомления = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("ИдентификаторСтроки,GTIN,Цена", СтрокаНомераУпаковокУведомленияВременная.ИдентификаторСтроки, СтрокаНомераУпаковокУведомленияВременная.GTIN, СтрокаНомераУпаковокУведомленияВременная.Цена));
		
		Если НайденныеСтрокиНомеровУведомления.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ ЗапретДобавленияКИЗ Тогда
			
			Для Каждого НайденныйНомерУведомления Из НайденныеСтрокиНомеровУведомления Цикл
				
				Если КоличествоСвободныхСтрокТоваров > 0 Тогда
					
					НоваяСтрока = НомераУпаковок.Добавить();
					НоваяСтрока.НомерКИЗ = НайденныйНомерУведомления.НомерКИЗ;
					НоваяСтрока.Цена = НайденныйНомерУведомления.Цена;
					НоваяСтрока.ИдентификаторСтроки = НайденнаяСтрока.ор_ИдентификаторСтроки;
					НоваяСтрока.Уведомление = НайденныйНомерУведомления.Уведомление;
					НоваяСтрока.СостояниеПодтверждения = НайденныйНомерУведомления.СостояниеПодтверждения;
					
					Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.GTIN) Тогда
						НайденнаяСтрока.GTIN = НайденныйНомерУведомления.GTIN;
					КонецЕсли;
					
					Если НЕ НайденнаяСтрока.ИспользоватьНомераУпаковок Тогда
						НайденнаяСтрока.ИспользоватьНомераУпаковок = Истина;
					КонецЕсли;
					
					СтрокаТовараНайдена = Истина;
					МассивСтрокУдаления.Добавить(НайденныйНомерУведомления);
					КоличествоСвободныхСтрокТоваров = КоличествоСвободныхСтрокТоваров - 1;
				Иначе
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаМассива Из МассивСтрокУдаления Цикл
				НомераУпаковокУведомления.Удалить(СтрокаМассива);
			КонецЦикла;
			МассивСтрокУдаления = Новый Массив;
			
			НайденныеСтрокиНомеровУведомления = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("ИдентификаторСтроки,GTIN,Цена", СтрокаНомераУпаковокУведомленияВременная.ИдентификаторСтроки, СтрокаНомераУпаковокУведомленияВременная.GTIN, СтрокаНомераУпаковокУведомленияВременная.Цена));
			
			Если НайденныеСтрокиНомеровУведомления.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаТовараНайдена Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьТаблицыТранспортныхУпаковок()
	
	МассивСтрокУдаления = Новый Массив;
	МассивСтрокУдаленияСостава = Новый Массив;
	
	Для Каждого Строка Из ТранспортныеУпаковкиУведомления Цикл
		
		НайденныеСтроки = ТранспортныеУпаковки.НайтиСтроки(Новый Структура("НомерУпаковки", Строка.НомерУпаковки));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки[0].Уведомление = Строка.Уведомление;
		НайденныеСтроки[0].СостояниеПодтверждения = Строка.СостояниеПодтверждения;
		
		МассивСтрокУдаления.Добавить(Строка);
		
		НайденныеСтрокиСоставаУведомления = СоставТранспортныхУпаковокУведомления.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки));
		
		Для Каждого СтрокаСостава Из НайденныеСтрокиСоставаУведомления Цикл
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИдентификаторСтроки", НайденныеСтроки[0].ИдентификаторСтроки);
			СтруктураПоиска.Вставить("GTIN"               , СтрокаСостава.GTIN);
			СтруктураПоиска.Вставить("НомерСерии"         , СтрокаСостава.НомерСерии);
			СтруктураПоиска.Вставить("Цена"               , СтрокаСостава.Цена);
			
			НайденныеСтрокиСостава = СоставТранспортныхУпаковок.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтрокиСостава.Количество() = 0 Тогда
				
				НоваяСтрока = СоставТранспортныхУпаковок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСостава);
				НоваяСтрока.ИдентификаторСтроки = НайденныеСтроки[0].ИдентификаторСтроки;
				
			Иначе
				Для Каждого НайденнаяСтрокаСостава Из НайденныеСтрокиСостава Цикл
					НайденнаяСтрокаСостава.Уведомление = СтрокаСостава.Уведомление;
				КонецЦикла;
			КонецЕсли;
			
			МассивСтрокУдаленияСостава.Добавить(СтрокаСостава);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из МассивСтрокУдаления Цикл
		ТранспортныеУпаковкиУведомления.Удалить(СтрокаМассива);
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из МассивСтрокУдаленияСостава Цикл
		СоставТранспортныхУпаковокУведомления.Удалить(СтрокаМассива);
	КонецЦикла;
	
	НомерСтроки = 1;
	Для Каждого Строка Из СоставТранспортныхУпаковок Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
			Строка.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(Строка.Характеристика);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНомеровУпаковок(ИдентификаторТекущейСтроки, GTINТекущейСтроки)
	
	ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
		Элементы.НомераУпаковок.ОтборСтрок,
		Новый Структура("ИдентификаторСтроки", ИдентификаторТекущейСтроки));
	
	
	Если GTINТекущейСтроки = "" Тогда
		GTINОтбора = "123";
	Иначе
		GTINОтбора = GTINТекущейСтроки;
	КонецЕсли;
	
	ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
		Элементы.НомераУпаковокУведомления.ОтборСтрок,
		Новый Структура("GTIN", GTINОтбора));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСоставаТранспортныхУпаковок(ИдентификаторТекущейСтроки)
	
	ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
		Элементы.СоставТранспортныхУпаковок.ОтборСтрок,
		Новый Структура("ИдентификаторСтроки", ИдентификаторТекущейСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницу(Вперед)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОснования Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			
			ЕстьВыбранныеОснования = Ложь;
			Для Каждого Строка Из Основания Цикл
				Если Строка.Выбран Тогда
					ЕстьВыбранныеОснования = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ЕстьВыбранныеОснования Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Не выбрано основание. Выберите основание.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				ПродолжитьПереходКСопоставлению();
			КонецЕсли;
			
		Иначе
			// нет перехода назад
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			
			ЕстьВыбранныеУведомления = Ложь;
			Для Каждого Строка Из Уведомления Цикл
				Если Строка.Выбран Тогда
					ЕстьВыбранныеУведомления = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ЕстьВыбранныеУведомления Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Не выбрано ни одного уведомления. Выберите минимум одно уведомление.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				
				ЭтоПервыйПрогон = Истина;
				ВыбранаяДата    = Неопределено;
				ВыбранныйНомера = Неопределено;
				
				Для Каждого Строка Из Уведомления Цикл
					Если Строка.Выбран Тогда
						
						Если ЭтоПервыйПрогон Тогда
							ВыбранаяДата    = Строка.ДатаДокумента;
							ВыбранныйНомера = Строка.НомерДокумента;
							ЭтоПервыйПрогон = Ложь;
							Продолжить;
						КонецЕсли;
						
						Если ВыбранаяДата <> Строка.ДатаДокумента
							ИЛИ ВыбранныйНомера <> Строка.НомерДокумента Тогда
							ЕстьОшибки = Истина;
							ТекстВопроса = НСтр("ru='У выбранных уведомлений различаются номер и дата отгрузки. Продолжить?'");
							ОписаниеОповещения = Новый ОписаниеОповещения("ВопросРазныеНомераЗавершение", ЭтотОбъект);
							ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				ПродолжитьПереходКСопоставлению();
			КонецЕсли;
			
		Иначе
			// нет перехода назад
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСопоставление Тогда
		
		Если Вперед Тогда
			УстановитьТекущуюСтраницу("СтраницаТранспортныеУпаковки");
		Иначе
			Если ФормаОткрытаИзУведомления Тогда
				УстановитьТекущуюСтраницу("СтраницаОснования");
			Иначе
				УстановитьТекущуюСтраницу("СтраницаУведомления");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТранспортныеУпаковки Тогда
		
		Если Вперед Тогда
			Если НомераУпаковокУведомления.Количество() > 0 ИЛИ ТранспортныеУпаковкиУведомления.Количество() > 0 Тогда
				УстановитьТекущуюСтраницу("СтраницаНеСопопставленные");
			Иначе
				ЗаполнитьТоварыДляРегистрацииGTIN();
				УстановитьТекущуюСтраницу("СтраницаРегистрацияGTIN");
			КонецЕсли;
		Иначе
			УстановитьТекущуюСтраницу("СтраницаСопоставление");
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНеСопопставленные Тогда
		
		Если Вперед Тогда
			ЗаполнитьТоварыДляРегистрацииGTIN();
			УстановитьТекущуюСтраницу("СтраницаРегистрацияGTIN");
		Иначе
			УстановитьТекущуюСтраницу("СтраницаТранспортныеУпаковки");
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРегистрацияGTIN Тогда
		
		Если Вперед Тогда
			
			Если ТоварыРегистрацииGTIN.Количество() > 0 Тогда
				ТекстВопроса = НСтр("ru='В списке есть GTIN, которые нужно зарегистрировать. Продолжить?'");
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЕстьGTINДляРегистрацииЗавершение", ЭтотОбъект);
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				Возврат;
			Иначе
				УстановитьТекущуюСтраницу("СтраницаОтчет");
				ЗаполнитьСтраницуОтчета();
			КонецЕсли;
		Иначе
			Если НомераУпаковокУведомления.Количество() > 0 ИЛИ ТранспортныеУпаковкиУведомления.Количество() > 0 Тогда
				УстановитьТекущуюСтраницу("СтраницаНеСопопставленные");
			Иначе
				УстановитьТекущуюСтраницу("СтраницаТранспортныеУпаковки");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если ОтчетОтмена Тогда
			Если ФормаОткрытаИзУведомления Тогда
				УстановитьТекущуюСтраницу("СтраницаОснования");
			Иначе
				УстановитьТекущуюСтраницу("СтраницаУведомления");
			КонецЕсли;
		Иначе
			УстановитьТекущуюСтраницу("СтраницаРегистрацияGTIN");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСостояниеКнопокСтраницы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтраницуОтчета()
	
	ЖирныйШрифт = Новый Шрифт(, 12, Истина, , , );
	ПростоШрифт = Новый Шрифт(, 12, Ложь  , , , );
	
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = 'После завершения будут произведены следующие операции:'"), ЖирныйШрифт));
	
	
	Если ФормаОткрытаИзУведомления Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- документ ""'") + Строка(ОснованиеСсылка) + НСтр("ru = '"" будет заполнен по сопоставленным серийным номерам упаковок. '"), ПростоШрифт));
	Иначе
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- в форме документа для маркируемых товаров будут заполнены серийные номера упаковок. '"), ПростоШрифт));
	КонецЕсли;
	
	
	Для Каждого Строка Из СписокУведомлений Цикл
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- в документе ""'") + Строка(Строка.Значение) + НСтр("ru = '"" будут заполнены недостающие данные (номенклатура и характеристика).'"), ПростоШрифт));
	КонецЦикла;
	
	
	МассивСообщенийПоНомерам = Новый Массив;
	
	Для Каждого Строка Из СписокУведомлений Цикл
		
		НайденныеСтроки = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("Уведомление", Строка.Значение));
		
		СписокНомеровОтказаться = Новый Массив;
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НайденнаяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче
					ИЛИ НайденнаяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ
					ИЛИ НайденнаяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Подтвердить Тогда
					СписокНомеровОтказаться.Добавить(НайденнаяСтрока.НомерКИЗ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СписокНомеровОтказаться.Количество() > 0 Тогда
			Если ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
				МассивСообщенийПоНомерам.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'В уведомлении ""'") + Строка(Строка.Значение) + НСтр("ru = '"" для следующих серийных номеров упаковок будут изменены состояния подтверждения на ""Отказаться"":'"), ПростоШрифт));
			Иначе
				МассивСообщенийПоНомерам.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'В уведомлении ""'") + Строка(Строка.Значение) + НСтр("ru = '"" для следующих серийных номеров упаковок будут изменены состояния подтверждения на ""Отозвать"":'"), ПростоШрифт));
			КонецЕсли;
			Для Каждого СтрокаСписка Из СписокНомеровОтказаться Цикл
				МассивСообщенийПоНомерам.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + "- " + СтрокаСписка, ПростоШрифт));
			КонецЦикла;
		КонецЕсли;
		
		НайденныеСтроки = ТранспортныеУпаковкиУведомления.НайтиСтроки(Новый Структура("Уведомление", Строка.Значение));
		
		СписокНомеровОтказаться = Новый Массив;
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НайденнаяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче
					ИЛИ НайденнаяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ
					ИЛИ НайденнаяСтрока.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Подтвердить Тогда
					СписокНомеровОтказаться.Добавить(НайденнаяСтрока.НомерУпаковки);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СписокНомеровОтказаться.Количество() > 0 Тогда
			Если ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
				МассивСообщенийПоНомерам.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'В уведомлении ""'") + Строка(Строка.Значение) + НСтр("ru = '"" для следующих транспортных номеров упаковок будут изменены состояния подтверждения на ""Отказаться"":'"), ПростоШрифт));
			Иначе
				МассивСообщенийПоНомерам.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'В уведомлении ""'") + Строка(Строка.Значение) + НСтр("ru = '"" для следующих транспортных номеров упаковок будут изменены состояния подтверждения на ""Отозвать"":'"), ПростоШрифт));
			КонецЕсли;
			Для Каждого СтрокаСписка Из СписокНомеровОтказаться Цикл
				МассивСообщенийПоНомерам.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + "- " + СтрокаСписка, ПростоШрифт));
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСообщенийПоНомерам.Количество() > 0 Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = 'ВАЖНО! '"), ЖирныйШрифт));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(МассивСообщенийПоНомерам));
	КонецЕсли;
	
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ор_ИдентификаторСтроки);
		СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиНомеров.Количество() > 0 Тогда
			
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = '- у характеристики ""'") + Строка(СтрокаТовары.Характеристика) + НСтр("ru = '"" будет установлен флаг ""Маркируемый товар"". '"), ПростоШрифт));
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Отчет = Новый ФорматированнаяСтрока(МассивСтрок);
	
	ОтчетОтмена = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтраницуОтчетаОтмена(ТекстЗаголовка, ТекстСообщения)
	
	ЖирныйШрифт = Новый Шрифт(, 12, Истина, , , );
	ПростоШрифт = Новый Шрифт(, 12, Ложь  , , , );
	
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + НСтр("ru = ' '")));
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + ТекстЗаголовка, ЖирныйШрифт));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + Символы.ПС + ТекстСообщения, ПростоШрифт));
	
	Отчет = Новый ФорматированнаяСтрока(МассивСтрок);
	
	ОтчетОтмена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеКнопокСтраницы()
	
	Элементы.ФормаНазад.Доступность  = Ложь;
	Элементы.ФормаДалее.Доступность  = Ложь;
	Элементы.ЗавершитьВвод.Видимость = Ложь;
	Элементы.ФормаСбросить.Видимость = Ложь;
	Элементы.ФормаУведомленияПоДругимОтгрузкам.Видимость = Ложь;
	Элементы.ФормаЗарегистрироватьGTIN.Видимость = Ложь;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОснования Тогда
		
		Элементы.ФормаДалее.Доступность  = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Подбор основания для сопоставления'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомления Тогда
		
		Элементы.ФормаДалее.Доступность  = Истина;
		Элементы.ФормаУведомленияПоДругимОтгрузкам.Видимость = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Подбор уведомлений для сопоставления'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСопоставление Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ФормаДалее.Доступность  = Истина;
		Элементы.ФормаСбросить.Видимость = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Сопоставление номеров упаковок'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТранспортныеУпаковки Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ФормаДалее.Доступность  = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Сопоставление транспортных упаковок'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНеСопопставленные Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ФормаДалее.Доступность  = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Результат по несопоставленным номерам'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРегистрацияGTIN Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ФормаДалее.Доступность  = Истина;
		Элементы.ФормаЗарегистрироватьGTIN.Видимость = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Регистрация GTIN'");
		
	ИначеЕсли ОтчетОтмена Тогда
		
		Элементы.ФормаНазад.Доступность  = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Результат сопоставления'");
		
	Иначе
		
		Элементы.ФормаНазад.Доступность  = Истина;
		Элементы.ЗавершитьВвод.Видимость = Истина;
		ЭтаФорма.Заголовок = НСтр("ru='Результат сопоставления'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораGTIN()
	
	ВременнаяНомераУпаковок = НомераУпаковокУведомления.Выгрузить();
	ВременнаяНомераУпаковок.Свернуть("GTIN");
	
	Возврат ВременнаяНомераУпаковок.ВыгрузитьКолонку("GTIN");
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеТоваров()
	
	ЕстьОшибки = Ложь;
	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьЗавершение()
	
	Если НЕ ПроверитьЗаполнениеТоваров() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	
	СохранитьВводСервер(ЕстьОшибки);
	Если Не Модифицированность И НЕ ЕстьОшибки Тогда
		
		Для Каждого Строка Из СписокУведомлений Цикл
			Оповестить("ВыполненоСопоставлениеЗаполнениеМДЛП", Строка.Значение, Неопределено);
		КонецЦикла;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		СтруктураВозврата.Вставить("МодифицированностьВладельца", МодифицированностьВладельца);
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВводСервер(ЕстьОшибки)
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ор_ИдентификаторСтроки);
		СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиНомеров.Количество() > 0 Тогда
			
			Результат = ЗаполнитьПризнакМаркируемгоТовара(СтрокаТовары.Характеристика);
			
			Если Результат Тогда
				СтрокаТовары.МаркируемыйТовар = Истина;
			Иначе
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из СоставТранспортныхУпаковок Цикл
		
		Если СтрокаТовары.МаркируемыйТовар Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки);
		СтрокиНомеров = НомераУпаковок.НайтиСтроки(ПараметрыОтбора);
		
		Результат = ЗаполнитьПризнакМаркируемгоТовара(СтрокаТовары.Характеристика);
		
		Если Результат Тогда
			СтрокаТовары.МаркируемыйТовар = Истина;
		Иначе
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормаОткрытаИзУведомления Тогда
		ОбновитьДокумент(ЕстьОшибки);
		Если ЕстьОшибки Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьУведомления(ЕстьОшибки);
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Структурапараметров = Новый Структура;
	Структурапараметров.Вставить("ТаблицаТоваров", Товары.Выгрузить());
	Структурапараметров.Вставить("ТаблицаНомеров", НомераУпаковок.Выгрузить());
	Структурапараметров.Вставить("ТаблицаНомеровОтказа", НомераУпаковокУведомления.Выгрузить());
	
	Структурапараметров.Вставить("ТаблицаТранспортныхУпаковок", ТранспортныеУпаковки.Выгрузить());
	Структурапараметров.Вставить("ТаблицаСоставаТранспортныхУпаковок", СоставТранспортныхУпаковок.Выгрузить());
	Структурапараметров.Вставить("ТаблицаТранспортныхУпаковокОтказа", ТранспортныеУпаковкиУведомления.Выгрузить());
	Структурапараметров.Вставить("ТаблицаСоставаТранспортныхУпаковокОтказа", СоставТранспортныхУпаковокУведомления.Выгрузить());
	
	Структурапараметров.Вставить("ОснованиеСсылка", ОснованиеСсылка);
	
	ПоместитьВоВременноеХранилище(Структурапараметров, АдресВоВременномХранилище);
	
	Если Модифицированность Тогда
		МодифицированностьВладельца = Истина;
	КонецЕсли;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУведомления(ЕстьОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаУведомления Из СписокУведомлений Цикл
		
		Данные = ИнтеграцияМДЛП.ТекущийСтатусУведомления(СтрокаУведомления.Значение);
		СтатусМДЛП = Данные.Статус;
		
		УведомлениеОбъект = СтрокаУведомления.Значение.ПолучитьОбъект();
		УведомлениеОбъект.Основание = ОснованиеСсылка;
		
		ОбновитьУведомление(УведомлениеОбъект, СтатусМДЛП);
		
		Попытка
			УведомлениеОбъект.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось перезаписать уведомление МДЛП:'") + Строка(УведомлениеОбъект.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУведомление(УведомлениеОбъект, СтатусМДЛП)
	
	Для Каждого СтрокаУпаковки Из УведомлениеОбъект.НомераУпаковок Цикл
		
		НайденныеСтроки = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("Уведомление,НомерКИЗ", УведомлениеОбъект.Ссылка, СтрокаУпаковки.НомерКИЗ));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ОбновитьСостояниеПодтвержденияВУведомлении(УведомлениеОбъект, СтрокаУпаковки, СтатусМДЛП, Ложь);
		КонецЕсли;
		
		НайденныеСтроки = НомераУпаковок.НайтиСтроки(Новый Структура("Уведомление,НомерКИЗ", УведомлениеОбъект.Ссылка, СтрокаУпаковки.НомерКИЗ));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ОбновитьСостояниеПодтвержденияВУведомлении(УведомлениеОбъект, СтрокаУпаковки, СтатусМДЛП, Истина);
		КонецЕсли;
		
		НайденныеСтроки = УведомлениеОбъект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаУпаковки.ИдентификаторСтроки));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			
			НайденнаяСтрока = НайденныеСтроки[0];
			
			НайденныеУпаковки = НомераУпаковок.НайтиСтроки(Новый Структура("Уведомление,НомерКИЗ", УведомлениеОбъект.Ссылка, СтрокаУпаковки.НомерКИЗ));
			Если НайденныеУпаковки.Количество() <> 0 Тогда
				
				НайденныеСтрокиТоваров = Товары.НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", НайденныеУпаковки[0].ИдентификаторСтроки));
				Если НайденныеСтрокиТоваров.Количество() <> 0 Тогда
					
					НайденнаяСтрокаТовара = НайденныеСтрокиТоваров[0];
					Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Номенклатура) Тогда
						НайденнаяСтрока.Номенклатура = НайденнаяСтрокаТовара.Номенклатура;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Характеристика) Тогда
						НайденнаяСтрока.Характеристика = НайденнаяСтрокаТовара.Характеристика;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТовара Из УведомлениеОбъект.ТранспортныеУпаковки Цикл
		
		НайденныеСтроки = ТранспортныеУпаковкиУведомления.НайтиСтроки(Новый Структура("Уведомление,НомерУпаковки", УведомлениеОбъект.Ссылка, СтрокаТовара.НомерУпаковки));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ОбновитьСостояниеПодтвержденияВУведомлении(УведомлениеОбъект, СтрокаТовара, СтатусМДЛП, Ложь);
		КонецЕсли;
		
		НайденныеСтроки = ТранспортныеУпаковки.НайтиСтроки(Новый Структура("Уведомление,НомерУпаковки", УведомлениеОбъект.Ссылка, СтрокаТовара.НомерУпаковки));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ОбновитьСостояниеПодтвержденияВУведомлении(УведомлениеОбъект, СтрокаТовара, СтатусМДЛП, Истина);
		КонецЕсли;
		
		НайденныеСтроки = ТранспортныеУпаковки.НайтиСтроки(Новый Структура("Уведомление,НомерУпаковки", УведомлениеОбъект.Ссылка, СтрокаТовара.НомерУпаковки));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Для Каждого СтрокаУпаковки Из УведомлениеОбъект.СоставТранспортныхУпаковок Цикл
				СтруктраПоиска = Новый Структура;
				СтруктраПоиска.Вставить("Уведомление"        , УведомлениеОбъект.Ссылка);
				СтруктраПоиска.Вставить("ИдентификаторСтроки", НайденныеСтроки[0].ИдентификаторСтроки);
				СтруктраПоиска.Вставить("GTIN"               , СтрокаУпаковки.GTIN);
				СтруктраПоиска.Вставить("НомерСерии"         , СтрокаУпаковки.НомерСерии);
				СтруктраПоиска.Вставить("Цена"               , СтрокаУпаковки.Цена);
				СтруктраПоиска.Вставить("СуммаНДС"           , СтрокаУпаковки.СуммаНДС);
				НайденныестрокиСостава = СоставТранспортныхУпаковок.НайтиСтроки(СтруктраПоиска);
				Если НайденныестрокиСостава.Количество() <> 0 Тогда
					НайденнаяСтрокаСостава = НайденныестрокиСостава[0];
					Если НЕ ЗначениеЗаполнено(СтрокаУпаковки.Номенклатура) Тогда
						СтрокаУпаковки.Номенклатура = НайденнаяСтрокаСостава.Номенклатура;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СтрокаУпаковки.Характеристика) Тогда
						СтрокаУпаковки.Характеристика = НайденнаяСтрокаСостава.Характеристика;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеПодтвержденияВУведомлении(УведомлениеОбъект, СтрокаУпаковки, СтатусМДЛП, Подтвердить = Ложь)
	
	УведомлениеОПриемке = ТипЗнч(УведомлениеОбъект.Ссылка) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП");
	
	Если СтатусМДЛП = Перечисления.СтатусыИнформированияМДЛП.Закрыто Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомлениеОПриемке Тогда
		СтатусОтказаться = Перечисления.СостоянияПодтвержденияМДЛП.Отказаться;
		УведомлениеСоздается = УведомлениеОбъект.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ОбратныйПорядок;
	Иначе
		СтатусОтказаться = Перечисления.СостоянияПодтвержденияМДЛП.Отозвать;
		УведомлениеСоздается = УведомлениеОбъект.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок;
	КонецЕсли;
	
	Если УведомлениеСоздается Тогда
		
		Если Подтвердить Тогда
			Если СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ
				ИЛИ СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ОприходованоНовымВладельцем
				ИЛИ СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках
				ИЛИ СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы Тогда
				СтрокаУпаковки.СостояниеПодтверждения = СтрокаУпаковки.СостояниеПодтверждения;
			Иначе
				СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
			КонецЕсли;
		Иначе
			Если СтатусМДЛП = Перечисления.СтатусыИнформированияМДЛП.Черновик Тогда
				СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.НеТребуется;
			ИначеЕсли СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче Тогда
				СтрокаУпаковки.СостояниеПодтверждения = СтатусОтказаться;
			ИначеЕсли СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ Тогда
				СтрокаУпаковки.СостояниеПодтверждения = СтатусОтказаться;
			Иначе
				СтрокаУпаковки.СостояниеПодтверждения = СтрокаУпаковки.СостояниеПодтверждения;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Подтверждено
			ИЛИ СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ОприходованоНовымВладельцем
			ИЛИ СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.АктуализироватьДанныеОбУпаковках
			ИЛИ СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ДанныеОбУпаковкахАктуализированы Тогда
			Возврат;
		КонецЕсли;
		
		Если Подтвердить Тогда
			СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Подтвердить;
		Иначе
			Если СтрокаУпаковки.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Подтвердить Тогда
				СтрокаУпаковки.СостояниеПодтверждения = СтатусОтказаться;
			Иначе
				СтрокаУпаковки.СостояниеПодтверждения = СтрокаУпаковки.СостояниеПодтверждения;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокумент(ЕстьОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументОбъект = ОснованиеСсылка.ПолучитьОбъект();
	
	//Для Каждого СтрокаТоваров Из Товары Цикл
	//	
	//	НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ор_ИдентификаторСтроки", СтрокаТоваров.ор_ИдентификаторСтроки));
	//	
	//	ТекущиеДанные = НайденныеСтроки[0];
	//	ТекущиеДанные.GTIN = СтрокаТоваров.GTIN;
	//	
	//КонецЦикла;
	
	// Заполнение номеров упаковок
	ДокументОбъект.ор_НомераУпаковок.Очистить();
	Для Каждого СтрокаМассива Из НомераУпаковок Цикл
		НоваяСтрока = ДокументОбъект.ор_НомераУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	// Заполнение ТранспортныеУпаковки
	ДокументОбъект.ор_ТранспортныеУпаковки.Очистить();
	Для Каждого СтрокаМассива Из ТранспортныеУпаковки Цикл
		НоваяСтрока = ДокументОбъект.ор_ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	// Заполнение СоставТранспортныхУпаковок
	ДокументОбъект.ор_СоставТранспортныхУпаковок.Очистить();
	Для Каждого СтрокаМассива Из СоставТранспортныхУпаковок Цикл
		НоваяСтрока = ДокументОбъект.ор_СоставТранспортныхУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;
	
	Попытка
		ДокументОбъект.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось перезаписать документ:'") + Строка(ДокументОбъект.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПризнакМаркируемгоТовара(Характеристика)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектХарактеристики = Характеристика.ПолучитьОбъект();
	ОбъектХарактеристики.ор_МаркируемыйТовар = Истина;
	
	Попытка
		ОбъектХарактеристики.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить признак маркируемого товара в характеристике :'") + Строка(Характеристика);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьТаблицыПередСопоставлением()
	
	МассивСообщений = Новый Массив;
	
	СтруктураОтвета = Новый Структура("ЕстьОшибки,ТекстЗаголовка,ТекстСообщения", Ложь, "", "");
	
	Если Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Отсутствуют маркируемые товары'");
		МассивСообщений.Добавить(ТекстСообщения);
	КонецЕсли;
	
	//Если ТранспортныеУпаковкиУведомления.Количество() = 0 Тогда 
	//	Для Каждого Строка Из Товары Цикл
	//		Если НЕ ЗначениеЗаполнено(Строка.GTIN) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		НайденныеСтроки = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("GTIN",Строка.GTIN));
	//		Если НайденныеСтроки.Количество() = 0 Тогда
	//			ТекстСообщения = НСтр("ru='Есть GTIN %GTIN%, который отсутствует в уведомлении'");
	//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", Строка.GTIN);
	//			МассивСообщений.Добавить(ТекстСообщения);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	//ВременнаяНомераУпаковок = НомераУпаковок.Выгрузить();
	//ВременнаяНомераУпаковок.Свернуть("НомерКИЗ");
	//Для Каждого Строка из ВременнаяНомераУпаковок Цикл
	//	НайденныеСтроки = НомераУпаковокУведомления.НайтиСтроки(Новый Структура("НомерКИЗ",Строка.НомерКИЗ));
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		ТекстСообщения = НСтр("ru='Есть серийный номер упаковки %НомерКИЗ%, который отсутствует в уведомлении'");
	//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерКИЗ%", Строка.НомерКИЗ);
	//		МассивСообщений.Добавить(ТекстСообщения);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Для Каждого Строка Из ТранспортныеУпаковки Цикл
	//	НайденныеСтроки = ТранспортныеУпаковкиУведомления.НайтиСтроки(Новый Структура("НомерУпаковки",Строка.НомерУпаковки));
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		ТекстСообщения = НСтр("ru='Есть номер транспортной упаковки %НомерУпаковки%, который отсутствует в уведомлении'");
	//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Строка.НомерУпаковки);
	//		МассивСообщений.Добавить(ТекстСообщения);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Для Каждого Строка Из ТранспортныеУпаковки Цикл
	//	НайденныеСтроки = ТранспортныеУпаковкиУведомления.НайтиСтроки(Новый Структура("НомерУпаковки",Строка.НомерУпаковки));
	//	Если НайденныеСтроки.Количество() > 0 И Строка.Цена <> НайденныеСтроки[0].Цена Тогда
	//		ТекстСообщения = НСтр("ru='Есть номер транспортной упаковки %НомерУпаковки%, цена которого отличается от цены в уведомлении'");
	//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Строка.НомерУпаковки);
	//		МассивСообщений.Добавить(ТекстСообщения);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Для Каждого Строка из СоставТранспортныхУпаковок Цикл
	//	НайденныеСтроки = СоставТранспортныхУпаковокУведомления.НайтиСтроки(Новый Структура("GTIN,НомерСерии,Цена", Строка.GTIN, Строка.НомерСерии, Строка.Цена));
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		ТекстСообщения = НСтр("ru='В составе транспортной упаковки есть товар с GTIN %GTIN% и номером серии %НомерСерии%, который отсутствует в уведомлении'");
	//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%"      , Строка.GTIN);
	//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСерии%", Строка.НомерСерии);
	//		МассивСообщений.Добавить(ТекстСообщения);
	//	КонецЕсли;
	//КонецЦикла;
	
	
	СтруктураОтвета.ЕстьОшибки = МассивСообщений.Количество() > 0;
	
	Если СтруктураОтвета.ЕстьОшибки Тогда
		
		СтруктураОтвета.ТекстЗаголовка = НСтр("ru='Сопоставление не возможно. В документе:'");
		
		ТекстСообщения = "";
		Для Каждого СтрокаМассива Из МассивСообщений Цикл
			ТекстСообщения = ?(ТекстСообщения = "", "", Символы.ПС) + " - " + СтрокаМассива;
		КонецЦикла;
		СтруктураОтвета.ТекстСообщения = ТекстСообщения;
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВверхВнизНомерУпаковки(Вверх = Ложь)
	
	Если Вверх Тогда
		
		ТекущаяСтрокаНЕсопосталена = Элементы.НомераУпаковокУведомления.ТекущиеДанные;
		
		Если ТекущаяСтрокаНЕсопосталена = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
		
		Если ТекущаяСтрокаТовары = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НайденныеСтрокиНомеров = НомераУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрокаТовары.ор_ИдентификаторСтроки));
		
		Если НайденныеСтрокиНомеров.Количество() = ТекущаяСтрокаТовары.Количество Тогда
			ТекстСообщения = НСтр("ru='Для выбранной строки таблицы ""Товары"" номера упаковок заполнены.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Если НЕ Игнорироватьцену И ТекущаяСтрокаНЕсопосталена.Цена <> ТекущаяСтрокаТовары.Цена Тогда
			ТекстСообщения = НСтр("ru='Цена переносимой строки отличается от цены выбранной строки таблицы ""Товары"".'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = НомераУпаковок.Добавить();
		НоваяСтрока.НомерКИЗ = ТекущаяСтрокаНЕсопосталена.НомерКИЗ;
		НоваяСтрока.Цена = ТекущаяСтрокаНЕсопосталена.Цена;
		НоваяСтрока.Уведомление = ТекущаяСтрокаНЕсопосталена.Уведомление;
		НоваяСтрока.СостояниеПодтверждения = ТекущаяСтрокаНЕсопосталена.СостояниеПодтверждения;
		НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрокаТовары.ор_ИдентификаторСтроки;
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаТовары.GTIN) Тогда
			ТекущаяСтрокаТовары.GTIN = ТекущаяСтрокаНЕсопосталена.GTIN;
		КонецЕсли;
		
		Если НЕ ТекущаяСтрокаТовары.ИспользоватьНомераУпаковок Тогда
			ТекущаяСтрокаТовары.ИспользоватьНомераУпаковок = Истина;
		КонецЕсли;
		
		НомераУпаковокУведомления.Удалить(ТекущаяСтрокаНЕсопосталена);
		
		ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок");
		
	Иначе
		
		ТекущаяСтрокаНомераУпаковки = Элементы.НомераУпаковок.ТекущиеДанные;
		
		Если ТекущаяСтрокаНомераУпаковки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = НомераУпаковокУведомления.Добавить();
		НоваяСтрока.НомерКИЗ = ТекущаяСтрокаНомераУпаковки.НомерКИЗ;
		НоваяСтрока.Цена = ТекущаяСтрокаНомераУпаковки.Цена;
		НоваяСтрока.Уведомление = ТекущаяСтрокаНомераУпаковки.Уведомление;
		НоваяСтрока.СостояниеПодтверждения = ТекущаяСтрокаНомераУпаковки.СостояниеПодтверждения;
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.GTIN = Лев(НоваяСтрока.НомерКИЗ, 14);
		
		НомераУпаковок.Удалить(ТекущаяСтрокаНомераУпаковки);
		
		ор_ИнтеграцияМДЛПКлиентСервер.ОбновитьСтатусыЗаполненияНомеровУпаковок(ЭтотОбъект, "Товары", "НомераУпаковок");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВверхВнизТранспортнуюУпаковку(Вверх = Ложь)
	
	Если Вверх Тогда
		
		ТекущаяСтрокаТранспортнаяУпаковкаУедомления = Элементы.ТранспортныеУпаковкиУведомления.ТекущиеДанные;
		
		Если ТекущаяСтрокаТранспортнаяУпаковкаУедомления = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = ТранспортныеУпаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТранспортнаяУпаковкаУедомления);
		
		НайденныеСтрокиСостава = СоставТранспортныхУпаковокУведомления.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрокаТранспортнаяУпаковкаУедомления.ИдентификаторСтроки));
		
		МассивСтрокУдаления = Новый Массив;
		
		Для Каждого Строка Из НайденныеСтрокиСостава Цикл
			
			НоваяСтрокаСостава = СоставТранспортныхУпаковок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСостава, Строка);
			
			МассивСтрокУдаления.Добавить(Строка);
			
		КонецЦикла;
		
		ТранспортныеУпаковкиУведомления.Удалить(ТекущаяСтрокаТранспортнаяУпаковкаУедомления);
		
		Для Каждого Строка Из МассивСтрокУдаления Цикл
			СоставТранспортныхУпаковокУведомления.Удалить(Строка);
		КонецЦикла;
		
	Иначе
		
		ТекущаяСтрокаТранспортнаяУпаковка = Элементы.ТранспортныеУпаковки.ТекущиеДанные;
		
		Если ТекущаяСтрокаТранспортнаяУпаковка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущаяСтрокаТранспортнаяУпаковка.ИзОснования Тогда
			ТекстСообщения = НСтр("ru='Номер транспортной упаковки %НомерУпаковки% уже заполнен в документе.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", ТекущаяСтрокаТранспортнаяУпаковка.НомерУпаковки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = ТранспортныеУпаковкиУведомления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТранспортнаяУпаковка);
		
		НайденныеСтрокиСостава = СоставТранспортныхУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрокаТранспортнаяУпаковка.ИдентификаторСтроки));
		
		МассивСтрокУдаления = Новый Массив;
		
		Для Каждого Строка Из НайденныеСтрокиСостава Цикл
			
			НоваяСтрокаСостава = СоставТранспортныхУпаковокУведомления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСостава, Строка);
			
			МассивСтрокУдаления.Добавить(Строка);
			
		КонецЦикла;
		
		ТранспортныеУпаковки.Удалить(ТекущаяСтрокаТранспортнаяУпаковка);
		
		Для Каждого Строка Из МассивСтрокУдаления Цикл
			СоставТранспортныхУпаковок.Удалить(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
	НомерСтроки = 1;
	Для Каждого Строка Из СоставТранспортныхУпаковок Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
			Строка.МаркируемыйТовар = ОбновитьПризнакМаркируемыйТовар(Строка.Характеристика);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПризнакМаркируемыйТовар(Характеристика)
	
	Возврат Характеристика.ор_МаркируемыйТовар;
	
КонецФункции

&НаСервере
Функция ПроверитьСериюПроизводителяХарактеристики(Характеристика, НомерСерии)
	
	Если НомерСерии = Характеристика.ор_СерияПроизводителя Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруНедоступныхНомеров(СписокУведомлений2)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Номераупаковок", Новый СписокЗначений);
	СтруктураВозврата.Вставить("ТранспортныеУпаковки", Новый СписокЗначений);
	
	Если ФормаОткрытаИзУведомления Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОснованиеСсылкаВходящая) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	
	Если ТипЗнч(ОснованиеСсылкаВходящая) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.НомерКИЗ КАК НомерКИЗ
		|ПОМЕСТИТЬ втНомераДокумента
		|ИЗ
		|	Документ.ПриходныйОрдер.ор_НомераУпаковок КАК ПриходныйОрдерНаТоварыор_НомераУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка.ДокументОснование В (&СписокДокументов)
		|	И НЕ ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка В (&СписокИсключений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерКИЗ КАК НомерКИЗ
		|ПОМЕСТИТЬ втНомераУведомлений
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК УведомлениеОПриемкеМДЛПНомераУпаковок
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка В(&СписокУведомлений)
		|	И УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка.Основание = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втНомераДокумента.НомерКИЗ КАК НомерКИЗ
		|ИЗ
		|	втНомераДокумента КАК втНомераДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНомераУведомлений КАК втНомераУведомлений
		|		ПО втНомераДокумента.НомерКИЗ = втНомераУведомлений.НомерКИЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.НомерУпаковки КАК НомерУпаковки
		|ПОМЕСТИТЬ втТранспортныеУпаковкиДокумента
		|ИЗ
		|	Документ.ПриходныйОрдер.ор_ТранспортныеУпаковки КАК ПриходныйОрдерНаТоварыор_НомераУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка.ДокументОснование В (&СписокДокументов)
		|	И НЕ ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка В (&СписокИсключений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерУпаковки КАК НомерУпаковки
		|ПОМЕСТИТЬ втТранспортныеУпаковкиУведомлений
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК УведомлениеОПриемкеМДЛПНомераУпаковок
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка В(&СписокУведомлений)
		|	И УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка.Основание = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втТранспортныеУпаковкиДокумента.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	втТранспортныеУпаковкиДокумента КАК втТранспортныеУпаковкиДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеУпаковкиУведомлений КАК втТранспортныеУпаковкиУведомлений
		|		ПО втТранспортныеУпаковкиДокумента.НомерУпаковки = втТранспортныеУпаковкиУведомлений.НомерУпаковки";
		
		СписокИсключений = Новый СписокЗначений;
		СписокИсключений.Добавить(ОснованиеСсылкаВходящая);
		
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(ОснованиеСсылка);
		
		Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		Запрос.УстановитьПараметр("СписокУведомлений", СписокУведомлений2);
		Запрос.УстановитьПараметр("Основание", ОснованиеСсылка);
		
		Результат = Запрос.ВыполнитьПакет();
		РезультатНомера = Результат[2].Выгрузить();
		РезультатТранспортные = Результат[5].Выгрузить();
		
		Для Каждого Строка Из РезультатНомера Цикл
			СтруктураВозврата.НомераУпаковок.Добавить(Строка.НомерКИЗ);
		КонецЦикла;
		
		Для Каждого Строка Из РезультатТранспортные Цикл
			СтруктураВозврата.ТранспортныеУпаковки.Добавить(Строка.НомерУпаковки);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ОснованиеСсылкаВходящая) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.НомерКИЗ КАК НомерКИЗ
		|ПОМЕСТИТЬ втНомераДокумента
		|ИЗ
		|	Документ.РасходныйОрдер.ор_НомераУпаковок КАК ПриходныйОрдерНаТоварыор_НомераУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка.ДокументОснование В(&СписокДокументов)
		|	И НЕ ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка В (&СписокИсключений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерКИЗ КАК НомерКИЗ
		|ПОМЕСТИТЬ втНомераУведомлений
		|ИЗ
		|	Документ.УведомлениеОбОтгрузкеМДЛП.НомераУпаковок КАК УведомлениеОПриемкеМДЛПНомераУпаковок
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка В(&СписокУведомлений)
		|	И УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка.Основание = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втНомераДокумента.НомерКИЗ КАК НомерКИЗ
		|ИЗ
		|	втНомераДокумента КАК втНомераДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНомераУведомлений КАК втНомераУведомлений
		|		ПО втНомераДокумента.НомерКИЗ = втНомераУведомлений.НомерКИЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.НомерУпаковки КАК НомерУпаковки
		|ПОМЕСТИТЬ втТранспортныеУпаковкиДокумента
		|ИЗ
		|	Документ.РасходныйОрдер.ор_ТранспортныеУпаковки КАК ПриходныйОрдерНаТоварыор_НомераУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка.ДокументОснование В(&СписокДокументов)
		|	И НЕ ПриходныйОрдерНаТоварыор_НомераУпаковок.Ссылка В (&СписокИсключений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерУпаковки КАК НомерУпаковки
		|ПОМЕСТИТЬ втТранспортныеУпаковкиУведомлений
		|ИЗ
		|	Документ.УведомлениеОбОтгрузкеМДЛП.ТранспортныеУпаковки КАК УведомлениеОПриемкеМДЛПНомераУпаковок
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка В(&СписокУведомлений)
		|	И УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка.Основание = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втТранспортныеУпаковкиДокумента.НомерУпаковки КАК НомерУпаковки
		|ИЗ
		|	втТранспортныеУпаковкиДокумента КАК втТранспортныеУпаковкиДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеУпаковкиУведомлений КАК втТранспортныеУпаковкиУведомлений
		|		ПО втТранспортныеУпаковкиДокумента.НомерУпаковки = втТранспортныеУпаковкиУведомлений.НомерУпаковки";
		
		СписокИсключений = Новый СписокЗначений;
		СписокДокументов.Добавить(ОснованиеСсылкаВходящая);
		
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(ОснованиеСсылка);
		
		Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		Запрос.УстановитьПараметр("СписокУведомлений", СписокУведомлений2);
		Запрос.УстановитьПараметр("Основание", ОснованиеСсылка);
		
		Результат = Запрос.ВыполнитьПакет();
		РезультатНомера = Результат[2].Выгрузить();
		РезультатТранспортные = Результат[5].Выгрузить();
		
		Для Каждого Строка Из РезультатНомера Цикл
			СтруктураВозврата.НомераУпаковок.Добавить(Строка.НомерКИЗ);
		КонецЦикла;
		
		Для Каждого Строка Из РезультатТранспортные Цикл
			СтруктураВозврата.ТранспортныеУпаковки.Добавить(Строка.НомерУпаковки);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ПолученнаяТекущаяСтраница <> ТекущаяСтраница.Имя Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы[ПолученнаяТекущаяСтраница];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницу(ИмяСтраницы)
	
	ПолученнаяТекущаяСтраница = ИмяСтраницы;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры

&НаСервере
Процедура ОткорректироватьСписокУведомлний()
	
	СписокУведомлений1 = Новый СписокЗначений;
	
	Для Каждого Строка Из Уведомления Цикл
		СписокУведомлений1.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Если СписокУведомлений1.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбъектаУведомления = СписокУведомлений1[0].Значение.Метаданные().Имя;
	
	СтруктураНедоступныхНомеров = ПолучитьСтруктуруНедоступныхНомеров(СписокУведомлений1);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомераУпаковок.Ссылка КАК Уведомление
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК НомераУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.Товары КАК Товары
	|		ПО НомераУпаковок.ИдентификаторСтроки = Товары.ИдентификаторСтроки
	|			И НомераУпаковок.Ссылка = Товары.Ссылка
	|ГДЕ
	|	НомераУпаковок.Ссылка В(&СписокУведомлений)
	|	И НЕ Товары.ИдентификаторСтроки ЕСТЬ NULL
	|	И НЕ НомераУпаковок.НомерКИЗ В (&СписокНомеровИсключений)
	|	И НомераУпаковок.СостояниеПодтверждения В(&СписокСостояний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеУпаковки.Ссылка КАК Уведомление
	|ПОМЕСТИТЬ втТранспортные
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ТранспортныеУпаковки
	|ГДЕ
	|	ТранспортныеУпаковки.Ссылка В(&СписокУведомлений)
	|	И НЕ ТранспортныеУпаковки.НомерУпаковки В (&СписокТранспортныхНомеровИсключений)
	|	И ТранспортныеУпаковки.СостояниеПодтверждения В(&СписокСостояний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Уведомление КАК Уведомление
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Уведомление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТранспортные.Уведомление
	|ИЗ
	|	втТранспортные КАК втТранспортные";
	
	Запрос.УстановитьПараметр("СписокСостояний", ор_ИнтеграцияМДЛП.ПолучитьСписокСостоянийПодтверждения(Истина));
	
	Запрос.УстановитьПараметр("СписокУведомлений"                  , СписокУведомлений1);
	Запрос.УстановитьПараметр("СписокНомеровИсключений"            , СтруктураНедоступныхНомеров.Номераупаковок);
	Запрос.УстановитьПараметр("СписокТранспортныхНомеровИсключений", СтруктураНедоступныхНомеров.ТранспортныеУпаковки);
	
	Если ИмяОбъектаУведомления = "УведомлениеОбОтгрузкеМДЛП" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УведомлениеОПриемкеМДЛП", "УведомлениеОбОтгрузкеМДЛП");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Каждого Строка Из Уведомления Цикл
		
		НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("Уведомление", Строка.Ссылка));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из МассивСтрокДляУдаления Цикл
		Уведомления.Удалить(Строка)
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДругимОтгрузкам()
	
	Если Не ОтображатьУведомленияПоДругимОтгрузкам Тогда
		
		Для Каждого строка Из Уведомления Цикл
			Если Строка.Выбран И НЕ Строка.Отображать Тогда
				Строка.Выбран = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ИнтеграцияМДЛПКлиент.УстановитьОтборСтрок(
			Элементы.Уведомления.ОтборСтрок,
			Новый Структура("Отображать", Истина));
		
	Иначе
		ИнтеграцияМДЛПКлиент.СнятьОтборСтрок(Элементы.Уведомления.ОтборСтрок, "Отображать");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыДляРегистрацииGTIN()
	
	ТоварыРегистрацииGTIN.Очистить();
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.GTIN)
			И ЗначениеЗаполнено(Строка.Номенклатура)
			И ЗначениеЗаполнено(Строка.Характеристика) Тогда
			НоваяСтрока = ТоварыРегистрацииGTIN.Добавить();
			НоваяСтрока.GTIN           = Строка.GTIN;
			НоваяСтрока.Номенклатура   = Строка.Номенклатура;
			НоваяСтрока.Характеристика = Строка.Характеристика;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из СоставТранспортныхУпаковок Цикл
		Если ЗначениеЗаполнено(Строка.GTIN)
			И ЗначениеЗаполнено(Строка.Номенклатура)
			И ЗначениеЗаполнено(Строка.Характеристика) Тогда
			НоваяСтрока = ТоварыРегистрацииGTIN.Добавить();
			НоваяСтрока.GTIN           = Строка.GTIN;
			НоваяСтрока.Номенклатура   = Строка.Номенклатура;
			НоваяСтрока.Характеристика = Строка.Характеристика;
		КонецЕсли;
	КонецЦикла;
	
	вТоварыРегистрацииGTIN = ТоварыРегистрацииGTIN.Выгрузить();
	ор_ИнтеграцияМДЛП.ОбработатьТаблицуТоваровДляРегистрацииGTIN(вТоварыРегистрацииGTIN);
	ТоварыРегистрацииGTIN.Загрузить(вТоварыРегистрацииGTIN);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияGTINПродолжить(РезультатПроверки)
	
	ЗарегистрироватьGTINНаСервере(РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьGTINПоРегиструШК()
	
	РезультатПроверки = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.ДляХарактеристики КАК ДляХарактеристики,
	|	ТаблицаТовары.GTIN КАК GTIN,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК GTIN,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО втТовары.Номенклатура = Штрихкоды.Номенклатура
	|			И втТовары.Характеристика = Штрихкоды.Характеристика
	|			И втТовары.GTIN <> Штрихкоды.Штрихкод
	|			И (втТовары.ДляХарактеристики)
	|			И (Штрихкоды.Партия = &Партия)
	|			И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения)
	|
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика";
	
	Запрос.УстановитьПараметр("ТаблицаТовары"   , ТоварыРегистрацииGTIN.Выгрузить());
	Запрос.УстановитьПараметр("Партия"          , Справочники.ПартииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	
	GtinДляУдаления = Новый Массив;
	ТекстПредупреждения = "";
	
	ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		
		ВыборкаПоХарактеристике = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоХарактеристике.Следующий() Цикл
			
			ПредставлениеТовара = ор_ИнтеграцияМДЛП.ПредставлениеНоменклатуры(ВыборкаПоНоменклатуре.Номенклатура, ВыборкаПоХарактеристике.Характеристика);
			
			ВыборкаПоGTIN = ВыборкаПоХарактеристике.Выбрать();
			
			GtinТекИтерация = Новый Массив;
			Пока ВыборкаПоGTIN.Следующий() Цикл
				Если НЕ ор_ИнтеграцияМДЛПКлиентСервер.ЭтоGTIN(ВыборкаПоGTIN.GTIN) Тогда
					Продолжить;
				КонецЕсли;
				СтруктураGTIN = Новый Структура("GTIN,Номенклатура,Характеристика");
				ЗаполнитьЗначенияСвойств(СтруктураGTIN, ВыборкаПоGTIN);
				GtinДляУдаления.Добавить(СтруктураGTIN);
				GtinТекИтерация.Добавить(ВыборкаПоGTIN.GTIN);
			КонецЦикла;
			
			Если GtinТекИтерация.Количество() = 1 Тогда
				ТекстПредупреждения = НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%""  уже существует запись с другим GTIN %GTIN%.'");
				ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%GTIN%", GtinТекИтерация[0]);
				ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%Товар%", ПредставлениеТовара);
			ИначеЕсли GtinТекИтерация.Количество() > 1 Тогда
				ТекстПредупреждения = НСтр("ru = 'В регистре ""Штрихкоды"" для ""%Товар%"" уже существуют записи с другими GTIN.'");
				ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%Товар%", ПредставлениеТовара);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если GtinДляУдаления.Количество() > 0 Тогда
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + НСтр("ru = 'Записи будут удалены. Продолжить?'");
		РезультатПроверки.Вставить("ТекстПредупреждения", ТекстПредупреждения);
		РезультатПроверки.Вставить("УдалитьСтарыеЗаписи", GtinДляУдаления);
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьGTINНаСервере(РезультатПроверки)
	
	ЕстьОшибки = Ложь;
	
	НачатьТранзакцию();
	
	Если РезультатПроверки.Свойство("УдалитьСтарыеЗаписи") Тогда
		GtinДляУдаления = РезультатПроверки.УдалитьСтарыеЗаписи;
		Для Каждого СтрокаGTIN Из GtinДляУдаления Цикл
			НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			НовыйШтрихкод.Штрихкод = СтрокаGTIN.GTIN;
			НовыйШтрихкод.Номенклатура = СтрокаGTIN.Номенклатура;
			НовыйШтрихкод.Характеристика = СтрокаGTIN.Характеристика;
			НовыйШтрихкод.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
			НовыйШтрихкод.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Попытка
				НовыйШтрихкод.Удалить();
			Исключение
				ОтменитьТранзакцию();
				ТекстСообщения = НСтр("ru= 'Не удалось удалить GTIN %GTIN% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", СтрокаGTIN.GTIN);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ЕстьОшибки = Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонеЦЕсли;
	
	Для Каждого Строка Из ТоварыРегистрацииGTIN Цикл
		НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		НовыйШтрихкод.Штрихкод = Строка.GTIN;
		НовыйШтрихкод.Номенклатура = Строка.Номенклатура;
		НовыйШтрихкод.Характеристика = ?(Строка.ДляХарактеристики, Строка.Характеристика, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		НовыйШтрихкод.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		НовыйШтрихкод.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Попытка
			НовыйШтрихкод.Записать(Истина);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru= 'Не удалось записать GTIN %GTIN% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%GTIN%", Строка.GTIN);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонеЦЕсли;
	
	ЗафиксироватьТранзакцию();
	
	ЗаполнитьТоварыДляРегистрацииGTIN();
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
