
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	// Установка пустых значений отбора по периоду
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Дата('00010101'));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата()));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаЗагрузкиОтборПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"НастройкаЗагрузки",
		ЭтотОбъект["НастройкаЗагрузки"],
		ЗначениеЗаполнено(ЭтотОбъект["НастройкаЗагрузки"]));
		
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОшибкиОтборПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"СтатусОшибки",
		ЭтотОбъект["СтатусОшибки"],
		ЗначениеЗаполнено(ЭтотОбъект["СтатусОшибки"]));
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Контрагент",
		ЭтотОбъект["Контрагент"],
		ЗначениеЗаполнено(ЭтотОбъект["Контрагент"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектОтбораПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Объект",
		ЭтотОбъект["ОбъектОтбора"],
		ЗначениеЗаполнено(ЭтотОбъект["ОбъектОтбора"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(ТекущаяДата())));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоФоновыеПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"ФоноваяЗагрузка",
		ЭтотОбъект["ОтображатьТолькоФоновые"],
		ЗначениеЗаполнено(ЭтотОбъект["ОтображатьТолькоФоновые"]));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПросмотрЗаписи(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если НЕ ТекСтрока = Неопределено Тогда
		
		ПараметрыОткрытия = Новый Структура("Ключ", ТекСтрока);
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("РегистрСведений.ор_ИсторияЗагрузки.ФормаЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,,,Режим);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СократитьЖурнал(Команда)
	
	Если Не ДоступноСокращениеЖурнала() Тогда
		ПоказатьПредупреждение(,"Не установлено дополнительное право на использование данной возможности.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ОповещениеСократитьЖурналЗавершение",ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("РегистрСведений.ор_ИсторияЗагрузки.Форма.СокращениеЖурнала",,ЭтотОбъект,,,,ОбработкаОповещения,Режим);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДоступноСокращениеЖурнала()
	
	Возврат Пользователи.РолиДоступны("ор_ПравоРазрешитьСокращениеИсторииЗагрузки", Пользователи.ТекущийПользователь());
	
КонецФункции

&НаКлиенте
Процедура ОповещениеСократитьЖурналЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
