#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Вид = Перечисления.эв_ВидыИсточниковЗаказа.Эвалар Тогда
		ОтправлятьСтатусы = Ложь;
	КонецЕсли;

	Если Не Активный Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Склад) Или Не ЗначениеЗаполнено(ВидЦен) Тогда
		ОбщегоНазначения.СообщитьПользователю("У активного источника должны быть заполнены склад и вид цен.", , , , Отказ);
	КонецЕсли;

	Если ВыгружатьОстатки Или ЗагружатьЗаказы Или ОтправлятьСтатусы Тогда
		Если ЗначениеЗаполнено(Ссылка) Тогда
			МенеджерЗаписи = РегистрыСведений.эв_НастройкиAPIИсточника.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИсточникЗаказов = Ссылка;
			МенеджерЗаписи.Прочитать();
			Если Не МенеджерЗаписи.Выбран() Тогда
				ОбщегоНазначения.СообщитьПользователю("Для включённого контура обмена нужна запись настроек API источника.", , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти