&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("НомерКарты") Тогда
        НомерКарты = Параметры.НомерКарты;
    КонецЕсли;  

    Если Параметры.Свойство("МинимальнаяСумма") Тогда
        МинимальнаяСумма = Параметры.МинимальнаяСумма;
        Элементы.СуммаСписания.МинимальноеЗначение = МинимальнаяСумма;
    КонецЕсли;   
    
    Если Параметры.Свойство("МаксимальнаяСуммаСкидки") Тогда
        МаксимальнаяСуммаСкидки = Параметры.МаксимальнаяСуммаСкидки;
    КонецЕсли;  

    Если Параметры.Свойство("МаксимальнаяСумма") Тогда
        МаксимальнаяСумма = Параметры.МаксимальнаяСумма;
        Элементы.СуммаСписания.МаксимальноеЗначение = Мин(МаксимальнаяСумма, МаксимальнаяСуммаСкидки);
        СуммаСписания = Мин(МаксимальнаяСумма, МаксимальнаяСуммаСкидки);
    КонецЕсли;  
    
    ОтменаСписания = Ложь;
    
    Попытка
        АдресЛого = ПоместитьВоВременноеХранилище(
            БиблиотекаКартинок.РМКЛоготипСберСпасибо.ПолучитьДвоичныеДанные(),
            УникальныйИдентификатор);
    Исключение
        АдресЛого = "";
    КонецПопытки;
    
КонецПроцедуры

&НаКлиенте
Процедура СписатьБонусы(Команда)
    
    Закрыть(РезультатЗакрытияФормы(Ложь));
    
КонецПроцедуры

&НаКлиенте
Процедура ОтменаОплатыБонусами(Команда)
    
    Закрыть(РезультатЗакрытияФормы(Истина));
    
КонецПроцедуры

&НаКлиенте
Функция РезультатЗакрытияФормы(ОтменитьСписание)
    
    Результат = Новый Структура;
    
    Если ОтменитьСписание Тогда
        Результат.Вставить("СуммаСписания", 0);
        Результат.Вставить("ОтменаСписания", Истина);
    Иначе
        Результат.Вставить("СуммаСписания", Мин(СуммаСписания, МаксимальнаяСумма));
        Результат.Вставить("ОтменаСписания", Ложь);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции