
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные.ЭтоГруппа Тогда
		НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
		НоваяСтрока.Номенклатура = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = ВыбраннаяНоменклатура.Индекс(Элементы.ВыбраннаяНоменклатура.ТекущиеДанные);
	ВыбраннаяНоменклатура.Удалить(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(ВыбраннаяНоменклатура);
КонецПроцедуры

#КонецОбласти

