
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если Параметры.Свойство("Выражение") Тогда
		Выражение = Параметры.Выражение;
	КонецЕсли;
	
	Если Параметры.Свойство("Представление") Тогда
		 Представление = Параметры.Представление;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ОК"
//
&НаКлиенте
Процедура ОК(Команда)
	
	Если ПустаяСтрока(Представление) Тогда
		ПоказатьПредупреждение(, "Поле ""Представление"" не заполнено!");
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура("Представление, Выражение", Представление, Выражение);
	Закрыть(Результат);
	
КонецПроцедуры

// Процедура - обработчик команды "ШтрихКодНоменклатуры"
//
&НаКлиенте
Процедура ШтрихКодНоменклатуры(Команда)
	УстановитьТекстШаблона("ШтрихКодНоменклатуры");
КонецПроцедуры

// Процедура - обработчик команды "ШаблонСтрока"
//
&НаКлиенте
Процедура ШаблонСтрока(Команда)
	УстановитьТекстШаблона("Строка");
КонецПроцедуры

// Процедура - обработчик команды "ШаблонЧисло"
//
&НаКлиенте
Процедура ШаблонЧисло(Команда)
	УстановитьТекстШаблона("Число");
КонецПроцедуры

// Процедура - обработчик команды "ШаблонДата"
//
&НаКлиенте
Процедура ШаблонДата(Команда)
	УстановитьТекстШаблона("Дата");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура установки текста шаблона на форму
//
&НаКлиенте
Процедура УстановитьТекстШаблона(Шаблон)
	
	НовоеПредставление = "";
	Текст = "";
	Если Шаблон = "ШтрихКодНоменклатуры" Тогда
		Текст = 
		"// Штрихкод номенклатуры (для документов)
		|// Данный фрагмент построен при помощи предопределенного шаблона.
		|// При повторном использовании шаблона, внесенные вручную изменения будут утеряны!!!
		|Результат = """";
		|
		|НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		|НаборЗаписей.Отбор.Владелец.Установить(ТекущиеДанные.Номенклатура);
		|НаборЗаписей.Прочитать();
		|Если НаборЗаписей.Количество()>0 Тогда
		|	Результат = НаборЗаписей[0].Штрихкод;
		|КонецЕсли;";
		НовоеПредставление = "Штрихкод";
	ИначеЕсли Шаблон = "Строка" Тогда
		Строка = "";
		ПоказатьВводСтроки(Новый ОписаниеОповещения("УстановитьТекстШаблонаСтрокаЗавершение", ЭтотОбъект, Новый Структура("Шаблон, Строка", Шаблон, Строка)), Строка, "Строка");
		Возврат;
		
	ИначеЕсли Шаблон = "Число" Тогда
		Число = "";
		ПоказатьВводЧисла(Новый ОписаниеОповещения("УстановитьТекстШаблонаЧислоЗавершение", ЭтотОбъект, Новый Структура("Шаблон, Число", Шаблон, Число)), Число, "Число");
		Возврат;
		
	ИначеЕсли Шаблон = "Дата" Тогда
		Дата = "";
		ПоказатьВводДаты(Новый ОписаниеОповещения("УстановитьТекстШаблонаДатаЗавершение", ЭтотОбъект, Новый Структура("Дата", Дата)), Дата, "Дата", ЧастиДаты.Дата);
		Возврат;
	КонецЕсли;
	
	ПроверкаТекстаНаНаличиеЗначащихСимволов(НовоеПредставление, Текст);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстШаблонаСтрокаЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРезультат = ?(Строка = "", ДополнительныеПараметры.Строка, Строка);
	
	Текст = "Результат = """+СтрЗаменить(СтрокаРезультат,"""","""""")+""";";
	НовоеПредставление = "Строка ("+СтрокаРезультат+")";
	
	
	ПроверкаТекстаНаНаличиеЗначащихСимволов(НовоеПредставление, Текст);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстШаблонаЧислоЗавершение(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоРезультат = ?(Число = Неопределено, ДополнительныеПараметры.Число, Число);
	
	Текст = "Результат = "+Формат(ЧислоРезультат,"ЧРД=.; ЧН=; ЧГ=0")+";";
	НовоеПредставление = "Число ("+ЧислоРезультат+")";
	
	ПроверкаТекстаНаНаличиеЗначащихСимволов(НовоеПредставление, Текст);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстШаблонаДатаЗавершение(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДатаРезультат = ?(Дата = Неопределено, ДополнительныеПараметры.Дата, Дата);
	
	Текст = "Результат = '"+Формат(ДатаРезультат,"ДФ=yyyyMMdd; ДП=00000000")+"';";
	НовоеПредставление = "Дата ("+Формат(ДатаРезультат,"ДФ=dd.MM.yyyy")+")";
	
	
	ПроверкаТекстаНаНаличиеЗначащихСимволов(НовоеПредставление, Текст);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТекстаНаНаличиеЗначащихСимволов(НовоеПредставление,Текст)
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Текущее выражение будет заменено.%1Продолжить?'"), Символы.ПС);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаТекстаНаНаличиеЗначащихСимволовВопросЗавершение", ЭтотОбъект, Новый Структура("НовоеПредставление, Текст", НовоеПредставление, Текст)), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТекстаНаНаличиеЗначащихСимволовВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Представление = ДополнительныеПараметры.НовоеПредставление;
	Выражение = ДополнительныеПараметры.Текст;

КонецПроцедуры // УстановитьТекстШаблона()

#КонецОбласти
