
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПрайсЛистДляМониторингаЦенПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЕстьТоварыПоПрайсу = ОпределитьНаличиеТоваровВПрайсе();
		Если ЕстьТоварыПоПрайсу Тогда
			ТекстСообщения = НСтр("ru = 'Текущий прайс-лист не пустой! Нельзя изменять его вид!");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Объект.ПрайсЛистДляМониторингаЦен = Не Объект.ПрайсЛистДляМониторингаЦен;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОпределитьНаличиеТоваровВПрайсе()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрайсЛистыПоставщиков.ПрайсЛист
	|ИЗ
	|	РегистрСведений.ор_ПрайсЛистыПоставщиков КАК ПрайсЛистыПоставщиков
	|ГДЕ
	|	ПрайсЛистыПоставщиков.ПрайсЛист = &ПрайсЛист";
	Запрос.УстановитьПараметр("ПрайсЛист", Объект.Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
