#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрДокумент = Новый ПараметрКомпоновкиДанных("Документ");
	ПараметрПоказыватьТолькоРасхождения = Новый ПараметрКомпоновкиДанных("ПоказыватьТолькоРасхождения");
	
	Для Каждого Элемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		ЕстьПараметр = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "Параметр");
		Если НЕ ЕстьПараметр Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элемент.Параметр = ПараметрДокумент Тогда 
			Элемент.Значение = Документ;
		КонецЕсли;
		Если Элемент.Параметр = ПараметрПоказыватьТолькоРасхождения Тогда 
			Элемент.Значение = ПоказыватьТолькоРасхождения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли