
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьИнкрементальныйОбмен() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьПолнуюВыгрузкуОстатков() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьОбработкуОчередиСтатусов() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура СнятьПросроченныеРезервы() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьЗапросHTTP(ПараметрыЗапроса) Экспорт

	Возврат Неопределено;

КонецФункции

Процедура ОчиститьЛогиHTTP(СтаршеДней = 0) Экспорт

КонецПроцедуры

#КонецОбласти