
#Область ПрограммныйИнтерфейс

// Позволяет переопределить запись результатов проверки КМ.
// (см. процедуру СобытияФормРазрешительныйРежимМДЛП.ЗаписатьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. СобытияФормРазрешительныйРежимМДЛП.ПараметрыЗаписиРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура ЗаписатьРезультатыПроверкиКМ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить получение записанных результатов проверки КМ.
// (см. процедуру СобытияФормРазрешительныйРежимМДЛП.ПолучитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. СобытияФормРазрешительныйРежимМДЛП.ПараметрыПолученияРезультатовПроверкиКМ.
//  СтандартныйРезультат - ТаблицаЗначений - таблица результата проверки КМ.
//
Процедура ПолучитьРезультатыПроверкиКМ(Параметры, СтандартныйРезультат) Экспорт
	
	
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру СобытияФормРазрешительныйРежимМДЛП.ПриЧтенииНаСервере).
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру СобытияФормРазрешительныйРежимМДЛП.ПриЗаписиНаСервере).
//
Процедура ПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру СобытияФормРазрешительныйРежимМДЛП.ПослеЗаписиНаСервере).
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти // ПрограммныйИнтерфейс
