
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Список.Параметры.УстановитьЗначениеПараметра("АктуальнаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Отбор.Свойство("Договор")
		И Параметры.Свойство("ДоговорКомиссии") И ЗначениеЗаполнено(Параметры.ДоговорКомиссии) Тогда
		Параметры.Отбор.Договор = Параметры.ДоговорКомиссии;
	КонецЕсли;
	
	Если Параметры.Свойство("СчетЗатрат") Тогда
		
		//@skip-check unknown-form-parameter-access
		Если ЗначениеЗаполнено(Параметры.СчетЗатрат) Тогда
			
			Если Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
				И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
				И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
				И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
				
				ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru = 'Для данного типа счета заказ покупателя не указывается.'"), , , , Отказ);
				
			КонецЕсли;
			
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбран счет.'"), , , , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборПоВидуОперации();
	СохранитьГлобальныеНастройки(Параметры);
	ОбновитьИнтерфейсПоЗаявкам();
	ИзменитьЗапросПоПравам();
	УстановитьПараметрыСписка();
	
	Если Параметры.Свойство("ор_ПараметрыОткрытияФормыВыбораЗаказа") Тогда
		ЭтотОбъект.ор_ПараметрыОткрытияФормыВыбораЗаказа = Параметры.ор_ПараметрыОткрытияФормыВыбораЗаказа;
		Элементы.СозданиеЗаказаПоЧеку.Видимость = Истина;
	КонецЕсли;

	Если Параметры.Свойство("ВозможнаПечатьЗаказаИзРМК") Тогда
		Элементы.ФормаПечатьЗаказаИзРМК.Видимость = Истина;
	КонецЕсли;
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеОтмененногоЗаказа(
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление);
	
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ФормаДокументПриходнаяНакладнаяСоздатьНаОсновании", 
		"Заголовок",
		НСтр("ru = 'Возврат от покупателя'"));
		
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Элементы.ГруппаГлобальныеКомандыЗаказПокупателя.Видимость = Ложь;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ЭтоЗаказНаряд И ИмяСобытия = "Запись_СостоянияЗаказНарядов")
		Или (Не ЭтоЗаказНаряд И ИмяСобытия = "Запись_СостоянияЗаказовПокупателей") Тогда
		
		УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьЗаказаИзРМК(Команда)
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("ДокументЗаказ", Элементы.Список.ТекущиеДанные.Ссылка);
	СтруктураВыбора.Вставить("ПечатьЗаказа", Истина);
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнтерфейса

&НаСервере
Процедура ОбновитьИнтерфейсПоЗаявкам()
	
	Элементы.Контрагент.Видимость = Не ИспользоватьЗаявки;
	Элементы.ГруппаКонтрагентИлиЛид.Видимость = ИспользоватьЗаявки;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗапросПоПравам()
	
	ЛидыДоступны = РаботаСЛидами.ЛидыДоступны();
	Если ЛидыДоступны Тогда
		
		Список.ТекстЗапроса = СтрЗаменить(
		Список.ТекстЗапроса,
		"-1 КАК ИндексИконкиКонтрагентаИлиЛида",
		"ВЫБОР
		|КОГДА ДокументЗаказПокупателя.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		И ДокументЗаказПокупателя.Лид = ЗНАЧЕНИЕ(Справочник.Лиды.ПустаяСсылка)
		|	ТОГДА -1
		|КОГДА ДокументЗаказПокупателя.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) Или Не &ЛидыДоступны
		|	ТОГДА ВЫБОР
		|			КОГДА ДокументЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
		|					ИЛИ ДокументЗаказПокупателя.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
		|				ТОГДА ВЫБОР
		|						КОГДА ДокументЗаказПокупателя.Контрагент.ПометкаУдаления
		|							ТОГДА 3
		|						ИНАЧЕ 1
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ДокументЗаказПокупателя.Контрагент.ПометкаУдаления
		|						ТОГДА 2
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ
		|ИНАЧЕ ВЫБОР
		|		КОГДА ДокументЗаказПокупателя.Лид.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|			ТОГДА ВЫБОР
		|					КОГДА ДокументЗаказПокупателя.Лид.ПометкаУдаления
		|						ТОГДА 7
		|					ИНАЧЕ 5
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументЗаказПокупателя.Лид.ПометкаУдаления
		|					ТОГДА 6
		|				ИНАЧЕ 4
		|			КОНЕЦ
		|	КОНЕЦ
		|КОНЕЦ КАК ИндексИконкиКонтрагентаИлиЛида");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ЛидыДоступны", ЛидыДоступны);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьОтборПоВидуОперации()
	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("ВыбиратьЗаказНаряд") И Параметры.ВыбиратьЗаказНаряд Тогда
		
		Параметры.Отбор.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заказ-наряды'");
		ЭтоЗаказНаряд = Истина;
		
	КонецЕсли;
	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("ВыбиратьЗаказПокупателя") И Параметры.ВыбиратьЗаказПокупателя Тогда
		
		Параметры.Отбор.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заказы покупателей'");
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВидыОпераций") Тогда
		
		//@skip-check unknown-form-parameter-access
		Если Параметры.ВидыОпераций[0] = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Заказ-наряды'");
			ЭтоЗаказНаряд = Истина;
			
		КонецЕсли;
		
		Если Не Параметры.Свойство("ОтображатьЗаявки") Тогда
			
			//@skip-check unknown-form-parameter-access
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			Параметры.ВидыОпераций, Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу);
			//@skip-check unknown-form-parameter-access
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			Параметры.ВидыОпераций, Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд);
			
		КонецЕсли;
		
		//@skip-check unknown-form-parameter-access
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ВидОперации", Параметры.ВидыОпераций, ВидСравненияКомпоновкиДанных.ВСписке);
		
	ИначеЕсли Не Параметры.Свойство("ОтображатьЗаявки") Тогда
		
		НеиспользуемыеВидыОпераций = Новый Массив;
		НеиспользуемыеВидыОпераций.Добавить(Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу);
		НеиспользуемыеВидыОпераций.Добавить(Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ВидОперации", НеиспользуемыеВидыОпераций, ВидСравненияКомпоновкиДанных.НеВСписке);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки(Параметры)
	
	ИспользоватьЗаявки = Параметры.Свойство("ОтображатьЗаявки") И РаботаСЗаявками.ЗаявкиИспользуются();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
	Список.КомпоновщикНастроек.Настройки.УсловноеОформление,
	Метаданные.Справочники.СостоянияЗаказовПокупателей.ПолноеИмя(),
	Элементы.СостояниеЗаказа.Имя,
	Элементы.СостояниеЗаказа.Имя);
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
	Список.КомпоновщикНастроек.Настройки.УсловноеОформление,
	Метаданные.Справочники.СостоянияЗаказНарядов.ПолноеИмя(),
	Элементы.СостояниеЗаказа.Имя,
	Элементы.СостояниеЗаказа.Имя,
	Ложь);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГлобальныеКомандыТакси.Видимость = Ложь;
	Элементы.Переместить(Элементы.КоманднаяПанель, КоманднаяПанель);
	
КонецПроцедуры

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

#Область СозданиеЗаказаНаОснованииЧекаККМ

&НаКлиенте
Процедура Подключаемый_СозданиеЗаказаПоЧеку(Команда)
	
	// ЭтотОбъект.ор_ПараметрыОткрытияФормыВыбораЗаказа - параметры открытия формы выбора чека полученные из ФормыРМК.
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЧекаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВыбораЧека",
		ЭтотОбъект.ор_ПараметрыОткрытияФормыВыбораЗаказа, ЭтотОбъект, , , , ОписаниеОповещения);
	
	КонецПроцедуры

&НаКлиенте
Процедура ВыборЧекаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйЧекККМ = РезультатЗакрытия.ЧекККМ;
	СтруктураЗаказаВЧекеККМ = ПолучитьСтруктуруЗаказовЧекаККМНаСервере(ВыбранныйЧекККМ);
	
	Если СтруктураЗаказаВЧекеККМ.ЕстьЗаказы Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'Для выбранного чека уже создан заказ.'");
		Сообщение.Сообщить();
		Возврат;
	Иначе
		
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("СсылкаЧекККМ", ВыбранныйЧекККМ);
		// Параметр СсылкаДокументаЗаказа необходим для получения ссылки созданного заказа и записи этой ссылки в чек ККМ.
		ДополнительныеПараметрыОповещения.Вставить("СсылкаДокументаЗаказа", Неопределено);
		ОписаниеОповещения = Новый ОписаниеОповещения ("ОбработатьСозданиеЗаказаНаОснованииЧека", ЭтотОбъект, ДополнительныеПараметрыОповещения);
		
		Адрес = ПолучитьАдресНовогоДокумента(ЭтотОбъект.УникальныйИдентификатор, ВыбранныйЧекККМ);
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("АдресХранилища", Адрес);
		
		ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЗаказовЧекаККМНаСервере(ЧекККМ)
	
	СтруктураЗаказаВЧекеККМ = Новый Структура();
	СтруктураЗаказаВЧекеККМ.Вставить("ЕстьЗаказы", ЧекККМ.ЕстьЗаказы);
	СтруктураЗаказаВЧекеККМ.Вставить("Заказ", ЧекККМ.Заказ);
	
	Возврат СтруктураЗаказаВЧекеККМ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАдресНовогоДокумента(ИдентификаторФормы, СсылкаЧекККМ)
	
	ДокументОбъектЗаказа = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	ЗаполнитьДокументЗаказаНаОснованииЧекаККМ(ДокументОбъектЗаказа, СсылкаЧекККМ);
	
	СтруктураОбъекта = Новый Структура ("ДокументОбъектЗаказа", ДокументОбъектЗаказа);
	АдресХранилища  = ПоместитьВоВременноеХранилище(СтруктураОбъекта, ИдентификаторФормы);
	Возврат АдресХранилища;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьДокументЗаказаНаОснованииЧекаККМ(ДокументОбъектЗаказа, СсылкаЧекККМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМ.Дата КАК Дата,
	|	ЧекККМ.Автор КАК Автор,
	|	ЧекККМ.АдресЭП КАК АдресЭП,
	|	ЧекККМ.ВалютаДокумента КАК ВалютаДокумента,
	|	ЧекККМ.ВидСкидкиНаценки КАК ВидСкидкиНаценки,
	|	ЧекККМ.ВидЦен КАК ВидЦен,
	|	ЧекККМ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ЧекККМ.КонтактноеЛицоПодписант КАК КонтактноеЛицоПодписант,
	|	ЧекККМ.Контрагент КАК Контрагент,
	|	ЧекККМ.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЧекККМ.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ЧекККМ.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ЧекККМ.Организация КАК Организация,
	|	ЧекККМ.Ответственный КАК Ответственный,
	|	ЧекККМ.ПодписьКассира КАК ПодписьКассира,
	|	ЧекККМ.ПроцентСкидкиПоДисконтнойКарте КАК ПроцентСкидкиПоДисконтнойКарте,
	|	ЧекККМ.СкидкиРассчитаны КАК СкидкиРассчитаны,
	|	ЧекККМ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекККМ.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	ЧекККМ.Телефон КАК Телефон,
	|	ЧекККМ.СпециальныйНалоговыйРежим КАК СпециальныйНалоговыйРежим,
	|	ЧекККМ.ОперацияСДенежнымиСредствами КАК ОперацияСДенежнымиСредствами,
	|	ЧекККМ.Договор КАК Договор,
	|	ЧекККМ.СпособЗачетаПредоплаты КАК СпособЗачетаПредоплаты,
	|	ЧекККМ.Кратность КАК Кратность,
	|	ЧекККМ.Курс КАК Курс,
	|	ЧекККМ.Ячейка КАК Ячейка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|	ЧекККМЗапасы.Характеристика КАК Характеристика,
	|	ЧекККМЗапасы.Партия КАК Партия,
	|	ЧекККМЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ЧекККМЗапасы.Количество КАК Количество,
	|	ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекККМЗапасы.Цена КАК Цена,
	|	ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЧекККМЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
	|	ЧекККМЗапасы.Сумма КАК Сумма,
	|	ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЧекККМЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЧекККМЗапасы.Всего КАК Всего,
	|	ЧекККМЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЧекККМЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ЧекККМЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЧекККМЗапасы.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
	|	ЧекККМЗапасы.Заказ КАК Заказ,
	|	ЧекККМЗапасы.Резерв КАК Резерв,
	|	ЧекККМЗапасы.НоменклатураНабора КАК НоменклатураНабора,
	|	ЧекККМЗапасы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЧекККМЗапасы.ДоляСтоимости КАК ДоляСтоимости,
	|	ЧекККМЗапасы.НоменклатураЕГАИС КАК НоменклатураЕГАИС,
	|	ЧекККМЗапасы.Штрихкод КАК Штрихкод,
	|	ЧекККМЗапасы.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	ЧекККМЗапасы.НеобходимостьВводаКодаМаркировки КАК НеобходимостьВводаКодаМаркировки,
	|	ЧекККМЗапасы.КодМаркировки КАК КодМаркировки,
	|	ЧекККМЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекККМЗапасы.Ячейка КАК Ячейка,
	|	ЧекККМЗапасы.КлючСвязиУслугаАгента КАК КлючСвязиУслугаАгента,
	|	ЧекККМЗапасы.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ЧекККМЗапасы.МРЦ КАК МРЦ,
	|	ЧекККМЗапасы.ПродажаПодарка КАК ПродажаПодарка,
	|	ЧекККМЗапасы.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|ГДЕ
	|	ЧекККМЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМПредоплата.Документ КАК Документ,
	|	ЧекККМПредоплата.Заказ КАК Заказ,
	|	ЧекККМПредоплата.СуммаРасчетов КАК СуммаРасчетов,
	|	ЧекККМПредоплата.Курс КАК Курс,
	|	ЧекККМПредоплата.Кратность КАК Кратность,
	|	ЧекККМПредоплата.СуммаПлатежа КАК СуммаПлатежа
	|ИЗ
	|	Документ.ЧекККМ.Предоплата КАК ЧекККМПредоплата
	|ГДЕ
	|	ЧекККМПредоплата.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМСкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	ЧекККМСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	ЧекККМСкидкиНаценки.Сумма КАК Сумма,
	|	ЧекККМСкидкиНаценки.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки
	|ИЗ
	|	Документ.ЧекККМ.СкидкиНаценки КАК ЧекККМСкидкиНаценки
	|ГДЕ
	|	ЧекККМСкидкиНаценки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМСерииНоменклатуры.Серия КАК Серия,
	|	ЧекККМСерииНоменклатуры.КлючСвязи КАК КлючСвязи,
	|	ЧекККМСерииНоменклатуры.Количество КАК Количество
	|ИЗ
	|	Документ.ЧекККМ.СерииНоменклатуры КАК ЧекККМСерииНоменклатуры
	|ГДЕ
	|	ЧекККМСерииНоменклатуры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМДобавленныеНаборы.НоменклатураНабора КАК НоменклатураНабора,
	|	ЧекККМДобавленныеНаборы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЧекККМДобавленныеНаборы.Количество КАК Количество
	|ИЗ
	|	Документ.ЧекККМ.ДобавленныеНаборы КАК ЧекККМДобавленныеНаборы
	|ГДЕ
	|	ЧекККМДобавленныеНаборы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМБонусныеБаллыКНачислению.КлючСвязи КАК КлючСвязи,
	|	ЧекККМБонусныеБаллыКНачислению.СкидкаНаценка КАК СкидкаНаценка,
	|	ЧекККМБонусныеБаллыКНачислению.ДатаНачисления КАК ДатаНачисления,
	|	ЧекККМБонусныеБаллыКНачислению.ДатаСписания КАК ДатаСписания,
	|	ЧекККМБонусныеБаллыКНачислению.КоличествоБонусныхБаллов КАК КоличествоБонусныхБаллов
	|ИЗ
	|	Документ.ЧекККМ.БонусныеБаллыКНачислению КАК ЧекККМБонусныеБаллыКНачислению
	|ГДЕ
	|	ЧекККМБонусныеБаллыКНачислению.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМПодарки.СкидкаНаценка КАК СкидкаНаценка,
	|	ЧекККМПодарки.Номенклатура КАК Номенклатура,
	|	ЧекККМПодарки.Характеристика КАК Характеристика,
	|	ЧекККМПодарки.Количество КАК Количество,
	|	ЧекККМПодарки.Цена КАК Цена,
	|	ЧекККМПодарки.Сумма КАК Сумма,
	|	ЧекККМПодарки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекККМПодарки.Ячейка КАК Ячейка,
	|	ЧекККМПодарки.КлючСвязи КАК КлючСвязи,
	|	ЧекККМПодарки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекККМПодарки.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ЧекККМПодарки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ЧекККМПодарки.Справка2 КАК Справка2,
	|	ЧекККМПодарки.СерииНоменклатуры КАК СерииНоменклатуры
	|ИЗ
	|	Документ.ЧекККМ.Подарки КАК ЧекККМПодарки
	|ГДЕ
	|	ЧекККМПодарки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМСерииПодарков.Серия КАК Серия,
	|	ЧекККМСерииПодарков.Количество КАК Количество,
	|	ЧекККМСерииПодарков.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	Документ.ЧекККМ.СерииПодарков КАК ЧекККМСерииПодарков
	|ГДЕ
	|	ЧекККМСерииПодарков.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаЧекККМ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаРеквизитыЧекаККМ = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаРеквизитыЧекаККМ.Следующий() Цикл
		
		
		ЗаполнитьЗначенияСвойств(ДокументОбъектЗаказа, ВыборкаРеквизитыЧекаККМ);
		ДокументОбъектЗаказа.ВидОперации 					= Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
		ДокументОбъектЗаказа.ВидЗаказа 						= Справочники.ВидыЗаказовПокупателей.Основной;
		ДокументОбъектЗаказа.Дата 							= ВыборкаРеквизитыЧекаККМ.Дата - 1;
		
		Если ВыборкаРеквизитыЧекаККМ.ОперацияСДенежнымиСредствами Тогда
			ДокументОбъектЗаказа.СтруктурнаяЕдиницаРезерв = ВыборкаРеквизитыЧекаККМ.СтруктурнаяЕдиница;
		Иначе
			ДокументОбъектЗаказа.СтруктурнаяЕдиницаПродажи = ВыборкаРеквизитыЧекаККМ.СтруктурнаяЕдиница;
			ДокументОбъектЗаказа.ДатаОтгрузки = ВыборкаРеквизитыЧекаККМ.Дата
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение табличныч частей созданного заказа.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[1].Выгрузить(),
													ДокументОбъектЗаказа.Запасы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[2].Выгрузить(),
													ДокументОбъектЗаказа.Предоплата);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[3].Выгрузить(),
													ДокументОбъектЗаказа.СкидкиНаценки);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[4].Выгрузить(),
													ДокументОбъектЗаказа.СерииНоменклатуры);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[5].Выгрузить(),
													ДокументОбъектЗаказа.ДобавленныеНаборы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[6].Выгрузить(),
													ДокументОбъектЗаказа.БонусныеБаллыКНачислению);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[7].Выгрузить(),
													ДокументОбъектЗаказа.Подарки);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса[8].Выгрузить(),
													ДокументОбъектЗаказа.СерииПодарков);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеЗаказаНаОснованииЧека(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.СсылкаДокументаЗаказа.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСозданиеЗаказаНаОснованииЧекаНаСервере(ДополнительныеПараметры.СсылкаЧекККМ,
														ДополнительныеПараметры.СсылкаДокументаЗаказа);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьСозданиеЗаказаНаОснованииЧекаНаСервере(СсылкаЧекККМ, СсылкаЗаказ)
	
	ЧекККМОбъект = СсылкаЧекККМ.ПолучитьОбъект();
	ЧекККМОбъект.ЕстьЗаказы = Истина;
	ЧекККМОбъект.Заказ = СсылкаЗаказ;
	ЧекККМОбъект.Контрагент = СсылкаЗаказ.Контрагент;
	
	Попытка
		ЧекККМОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'Не удалось провести выбранный чек после создания заказа.'");
		Сообщение.Сообщить();
	КонецПопытки
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
