
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Добавлять новые записи разрешено только через загрузку из файла'"),,,,
		Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьВсе(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ВопросУдалитьВсеЗавершение", ЭтотОбъект),
		НСтр("ru = 'Удалить все записи?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ВопросУдалитьЗавершение", ЭтотОбъект),
		НСтр("ru = 'Удалить строки с номенклатурой, выпуск которой не предусмотрен действующими документами?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеДанных(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимСопоставления", Истина);
	
	ОткрытьФорму(
		"РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.Форма.ФормаСопоставленияДанных",
		ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимЗагрузки", 3);
	ПараметрыФормы.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", Истина);
	ПараметрыФормы.Вставить("ИмяВидаРегистра", "ор_РеестрЦенПроизводителейНаЖНВЛП");
	
	ОткрытьФорму(
		"Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПомощник",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ЗагрузитьИзФайлаОткрытьФормуЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьС1СНоменклатура(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимЗагрузкиС1СНоменклатура", Истина);
	
	ОткрытьФорму(
		"РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.Форма.ФормаЗагрузкиЦенС1СНоменклатура",
		ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросУдалитьВсеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВсеНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеНаСервере()
	
	Набор = РегистрыСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РеестрЦенНаЖНВЛП.ШтрихКод,
	|	РеестрЦенНаЖНВЛП.Наименование,
	|	РеестрЦенНаЖНВЛП.НаименованиеПроизводителя,
	|	РеестрЦенНаЖНВЛП.ФормаВыпускаКраткое,
	|	РеестрЦенНаЖНВЛП.ИдРЛС,
	|	РеестрЦенНаЖНВЛП.ДатаРегистрацииЦены
	|ИЗ
	|	РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП КАК РеестрЦенНаЖНВЛП
	|ГДЕ
	|	(НЕ РеестрЦенНаЖНВЛП.Действует)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.СоздатьНаборЗаписей();
		
		Набор.Отбор.ШтрихКод.Установить(Выборка.ШтрихКод);
		Набор.Отбор.Наименование.Установить(Выборка.Наименование);
		Набор.Отбор.НаименованиеПроизводителя.Установить(Выборка.НаименованиеПроизводителя);
		Набор.Отбор.ФормаВыпускаКраткое.Установить(Выборка.ФормаВыпускаКраткое);
		Набор.Отбор.ИдРЛС.Установить(Выборка.ИдРЛС);
		Набор.Отбор.ДатаРегистрацииЦены.Установить(Выборка.ДатаРегистрацииЦены);
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
