
#Область ПрограммныйИнтерфейс

// Выполняет программное изменение структуры формы
// (создание и изменение реквизитов, команд, элементов, условного оформления), 
// связанное с изменениями в общих отраслевых блоках. 
//
// Параметры:
//   ИмяПроцедуры - Строка - Имя процедуры, которая будет выполнять изменение структуры для конкретной формы.
// 				    Должно подчиняться шаблону именования [Сокращенное наименование типа объекта][Имя объекта][Имя Формы] 
//   Форма 	  	  - Форма клиентского приложения, структура которой изменяется 
//   СписокОшибок - Строка - Список ошибок при изменении формы
//
Процедура ОбработатьПрограммноеСозданиеЭлементовФормы(ИмяПроцедуры, Форма, СписокОшибок) Экспорт
	
	СписокПроцедурПрограммногоСоздания 	= ор_ПрограммноеСозданиеЭлементовФормПовтИсп.СписокПроцедурОБ();
	ПроцедураЕсть 						= СписокПроцедурПрограммногоСоздания.Получить(ИмяПроцедуры);
	
	Если ПроцедураЕсть <> Неопределено  Тогда
		Выполнить("" + ИмяПроцедуры + "(Форма, СписокОшибок);");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает соответствия используемых процедур.
//
// Возвращаемое значение:
//  СоответствияИспользуемыхПроцедурОБ - Соответствие - Наименования используемых процедур.
//
Функция СформироватьСоответствияИспользуемыхПроцедур() Экспорт
	
	СоответствияИспользуемыхПроцедурОБ = Новый Соответствие();
	
	#Область ПланыОбмена
	#КонецОбласти
	
	#Область ОбщиеФормы
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОФБлокировкаРаботыСВнешнимиРесурсами",
		"ОбщаяФорма.БлокировкаРаботыСВнешнимиРесурсами");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОФНастройкиРабочегоМестаКассира",
		"ОбщаяФорма.НастройкиРабочегоМестаКассира");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОФФормаВыбораДанныхПоискаПоШтрихкоду",
		"ОбщаяФорма.ФормаВыбораДанныхПоискаПоШтрихкоду");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОФОФУдалить_ПодаркиНаВыбор", 
		"ОбщаяФорма.Удалить_ПодаркиНаВыбор");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОФМенюФункцийНСИ",
		"ОбщаяФорма.МенюФункцийНСИ");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОФРМКФормаВыдачиПодарка",
		"ОбщаяФорма.РМКФормаВыдачиПодарка");
	#КонецОбласти
	
	#Область Справочники
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрАвтоматическиеСкидкиФормаЭлемента",
		"Справочник.АвтоматическиеСкидки.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрУсловияПредоставленияСкидокНаценокФормаЭлемента",
		"Справочник.УсловияПредоставленияСкидокНаценок.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрКатегорииНоменклатурыФормаЭлемента",
		"Справочник.КатегорииНоменклатуры.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрКатегорииНоменклатурыФормаСписка",
		"Справочник.КатегорииНоменклатуры.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрНоменклатураФормаЭлемента",
		"Справочник.Номенклатура.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрНоменклатураФормаСписка",
		"Справочник.Номенклатура.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрШаблоныНаименованийФормаЭлемента",
		"Справочник.ШаблоныНаименований.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрШаблоныНаименованийФормаСписка",
		"Справочник.ШаблоныНаименований.Форма.ФормаСписка");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрХранилищеШаблоновРМКФормаЭлемента",
		"Справочник.ХранилищеШаблоновРМК.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрХарактеристикиНоменклатурыФормаЭлемента",
		"Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрХарактеристикиНоменклатурыФормаВыбора",
		"Справочник.ХарактеристикиНоменклатуры.Форма.ФормаВыбора");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"СпрХарактеристикиНоменклатурыФормаСписка",
		"Справочник.ХарактеристикиНоменклатуры.Форма.ФормаСписка");
	#КонецОбласти
	
	#Область Документы
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокАктВыполненныхРаботФормаДокумента",
		"Документ.АктВыполненныхРабот.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокЗаказПокупателяФормаДокумента",
		"Документ.ЗаказПокупателя.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокЗаказПокупателяФормаВыбора",
		"Документ.ЗаказПокупателя.Форма.ФормаВыбора");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокЗаказПоставщикуФормаДокумента",
		"Документ.ЗаказПоставщику.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокЗаказНаПеремещениеФормаДокумента",
		"Документ.ЗаказНаПеремещение.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокОприходованиеЗапасовФормаДокумента",
		"Документ.ОприходованиеЗапасов.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокПриходнаяНакладнаяФормаДокумента",
		"Документ.ПриходнаяНакладная.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокРасходнаяНакладнаяФормаДокумента",
		"Документ.РасходнаяНакладная.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокСчетНаОплатуФормаДокумента",
		"Документ.СчетНаОплату.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокУстановкаЦенНоменклатурыФормаДокумента",
		"Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ДокЧекККМФормаДокумента",
		"Документ.ЧекККМ.Форма.ФормаДокумента");
	#КонецОбласти
	
	#Область Обработки
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОбрРабочееМестоКассираФормаРМК",
		"Обработка.РабочееМестоКассира.Форма.ФормаРМК");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОбрНастройкаПрограммыНастройкаПрограммы",
		"Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы");
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"ОбрПанельАдминистрированияБИПИнтернетПоддержкаИСервисы",
		"Обработка.ПанельАдминистрированияБИП.Форма.ИнтернетПоддержкаИСервисы");
	#КонецОбласти
	
	#Область РегистрыСведений
	СоответствияИспользуемыхПроцедурОБ.Вставить(
		"РССопутствующиеТоварыФормаДляНоменклатуры",
		"РегистрСведений.СопутствующиеТовары.Форма.ФормаДляНоменклатуры");
	#КонецОбласти
	
	#Область Отчеты
	#КонецОбласти
	
	Возврат СоответствияИспользуемыхПроцедурОБ;
	
КонецФункции

#Область СозданиеЭлементов

#Область ПланыОбмена
#КонецОбласти

#Область ОбщиеФормы

Процедура ОФБлокировкаРаботыСВнешнимиРесурсами(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства

	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ПриОткрытии", "ПриОткрытии");
	
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти
	
КонецПроцедуры

Процедура ОФНастройкиРабочегоМестаКассира(Форма, СписокОшибок)

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаОтраслевыеФлаги",
		Тип("ГруппаФормы"),
		Элементы.НастройкиИнтерфейсаКарточка);
	НовыйЭлемент.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаОтраслевыеФлагиЛево",
		Тип("ГруппаФормы"),
		Элементы.ГруппаОтраслевыеФлаги);
	НовыйЭлемент.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Ширина              = 43;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаОтраслевыеФлагиПраво",
		Тип("ГруппаФормы"),
		Элементы.ГруппаОтраслевыеФлаги);
	НовыйЭлемент.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"НастройкаРМКор_ПоказыватьТолькоХарактеристикиВНаличии",
		Тип("ПолеФормы"),
		Элементы.ГруппаОтраслевыеФлагиЛево);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным        = "НастройкиРМК.ор_ПоказыватьТолькоХарактеристикиВНаличии";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	НовыйЭлемент = Элементы.Вставить(
		"НастройкаРМКор_ИнтерактивноОповещатьОСопутствующихТоварах",
		Тип("ПолеФормы"),
		Элементы.ГруппаОтраслевыеФлагиЛево);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным        = "НастройкиРМК.ор_ИнтерактивноОповещатьОСопутствующихТоварах";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	НовыйЭлемент = Элементы.Вставить(
		"НастройкаРМКор_ВыводитьХарактеристикиДляПодаркаВВидеДерева",
		Тип("ПолеФормы"),
		Элементы.ГруппаОтраслевыеФлагиПраво);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Видимость          = Ложь;
	НовыйЭлемент.ПутьКДанным        = "НастройкиРМК.ор_ВыводитьХарактеристикиДляПодаркаВВидеДерева";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Подсказка          = НСтр("ru = 'В форме выбора подарка для каждой номенклатурной позиции будет выводиться список доступных характеристик.'");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыводитьХарактеристикиДляПодаркаВВидеДереваПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить(
		"НастройкаРМКор_РаскрытьГруппыХарактеристикПриОткрытии",
		Тип("ПолеФормы"),
		Элементы.ГруппаОтраслевыеФлагиПраво);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Видимость          = Ложь;
	НовыйЭлемент.ПутьКДанным        = "НастройкиРМК.ор_РаскрытьГруппыХарактеристикПриОткрытии";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Доступность        = Ложь;
	
#КонецОбласти

#Область ИзмененныеСвойства
#КонецОбласти

КонецПроцедуры

Процедура ОФФормаВыбораДанныхПоискаПоШтрихкоду(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты

	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОтображатьЦены",
		Новый ОписаниеТипов("Булево"),
		"ДеревоВыбора",
		НСтр("ru = 'Отображать цены'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ПоказыватьЦеныНоменклатуры",
		Новый ОписаниеТипов("Булево"),
		,
		НСтр("ru = 'Показывать цены'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"РозничныйВидЦены",
		Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"),
		,
		НСтр("ru = 'РозничныйВидЦены'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТаблицаНоменклатурыДляЦен",
		Новый ОписаниеТипов("ТаблицаЗначений"),
		,
		НСтр("ru = 'ТаблицаНоменклатурыДляЦен'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Номенклатура",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
		"ТаблицаНоменклатурыДляЦен", 
		НСтр("ru = 'Номенклатура'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
		"ТаблицаНоменклатурыДляЦен",
		НСтр("ru = 'Характеристика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Цена",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)),
		"ТаблицаНоменклатурыДляЦен",
		НСтр("ru = 'Цена'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаПоказыватьЦену",
		Тип("ГруппаФормы"));
	НовыйЭлемент.Вид 		 		 = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок   		 = "ГруппаПоказыватьЦену";
	НовыйЭлемент.отображатьЗаголовок = Ложь;
	НовыйЭлемент.Отображение 		 = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Вставить(
		"ПоказыватьЦеныНоменклатуры",
		Тип("ПолеФормы"),
		Элементы.ГруппаПоказыватьЦену);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка          = ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным        = "ПоказыватьЦеныНоменклатуры";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПоказыватьЦеныНоменклатурыПриИзменении");
	
#КонецОбласти

КонецПроцедуры

Процедура ОФУдалить_ПодаркиНаВыбор(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"ДеревоПодарковХарактеристика",
		"ПриИзменении", 
		"Подключаемый_ДеревоПодарковХарактеристикаПриИзменении",,
		СписокОшибок);
		
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеЭлемента(
		Форма,
		"ДеревоПодарковХарактеристика",
		"НачалоВыбора", 
		"Подключаемый_ДеревоПодарковХарактеристикаНачалоВыбора",,
		СписокОшибок);
#КонецОбласти
	
#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВидЦен",
		Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"),,
		НСтр("ru = 'Вид цен'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВалютаДокумента",
		Новый ОписаниеТипов("СправочникСсылка.Валюты"),,
		НСтр("ru = 'Валюта документа'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ИспользоватьХарактеристики",
		Новый ОписаниеТипов("Булево"),
		"ДеревоПодарков",
		НСтр("ru = 'Использовать характеристики'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

#Область УсловноеОформлениеФормы
#КонецОбласти

КонецПроцедуры

Процедура ОФМенюФункцийНСИ(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ор_НоменклатураОтсутствующаяВБазе");
	НоваяКоманда.Действие  = "Подключаемый_ОтраслевойРегистрСведенийОткрытьСписок";
	НоваяКоманда.Заголовок = НСтр("ru = 'Номенклатура, отсутствующая в базе'");
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"ор_НоменклатураОтсутствующаяВБазе",
		Тип("КнопкаФормы"),
		Элементы.РазделОбщее);
	НовыйЭлемент.Вид               = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Важность          = ВажностьКнопки.Дополнительная;
	НовыйЭлемент.ИмяКоманды        = "ор_НоменклатураОтсутствующаяВБазе";
	НовыйЭлемент.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
#КонецОбласти

КонецПроцедуры

Процедура ОФРМКФормаВыдачиПодарка(Форма, СписокОшибок)

#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеобходимоУточнитьХарактеристику",
		Новый ОписаниеТипов("Булево"),
		"ТаблицаПодаркиБезВыбора",
		НСтр("ru = 'Необходимо уточнить характеристику подарка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеобходимоУточнитьХарактеристику",
		Новый ОписаниеТипов("Булево"),
		"ТаблицаПодаркиНаВыбор",
		НСтр("ru = 'Необходимо уточнить характеристику подарка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

#Область ИзмененныеСвойства
#КонецОбласти

#Область УсловноеОформлениеФормы
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область Справочники

Процедура СпрАвтоматическиеСкидкиФормаЭлемента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.НаборПодарков.ИспользоватьХарактеристики");
	ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.НаборПодарков.Характеристика");
	ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.Использование  = Истина;
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("НаборПодарковХарактеристика");
	ПолеОформления.Использование = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(160, 160, 164));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "<характеристика не выбрана>");
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

КонецПроцедуры

Процедура СпрУсловияПредоставленияСкидокНаценокФормаЭлемента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПоДиапазонуНомеровКарт",
		Тип("ГруппаФормы"),
		Элементы.ГруппаРеквизитыТиповУсловий,
		Элементы.ЗаРучнуюАктивацию);
	НовыйЭлемент.Вид         = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'По диапазону номеров карт'");
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПрефиксыДиапазоновКарт",
		Тип("ТаблицаФормы"),
		Элементы.ор_ПоДиапазонуНомеровКарт);
	НовыйЭлемент.ПутьКДанным             = "Объект.ор_ПрефиксыДиапазоновКарт";
	НовыйЭлемент.ПоложениеЗаголовка      = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.АвтоВводНовойСтроки     = Ложь;
	НовыйЭлемент.РазрешитьПеретаскивание = Ложь;
	НовыйЭлемент.УстановитьДействие(
		"ПриОкончанииРедактирования",
		"Подключаемый_ор_ПрефиксыДиапазоновКартПриОкончанииРедактирования");
	НовыйЭлемент.УстановитьДействие(
		"ПослеУдаления",
		"Подключаемый_ор_ПрефиксыДиапазоновКартПослеУдаления");
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПрефиксыДиапазоновКартНомерСтроки",
		Тип("ПолеФормы"),
		Элементы.ор_ПрефиксыДиапазоновКарт);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ПрефиксыДиапазоновКарт.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПрефиксыДиапазоновКартПрефикс",
		Тип("ПолеФормы"),
		Элементы.ор_ПрефиксыДиапазоновКарт);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ПрефиксыДиапазоновКарт.Префикс";
#КонецОбласти

КонецПроцедуры

Процедура СпрКатегорииНоменклатурыФормаЭлемента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	
	Команды = Форма.Команды;
	
	НоваяКоманда = Команды.Добавить("ПечатьЦенниковИЭтикеток");
	НоваяКоманда.Действие 	= "Подключаемый_ПечатьЦенниковИЭтикетокОбработкаКоманды";
	НоваяКоманда.Заголовок 	= НСтр("ru = 'Печать ценников и этикеток'");

#КонецОбласти

#Область Элементы

	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаПодменюПечать",
		Тип("ГруппаФормы"),
		Форма.КоманднаяПанель);
	НовыйЭлемент.Вид 		 = ВидГруппыФормы.Подменю;
	НовыйЭлемент.Заголовок	 = НСтр("ru = 'Печать'");
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Картинка 	 = БиблиотекаКартинок.Печать;
	
	НовыйЭлемент = Элементы.Вставить("ПечатьЦенниковИЭтикеток",
											Тип("КнопкаФормы"),
											Элементы.ГруппаПодменюПечать);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "ПечатьЦенниковИЭтикеток";

#КонецОбласти

КонецПроцедуры

Процедура СпрКатегорииНоменклатурыФормаСписка(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты 
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ПечатьЦенниковИЭтикеток");
	НоваяКоманда.Действие 	= "Подключаемый_ПечатьЦенниковИЭтикетокОбработкаКоманды";
	НоваяКоманда.Заголовок 	= НСтр("ru = 'Печать ценников и этикеток'");;
	
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаПодменюПечать",
		Тип("ГруппаФормы"),
		Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.Вид 		 = ВидГруппыФормы.Подменю;
	НовыйЭлемент.Заголовок	 = НСтр("ru = 'Печать'");
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Картинка 	 = БиблиотекаКартинок.Печать;
	
	НовыйЭлемент = Элементы.Вставить(
		"ВидыНоменклатурыПечатьЦенниковИЭтикеток",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПодменюПечать);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "ПечатьЦенниковИЭтикеток";
	
#КонецОбласти

КонецПроцедуры

Процедура СпрНоменклатураФормаЭлемента(Форма, СписокОшибок)

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ШаблонЦенникаЭтикетки",
		Тип("ПолеФормы"),
		Элементы.ГруппаСоставГруппыЛево);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ШаблонЦенника";

#КонецОбласти

#Область ИзмененныеСвойства
#КонецОбласти

КонецПроцедуры

Процедура СпрНоменклатураФормаСписка(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"РасшифровкаОстатков",
		"Видимость",
		Ложь,
		СписокОшибок);
#КонецОбласти
	
#Область Реквизиты
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ПодборНоменклатураПоставщика",
		Новый ОписаниеТипов("ДинамическийСписок"),,
		НСтр("ru = 'Подбор номенклатура поставщика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"УчитыватьХарактеристикиПриПодбореСопутствующихТоваров",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Учитывать характеристики при подборе товаров'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	#Область ДеревоИнформацииПоОстаткам
	НовыйРеквизит = Новый РеквизитФормы(
		"ДеревоИнформации",
		Новый ОписаниеТипов("ДеревоЗначений"),,
		"Дерево информации");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Ссылка",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
		"ДеревоИнформации",
		НСтр("ru = 'Ссылка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"СкладХарактеристика",
		Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы, СправочникСсылка.ХарактеристикиНоменклатуры"),
		"ДеревоИнформации",
		НСтр("ru = 'Склад'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы(
		"Количество",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(15, 3)),
		"ДеревоИнформации",
		НСтр("ru = 'Количество'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы(
		"Резерв", 
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(15, 3)),
		"ДеревоИнформации",
		НСтр("ru = 'Резерв'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Цена",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)),
		"ДеревоИнформации",
		НСтр("ru = 'Цена'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы(
		"Картинка",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0)),
		"ДеревоИнформации",
		НСтр("ru = 'Картинка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"КартинкаКорзина",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0)),
		"ДеревоИнформации",
		НСтр("ru = 'Картинка корзина'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	#КонецОбласти
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОтображатьКоличествоОтраслевое", 
		Новый ОписаниеТипов("Булево"),, 
		"Отображать количество");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы(
		"ОтображатьРезервОтраслевой", 
		Новый ОписаниеТипов("Булево"),,
		"Отображать резерв");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы(
		"ОтображатьЦеныОтраслевые", 
		Новый ОписаниеТипов("Булево"),, 
		"Отображать цены");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	Форма.ор_ПодборНоменклатураПоставщика.ОсновнаяТаблица = "РегистрСведений.ор_НоменклатураОтсутствующаяВБазе";
	
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ор_СоздатьНоменклатуру");
	НоваяКоманда.Действие                   = "Подключаемый_СоздатьНоменклатуру";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'номенклатуры'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Мастер создания номенклатуры'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("ор_СоздатьХарактеристику");
	НоваяКоманда.Действие                   = "Подключаемый_СоздатьХарактеристику";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'характеристики'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Мастер создания характеристики'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("ДобавитьВКорзинуДеревоИнформации");
	НоваяКоманда.Действие                   = "Подключаемый_ДобавитьВКорзинуДеревоИнформации";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Добавить в корзину'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Добавить в корзину'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("УдалитьИзКорзиныДеревоИнформации");
	НоваяКоманда.Действие                   = "Подключаемый_УдалитьИзКорзиныДеревоИнформации";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Удалить из корзины'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Удалить из корзины'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодменюПомощникСоздать",
		Тип("ГруппаФормы"),
		Элементы.КомандыСписка,
		Элементы.СкопироватьНоменклатуру);
	НовыйЭлемент.Вид       = ВидГруппыФормы.Подменю;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Помощник создания'");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Мастер создания'");
	
	НовыйЭлемент = Элементы.Добавить(
		"ор_СписокСоздатьНоменклатуру",
		Тип("КнопкаФормы"),
		Элементы.ор_ПодменюПомощникСоздать);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ор_СоздатьНоменклатуру";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_СписокСоздатьХарактеристику",
		Тип("КнопкаФормы"),
		Элементы.ор_ПодменюПомощникСоздать);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ор_СоздатьХарактеристику";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_СтраницыПодбора",
		Тип("ГруппаФормы"),,
		Элементы.НоменклатураИОтборы);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страницы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаПодборПоБазе",
		Тип("ГруппаФормы"),
		Элементы.ор_СтраницыПодбора);
	НовыйЭлемент.Вид         = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Номенклатура'");
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Подбор по базе'");
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	НовыйЭлемент = Элементы.Вставить(
		"ОбластьПодбораНоменклатураПоставщиков",
		Тип("ГруппаФормы"),
		Элементы.ор_СтраницыПодбора);
	НовыйЭлемент.Вид         = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Номенклатура поставщиков'");
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Область подбора номенклатура поставщиков'");
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	НовыйЭлемент = Элементы.Вставить(
		"ГруппаОтборыНоменклатураПоставщиков",
		Тип("ГруппаФормы"),
		Элементы.ОбластьПодбораНоменклатураПоставщиков);
	НовыйЭлемент.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок   = "Отборы";
	НовыйЭлемент.Подсказка   = "Отборы";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщика",
		Тип("ТаблицаФормы"),
		Элементы.ОбластьПодбораНоменклатураПоставщиков);
	НовыйЭлемент.ПутьКДанным                = "ор_ПодборНоменклатураПоставщика";
	НовыйЭлемент.Видимость                  = ПолучитьФункциональнуюОпцию("ор_СоздаватьВЗаказеНоменклатуруПоДаннымПоставщика");
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.АвтоВводНовойСтроки        = Ложь;
	НовыйЭлемент.РазрешитьПеретаскивание    = Ложь;
	НовыйЭлемент.УстановитьДействие("Выбор", "Подключаемый_ор_ПодборНоменклатураПоставщикаВыбор");
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщикаКатегорияНоменклатуры",
		Тип("ПолеФормы"),
		Элементы.ор_ПодборНоменклатураПоставщика);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ор_ПодборНоменклатураПоставщика.КатегорияНоменклатуры";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщикаНаименованиеПоставщика",
		Тип("ПолеФормы"),
		Элементы.ор_ПодборНоменклатураПоставщика);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ор_ПодборНоменклатураПоставщика.НаименованиеПоставщика";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщикаШаблонКраткогоНаименованияНоменклатуры",
		Тип("ПолеФормы"),
		Элементы.ор_ПодборНоменклатураПоставщика);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ор_ПодборНоменклатураПоставщика.ШаблонКраткогоНаименованияНоменклатуры";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщикаШаблонПолногоНаименованияНоменклатуры", 
		Тип("ПолеФормы"),
		Элементы.ор_ПодборНоменклатураПоставщика);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ор_ПодборНоменклатураПоставщика.ШаблонПолногоНаименованияНоменклатуры";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщикаШаблонНаименованияХарактеристики", 
		Тип("ПолеФормы"),
		Элементы.ор_ПодборНоменклатураПоставщика);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ор_ПодборНоменклатураПоставщика.ШаблонНаименованияХарактеристики";
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ПодборНоменклатураПоставщикаШаблонНаименованияХарактеристикиДляПечати", 
		Тип("ПолеФормы"),
		Элементы.ор_ПодборНоменклатураПоставщика);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ор_ПодборНоменклатураПоставщика.ШаблонНаименованияХарактеристикиДляПечати";
	
	#Область ДеревоИнформацииПоОстаткам
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ГруппаОтображенияКолонок",
		Тип("ГруппаФормы"), 
		Форма.Элементы.ГруппаОстаткиДинСписка);
	НовыйЭлемент.Вид 		 				= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Подсказка	 				= НСтр("ru = 'Отображение колонок:'");
	НовыйЭлемент.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок        = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали 	= Ложь;
	НовыйЭлемент.РастягиватьПоВертикали 	= Ложь;
	НовыйЭлемент.ОтображатьЗаголовок 		= Ложь;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Центр;

	НовыйЭлемент = Форма.Элементы.Вставить(
		"НадписьОтображения",
		Тип("ДекорацияФормы"),
		Форма.Элементы.ГруппаОтображенияКолонок);
	НовыйЭлемент.Заголовок					= НСтр("ru = 'Отображать:'");
	НовыйЭлемент.Вид 						= ВидДекорацииФормы.Надпись;
	НовыйЭлемент.ГоризонтальноеПоложение 	= ГоризонтальноеПоложениеЭлемента.Лево;

	НовыйЭлемент = Форма.Элементы.Вставить(
		"ОтображатьКоличествоОтраслевое",
		Тип("ПолеФормы"),
		Форма.Элементы.ГруппаОтображенияКолонок);
	НовыйЭлемент.Вид 		 		= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка			= ВидФлажка.Выключатель;
	НовыйЭлемент.Заголовок 	 		= НСтр("ru = 'Количество'");
	НовыйЭлемент.ПутьКДанным 		= "ОтображатьКоличествоОтраслевое";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтображатьКоличествоПриИзменении");

	НовыйЭлемент = Форма.Элементы.Вставить(
		"ОтображатьРезервОтраслевое",
		Тип("ПолеФормы"),
		Форма.Элементы.ГруппаОтображенияКолонок);
	НовыйЭлемент.Вид 		 		= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка			= ВидФлажка.Выключатель;
	НовыйЭлемент.Заголовок 	 		= НСтр("ru = 'Резерв'");
	НовыйЭлемент.ПутьКДанным 		= "ОтображатьРезервОтраслевой";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтображатьРезервПриИзменении");

	НовыйЭлемент = Форма.Элементы.Вставить(
		"ОтображатьЦеныОтраслевое",
		Тип("ПолеФормы"),
		Форма.Элементы.ГруппаОтображенияКолонок);
	НовыйЭлемент.Вид 		 		= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка			= ВидФлажка.Выключатель;
	НовыйЭлемент.Заголовок 	 		= НСтр("ru = 'Цены'");
	НовыйЭлемент.ПутьКДанным 		= "ОтображатьЦеныОтраслевые";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтображатьЦеныПриИзменении");
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформации",
		Тип("ТаблицаФормы"),
		Форма.Элементы.ГруппаОстаткиДинСписка);
	НовыйЭлемент.ПоложениеЗаголовка   			= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		  			= "ДеревоИнформации";
	НовыйЭлемент.ТолькоПросмотр		 			= Истина;
	НовыйЭлемент.ИзменятьСоставСтрок  			= Ложь;
	НовыйЭлемент.ИзменятьПорядокСтрок 			= Ложь;
	НовыйЭлемент.РежимВыделения 	  			= РежимВыделенияТаблицы.Одиночный;
	НовыйЭлемент.РежимВыделенияСтроки 			= РежимВыделенияСтрокиТаблицы.Строка;
	НовыйЭлемент.РазрешитьНачалоПеретаскивания 	= Ложь;
	НовыйЭлемент.РазрешитьПеретаскивание 		= Ложь;
	НовыйЭлемент.СпособПеретаскиванияФайлов 	= СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.ПутьКДаннымКартинкиСтроки 		= "ДеревоИнформации.Картинка";
	НовыйЭлемент.КартинкаСтрок					= БиблиотекаКартинок.ТоварУслугаСписок;
	НовыйЭлемент.НачальноеОтображениеДерева		= НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	НовыйЭлемент.ПоложениеСтрокиПоиска			= ПоложениеСтрокиПоиска.Нет;
	НовыйЭлемент.ПоложениеСостоянияПросмотра	= ПоложениеСостоянияПросмотра.Нет;
	НовыйЭлемент.ПоложениеУправленияПоиском		= ПоложениеУправленияПоиском.Нет;
	НовыйЭлемент.ВысотаВСтрокахТаблицы			= 6;
	НовыйЭлемент.УстановитьДействие("Выбор", "Подключаемый_ДеревоИнформацииВыбор");
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_ДеревоИнформацииПриАктивизацииСтроки");
	
	#Область КонтекстноеМенюДереваИнформации
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииКонтекстноеМенюДобавитьВКорзину",
		Тип("КнопкаФормы"),
		Элементы.ДеревоИнформации.КонтекстноеМеню);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ДобавитьВКорзинуДеревоИнформации";
	НовыйЭлемент.Картинка   = БиблиотекаКартинок.ТележкаМаленькая;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииКонтекстноеМенюУдалитьИзКорзины",
		Тип("КнопкаФормы"),
		Элементы.ДеревоИнформации.КонтекстноеМеню);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "УдалитьИзКорзиныДеревоИнформации";
	НовыйЭлемент.Картинка   = БиблиотекаКартинок.ТележкаОтмена;
	#КонецОбласти
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииСклад",
		Тип("ПолеФормы"),
		Форма.Элементы.ДеревоИнформации);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок 	 = НСтр("ru = 'Место хранения / характеристика'");
	НовыйЭлемент.ПутьКДанным = "ДеревоИнформации.СкладХарактеристика";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииКоличество",
		Тип("ПолеФормы"),
		Форма.Элементы.ДеревоИнформации);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоИнформации.Количество";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииРезерв",
		Тип("ПолеФормы"),
		Форма.Элементы.ДеревоИнформации);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоИнформации.Резерв";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииЦена",
		Тип("ПолеФормы"),
		Форма.Элементы.ДеревоИнформации);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоИнформации.Цена";
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоИнформацииКартинкаКорзина",
		Тип("ПолеФормы"),
		Форма.Элементы.ДеревоИнформации);
	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеКартинки;
	НовыйЭлемент.ПутьКДанным = "ДеревоИнформации.КартинкаКорзина";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КартинкаЗначений = БиблиотекаКартинок.СписокНоменклатурыТележкиРаботаСНоменклатурой;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ГиперссылкаЯчейки = Истина;
	
	#КонецОбласти
	
#КонецОбласти

#Область УсловноеОформлениеФормы

	ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтборСклад");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоИнформации.СкладХарактеристика");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ОтборСклад");
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПоказыватьОстатки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ДеревоИнформацииСклад");
	ПолеОформления.Использование = Истина;
	
	ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ДеревоИнформацииКоличество");
	ПолеОформления.Использование = Истина;
	
	ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ДеревоИнформацииРезерв");
	ПолеОформления.Использование = Истина;
	
	ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ДеревоИнформацииЦена");
	ПолеОформления.Использование = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
	
#КонецОбласти

#Область ИзмененныеСвойства
	Элементы.Переместить(Элементы.НоменклатураИОтборы, Элементы.ГруппаПодборПоБазе);
#КонецОбласти

КонецПроцедуры

Процедура СпрШаблоныНаименованийФормаЭлемента(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти
	
#Область Реквизиты
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"СписокРеквизитовФормы",
		Новый ОписаниеТипов("СписокЗначений"),,
		НСтр("ru = 'Список реквизитов формы'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"СписокДопРеквизитов",
		Новый ОписаниеТипов("СписокЗначений"),,
		НСтр("ru = 'Список доп реквизитов'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТаблицаРеквизитов",
		Новый ОписаниеТипов("ТаблицаЗначений"),,
		НСтр("ru = 'Таблица реквизитов'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Тип",
		Новый ОписаниеТипов(),
		"ТаблицаРеквизитов",
		НСтр("ru = 'Тип'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Синоним",
		Новый ОписаниеТипов("Строка"),
		"ТаблицаРеквизитов",
		НСтр("ru = 'Синоним'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Реквизит",
		Новый ОписаниеТипов(),
		"ТаблицаРеквизитов",
		НСтр("ru = 'Реквизит'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТаблицаДопРеквизитов",
		Новый ОписаниеТипов("ТаблицаЗначений"),,
		НСтр("ru = 'Таблица реквизитов номенклатуры'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Тип",
		Новый ОписаниеТипов(),
		"ТаблицаДопРеквизитов",
		НСтр("ru = 'Тип'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Синоним",
		Новый ОписаниеТипов("Строка"),
		"ТаблицаДопРеквизитов",
		НСтр("ru = 'Синоним'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Реквизит",
		Новый ОписаниеТипов(),
		"ТаблицаДопРеквизитов",
		НСтр("ru = 'Реквизит'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ИсключающиеРеквизиты",
		Новый ОписаниеТипов("СписокЗначений"),,
		НСтр("ru = 'Исключающие реквизиты'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьРеквизитыПоУмолчанию");
	НоваяКоманда.Действие  = "Подключаемый_ЗаполнитьРеквизитыПоУмолчанию";
	НоваяКоманда.Заголовок = НСтр("ru = 'по умолчанию'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Заполнить реквизиты по умолчанию'");
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьОбязательныеРеквизиты");
	НоваяКоманда.Действие  = "Подключаемый_ЗаполнитьОбязательныеРеквизиты";
	НоваяКоманда.Заголовок = НСтр("ru = 'Реквизиты номенклатуры'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Заполнить обязательные реквизиты'");
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьДополнительныеРеквизиты");
	НоваяКоманда.Действие  = "Подключаемый_ЗаполнитьДополнительныеРеквизиты";
	НоваяКоманда.Заголовок = НСтр("ru = 'Заполнить дополнительные реквизиты'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Заполнить дополнительные реквизиты'");
	
	НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьОбязательныеДополнительныеРеквизиты");
	НоваяКоманда.Действие  = "Подключаемый_ЗаполнитьОбязательныеДополнительныеРеквизиты";
	НоваяКоманда.Заголовок = НСтр("ru = 'Заполнить обязательные дополнительные реквизиты'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Заполнить обязательные дополнительные реквизиты'");
	
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"СтраницыРеквизитов",
		Тип("ГруппаФормы"));
	НовыйЭлемент.Вид       = ВидГруппыФормы.Страницы;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Страницы реквизитов'");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Страницы реквизитов'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаДополнительныеРеквизиты",
		Тип("ГруппаФормы"),
		Элементы.СтраницыРеквизитов);
	НовыйЭлемент.Вид         = ВидГруппыФормы.Страница;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Дополнительные реквизиты'");
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Группа дополнительные реквизиты'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ДополнительныеРеквизиты",
		Тип("ТаблицаФормы"),
		Элементы.ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ДополнительныеРеквизиты";
	
	НовыйЭлемент = Элементы.Вставить(
		"ДополнительныеРеквизитыЗначение",
		Тип("ПолеФормы"),
		Элементы.ДополнительныеРеквизиты);
	НовыйЭлемент.Вид                    = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным            = "Объект.ор_ДополнительныеРеквизиты.Значение";
	НовыйЭлемент.АвтоМаксимальнаяВысота = Истина;
	
	НовыйЭлемент = Элементы.Вставить(
		"ДополнительныеРеквизитыПредставление",
		Тип("ПолеФормы"),
		Элементы.ДополнительныеРеквизиты,
		Элементы.ДополнительныеРеквизитыЗначение);
	НовыйЭлемент.Вид                     = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок               = "Реквизит";
	НовыйЭлемент.ПутьКДанным             = "Объект.ор_ДополнительныеРеквизиты.Представление";
	НовыйЭлемент.РедактированиеТекста    = Ложь;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "Подключаемый_ДополнительныеРеквизитыПредставлениеОбработкаВыбора");
	
	НовыйЭлемент = Элементы.Вставить(
		"ДополнительныеРеквизитыНомерСтроки",
		Тип("ПолеФормы"),
		Элементы.ДополнительныеРеквизиты,
		Элементы.ДополнительныеРеквизитыПредставление);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ДополнительныеРеквизиты.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить(
		"ДополнительныеРеквизитыПодменю",
		Тип("ГруппаФормы"),
		Элементы.ДополнительныеРеквизиты.КоманднаяПанель);
	НовыйЭлемент.Вид       = ВидГруппыФормы.Подменю;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Заполнить'");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Заполнить дополнительные реквизиты'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ЗаполнитьДополнительныеРевизитыПоУмолчанию",
		Тип("КнопкаФормы"),
		Элементы.ДополнительныеРеквизитыПодменю);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьДополнительныеРеквизиты";
	НовыйЭлемент.Заголовок  = НСтр("ru = 'по умолчанию'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ЗаполнитьДополнительныеРеквизитыОбязательные",
		Тип("КнопкаФормы"),
		Элементы.ДополнительныеРеквизитыПодменю);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьОбязательныеДополнительныеРеквизиты";
	НовыйЭлемент.Заголовок  = НСтр("ru = 'только обязательные'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаРеквизитыДляЗаполнения",
		Тип("ГруппаФормы"),
		Элементы.СтраницыРеквизитов,
		Элементы.ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид         = ВидГруппыФормы.Страница;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Реквизиты для заполнения'");
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Реквизиты для заполнения'");
	
	НовыйЭлемент = Элементы.Вставить(
		"РеквизитыДляЗаполнения",
		Тип("ТаблицаФормы"),
		Элементы.ГруппаРеквизитыДляЗаполнения);
	НовыйЭлемент.ПутьКДанным                = "Объект.ор_РеквизитыДляЗаполнения";
	НовыйЭлемент.АвтоВводНовойСтроки        = Истина;
	НовыйЭлемент.Отображение                = ОтображениеТаблицы.Список;
	НовыйЭлемент.СпособПеретаскиванияФайлов = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииЯчейки", "Подключаемый_РеквизитыДляЗаполненияПриАктивизацииЯчейки");
	
	НовыйЭлемент = Элементы.Вставить(
		"РеквизитыДляЗаполненияЗначение",
		Тип("ПолеФормы"),
		Элементы.РеквизитыДляЗаполнения);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_РеквизитыДляЗаполнения.Значение";
	
	НовыйЭлемент = Элементы.Вставить(
		"РеквизитыДляЗаполненияПредставление",
		Тип("ПолеФормы"),
		Элементы.РеквизитыДляЗаполнения,
		Элементы.РеквизитыДляЗаполненияЗначение);
	НовыйЭлемент.Вид                     = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок               = НСтр("ru = 'Реквизит'");
	НовыйЭлемент.ПутьКДанным             = "Объект.ор_РеквизитыДляЗаполнения.Представление";
	НовыйЭлемент.КнопкаВыбора            = Ложь;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
	НовыйЭлемент.РежимВыбораИзСписка     = Истина;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_РеквизитыДляЗаполненияПредставлениеНачалоВыбора");
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "Подключаемый_РеквизитыДляЗаполненияПредставлениеОбработкаВыбора");

	НовыйЭлемент = Элементы.Вставить(
		"РеквизитыДляЗаполненияНомерСтроки",
		Тип("ПолеФормы"),
		Элементы.РеквизитыДляЗаполнения,
		Элементы.РеквизитыДляЗаполненияПредставление);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_РеквизитыДляЗаполнения.НомерСтроки";
	
	НовыйЭлемент = Элементы.Вставить(
		"ЗаполнитьРеквизитыПодменю",
		Тип("ГруппаФормы"),
		Элементы.РеквизитыДляЗаполнения.КоманднаяПанель);
	НовыйЭлемент.Вид       = ВидГруппыФормы.Подменю;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Заполнить'");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Заполнение реквизитов'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ЗаполнитьВсеРеквизиты",
		Тип("КнопкаФормы"),
		Элементы.ЗаполнитьРеквизитыПодменю);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьРеквизитыПоУмолчанию";
	НовыйЭлемент.Заголовок  = НСтр("ru = 'по умолчанию'");
	
	НовыйЭлемент = Элементы.Вставить(
		"РеквизитыДляЗаполненияЗаполнитьОбязательныеРеквизиты",
		Тип("КнопкаФормы"),
		Элементы.ЗаполнитьРеквизитыПодменю);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьОбязательныеРеквизиты";
	НовыйЭлемент.Заголовок  = НСтр("ru = 'только обязательные'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаИспользоватьВнеБазы",
		Тип("ГруппаФормы"),,
		Элементы.СтраницыРеквизитов);
	НовыйЭлемент.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок            = НСтр("ru = 'Использовать вне базы'");
	НовыйЭлемент.Подсказка            = НСтр("ru = 'Использовать вне базы'");
	НовыйЭлемент.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.ОтображатьЗаголовок  = Ложь;
	НовыйЭлемент.Отображение          = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ТоварВнеБазы",
		Тип("ПолеФормы"),
		Элементы.ГруппаИспользоватьВнеБазы);
	НовыйЭлемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок            = НСтр("ru = 'Использовать при создании номенклатуры'");
	НовыйЭлемент.Подсказка            = НСтр("ru = 'Позволяет выбрать правило в списке ""Номенклатура отсутствующая в базе"", предоставляет доступ к заполнению реквизитов по умолчанию, так же добавляет в конструктор реквизит ""Наименование поставщика"".'");
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.ПутьКДанным          = "Объект.ор_ТоварВнеБазы";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ор_ТоварВнеБазыПриИзменении");
	
#КонецОбласти

КонецПроцедуры

Процедура СпрШаблоныНаименованийФормаСписка(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

КонецПроцедуры

Процедура СпрХарактеристикиНоменклатурыФормаЭлемента(Форма, СписокОшибок)

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

#Область ИзмененныеСвойства
#КонецОбласти

КонецПроцедуры

Процедура СпрХарактеристикиНоменклатурыФормаВыбора(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

КонецПроцедуры

Процедура СпрХарактеристикиНоменклатурыФормаСписка(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

КонецПроцедуры

Процедура СпрХранилищеШаблоновРМКФормаЭлемента(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти
	
#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеОтображатьХарактеристику",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Не отображать характеристику'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"НеОтображатьХарактеристику",
		Тип("ПолеФормы"),
		Элементы.ГруппаШапка);
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка			= ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным 		= "НеОтображатьХарактеристику"; 
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НеОтображатьХарактеристикуПриИзменении");
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область Документы

Процедура ДокАктВыполненныхРаботФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ПодаркиХарактеристика",
		"ТолькоПросмотр", 
		Ложь,
		СписокОшибок);
#КонецОбласти

КонецПроцедуры

Процедура ДокЗаказПокупателяФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаВыбора", "ОбработкаВыбора");
	
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ЗагрузкаИзФайла");
	НоваяКоманда.Действие  = "Подключаемый_ЗагрузкаИзФайла";
	НоваяКоманда.Заголовок = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Истина;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
#КонецОбласти

#Область Элементы
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ТоварыЗагрузкаИзФайла",
		Тип("КнопкаФормы"),
		Форма.Элементы.ЗапасыКоманднаяПанель,
		Форма.Элементы.ЗапасыКомандыКопированияСтрок);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗагрузкаИзФайла";
	
#КонецОбласти

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ПодаркиХарактеристика",
		"ТолькоПросмотр", 
		Ложь,
		СписокОшибок);
#КонецОбласти

КонецПроцедуры

Процедура ДокЗаказПокупателяФормаВыбора(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ПараметрыОткрытияФормыВыбораЗаказа",
		Новый ОписаниеТипов(),,
		НСтр("ru = 'Параметры открытия формы выбора заказа'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

#КонецОбласти

#Область Команды

	НоваяКоманда = Форма.Команды.Добавить("СозданиеЗаказаПоЧеку");
	НоваяКоманда.Действие                   = "Подключаемый_СозданиеЗаказаПоЧеку";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Создать по чеку'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
#КонецОбласти

#Область Элементы

	НовыйЭлемент = Форма.Элементы.Вставить(
		"СозданиеЗаказаПоЧеку",
		Тип("КнопкаФормы"),
		Форма.Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.Видимость  = Ложь;
	НовыйЭлемент.ИмяКоманды = "СозданиеЗаказаПоЧеку";

#КонецОбласти

КонецПроцедуры

Процедура ДокЗаказПоставщикуФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаВыбора", "ОбработкаВыбора");
	
#КонецОбласти

#Область Реквизиты 
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ЗагрузкаИзФайла");
	НоваяКоманда.Действие                   = "Подключаемый_ЗагрузкаИзФайла";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Истина;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
#КонецОбласти

#Область Элементы
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ТоварыЗагрузкаИзФайла",
		Тип("КнопкаФормы"),
		Форма.Элементы.ЗапасыКоманднаяПанель,
		Форма.Элементы.ЗапасыГруппаКопированиеСтрок);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗагрузкаИзФайла";
	
#КонецОбласти

КонецПроцедуры

Процедура ДокЗаказНаПеремещениеФормаДокумента(Форма, СписокОшибок)
		
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	Команды = Форма.Команды;
	НоваяКоманда = Команды.Добавить("ЗаполнитьПоЗаказам");
	НоваяКоманда.Действие 					= "Подключаемый_ЗаполнитьПоЗаказам";
	НоваяКоманда.Заголовок 					= НСтр("ru = 'По заказам покупателей'");
	НоваяКоманда.Подсказка 					= НСтр("ru = 'Заполнить по незакрытым заказам покупателей с учетом остатков на складе'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.ИзменяетСохраняемыеДанные	= Истина;
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"ТоварыЗаполнитьПоЗаказам",
		Тип("КнопкаФормы"),
		Элементы.Заполнить);
	НовыйЭлемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗаполнитьПоЗаказам";
#КонецОбласти

КонецПроцедуры

Процедура ДокОприходованиеЗапасовФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаЗаписиНового", "ОбработкаЗаписиНового");
	
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("СозданиеНоменклатуры");
	НоваяКоманда.Действие                   = "Подключаемый_СозданиеНоменклатуры";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Создание номенклатуры'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Создание номенклатуры'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Истина;
	
#КонецОбласти

#Область Элементы
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ТоварыСозданиеНоменклатуры",
		Тип("КнопкаФормы"),
		Форма.Элементы.ЗапасыКоманднаяПанель,
		Форма.Элементы.ЗапасыГруппаКопированиеСтрок);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "СозданиеНоменклатуры";
	
#КонецОбласти

КонецПроцедуры

Процедура ДокПриходнаяНакладнаяФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаЗаписиНового", "ОбработкаЗаписиНового");
#КонецОбласти

#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;

	НовыйРеквизит = Новый РеквизитФормы(
		"РазрешеноАвтоформированиеЦен",
		Новый ОписаниеТипов("Булево"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_СтараяЦена",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)),
		"Объект.Запасы",
		НСтр("ru = 'Старая цена'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ор_СтараяЦенаРассчитана",
		Новый ОписаниеТипов("Булево"),
		"Объект.Запасы",
		НСтр("ru = 'Старая цена рассчитана'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

#КонецОбласти

#Область Команды
	НоваяКоманда = Форма.Команды.Добавить("ЗагрузкаИзФайла");
	НоваяКоманда.Действие                   = "Подключаемый_ЗагрузкаИзФайла";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Ложь;
	
	НоваяКоманда = Форма.Команды.Добавить("СозданиеНоменклатуры");
	НоваяКоманда.Действие                   = "Подключаемый_СозданиеНоменклатуры";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Создание номенклатуры'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Создание номенклатуры'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Ложь;
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ТоварыЗагрузкаИзФайла",
		Тип("КнопкаФормы"),
		Элементы.ГруппаЗапасыКоманднаяПанель,
		Элементы.ЗапасыГруппаКопированиеСтрок);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗагрузкаИзФайла";
	
	НовыйЭлемент = Элементы.Вставить(
		"ТоварыСозданиеНоменклатуры",
		Тип("КнопкаФормы"),
		Элементы.ГруппаЗапасыКоманднаяПанель,
		Элементы.ЗапасыГруппаКопированиеСтрок);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "СозданиеНоменклатуры";
	
	НовыйЭлемент = Форма.Элементы.Вставить("ТоварыСтараяЦена", 
		Тип("ПолеФормы"),
		Элементы.Запасы,
		Элементы.ЗапасыЦена);
	НовыйЭлемент.Вид 	 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Запасы.ор_СтараяЦена";
		
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаАвтоформированиеЦен",
		Тип("ГруппаФормы"),
		Элементы.ЛеваяКолонка,
		Элементы.ГруппаПредупреждениеПодчиненныеДокументы);
	НовыйЭлемент.Вид                   = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок             = НСтр("ru = 'Автоформирование цен'");
	НовыйЭлемент.Подсказка             = НСтр("ru = 'Автоформирование цен по поступлению'");
	НовыйЭлемент.Отображение           = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.Поведение             = ПоведениеОбычнойГруппы.Всплывающая;
	НовыйЭлемент.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
	НовыйЭлемент.Группировка           = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.ЦветТекстаЗаголовка   = ЦветаСтиля.ГиперссылкаЦвет;
	
	НовыйЭлемент = Элементы.Вставить(
		"АвтоформированиеЦен",
		Тип("ПолеФормы"),
		Элементы.ГруппаАвтоформированиеЦен);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным        = "Объект.ор_АвтоформированиеЦен";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_АвтоформированиеЦенПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить(
		"ВидЦен",
		Тип("ПолеФормы"),
		Элементы.ГруппаАвтоформированиеЦен);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ор_ВидЦен";
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Вид цен, используемый для автоматического формирования цен'");
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ЗаполнятьИзОснования", Истина));
	НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВидЦенПриИзменении");
	
#КонецОбласти

#Область УсловноеОформлениеФормы
#КонецОбласти

КонецПроцедуры

Процедура ДокРасходнаяНакладнаяФормаДокумента(Форма, СписокОшибок)

#Область Реквизиты
#КонецОбласти

#Область Команды

	НоваяКоманда = Форма.Команды.Добавить("ЗагрузкаИзФайла");
	НоваяКоманда.Действие                   = "Подключаемый_ЗагрузкаИзФайла";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Загрузка из файла'");
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Истина;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
#КонецОбласти

#Область Элементы
	
	НовыйЭлемент = Форма.Элементы.Вставить(
		"ТоварыЗагрузкаИзФайла",
		Тип("КнопкаФормы"),
		Форма.Элементы.ЗапасыИзменитьРезерв);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ЗагрузкаИзФайла";
	
#КонецОбласти

#Область УсловноеОформлениеФормы
#КонецОбласти

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ПодаркиХарактеристика",
		"ТолькоПросмотр", 
		Ложь,
		СписокОшибок);
#КонецОбласти

КонецПроцедуры

Процедура ДокСчетНаОплатуФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ПодаркиХарактеристика",
		"ТолькоПросмотр", 
		Ложь,
		СписокОшибок);
#КонецОбласти

КонецПроцедуры

Процедура ДокУстановкаЦенНоменклатурыФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
	
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьДействиеФормы(Форма, "ОбработкаЗаписиНового", "ОбработкаЗаписиНового");
	
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("СозданиеНоменклатуры");
	НоваяКоманда.Действие                   = "Подключаемый_СозданиеНоменклатуры";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Создание номенклатуры'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Создание номенклатуры'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.ИзменяетСохраняемыеДанные  = Истина;
	
#КонецОбласти

#Область Элементы

	НовыйЭлемент = Форма.Элементы.Вставить(
		"ДеревоЦенСозданиеНоменклатуры",
		Тип("КнопкаФормы"),
		Форма.Элементы.ПодобратьНоменклатуру);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "СозданиеНоменклатуры";
	
#КонецОбласти

КонецПроцедуры

Процедура ДокЧекККМФормаДокумента(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
#КонецОбласти

#Область Элементы
#КонецОбласти

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ПодаркиХарактеристикаНоменклатуры",
		"ТолькоПросмотр", 
		Ложь,
		СписокОшибок);
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область Обработки

Процедура ОбрРабочееМестоКассираФормаРМК(Форма, СписокОшибок)

#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ПоказыватьТолькоХарактеристикиВНаличии",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Показывать только характеристики в наличии'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ИнтерактивноОповещатьОСопутствующихТоварах",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Интерактивно оповещать о сопутствующих товарах'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	#Область ДеревоПодарков
	НовыйРеквизит = Новый РеквизитФормы(
		"ОтраслевоеДеревоПодарков",
		Новый ОписаниеТипов("ДеревоЗначений"),,
		НСтр("ru = 'Выберите подарок'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Номенклатура",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Номенклатура'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Характеристика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НаименованиеДляПечатиНоменклатуры",
		Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(100)),
		"ОтраслевоеДеревоПодарков", 
		НСтр("ru = 'Номенклатура'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Упаковка",
		Метаданные.ОпределяемыеТипы.Упаковка.Тип,
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Упаковка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОсобенностьУчета",
		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Особенность учета'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ТипНоменклатуры",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Тип номенклатуры'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВидНоменклатуры",
		Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Категория номенклатуры'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"КоличествоУпаковок",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(12, 3)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Количество'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Цена",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Цена, ₽'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Количество",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(12, 3)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Количество'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Доступно",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(12, 3)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Доступно'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВРезерве",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(12, 3)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'В резерве'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Склад",
		Метаданные.ОпределяемыеТипы.ТорговыйОбъектРМК.Тип,
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Склад'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Помечен",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Помечен'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеобходимоУточнитьХарактеристику",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Необходимо уточнить характеристику'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Выбран",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Выбран'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВыборИзСписка",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Выбор из списка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОтстаткаНеХватает",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Отстатка не хватает'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"КлючСвязи",
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5, 0)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Ключ связи'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НомерСтроки", 
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10, 0)),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Номер строки'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВыборХарактеристик",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Выбор характеристик'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВладелецПодарка",
		Новый ОписаниеТипов("Строка"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Владелец подарка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ПредставлениеВладельца",
		Новый ОписаниеТипов("Строка"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Представление владельца'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОбластьПредоставленияДокумент",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Область предоставления документ'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВыводитьПодарокВЧек",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Выводить подарок в чек'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Организация",
		Новый ОписаниеТипов("СправочникСсылка.Организации"),
		"ОтраслевоеДеревоПодарков",
		НСтр("ru = 'Организация'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	#КонецОбласти
	
	#Область СопутствующиеТовары
	НовыйРеквизит = Новый РеквизитФормы(
		"ОтраслевыеСопутствующиеТовары",
		Новый ОписаниеТипов("ТаблицаЗначений"),
		,
		НСтр("ru = 'Сопутствующие товары'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НомерСтроки",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(10, 0)),
		"ОтраслевыеСопутствующиеТовары",
		НСтр("ru = 'Номер строки'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Служебный",
		Новый ОписаниеТипов("Булево"),
		"ОтраслевыеСопутствующиеТовары",
		НСтр("ru = 'Служебный'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Номенклатура",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Номенклатура'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НоменклатураНаименованиеДляПечати",
		Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(100)),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Номенклатура'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ХарактеристикаНаименованиеДляПечати",
		Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(150)),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Характеристика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВидНоменклатуры",
		Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Вид номенклатуры'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВидСтроки",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Вид строки'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Доступно",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(15, 3)),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Доступно'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ВРезерве",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(15, 3)),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'В резерве'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы(
		"Код",
		Новый ОписаниеТипов("Строка"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Код'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Наименование",
		Новый ОписаниеТипов("Строка"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Наименование'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ОсобенностьУчета",
		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Особенность учета'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Характеристика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Цена",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Цена, ₽'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Упаковка",
		Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Упаковка'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"Артикул",
		Новый ОписаниеТипов("Строка"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Артикул'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ПредставлениеУпаковки",
		Новый ОписаниеТипов("Строка"),
		"ОтраслевыеСопутствующиеТовары", 
		НСтр("ru = 'Представление упаковки'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ЗначениеПоискаСопутствующегоТовара",
		Новый ОписаниеТипов("Строка"),
		, 
		НСтр("ru = 'Поиск сопутствующего товара'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НоменклатураДляПолученияСопутствующихТоваров",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
		, 
		НСтр("ru = 'Номенклатура'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ХарактеристикаДляПолученияСопутствующихТоваров",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
		, 
		НСтр("ru = 'Характеристика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	#КонецОбласти
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеобходимоУточнитьХарактеристику",
		Новый ОписаниеТипов("Булево"),
		"ДеревоПодарков",
		НСтр("ru = 'Необходимо уточнить характеристику'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ХарактеристикаДляУточнения",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
		"ДеревоПодарков",
		НСтр("ru = 'Характеристика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
	НовыйРеквизит = Новый РеквизитФормы(
		"НомерСтроки",
		Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(10, 0)),
		"ТаблицаПодарков",
		НСтр("ru = 'Номер строки'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ДатаОкончания",
		Новый ОписаниеТипов("Дата"),
		"ДеревоДействующихСкидок",
		НСтр("ru = 'Дата окончания'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"РучнаяСкидка",
		Новый ОписаниеТипов("Булево"),
		"ДеревоДействующихСкидок",
		НСтр("ru = 'Дата окончания'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"УправляемаяСкидка",
		Новый ОписаниеТипов("Булево"),
		"ДеревоДействующихСкидок",
		НСтр("ru = 'Дата окончания'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеобходимоУточнитьХарактеристику",
		Новый ОписаниеТипов("Булево"),
		"ТаблицаПодаркиБезВыбора",
		НСтр("ru = 'Необходимо уточнить характеристику'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеобходимоУточнитьХарактеристику",
		Новый ОписаниеТипов("Булево"),
		"ТаблицаПодаркиНаВыбор",
		НСтр("ru = 'Необходимо уточнить характеристику'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"СписокВВидеДерева",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Список в виде дерева'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ПоказыватьТолькоХарактеристикиПодарковВНаличии",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Показывать только характеристики подарков в наличии'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"СтруктураОбъект",
		Новый ОписаниеТипов(),,
		НСтр("ru = 'Структура объект'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	// ++ Диапазоны карт
	НовыйРеквизит = Новый РеквизитФормы(
		"ТипКартыДляАнализаДиапазона",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКодовКарт"),,
		НСтр("ru = 'Тип карты для анализа диапазона'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НомерКартыДляАнализаДиапазона", 
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)),,
		НСтр("ru = 'Номер карты для анализа диапазона'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НайденаКартаПоДиапазону",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Найдена карта по диапазону'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	// -- Диапазоны карт
	
	НовыйРеквизит = Новый РеквизитФормы(
		"УчитыватьХарактеристикиПриПодбореСопутствующихТоваров",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Учитывать характеристики при подборе сопутствующих товаров'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"НеОповещатьОСопутствующихТоваров",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Не оповещать о сопутствующих товарах'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"РежимВыбораСопутствующихТоваров",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Режим выбора сопутствующих товаров'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ПараметрыОткрытияФормыВыбораЗаказа",
		Новый ОписаниеТипов(),,
		НСтр("ru = 'Параметры открытия формы выбора заказа'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ПоказатьСовместныеТовары");
	НоваяКоманда.Действие                   = "Подключаемый_ПоказатьСовместныеТовары";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Нет сопутствующих товаров'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Показать сопутствующие товары'");
	НоваяКоманда.СочетаниеКлавиш            = Новый СочетаниеКлавиш(Клавиша.F6);
	НоваяКоманда.Картинка                   = БиблиотекаКартинок.СопутствующиеТовары;
	НоваяКоманда.Отображение                = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("ЗакрытьСовместныеТовары");
	НоваяКоманда.Действие                   = "Подключаемый_ЗакрытьСовместныеТовары";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Вернуться к списку'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Вернуться к списку'");
	НоваяКоманда.СочетаниеКлавиш            = Новый СочетаниеКлавиш(Клавиша.F7);
	НоваяКоманда.Картинка                   = БиблиотекаКартинок.СопутствующиеТовары;
	НоваяКоманда.Отображение                = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("ОбновитьСопутствующиеТовары");
	НоваяКоманда.Действие                   = "Подключаемый_ОбновитьСопутствующиеТовары";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Обновить сопутствующие товары'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Обновить сопутствующие товары'");
	НоваяКоманда.Картинка                   = БиблиотекаКартинок.Обновить;
	НоваяКоманда.Отображение                = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("ТолькоСОстатком");
	НоваяКоманда.Действие                   = "Подключаемый_ТолькоСОстатком";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Только с остатком'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Включить/отключить отбор товаров с ненулевым остатком'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Отображение                = ОтображениеКнопки.Текст;
	
	НоваяКоманда = Форма.Команды.Добавить("ПеренестиПодарки");
	НоваяКоманда.Действие                   = "Подключаемый_ПеренестиПодарки";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Перенести подарки'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	НоваяКоманда.Отображение                = ОтображениеКнопки.Текст;
	
	НоваяКоманда = Форма.Команды.Добавить("ОплатитьЧек");
	НоваяКоманда.Действие                   = "Подключаемый_ОплатитьЧек";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Оплатить чек'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Продолжить оплату чека'");
	НоваяКоманда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.НеИспользует;
	
	НоваяКоманда = Форма.Команды.Добавить("КомандаПроверкаЦены");
	НоваяКоманда.Действие                   = "Подключаемый_КомандаПроверкаЦены";
	НоваяКоманда.Заголовок                  = НСтр("ru = 'Проверка цены'");
	НоваяКоманда.Подсказка                  = НСтр("ru = 'Проверить цену текущего товара'");
	НоваяКоманда.Картинка                   = БиблиотекаКартинок.ор_ИконкаРубль;
	
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаОтраслевыеЕще",
		Тип("ГруппаФормы"),
		Элементы.ГруппаЕщеКолонка4,
		Элементы.ЕщеГруппаОтступ);
	НовыйЭлемент.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Отображение              = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок      = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.Ширина                   = 22;
	
	НовыйЭлемент = Элементы.Вставить(
		"КомандаПроверкаЦеныАкселераторы",
		Тип("КнопкаФормы"),
		Элементы.ГруппаОтраслевыеЕще);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "КомандаПроверкаЦены";
	
	НовыйЭлемент = Элементы.Вставить(
		"ДеревоДействующихСкидокДатаОкончания",
		Тип("ПолеФормы"),
		Элементы.ДеревоДействующихСкидок,
		Элементы.ДеревоДействующихСкидокЗначениеСкидкиНаценки);
	НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоДействующихСкидок.ДатаОкончания";
	НовыйЭлемент.Формат      = "ДФ=dd/MM/yy";
	НовыйЭлемент.Подсказка   = НСтр("ru = 'Дата окончания действия скидки'");
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	
	#Область ДеревоПодарков
	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарков",
		Тип("ТаблицаФормы"),
		Элементы.СтраницаПоискТовара);
	НовыйЭлемент.ПоложениеЗаголовка          = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ШрифтЗаголовка              = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Видимость                   = Ложь;
	НовыйЭлемент.ПутьКДанным                 = "ОтраслевоеДеревоПодарков";
	НовыйЭлемент.РежимВыделения              = РежимВыделенияТаблицы.Одиночный;
	НовыйЭлемент.РежимВыделенияСтроки        = РежимВыделенияСтрокиТаблицы.Строка;
	НовыйЭлемент.РазрешитьПеретаскивание     = Ложь;
	НовыйЭлемент.СпособПеретаскиванияФайлов  = СпособПеретаскиванияФайлов.КакФайл;
	НовыйЭлемент.ПоложениеСтрокиПоиска       = ПоложениеСтрокиПоиска.Нет;
	НовыйЭлемент.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
	НовыйЭлемент.ПоложениеУправленияПоиском  = ПоложениеУправленияПоиском.Нет;
	НовыйЭлемент.Ширина                      = 150;
	НовыйЭлемент.Высота                      = 12;
	НовыйЭлемент.КоманднаяПанель.Видимость   = Ложь;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДеревоПодарковПриИзменении");
	НовыйЭлемент.УстановитьДействие("Выбор", "Подключаемый_ДеревоПодарковВыбор");

	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковВыбран",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.Выбран";
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);

	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковНоменклатура",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.Номенклатура";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Шрифт          = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,,14);
	НовыйЭлемент.Ширина         = 30;
	
	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковНоменклатураНаименованиеДляПечати",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.НаименованиеДляПечатиНоменклатуры";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Видимость      = Ложь;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Шрифт          = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,,14);
	НовыйЭлемент.Ширина         = 30;

	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковХарактеристика",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Видимость                 = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	НовыйЭлемент.Вид                       = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным               = "ОтраслевоеДеревоПодарков.Характеристика";
	НовыйЭлемент.КнопкаВыпадающегоСписка   = Истина;
	НовыйЭлемент.КнопкаСоздания            = Ложь;
	НовыйЭлемент.РежимВыбораНезаполненного = РежимВыбораНезаполненного.ПриАктивизации;
	НовыйЭлемент.ШрифтЗаголовка            = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Шрифт                     = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,,14);
	НовыйЭлемент.Ширина                    = 15;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДеревоПодарковХарактеристикаПриИзменении");
	
	НоваяСвязь = Новый СвязьПараметраВыбора(
		"Отбор.Владелец",
		"Элементы.ОтраслевоеДеревоПодарков.ТекущиеДанные.Номенклатура",
		РежимИзмененияСвязанногоЗначения.Очищать);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыйЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковЦена",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.Цена";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Шрифт          = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,, 14);
	НовыйЭлемент.Ширина         = 15;

	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковУпаковка",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.Упаковка";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,, 14);
	НовыйЭлемент.Шрифт          = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,, 14);
	НовыйЭлемент.Ширина         = 15;
	
	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковДоступно",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.Доступно";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Шрифт          = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,, 14);
	НовыйЭлемент.Ширина         = 15;
	
	НовыйЭлемент = Элементы.Вставить(
		"ОтраслевоеДеревоПодарковВРезерве",
		Тип("ПолеФормы"),
		Элементы.ОтраслевоеДеревоПодарков);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевоеДеревоПодарков.ВРезерве";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ШрифтЗаголовкаСреднийУНФ,,14);
	НовыйЭлемент.Шрифт          = Новый Шрифт(ШрифтыСтиля.УменьшенныйШрифтТекста,, 14);
	НовыйЭлемент.Ширина         = 15;
	
	НовыйЭлемент = Элементы.Вставить(
		"ТолькоСОстатком",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПоискТовара);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок  = НСтр("ru = 'Характеристики на остатке'");
	НовыйЭлемент.ИмяКоманды = "ТолькоСОстатком";
	НовыйЭлемент.Видимость  = Ложь;
	НовыйЭлемент.Ширина     = 30;
	НовыйЭлемент.Шрифт      = Новый Шрифт(, 12);
	
	НовыйЭлемент = Элементы.Вставить(
		"ПеренестиПодарки",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПоискТовара);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок  = НСтр("ru = 'Перенести подарки'");
	НовыйЭлемент.ИмяКоманды = "ПеренестиПодарки";
	НовыйЭлемент.Видимость  = Ложь;
	НовыйЭлемент.Ширина     = 30;
	НовыйЭлемент.Шрифт      = Новый Шрифт(, 12);
	#КонецОбласти
	
	#Область СопутствующиеТовары
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаПоискСопутствующегоТовара",
		Тип("ГруппаФормы"),
		Элементы.ГруппаСтраницаПоискТоваров);
	НовыйЭлемент.Вид                      = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.Заголовок                = НСтр("ru = 'Поиск сопутствующего товара'");
	НовыйЭлемент.Видимость                = Ложь;
	НовыйЭлемент.ОтображатьЗаголовок      = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	
	НовыйЭлемент = Элементы.Вставить(
		"ПоискСопутствующегоТовара",
		Тип("ПолеФормы"),
		Элементы.ГруппаПоискСопутствующегоТовара);
	НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным              = "ЗначениеПоискаСопутствующегоТовара";
	НовыйЭлемент.Шрифт                    = ШрифтыСтиля.ТекстТретьегоУровня;
	НовыйЭлемент.ПодсказкаВвода           = НСтр("ru = 'Поиск (Ctrl+F)'");
	НовыйЭлемент.СочетаниеКлавиш          = Новый СочетаниеКлавиш(Клавиша.F,, Истина);
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КнопкаОчистки            = Истина;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина   = Ложь;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПоискСопутствующегоТовараПриИзменении");
	НовыйЭлемент.УстановитьДействие("Очистка",      "Подключаемый_ПоискСопутствующегоТовараТоварыОчистка");
	
	НовыйЭлемент = Элементы.Вставить(
		"ОбновитьСопутствующиеТовары",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПоискСопутствующегоТовара);
	НовыйЭлемент.Вид                      = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды               = "ОбновитьСопутствующиеТовары";
	НовыйЭлемент.Шрифт                    = ШрифтыСтиля.ШрифтОбычный12РМК;
	НовыйЭлемент.Отображение              = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Ширина                   = 3;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.РастягиватьПоВертикали   = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"КоманднаяПанельЗакрытьСовместныеТовары",
		Тип("ГруппаФормы"),
		Элементы.ГруппаПоискСопутствующегоТовара);
	НовыйЭлемент.Вид = ВидГруппыФормы.КоманднаяПанель;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"ЗакрытьСовместныеТовары",
		Тип("КнопкаФормы"),
		Элементы.КоманднаяПанельЗакрытьСовместныеТовары);
	НовыйЭлемент.Вид         = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды  = "ЗакрытьСовместныеТовары";
	НовыйЭлемент.Ширина      = 30;
	НовыйЭлемент.Шрифт       = ШрифтыСтиля.ШрифтОбычный12РМК;
	НовыйЭлемент.ЦветФона    = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
	
	НовыйЭлемент = Элементы.Вставить(
		"ОплатитьЧек",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПоискСопутствующегоТовара);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "ОплатитьЧек";
	НовыйЭлемент.Ширина     = 15;
	НовыйЭлемент.Шрифт      = ШрифтыСтиля.ШрифтОбычный12РМК;
	НовыйЭлемент.Видимость  = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"ЗакрытьПоискСопутствующегоТовара",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПоискСопутствующегоТовара);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "ЗакрытьПоискТоваров";
	НовыйЭлемент.Шрифт      = ШрифтыСтиля.ШрифтОбычный12РМК;
	
	НовыйЭлемент = Элементы.Вставить(
		"ПоказатьСовместныеТовары",
		Тип("КнопкаФормы"),
		Элементы.ГруппаПоискТовара);
	НовыйЭлемент.Вид         = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды  = "ПоказатьСовместныеТовары";
	НовыйЭлемент.Ширина      = 30;
	НовыйЭлемент.Шрифт       = ШрифтыСтиля.ШрифтОбычный12РМК;
	
	НовыйЭлемент = Элементы.Вставить(
		"СтраницаСопутствующиеТовары",
		Тип("ГруппаФормы"),
		Элементы.СтраницыСпискиТоваров);
	НовыйЭлемент.Вид         = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Сопутствующие товары'");
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТовары",
		Тип("ТаблицаФормы"),
		Элементы.СтраницаСопутствующиеТовары);
	НовыйЭлемент.ПутьКДанным              = "ОтраслевыеСопутствующиеТовары";
	НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	НовыйЭлемент.ШрифтЗаголовка           = Новый Шрифт(ШрифтыСтиля.ТекстТретьегоУровня, 14,, Истина);
	НовыйЭлемент.ТолькоПросмотр           = Истина;
	НовыйЭлемент.УстановитьДействие("Выбор", "Подключаемый_СопутствующиеТоварыВыбор");
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_СопутствующиеТоварыПриАктивизацииСтроки");
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыКод",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Код";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыАртикул",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Артикул";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыНаименование",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Наименование";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыНоменклатураНаименованиеДляПечати",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.НоменклатураНаименованиеДляПечати";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	НовыйЭлемент.Видимость      = Ложь;

	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыХарактеристикаНаименованиеДляПечати",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.ХарактеристикаНаименованиеДляПечати";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	НовыйЭлемент.Видимость      = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыНоменклатура",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Номенклатура";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	НовыйЭлемент.Видимость      = Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыХарактеристика",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Характеристика";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыЦена",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Цена";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыПредставлениеУпаковки",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.ПредставлениеУпаковки";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	НовыйЭлемент.Видимость      =  Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыУпаковка",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Упаковка";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыОсобенностьУчета",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.ОсобенностьУчета";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	НовыйЭлемент.Видимость      =  Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыВидНоменклатуры",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.ВидНоменклатуры";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	НовыйЭлемент.Видимость      =  Ложь;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыДоступно",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.Доступно";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"СопутствующиеТоварыВРезерве",
		Тип("ПолеФормы"),
		Элементы.СопутствующиеТовары);
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным    = "ОтраслевыеСопутствующиеТовары.ВРезерве";
	НовыйЭлемент.ШрифтЗаголовка = ШрифтыСтиля.ТекстПервогоУровня;
	
	НовыйЭлемент = Элементы.Вставить(
		"ГруппаИнформацияПоПозицииСопутки",
		Тип("ГруппаФормы"),
		Элементы.СтраницаСопутствующиеТовары);
	НовыйЭлемент.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Отображение         = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.ТолькоПросмотр      = Истина;
	#КонецОбласти
	
#КонецОбласти

#Область ИзмененныеСвойства
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ДеревоДействующихСкидокКартинкаОбозначение",
		"Подсказка",
		НСтр("ru = 'УС - управляемая скидка, РС - ручная скидка'"),
		СписокОшибок);
	ор_ПрограммноеСозданиеЭлементовФорм.ИзменитьСвойствоЭлемента(
		Форма,
		"ДеревоДействующихСкидокКартинкаОбозначение",
		"ОтображениеПодсказки",
		ОтображениеПодсказки.Всплывающая,
		СписокОшибок);
#КонецОбласти

#Область УсловноеОформлениеФормы
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтраслевоеДеревоПодарков.НеобходимоУточнитьХарактеристику");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ОтраслевоеДеревоПодарковХарактеристика");
	ПолеОформления.Использование = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не указана характеристика>'"));
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтраслевоеДеревоПодарков.НеобходимоУточнитьХарактеристику");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ОтраслевоеДеревоПодарковКоличествоУпаковок");
	ПолеОформления.Использование = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокВВидеДерева");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;

	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("ОтраслевоеДеревоПодарковХарактеристика");
	ПолеОформления.Использование = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
#КонецОбласти

КонецПроцедуры

Процедура ОбрНастройкаПрограммыНастройкаПрограммы(Форма, СписокОшибок)

#Область Реквизиты
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ИспользоватьОбщиеШКХарактеристик",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Использовать общие штрихкоды номенклатуры'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_СоздаватьВЗаказеНоменклатуруПоДаннымПоставщика",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Создавать в заказе номенклатуру по данным поставщика'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_АвтоматическиФормироватьЦеныПоПоступлениюТоваров",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Автоматическое формирование цен'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_УчитыватьХарактеристикиПриПодбореСопутствующихТоваров",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Учитывать характеристики при подборе сопутствующих товаров'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ИнфоКиоскИспользовать",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Использовать информационный киоск'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ОткрытьНастройкиСопутствующихТоваров");
	НоваяКоманда.Действие    = "Подключаемый_ОткрытьНастройкиСопутствующихТоваров";
	НоваяКоманда.Заголовок   = НСтр("ru = 'Открыть настройку поиска ассоциаций'");
	НоваяКоманда.Отображение = ОтображениеКнопки.Авто;
	НоваяКоманда.Подсказка   = НСтр("ru = 'Управление настройками механизма товаров, продаваемых совместно'");
	
	НоваяКоманда = Форма.Команды.Добавить("ОткрытьНастройкиИнформационногоКиоска");
	НоваяКоманда.Действие    = "Подключаемый_ОткрытьНастройкиИнформационногоКиоска";
	НоваяКоманда.Заголовок   = НСтр("ru = 'Настройка информационного киоска'");
	НоваяКоманда.Отображение = ОтображениеКнопки.Авто;
	НоваяКоманда.Подсказка   = НСтр("ru = 'Управление настройками информационного киоска'");
	
#КонецОбласти

#Область Элементы
	
	Элементы = Форма.Элементы;
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_ИспользоватьОбщиеШКХарактеристик",
		Тип("ПолеФормы"),
		Элементы.СтраницаГлавноеГруппаТовары,
		Элементы.ФункциональнаяОпцияИспользоватьНаборы);
	НовыйЭлемент.Вид                = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка          = ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным        = "ор_ИспользоватьОбщиеШКХарактеристик";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Подсказка            = НСтр("ru = 'Позволяет выбрать характеристику при поиске по штрихкоду номенклатуры'");
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаУНФ");
	// Для ОБ настройка скрыта.
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить(
		"ор_СоздаватьВЗаказеНоменклатуруПоДаннымПоставщика",
		Тип("ПолеФормы"),
		Элементы.СтраницаЗакупкиГруппаЗакупки);
	НовыйЭлемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка            = ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным          = "ор_СоздаватьВЗаказеНоменклатуруПоДаннымПоставщика";
	НовыйЭлемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Подсказка            = НСтр("ru = 'Позволяет создавать номенклатуру в момент создания заказа покупателю или поставщику, которая отсутствует в базе, однако доступна у поставщиков'");
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаУНФ");
	
	НовыйЭлемент = Элементы.Добавить(
		"ор_УчитыватьХарактеристикиПриПодбореСопутствующихТоваров",
		Тип("ПолеФормы"),
		Элементы.СтраницаПродажиГруппаПродажи);
	НовыйЭлемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка            = ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным          = "ор_УчитыватьХарактеристикиПриПодбореСопутствующихТоваров";
	НовыйЭлемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'При включенной опции список сопутствующих товаров
	|показывает только те характеристики номенклатуры, которые указаны в регистре ""Сопутствующие товары"".
	|При выключенной опции будут выводиться все характеристики номенклатуры.'");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаУНФ");
	
	НовыйЭлемент = Элементы.Добавить(
		"ор_ОткрытьНастройкиСопутствующихТоваров",
		Тип("КнопкаФормы"),
		Элементы.СтраницаПродажиГруппаПродажи);
	НовыйЭлемент.Вид                  = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.Заголовок            = НСтр("ru = 'Настройка поиска ассоциаций'");
	НовыйЭлемент.ИмяКоманды           = "ОткрытьНастройкиСопутствующихТоваров";
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	
	НовыйЭлемент = Элементы.Добавить(
		"ор_АвтоматическиФормироватьЦеныПоПоступлениюТоваров",
		Тип("ПолеФормы"),
		Элементы.СтраницаЗакупкиГруппаЦеныСкидки);
	НовыйЭлемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка            = ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным          = "ор_АвтоматическиФормироватьЦеныПоПоступлениюТоваров";
	НовыйЭлемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок =
		НСтр("ru = 'Включение позволяет автоматически создавать документ ""Установка цен"" на основании документа ""Приходная накладная"".
		|Для этого необходимо указать вид цен в документе ""Приходная накладная"".
		|Если у пользователя включено право ""Разрешить управление автоматическим формированием цен в приходной накладной"",
		|он может отключить использование механизма для текущего документа. Для этого он снимает флаг ""Автоформирование цен"".'");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаУНФ");
	
	НовыйЭлемент = Элементы.Вставить(
		"СтраницаПродажиИнформационныйКиоск",
		Тип("ГруппаФормы"),
		Элементы.СтраницаПродажи,
		Элементы.СтраницаПродажиГруппаСмТакжеАдминистрирование);
	НовыйЭлемент.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Поведение   = ПоведениеОбычнойГруппы.Свертываемая;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Заголовок   = НСтр("ru = 'Информационный киоск'");
	НовыйЭлемент.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Кнопка;
	НовыйЭлемент.Скрыть();
	
	НовыйЭлемент = Элементы.Добавить(
		"ор_ИнфоКиоскИспользовать",
		Тип("ПолеФормы"),
		Элементы.СтраницаПродажиИнформационныйКиоск);
	НовыйЭлемент.Вид                  = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка          = ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным          = "ор_ИнфоКиоскИспользовать";
	НовыйЭлемент.ПоложениеЗаголовка   = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Позволяет использовать информационный киоск'");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаУНФ");
	
	НовыйЭлемент = Элементы.Добавить(
		"ОткрытьНастройкиИнформационногоКиоска",
		Тип("КнопкаФормы"),
		Элементы.СтраницаПродажиИнформационныйКиоск);
	НовыйЭлемент.Вид                  = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.Заголовок            = НСтр("ru = 'Настройка информационного киоска'");
	НовыйЭлемент.ИмяКоманды           = "ОткрытьНастройкиИнформационногоКиоска";
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	
#КонецОбласти

#Область ИзмененныеСвойства
#КонецОбласти

КонецПроцедуры

Процедура ОбрПанельАдминистрированияБИПИнтернетПоддержкаИСервисы(Форма, СписокОшибок)
	
#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
	МассивДобавляемыхРеквизитов = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы(
		"ор_ЗагружатьИУстанавливатьИсправленияАвтоматическиРозница",
		Новый ОписаниеТипов("Булево"),,
		НСтр("ru = 'Загружать и устанавливать исправления (патчи) автоматически
				  |(1С:Розница)'"));
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
#КонецОбласти

#Область Команды

#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"ор_ЗагружатьИУстанавливатьИсправленияАвтоматическиРозница", 
		Тип("ПолеФормы"),
		Элементы.ГруппаНастройкаИсправленияПатчи);
	НовыйЭлемент.Вид 	 	 			= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ВидФлажка          	= ВидФлажка.Выключатель;
	НовыйЭлемент.ПутьКДанным 			= "ор_ЗагружатьИУстанавливатьИсправленияАвтоматическиРозница";
	НовыйЭлемент.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Подсказка				= НСтр("ru='Список доступных исправлений (патчей) будет расширен
												   |исправлениями предназначенными для 1С:Розница
												   |Внимание: возможна ситуация, когда полученные
												   |дополнительные исправления могут приводить к ошибкам.'");
	НовыйЭлемент.ОтображениеПодсказки 	= ОтображениеПодсказки.ОтображатьСнизу;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ЗагружатьИУстанавливатьИсправленияАвтоматическиПриИзменении");
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область РегистрыСведений

Процедура РССопутствующиеТоварыФормаДляНоменклатуры(Форма, СписокОшибок)

#Область ИзмененныеСвойства
#КонецОбласти

#Область Реквизиты
#КонецОбласти

#Область Команды
	
	НоваяКоманда = Форма.Команды.Добавить("ор_ВыполнитьПоискАссоциаций");
	НоваяКоманда.Действие  = "Подключаемый_ВыполнитьПоискАссоциаций";
	НоваяКоманда.Заголовок = НСтр("ru = 'Выполнить поиск ассоциаций'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Запустить заполнение сопутствующих товаров по настроенным ассоциациям'");
	
	НоваяКоманда = Форма.Команды.Добавить("ор_НастройкаПоискаАссоциаций");
	НоваяКоманда.Действие  = "Подключаемый_НастроитьПоискАссоциаций";
	НоваяКоманда.Заголовок = НСтр("ru = 'Настройка поиска ассоциаций'");
	НоваяКоманда.Подсказка = НСтр("ru = 'Настройка поиска ассоциаций для заполения списка сопутствующих товаров'");
	
#КонецОбласти

#Область Элементы
	Элементы = Форма.Элементы;
	НовыйЭлемент = Элементы.Вставить(
		"ор_ВыполнитьПоискАссоциаций",
		Тип("КнопкаФормы"),
		Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ор_ВыполнитьПоискАссоциаций";
	НовыйЭлемент.Заголовок  = НСтр("ru = 'Выполнить поиск ассоциаций'");
	
	НовыйЭлемент = Элементы.Вставить(
		"ор_НастройкаПоискаАссоциаций",
		Тип("КнопкаФормы"),
		Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ор_НастройкаПоискаАссоциаций";
	НовыйЭлемент.Заголовок  = НСтр("ru = 'Настройка поиска ассоциаций'");
	
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область Отчеты
#КонецОбласти

#КонецОбласти

#КонецОбласти
